<abi-corpus version='2.4'>
  <elf-needed>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- bar(std::string const&) -->
    <elf-symbol name='_Z3barRKSs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- foo(std::string const&) -->
    <elf-symbol name='_Z3fooRKSs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- std::char_traits<char>::length(char const*) -->
    <elf-symbol name='_ZNSt11char_traitsIcE6lengthEPKc' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> > std::operator+<char, std::char_traits<char>, std::allocator<char> >(char const*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > const&) -->
    <elf-symbol name='_ZStplIcSt11char_traitsIcESaIcEESbIT_T0_T1_EPKS3_RKS6_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- _fini -->
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- _init -->
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='test24-drop-fns.cc' comp-dir-path='/home/dodji/git/libabigail.git/suppr/tests/data/test-read-dwarf' language='LANG_C_plus_plus'>
    <!-- bool -->
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='type-id-1'/>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-2'/>
    <!-- char[4] -->
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='32' hash='932523ac2c3bfb84' id='type-id-3'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-5'/>
    </array-type-def>
    <!-- double -->
    <type-decl name='double' size-in-bits='64' hash='e9e9b320886d9aa6' id='type-id-6'/>
    <!-- float -->
    <type-decl name='float' size-in-bits='32' hash='d7ec3bf03d3c5690' id='type-id-7'/>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-8'/>
    <!-- long double -->
    <type-decl name='long double' size-in-bits='128' hash='2a9bbfe8bb0475f1#2' id='type-id-9'/>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-10'/>
    <!-- long long int -->
    <type-decl name='long long int' size-in-bits='64' hash='5ae7f9eec1fc43d6#3' id='type-id-11'/>
    <!-- short int -->
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#4' id='type-id-12'/>
    <!-- sizetype -->
    <type-decl name='sizetype' size-in-bits='64' hash='3e84f1a1648448f5' id='type-id-4'/>
    <!-- struct __mbstate_t -->
    <class-decl name='__mbstate_t' is-struct='yes' naming-typedef-id='type-id-13' visibility='default' size-in-bits='64' filepath='/usr/include/wchar.h' line='83' column='1' hash='e97fe294ce223fec' id='type-id-14'>
      <member-type access='public'>
        <!-- union {unsigned int __wch; char __wchb[4];} -->
        <union-decl name='__anonymous_union__' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='/usr/include/wchar.h' line='86' column='1' hash='db9d16b710a8f305' id='type-id-15'>
          <data-member access='public'>
            <!-- unsigned int __wch -->
            <var-decl name='__wch' type-id='type-id-16' visibility='default' filepath='/usr/include/wchar.h' line='88' column='1'/>
          </data-member>
          <data-member access='public'>
            <!-- char __wchb[4] -->
            <var-decl name='__wchb' type-id='type-id-3' visibility='default' filepath='/usr/include/wchar.h' line='92' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int __mbstate_t::__count -->
        <var-decl name='__count' type-id='type-id-8' visibility='default' filepath='/usr/include/wchar.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- union {unsigned int __wch; char __wchb[4];} __mbstate_t::__value -->
        <var-decl name='__value' type-id='type-id-15' visibility='default' filepath='/usr/include/wchar.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct lconv -->
    <class-decl name='lconv' is-struct='yes' visibility='default' size-in-bits='768' filepath='/usr/include/locale.h' line='53' column='1' hash='91b2fd0786b4df3e' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char* lconv::decimal_point -->
        <var-decl name='decimal_point' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- char* lconv::thousands_sep -->
        <var-decl name='thousands_sep' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char* lconv::grouping -->
        <var-decl name='grouping' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- char* lconv::int_curr_symbol -->
        <var-decl name='int_curr_symbol' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- char* lconv::currency_symbol -->
        <var-decl name='currency_symbol' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- char* lconv::mon_decimal_point -->
        <var-decl name='mon_decimal_point' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- char* lconv::mon_thousands_sep -->
        <var-decl name='mon_thousands_sep' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- char* lconv::mon_grouping -->
        <var-decl name='mon_grouping' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- char* lconv::positive_sign -->
        <var-decl name='positive_sign' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- char* lconv::negative_sign -->
        <var-decl name='negative_sign' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- char lconv::int_frac_digits -->
        <var-decl name='int_frac_digits' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <!-- char lconv::frac_digits -->
        <var-decl name='frac_digits' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <!-- char lconv::p_cs_precedes -->
        <var-decl name='p_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <!-- char lconv::p_sep_by_space -->
        <var-decl name='p_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <!-- char lconv::n_cs_precedes -->
        <var-decl name='n_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <!-- char lconv::n_sep_by_space -->
        <var-decl name='n_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <!-- char lconv::p_sign_posn -->
        <var-decl name='p_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <!-- char lconv::n_sign_posn -->
        <var-decl name='n_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- char lconv::int_p_cs_precedes -->
        <var-decl name='int_p_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <!-- char lconv::int_p_sep_by_space -->
        <var-decl name='int_p_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <!-- char lconv::int_n_cs_precedes -->
        <var-decl name='int_n_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <!-- char lconv::int_n_sep_by_space -->
        <var-decl name='int_n_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <!-- char lconv::int_p_sign_posn -->
        <var-decl name='int_p_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <!-- char lconv::int_n_sign_posn -->
        <var-decl name='int_n_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct tm -->
    <class-decl name='tm' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/include/time.h' line='133' column='1' hash='831fa813c3806379' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int tm::tm_sec -->
        <var-decl name='tm_sec' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int tm::tm_min -->
        <var-decl name='tm_min' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int tm::tm_hour -->
        <var-decl name='tm_hour' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- int tm::tm_mday -->
        <var-decl name='tm_mday' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int tm::tm_mon -->
        <var-decl name='tm_mon' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int tm::tm_year -->
        <var-decl name='tm_year' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int tm::tm_wday -->
        <var-decl name='tm_wday' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- int tm::tm_yday -->
        <var-decl name='tm_yday' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- int tm::tm_isdst -->
        <var-decl name='tm_isdst' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- long int tm::tm_gmtoff -->
        <var-decl name='tm_gmtoff' type-id='type-id-10' visibility='default' filepath='/usr/include/time.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- const char* tm::tm_zone -->
        <var-decl name='tm_zone' type-id='type-id-20' visibility='default' filepath='/usr/include/time.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct typedef __va_list_tag __va_list_tag -->
    <class-decl name='typedef __va_list_tag __va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='82aec996f90384a2' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int typedef __va_list_tag __va_list_tag::gp_offset -->
        <var-decl name='gp_offset' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int typedef __va_list_tag __va_list_tag::fp_offset -->
        <var-decl name='fp_offset' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* typedef __va_list_tag __va_list_tag::overflow_arg_area -->
        <var-decl name='overflow_arg_area' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* typedef __va_list_tag __va_list_tag::reg_save_area -->
        <var-decl name='reg_save_area' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- typedef int _Atomic_word -->
    <typedef-decl name='_Atomic_word' type-id='type-id-8' size-in-bits='32' filepath='/usr/include/c++/5.3.1/x86_64-redhat-linux/bits/atomic_word.h' line='32' column='1' hash='09d17c08f594edc7' id='type-id-23'/>
    <!-- typedef int __int32_t -->
    <typedef-decl name='__int32_t' type-id='type-id-8' size-in-bits='32' filepath='/usr/include/bits/types.h' line='40' column='1' hash='09d17c08f594edc7' id='type-id-24'/>
    <!-- typedef __mbstate_t __mbstate_t -->
    <typedef-decl name='__mbstate_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/wchar.h' line='94' column='1' id='type-id-13'/>
    <!-- typedef __mbstate_t mbstate_t -->
    <typedef-decl name='mbstate_t' type-id='type-id-13' size-in-bits='64' filepath='/usr/include/wchar.h' line='106' column='1' id='type-id-25'/>
    <!-- typedef unsigned long int size_t -->
    <typedef-decl name='size_t' type-id='type-id-26' size-in-bits='64' filepath='/usr/lib/gcc/x86_64-redhat-linux/5.3.1/include/stddef.h' line='216' column='1' hash='8fdc5eea2983a729' id='type-id-27'/>
    <!-- typedef const __int32_t* wctrans_t -->
    <typedef-decl name='wctrans_t' type-id='type-id-28' size-in-bits='64' filepath='/usr/include/wctype.h' line='186' column='1' hash='96e1bfcb27b9d6ed' id='type-id-29'/>
    <!-- typedef unsigned long int wctype_t -->
    <typedef-decl name='wctype_t' type-id='type-id-26' size-in-bits='64' filepath='/usr/include/wctype.h' line='52' column='1' hash='8fdc5eea2983a729' id='type-id-30'/>
    <!-- typedef unsigned int wint_t -->
    <typedef-decl name='wint_t' type-id='type-id-16' size-in-bits='32' filepath='/usr/lib/gcc/x86_64-redhat-linux/5.3.1/include/stddef.h' line='357' column='1' hash='e66b43f97c38e87a' id='type-id-31'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-16'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-26'/>
    <!-- unsigned long long int -->
    <type-decl name='unsigned long long int' size-in-bits='64' hash='ebdfc4685a1e82df#3' id='type-id-32'/>
    <!-- wchar_t -->
    <type-decl name='wchar_t' size-in-bits='32' hash='4b224bc24abb5f1b' id='type-id-33'/>
    <!-- __gnu_cxx::new_allocator<char>* -->
    <pointer-type-def type-id='type-id-34' size-in-bits='64' hash='608f46af5d93b320' id='type-id-35'/>
    <!-- char& -->
    <reference-type-def kind='lvalue' type-id='type-id-2' size-in-bits='64' hash='ffc913127619398d' id='type-id-36'/>
    <!-- char* -->
    <pointer-type-def type-id='type-id-2' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-18'/>
    <!-- const __gnu_cxx::new_allocator<char> -->
    <qualified-type-def type-id='type-id-34' const='yes' hash='d0c896a319e39135' id='type-id-37'/>
    <!-- const __gnu_cxx::new_allocator<char>& -->
    <reference-type-def kind='lvalue' type-id='type-id-37' size-in-bits='64' hash='9a4f67b0de72c33d' id='type-id-38'/>
    <!-- const __gnu_cxx::new_allocator<char>* -->
    <pointer-type-def type-id='type-id-37' size-in-bits='64' hash='0481e4c0dbe5485f' id='type-id-39'/>
    <!-- const __int32_t -->
    <qualified-type-def type-id='type-id-24' const='yes' hash='3aaf0f2479f2834c' id='type-id-40'/>
    <!-- const __int32_t* -->
    <pointer-type-def type-id='type-id-40' size-in-bits='64' hash='96e1bfcb27b9d6ed' id='type-id-28'/>
    <!-- const char -->
    <qualified-type-def type-id='type-id-2' const='yes' hash='3e50fd33f9bb78d9' id='type-id-41'/>
    <!-- const char& -->
    <reference-type-def kind='lvalue' type-id='type-id-41' size-in-bits='64' hash='78bf127c69ae91c1' id='type-id-42'/>
    <!-- const char* -->
    <pointer-type-def type-id='type-id-41' size-in-bits='64' hash='c44743f354f6a443' id='type-id-20'/>
    <!-- const char** -->
    <pointer-type-def type-id='type-id-20' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-43'/>
    <!-- const int -->
    <qualified-type-def type-id='type-id-8' const='yes' hash='8cef8df4b6728924' id='type-id-44'/>
    <!-- const long int -->
    <qualified-type-def type-id='type-id-10' const='yes' hash='ea466b949f1ce7b6#2' id='type-id-45'/>
    <!-- const mbstate_t -->
    <qualified-type-def type-id='type-id-25' const='yes' hash='a328f2686e4dcc6e' id='type-id-46'/>
    <!-- const mbstate_t* -->
    <pointer-type-def type-id='type-id-46' size-in-bits='64' hash='965b139f91617649' id='type-id-47'/>
    <!-- const short int -->
    <qualified-type-def type-id='type-id-12' const='yes' hash='fa0f98d319d2e5f4#3' id='type-id-48'/>
    <!-- const std::allocator<char> -->
    <qualified-type-def type-id='type-id-49' const='yes' hash='902ffeb42efa2254' id='type-id-50'/>
    <!-- const std::allocator<char>& -->
    <reference-type-def kind='lvalue' type-id='type-id-50' size-in-bits='64' hash='7d4280c016344b59' id='type-id-51'/>
    <!-- const std::basic_string<char, std::char_traits<char>, std::allocator<char> > -->
    <qualified-type-def type-id='type-id-52' const='yes' hash='42938116911f2585' id='type-id-53'/>
    <!-- const std::basic_string<char, std::char_traits<char>, std::allocator<char> >& -->
    <reference-type-def kind='lvalue' type-id='type-id-53' size-in-bits='64' hash='ebc94b0648ba0254' id='type-id-54'/>
    <!-- const std::basic_string<char, std::char_traits<char>, std::allocator<char> >* -->
    <pointer-type-def type-id='type-id-53' size-in-bits='64' hash='f14dbace06951209' id='type-id-55'/>
    <!-- const std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep -->
    <qualified-type-def type-id='type-id-56' const='yes' hash='7226944aa4e46352' id='type-id-57'/>
    <!-- const std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep* -->
    <pointer-type-def type-id='type-id-57' size-in-bits='64' hash='61c33da8fd0cc9a8' id='type-id-58'/>
    <!-- const std::basic_string<char, std::char_traits<char>, std::allocator<char> >::size_type -->
    <qualified-type-def type-id='type-id-59' const='yes' hash='f3ad494e9f7aea44' id='type-id-60'/>
    <!-- const std::char_traits<char>::char_type -->
    <qualified-type-def type-id='type-id-61' const='yes' hash='0d301f00e830e5eb' id='type-id-62'/>
    <!-- const std::char_traits<char>::char_type& -->
    <reference-type-def kind='lvalue' type-id='type-id-62' size-in-bits='64' hash='d98a60be7234f7c8' id='type-id-63'/>
    <!-- const std::char_traits<char>::char_type* -->
    <pointer-type-def type-id='type-id-62' size-in-bits='64' hash='f4903706bce76c85' id='type-id-64'/>
    <!-- const std::char_traits<char>::int_type -->
    <qualified-type-def type-id='type-id-65' const='yes' hash='9c3f1503b45b0328' id='type-id-66'/>
    <!-- const std::char_traits<char>::int_type& -->
    <reference-type-def kind='lvalue' type-id='type-id-66' size-in-bits='64' hash='00b5256d58d8bd92' id='type-id-67'/>
    <!-- const std::string -->
    <qualified-type-def type-id='type-id-68' const='yes' hash='18782c365e5b3732' id='type-id-69'/>
    <!-- const std::string& -->
    <reference-type-def kind='lvalue' type-id='type-id-69' size-in-bits='64' hash='c1a2c2d06c5e591e' id='type-id-70'/>
    <!-- const tm -->
    <qualified-type-def type-id='type-id-19' const='yes' hash='6d30d2c0485b21b8' id='type-id-71'/>
    <!-- const tm* -->
    <pointer-type-def type-id='type-id-71' size-in-bits='64' hash='934b82f269d593b3' id='type-id-72'/>
    <!-- const wchar_t -->
    <qualified-type-def type-id='type-id-33' const='yes' hash='f2fba7dbc42fc9d5' id='type-id-73'/>
    <!-- const wchar_t* -->
    <pointer-type-def type-id='type-id-73' size-in-bits='64' hash='317089067e76910a' id='type-id-74'/>
    <!-- const wchar_t** -->
    <pointer-type-def type-id='type-id-74' size-in-bits='64' hash='535c62eb027026ae' id='type-id-75'/>
    <!-- lconv* -->
    <pointer-type-def type-id='type-id-17' size-in-bits='64' hash='6921f81febec828e' id='type-id-76'/>
    <!-- mbstate_t* -->
    <pointer-type-def type-id='type-id-25' size-in-bits='64' hash='18fb85b101e2cd25' id='type-id-77'/>
    <!-- std::allocator<char>* -->
    <pointer-type-def type-id='type-id-49' size-in-bits='64' hash='e3d0c180eee5d782' id='type-id-78'/>
    <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> >& -->
    <reference-type-def kind='lvalue' type-id='type-id-52' size-in-bits='64' hash='d8ed513ed2f704b1' id='type-id-79'/>
    <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> >* -->
    <pointer-type-def type-id='type-id-52' size-in-bits='64' hash='c23efea4cbf2dbe8' id='type-id-80'/>
    <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Alloc_hider* -->
    <pointer-type-def type-id='type-id-81' size-in-bits='64' hash='9d029584a1ffef40' id='type-id-82'/>
    <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep& -->
    <reference-type-def kind='lvalue' type-id='type-id-56' size-in-bits='64' hash='dce7c83b7dca5265' id='type-id-83'/>
    <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep* -->
    <pointer-type-def type-id='type-id-56' size-in-bits='64' hash='0eeadcf9df869442' id='type-id-84'/>
    <!-- std::char_traits<char>::char_type& -->
    <reference-type-def kind='lvalue' type-id='type-id-61' size-in-bits='64' hash='75929b1513585467' id='type-id-85'/>
    <!-- std::char_traits<char>::char_type* -->
    <pointer-type-def type-id='type-id-61' size-in-bits='64' hash='4cef840ef4725ab6' id='type-id-86'/>
    <!-- typedef __va_list_tag __va_list_tag* -->
    <pointer-type-def type-id='type-id-21' size-in-bits='64' hash='648313adc1c4c534' id='type-id-87'/>
    <!-- wchar_t* -->
    <pointer-type-def type-id='type-id-33' size-in-bits='64' hash='fb9a8c973ae04ed8' id='type-id-88'/>
    <!-- wchar_t** -->
    <pointer-type-def type-id='type-id-88' size-in-bits='64' hash='f6157ba411f3141d' id='type-id-89'/>
    <!-- __FILE* -->
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-91'/>
    <!-- namespace std -->
    <namespace-decl name='std'>
      <!-- class std::allocator<char> -->
      <class-decl name='allocator&lt;char&gt;' visibility='default' size-in-bits='8' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='92' column='1' hash='0e29bc311ca95715' id='type-id-49'>
        <!-- class __gnu_cxx::new_allocator<char> -->
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-34'/>
        <member-type access='public'>
          <!-- typedef const char& std::allocator<char>::const_reference -->
          <typedef-decl name='const_reference' type-id='type-id-42' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='100' column='1' hash='78bf127c69ae91c1' id='type-id-92'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef char& std::allocator<char>::reference -->
          <typedef-decl name='reference' type-id='type-id-36' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='99' column='1' hash='ffc913127619398d' id='type-id-93'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef std::size_t std::allocator<char>::size_type -->
          <typedef-decl name='size_type' type-id='type-id-95' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='95' column='1' hash='8fdc5eea2983a729' id='type-id-94'/>
        </member-type>
      </class-decl>
      <!-- class std::basic_string<char, std::char_traits<char>, std::allocator<char> > -->
      <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' visibility='default' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2510' column='1' hash='41e28a36dddcbfdb' id='type-id-52'>
        <member-type access='private'>
          <!-- struct std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Alloc_hider -->
          <class-decl name='_Alloc_hider' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2670' column='1' hash='b2053c926fcda493' id='type-id-81'>
            <!-- class std::allocator<char> -->
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-49'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <!-- char* std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Alloc_hider::_M_p -->
              <var-decl name='_M_p' type-id='type-id-18' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2675' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <!-- struct std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep -->
          <class-decl name='_Rep' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2553' column='1' hash='1100d7022e36b961' id='type-id-56'>
            <!-- struct std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep_base -->
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-96'/>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <!-- struct std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep_base -->
          <class-decl name='_Rep_base' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2546' column='1' hash='ef64d4b91b5de2fe' id='type-id-96'>
            <data-member access='public' layout-offset-in-bits='0'>
              <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> >::size_type std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep_base::_M_length -->
              <var-decl name='_M_length' type-id='type-id-59' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2548' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> >::size_type std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep_base::_M_capacity -->
              <var-decl name='_M_capacity' type-id='type-id-59' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2549' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <!-- _Atomic_word std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Rep_base::_M_refcount -->
              <var-decl name='_M_refcount' type-id='type-id-23' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2550' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <!-- typedef std::allocator<char> std::basic_string<char, std::char_traits<char>, std::allocator<char> >::allocator_type -->
          <typedef-decl name='allocator_type' type-id='type-id-49' size-in-bits='8' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2518' column='1' id='type-id-97'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef std::allocator<char>::const_reference std::basic_string<char, std::char_traits<char>, std::allocator<char> >::const_reference -->
          <typedef-decl name='const_reference' type-id='type-id-92' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2522' column='1' hash='78bf127c69ae91c1' id='type-id-98'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef std::allocator<char>::reference std::basic_string<char, std::char_traits<char>, std::allocator<char> >::reference -->
          <typedef-decl name='reference' type-id='type-id-93' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2521' column='1' hash='ffc913127619398d' id='type-id-99'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef std::allocator<char>::size_type std::basic_string<char, std::char_traits<char>, std::allocator<char> >::size_type -->
          <typedef-decl name='size_type' type-id='type-id-94' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2519' column='1' hash='8fdc5eea2983a729' id='type-id-59'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef __gnu_cxx::__normal_iterator<char const*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > std::basic_string<char, std::char_traits<char>, std::allocator<char> >::const_iterator -->
          <typedef-decl name='const_iterator' type-id='type-id-101' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2527' column='1' id='type-id-100'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef std::reverse_iterator<__gnu_cxx::__normal_iterator<char const*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > > std::basic_string<char, std::char_traits<char>, std::allocator<char> >::const_reverse_iterator -->
          <typedef-decl name='const_reverse_iterator' type-id='type-id-103' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2528' column='1' id='type-id-102'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef __gnu_cxx::__normal_iterator<char*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > std::basic_string<char, std::char_traits<char>, std::allocator<char> >::iterator -->
          <typedef-decl name='iterator' type-id='type-id-105' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2525' column='1' id='type-id-104'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef std::reverse_iterator<__gnu_cxx::__normal_iterator<char*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > > std::basic_string<char, std::char_traits<char>, std::allocator<char> >::reverse_iterator -->
          <typedef-decl name='reverse_iterator' type-id='type-id-107' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2529' column='1' id='type-id-106'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Alloc_hider std::basic_string<char, std::char_traits<char>, std::allocator<char> >::_M_dataplus -->
          <var-decl name='_M_dataplus' type-id='type-id-81' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2687' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct std::char_traits<char> -->
      <class-decl name='char_traits&lt;char&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='/usr/include/c++/5.3.1/bits/char_traits.h' line='233' column='1' hash='fc88b5d70352b916' id='type-id-108'>
        <member-type access='public'>
          <!-- typedef char std::char_traits<char>::char_type -->
          <typedef-decl name='char_type' type-id='type-id-2' size-in-bits='8' filepath='/usr/include/c++/5.3.1/bits/char_traits.h' line='235' column='1' hash='65b2d157027b431a' id='type-id-61'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef int std::char_traits<char>::int_type -->
          <typedef-decl name='int_type' type-id='type-id-8' size-in-bits='32' filepath='/usr/include/c++/5.3.1/bits/char_traits.h' line='236' column='1' hash='09d17c08f594edc7' id='type-id-65'/>
        </member-type>
        <member-function access='public' static='yes'>
          <!-- std::size_t std::char_traits<char>::length() -->
          <function-decl name='length' mangled-name='_ZNSt11char_traitsIcE6lengthEPKc' filepath='/usr/include/c++/5.3.1/bits/char_traits.h' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt11char_traitsIcE6lengthEPKc' hash='020ad60f75c8b018'>
            <!-- parameter of type 'const std::char_traits<char>::char_type*' -->
            <parameter type-id='type-id-64'/>
            <!-- typedef std::size_t -->
            <return type-id='type-id-95'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- typedef unsigned long int std::size_t -->
      <typedef-decl name='size_t' type-id='type-id-26' size-in-bits='64' filepath='/usr/include/c++/5.3.1/x86_64-redhat-linux/bits/c++config.h' line='1969' column='1' hash='8fdc5eea2983a729' id='type-id-95'/>
      <!-- typedef std::basic_string<char, std::char_traits<char>, std::allocator<char> > std::string -->
      <typedef-decl name='string' type-id='type-id-52' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/stringfwd.h' line='74' column='1' id='type-id-68'/>
      <!-- class std::basic_ostream<char, std::char_traits<char> > -->
      <class-decl name='basic_ostream&lt;char, std::char_traits&lt;char&gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-109'/>
      <!-- class std::reverse_iterator<__gnu_cxx::__normal_iterator<char const*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > > -->
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char const*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-103'/>
      <!-- class std::reverse_iterator<__gnu_cxx::__normal_iterator<char*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > > -->
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-107'/>
      <!-- std::basic_string<char, std::char_traits<char>, std::allocator<char> > std::operator+<char, std::char_traits<char>, std::allocator<char> >(const char*, const std::basic_string<char, std::char_traits<char>, std::allocator<char> >&) -->
