<abi-corpus version='2.4' soname='libGLU.so.1'>
  <elf-needed>
    <dependency name='libGL.so.1'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- gluBeginCurve -->
    <elf-symbol name='gluBeginCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBeginPolygon -->
    <elf-symbol name='gluBeginPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBeginSurface -->
    <elf-symbol name='gluBeginSurface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBeginTrim -->
    <elf-symbol name='gluBeginTrim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBuild1DMipmapLevels -->
    <elf-symbol name='gluBuild1DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBuild1DMipmaps -->
    <elf-symbol name='gluBuild1DMipmaps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBuild2DMipmapLevels -->
    <elf-symbol name='gluBuild2DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluBuild2DMipmaps -->

    <elf-symbol name='gluLoadSamplingMatrices' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluLookAt -->
    <elf-symbol name='gluLookAt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNewNurbsRenderer -->
    <elf-symbol name='gluNewNurbsRenderer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNewQuadric -->
    <elf-symbol name='gluNewQuadric' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNewTess -->
    <elf-symbol name='gluNewTess' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNextContour -->
    <elf-symbol name='gluNextContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNurbsCallback -->
    <elf-symbol name='gluNurbsCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNurbsCallbackData -->
    <elf-symbol name='gluNurbsCallbackData' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNurbsCallbackDataEXT -->
    <elf-symbol name='gluNurbsCallbackDataEXT' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNurbsCurve -->
    <elf-symbol name='gluNurbsCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNurbsProperty -->
    <elf-symbol name='gluNurbsProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluNurbsSurface -->
    <elf-symbol name='gluNurbsSurface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluOrtho2D -->
    <elf-symbol name='gluOrtho2D' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluPartialDisk -->
    <elf-symbol name='gluPartialDisk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluPerspective -->
    <elf-symbol name='gluPerspective' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluPickMatrix -->
    <elf-symbol name='gluPickMatrix' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluProject -->
    <elf-symbol name='gluProject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluPwlCurve -->
    <elf-symbol name='gluPwlCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluQuadricCallback -->
    <elf-symbol name='gluQuadricCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluQuadricDrawStyle -->
    <elf-symbol name='gluQuadricDrawStyle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluQuadricNormals -->
    <elf-symbol name='gluQuadricNormals' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluQuadricOrientation -->
    <elf-symbol name='gluQuadricOrientation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluQuadricTexture -->
    <elf-symbol name='gluQuadricTexture' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluScaleImage -->
    <elf-symbol name='gluScaleImage' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluSphere -->
    <elf-symbol name='gluSphere' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessBeginContour -->
    <elf-symbol name='gluTessBeginContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessBeginPolygon -->
    <elf-symbol name='gluTessBeginPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessCallback -->
    <elf-symbol name='gluTessCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessEndContour -->
    <elf-symbol name='gluTessEndContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessEndPolygon -->
    <elf-symbol name='gluTessEndPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessNormal -->
    <elf-symbol name='gluTessNormal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessProperty -->
    <elf-symbol name='gluTessProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluTessVertex -->
    <elf-symbol name='gluTessVertex' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluUnProject -->
    <elf-symbol name='gluUnProject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- gluUnProject4 -->
    <elf-symbol name='gluUnProject4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='libnurbs/interface/bezierPatchMesh.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- struct bezierPatch -->
    <class-decl name='bezierPatch' is-struct='yes' visibility='default' size-in-bits='384' filepath='libnurbs/interface/bezierPatch.h' line='36' column='1' hash='d203fe57ab48cffc' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- float bezierPatch::umin -->
        <var-decl name='umin' type-id='type-id-2' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- float bezierPatch::vmin -->
        <var-decl name='vmin' type-id='type-id-2' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- float bezierPatch::umax -->
        <var-decl name='umax' type-id='type-id-2' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- float bezierPatch::vmax -->
        <var-decl name='vmax' type-id='type-id-2' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int bezierPatch::uorder -->
        <var-decl name='uorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int bezierPatch::vorder -->
        <var-decl name='vorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int bezierPatch::dimension -->
        <var-decl name='dimension' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- float* bezierPatch::ctlpoints -->
        <var-decl name='ctlpoints' type-id='type-id-4' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- bezierPatch* bezierPatch::next -->
        <var-decl name='next' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct bezierPatchMesh -->
    <class-decl name='bezierPatchMesh' is-struct='yes' visibility='default' size-in-bits='960' filepath='libnurbs/interface/bezierPatchMesh.h' line='39' column='1' hash='44b8e12f6ca8acd3' id='type-id-6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- bezierPatch* bezierPatchMesh::bpatch -->
        <var-decl name='bpatch' type-id='type-id-7' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- bezierPatch* bezierPatchMesh::bpatch_normal -->
        <var-decl name='bpatch_normal' type-id='type-id-7' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- bezierPatch* bezierPatchMesh::bpatch_texcoord -->
        <var-decl name='bpatch_texcoord' type-id='type-id-7' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- bezierPatch* bezierPatchMesh::bpatch_color -->
        <var-decl name='bpatch_color' type-id='type-id-7' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- float* bezierPatchMesh::UVarray -->
        <var-decl name='UVarray' type-id='type-id-4' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int* bezierPatchMesh::length_array -->
        <var-decl name='length_array' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- GLenum* bezierPatchMesh::type_array -->
        <var-decl name='type_array' type-id='type-id-9' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int bezierPatchMesh::size_UVarray -->
        <var-decl name='size_UVarray' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <!-- int bezierPatchMesh::index_UVarray -->
        <var-decl name='index_UVarray' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- int bezierPatchMesh::size_length_array -->
        <var-decl name='size_length_array' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <!-- int bezierPatchMesh::index_length_array -->
        <var-decl name='index_length_array' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- int bezierPatchMesh::counter -->
        <var-decl name='counter' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <!-- GLenum bezierPatchMesh::type -->
        <var-decl name='type' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- float* bezierPatchMesh::vertex_array -->
        <var-decl name='vertex_array' type-id='type-id-4' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- float* bezierPatchMesh::normal_array -->
        <var-decl name='normal_array' type-id='type-id-4' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- float* bezierPatchMesh::color_array -->
        <var-decl name='color_array' type-id='type-id-4' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- float* bezierPatchMesh::texcoord_array -->
        <var-decl name='texcoord_array' type-id='type-id-4' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- bezierPatchMesh* bezierPatchMesh::next -->
        <var-decl name='next' type-id='type-id-11' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef bezierPatch bezierPatch -->
    <typedef-decl name='bezierPatch' type-id='type-id-1' size-in-bits='384' filepath='libnurbs/interface/bezierPatch.h' line='65' column='1' id='type-id-12'/>
    <!-- typedef bezierPatchMesh bezierPatchMesh -->
    <typedef-decl name='bezierPatchMesh' type-id='type-id-6' size-in-bits='960' filepath='libnurbs/interface/bezierPatchMesh.h' line='66' column='1' id='type-id-13'/>
    <!-- GLenum* -->
    <pointer-type-def type-id='type-id-10' size-in-bits='64' hash='c1f3555c52d20679' id='type-id-9'/>
    <!-- bezierPatch* -->
    <pointer-type-def type-id='type-id-1' size-in-bits='64' hash='4f16043562680025' id='type-id-5'/>
    <!-- bezierPatch* -->
    <pointer-type-def type-id='type-id-12' size-in-bits='64' hash='4f16043562680025#2' id='type-id-7'/>
    <!-- bezierPatchMesh* -->
    <pointer-type-def type-id='type-id-6' size-in-bits='64' hash='24cf0de04a1708da' id='type-id-11'/>
    <!-- bezierPatchMesh* -->
    <pointer-type-def type-id='type-id-13' size-in-bits='64' hash='24cf0de04a1708da#2' id='type-id-14'/>
    <!-- float* -->
    <pointer-type-def type-id='type-id-2' size-in-bits='64' hash='5022839615992ac0' id='type-id-4'/>
    <!-- int* -->
    <pointer-type-def type-id='type-id-3' size-in-bits='64' hash='3fd83b2c14ae2f2f' id='type-id-8'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glcurveval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- REAL[160] -->
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='5120' hash='ce922d9abf7a8a27' id='type-id-16'>
      <!-- <anonymous range>[160] -->
      <subrange length='160' lower-bound='0' upper-bound='159' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='dd8476b5115dfea8' id='type-id-18'/>
    </array-type-def>
    <!-- REAL[40] -->
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='1280' hash='60df066dd1909539' id='type-id-19'>
      <!-- <anonymous range>[40] -->
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='type-id-20'/>
    </array-type-def>
    <!-- class OpenGLCurveEvaluator -->
    <class-decl name='OpenGLCurveEvaluator' visibility='default' size-in-bits='27584' filepath='libnurbs/interface/glcurveval.h' line='66' column='1' hash='e8c87979939c52ba' id='type-id-21'>
      <!-- struct BasicCurveEvaluator -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-22'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- curveEvalMachine OpenGLCurveEvaluator::em_vertex -->
        <var-decl name='em_vertex' type-id='type-id-23' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='102' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6656'>
        <!-- curveEvalMachine OpenGLCurveEvaluator::em_normal -->
        <var-decl name='em_normal' type-id='type-id-23' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='103' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='13248'>
        <!-- curveEvalMachine OpenGLCurveEvaluator::em_color -->
        <var-decl name='em_color' type-id='type-id-23' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='104' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19840'>
        <!-- curveEvalMachine OpenGLCurveEvaluator::em_texcoord -->
        <var-decl name='em_texcoord' type-id='type-id-23' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='105' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26432'>
        <!-- int OpenGLCurveEvaluator::vertex_flag -->
        <var-decl name='vertex_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26464'>
        <!-- int OpenGLCurveEvaluator::normal_flag -->
        <var-decl name='normal_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='107' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26496'>
        <!-- int OpenGLCurveEvaluator::color_flag -->
        <var-decl name='color_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='108' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26528'>
        <!-- int OpenGLCurveEvaluator::texcoord_flag -->
        <var-decl name='texcoord_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26560'>
        <!-- REAL OpenGLCurveEvaluator::global_grid_u0 -->
        <var-decl name='global_grid_u0' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26592'>
        <!-- REAL OpenGLCurveEvaluator::global_grid_u1 -->
        <var-decl name='global_grid_u1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26624'>
        <!-- int OpenGLCurveEvaluator::global_grid_nu -->
        <var-decl name='global_grid_nu' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='113' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26688'>
        <!-- void (* OpenGLCurveEvaluator::beginCallBackN)(GLenum) -->
        <var-decl name='beginCallBackN' type-id='type-id-24' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26752'>
        <!-- void (* OpenGLCurveEvaluator::endCallBackN)(void) -->
        <var-decl name='endCallBackN' type-id='type-id-25' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26816'>
        <!-- void (* OpenGLCurveEvaluator::vertexCallBackN)(const GLfloat*) -->
        <var-decl name='vertexCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26880'>
        <!-- void (* OpenGLCurveEvaluator::normalCallBackN)(const GLfloat*) -->
        <var-decl name='normalCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26944'>
        <!-- void (* OpenGLCurveEvaluator::colorCallBackN)(const GLfloat*) -->
        <var-decl name='colorCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27008'>
        <!-- void (* OpenGLCurveEvaluator::texcoordCallBackN)(const GLfloat*) -->
        <var-decl name='texcoordCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='133' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27072'>
        <!-- void (* OpenGLCurveEvaluator::beginCallBackData)(GLenum, void*) -->
        <var-decl name='beginCallBackData' type-id='type-id-27' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='135' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27136'>
        <!-- void (* OpenGLCurveEvaluator::endCallBackData)(void*) -->
        <var-decl name='endCallBackData' type-id='type-id-28' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='136' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27200'>
        <!-- void (* OpenGLCurveEvaluator::vertexCallBackData)(const GLfloat*, void*) -->
        <var-decl name='vertexCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27264'>
        <!-- void (* OpenGLCurveEvaluator::normalCallBackData)(const GLfloat*, void*) -->
        <var-decl name='normalCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='138' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27328'>
        <!-- void (* OpenGLCurveEvaluator::colorCallBackData)(const GLfloat*, void*) -->
        <var-decl name='colorCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='139' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27392'>
        <!-- void (* OpenGLCurveEvaluator::texcoordCallBackData)(const GLfloat*, void*) -->
        <var-decl name='texcoordCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27456'>
        <!-- void* OpenGLCurveEvaluator::userData -->
        <var-decl name='userData' type-id='type-id-30' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='142' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27520'>
        <!-- int OpenGLCurveEvaluator::output_triangles -->
        <var-decl name='output_triangles' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='154' column='1'/>
      </data-member>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <!-- OpenGLCurveEvaluator::~OpenGLCurveEvaluator(int) -->
        <function-decl name='~OpenGLCurveEvaluator' filepath='libnurbs/interface/glcurveval.cc' line='78' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-3' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='9'>
        <!-- void OpenGLCurveEvaluator::domain1f(REAL, REAL) -->
        <function-decl name='domain1f' mangled-name='_ZN20OpenGLCurveEvaluator8domain1fEff' filepath='libnurbs/interface/glcurveval.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64' hash='db8105e6b583cbd0'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='10'>
        <!-- void OpenGLCurveEvaluator::range1f(long int, REAL*, REAL*) -->
        <function-decl name='range1f' mangled-name='_ZN20OpenGLCurveEvaluator7range1fElPfS0_' filepath='libnurbs/interface/glcurveval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64' hash='ca180d896c71b6c7'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='11'>
        <!-- void OpenGLCurveEvaluator::enable(long int) -->
        <function-decl name='enable' mangled-name='_ZN20OpenGLCurveEvaluator6enableEl' filepath='libnurbs/interface/glcurveval.cc' line='137' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='12'>
        <!-- void OpenGLCurveEvaluator::disable(long int) -->
        <function-decl name='disable' mangled-name='_ZN20OpenGLCurveEvaluator7disableEl' filepath='libnurbs/interface/glcurveval.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='13'>
        <!-- void OpenGLCurveEvaluator::bgnmap1f(long int) -->
        <function-decl name='bgnmap1f' mangled-name='_ZN20OpenGLCurveEvaluator8bgnmap1fEl' filepath='libnurbs/interface/glcurveval.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='14'>
        <!-- void OpenGLCurveEvaluator::map1f(long int, REAL, REAL, long int, long int, REAL*) -->
        <function-decl name='map1f' mangled-name='_ZN20OpenGLCurveEvaluator5map1fElffllPf' filepath='libnurbs/interface/glcurveval.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64' hash='f98f6f059a92e1c7'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='15'>
        <!-- void OpenGLCurveEvaluator::mapgrid1f(long int, REAL, REAL) -->
        <function-decl name='mapgrid1f' mangled-name='_ZN20OpenGLCurveEvaluator9mapgrid1fElff' filepath='libnurbs/interface/glcurveval.cc' line='147' column='1' visibility='default' binding='global' size-in-bits='64' hash='3298e9f33f58ace5'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='16'>
        <!-- void OpenGLCurveEvaluator::mapmesh1f(long int, long int, long int) -->
        <function-decl name='mapmesh1f' mangled-name='_ZN20OpenGLCurveEvaluator9mapmesh1fElll' filepath='libnurbs/interface/glcurveval.cc' line='262' column='1' visibility='default' binding='global' size-in-bits='64' hash='2461ca6254ad53d2'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='17'>
        <!-- void OpenGLCurveEvaluator::evalcoord1f(long int, REAL) -->
        <function-decl name='evalcoord1f' mangled-name='_ZN20OpenGLCurveEvaluator11evalcoord1fElf' filepath='libnurbs/interface/glcurveval.cc' line='296' column='1' visibility='default' binding='global' size-in-bits='64' hash='abf64f704bd8df76'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='18'>
        <!-- void OpenGLCurveEvaluator::endmap1f() -->
        <function-decl name='endmap1f' mangled-name='_ZN20OpenGLCurveEvaluator8endmap1fEv' filepath='libnurbs/interface/glcurveval.cc' line='184' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='19'>
        <!-- void OpenGLCurveEvaluator::bgnline() -->
        <function-decl name='bgnline' mangled-name='_ZN20OpenGLCurveEvaluator7bgnlineEv' filepath='libnurbs/interface/glcurveval.cc' line='105' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='20'>
        <!-- void OpenGLCurveEvaluator::endline() -->
        <function-decl name='endline' mangled-name='_ZN20OpenGLCurveEvaluator7endlineEv' filepath='libnurbs/interface/glcurveval.cc' line='114' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct curveEvalMachine -->
    <class-decl name='curveEvalMachine' is-struct='yes' visibility='default' size-in-bits='6592' filepath='libnurbs/interface/glcurveval.h' line='55' column='1' hash='a602d5b1accda201' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- REAL curveEvalMachine::uprime -->
        <var-decl name='uprime' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int curveEvalMachine::k -->
        <var-decl name='k' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- REAL curveEvalMachine::u1 -->
        <var-decl name='u1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- REAL curveEvalMachine::u2 -->
        <var-decl name='u2' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int curveEvalMachine::ustride -->
        <var-decl name='ustride' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int curveEvalMachine::uorder -->
        <var-decl name='uorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- REAL curveEvalMachine::ctlpoints[160] -->
        <var-decl name='ctlpoints' type-id='type-id-16' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <!-- REAL curveEvalMachine::ucoeff[40] -->
        <var-decl name='ucoeff' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef float REAL -->
    <typedef-decl name='REAL' type-id='type-id-2' size-in-bits='32' filepath='libnurbs/internals/types.h' line='41' column='1' hash='d7ec3bf03d3c5690' id='type-id-15'/>
    <!-- typedef curveEvalMachine curveEvalMachine -->
    <typedef-decl name='curveEvalMachine' type-id='type-id-35' size-in-bits='6592' filepath='libnurbs/interface/glcurveval.h' line='64' column='1' id='type-id-23'/>
    <!-- CachingEvaluator* -->
    <pointer-type-def type-id='type-id-36' size-in-bits='64' hash='b03786f72e5829cf' id='type-id-37'/>
    <!-- CachingEvaluator* const -->
    <qualified-type-def type-id='type-id-37' const='yes' hash='4faf346980fe02bf' id='type-id-38'/>
    <!-- OpenGLCurveEvaluator* -->
    <pointer-type-def type-id='type-id-21' size-in-bits='64' hash='b91559f9593fd13e' id='type-id-31'/>
    <!-- OpenGLCurveEvaluator* const -->
    <qualified-type-def type-id='type-id-31' const='yes' hash='5b363d9db8c8ec1e' id='type-id-39'/>
    <!-- REAL* -->
    <pointer-type-def type-id='type-id-15' size-in-bits='64' hash='93d591affbbd5f40' id='type-id-34'/>
    <!-- const GLfloat -->
    <qualified-type-def type-id='type-id-40' const='yes' hash='af53eb456940121e' id='type-id-41'/>
    <!-- const GLfloat* -->
    <pointer-type-def type-id='type-id-41' size-in-bits='64' hash='ee073772e477e208' id='type-id-42'/>
    <!-- const int -->
    <qualified-type-def type-id='type-id-3' const='yes' hash='8cef8df4b6728924' id='type-id-43'/>
    <!-- curveEvalMachine* -->
    <pointer-type-def type-id='type-id-23' size-in-bits='64' hash='d911b498457b3672' id='type-id-44'/>
    <!-- void (*)(const GLfloat*) -->
    <pointer-type-def type-id='type-id-45' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-26'/>
    <!-- void (*)(const GLfloat*, void*) -->
    <pointer-type-def type-id='type-id-46' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-29'/>
    <!-- CurveMap* -->
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-48'/>
    <!-- class CachingEvaluator -->
    <class-decl name='CachingEvaluator' visibility='default' size-in-bits='64' filepath='libnurbs/internals/cachingeval.h' line='39' column='1' hash='3b4a36132c0975c1' id='type-id-36'>
      <member-type access='private'>
        <!-- enum CachingEvaluator::ServiceMode -->
        <enum-decl name='ServiceMode' size-in-bits='32' alignment-in-bits='32' filepath='libnurbs/internals/cachingeval.h' line='42' column='1' hash='f2f9e3a9fba1efaa' id='type-id-49'>
          <underlying-type type-id='type-id-50'/>
          <enumerator name='play' value='0'/>
          <enumerator name='record' value='1'/>
          <enumerator name='playAndRecord' value='2'/>
        </enum-decl>
      </member-type>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <!-- CachingEvaluator::~CachingEvaluator(int) -->
        <function-decl name='~CachingEvaluator' filepath='libnurbs/internals/cachingeval.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <!-- int CachingEvaluator::canRecord() -->
        <function-decl name='canRecord' mangled-name='_ZN16CachingEvaluator9canRecordEv' filepath='libnurbs/internals/cachingeval.cc' line='43' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <!-- int -->
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <!-- int CachingEvaluator::canPlayAndRecord() -->
        <function-decl name='canPlayAndRecord' mangled-name='_ZN16CachingEvaluator16canPlayAndRecordEv' filepath='libnurbs/internals/cachingeval.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <!-- int -->
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <!-- int CachingEvaluator::createHandle(int) -->
        <function-decl name='createHandle' mangled-name='_ZN16CachingEvaluator12createHandleEi' filepath='libnurbs/internals/cachingeval.cc' line='55' column='1' visibility='default' binding='global' size-in-bits='64' hash='d628501fd2223339'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- int -->
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <!-- void CachingEvaluator::beginOutput(CachingEvaluator::ServiceMode, int) -->
        <function-decl name='beginOutput' mangled-name='_ZN16CachingEvaluator11beginOutputENS_11ServiceModeEi' filepath='libnurbs/internals/cachingeval.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64' hash='4fc416ef3d7eda10'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <!-- parameter of type 'enum CachingEvaluator::ServiceMode' -->
          <parameter type-id='type-id-49'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='6'>
        <!-- void CachingEvaluator::endOutput() -->
        <function-decl name='endOutput' mangled-name='_ZN16CachingEvaluator9endOutputEv' filepath='libnurbs/internals/cachingeval.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='7'>
        <!-- void CachingEvaluator::discardRecording(int) -->
        <function-decl name='discardRecording' mangled-name='_ZN16CachingEvaluator16discardRecordingEi' filepath='libnurbs/internals/cachingeval.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='8'>
        <!-- void CachingEvaluator::playRecording(int) -->
        <function-decl name='playRecording' mangled-name='_ZN16CachingEvaluator13playRecordingEi' filepath='libnurbs/internals/cachingeval.cc' line='76' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'CachingEvaluator*' -->
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class BasicCurveEvaluator -->
    <class-decl name='BasicCurveEvaluator' visibility='default' size-in-bits='64' filepath='libnurbs/internals/basiccrveval.h' line='43' column='1' hash='c931bb487f51cb63' id='type-id-22'>
      <!-- class CachingEvaluator -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-36'/>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <!-- BasicCurveEvaluator::~BasicCurveEvaluator(int) -->
        <function-decl name='~BasicCurveEvaluator' filepath='libnurbs/internals/basiccrveval.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-3' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='9'>
        <!-- void BasicCurveEvaluator::domain1f(REAL, REAL) -->
        <function-decl name='domain1f' mangled-name='_ZN19BasicCurveEvaluator8domain1fEff' filepath='libnurbs/internals/basiccrveval.cc' line='45' column='1' visibility='default' binding='global' size-in-bits='64' hash='db8105e6b583cbd0'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='10'>
        <!-- void BasicCurveEvaluator::range1f(long int, REAL*, REAL*) -->
        <function-decl name='range1f' mangled-name='_ZN19BasicCurveEvaluator7range1fElPfS0_' filepath='libnurbs/internals/basiccrveval.cc' line='53' column='1' visibility='default' binding='global' size-in-bits='64' hash='ca180d896c71b6c7'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='11'>
        <!-- void BasicCurveEvaluator::enable(long int) -->
        <function-decl name='enable' mangled-name='_ZN19BasicCurveEvaluator6enableEl' filepath='libnurbs/internals/basiccrveval.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='12'>
        <!-- void BasicCurveEvaluator::disable(long int) -->
        <function-decl name='disable' mangled-name='_ZN19BasicCurveEvaluator7disableEl' filepath='libnurbs/internals/basiccrveval.cc' line='69' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='13'>
        <!-- void BasicCurveEvaluator::bgnmap1f(long int) -->
        <function-decl name='bgnmap1f' mangled-name='_ZN19BasicCurveEvaluator8bgnmap1fEl' filepath='libnurbs/internals/basiccrveval.cc' line='77' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='14'>
        <!-- void BasicCurveEvaluator::map1f(long int, REAL, REAL, long int, long int, REAL*) -->
        <function-decl name='map1f' mangled-name='_ZN19BasicCurveEvaluator5map1fElffllPf' filepath='libnurbs/internals/basiccrveval.cc' line='85' column='1' visibility='default' binding='global' size-in-bits='64' hash='f98f6f059a92e1c7'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='15'>
        <!-- void BasicCurveEvaluator::mapgrid1f(long int, REAL, REAL) -->
        <function-decl name='mapgrid1f' mangled-name='_ZN19BasicCurveEvaluator9mapgrid1fElff' filepath='libnurbs/internals/basiccrveval.cc' line='93' column='1' visibility='default' binding='global' size-in-bits='64' hash='3298e9f33f58ace5'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='16'>
        <!-- void BasicCurveEvaluator::mapmesh1f(long int, long int, long int) -->
        <function-decl name='mapmesh1f' mangled-name='_ZN19BasicCurveEvaluator9mapmesh1fElll' filepath='libnurbs/internals/basiccrveval.cc' line='101' column='1' visibility='default' binding='global' size-in-bits='64' hash='2461ca6254ad53d2'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='17'>
        <!-- void BasicCurveEvaluator::evalcoord1f(long int, REAL) -->
        <function-decl name='evalcoord1f' mangled-name='_ZN19BasicCurveEvaluator11evalcoord1fElf' filepath='libnurbs/internals/basiccrveval.cc' line='109' column='1' visibility='default' binding='global' size-in-bits='64' hash='abf64f704bd8df76'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='18'>
        <!-- void BasicCurveEvaluator::endmap1f() -->
        <function-decl name='endmap1f' mangled-name='_ZN19BasicCurveEvaluator8endmap1fEv' filepath='libnurbs/internals/basiccrveval.cc' line='117' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='19'>
        <!-- void BasicCurveEvaluator::bgnline() -->
        <function-decl name='bgnline' mangled-name='_ZN19BasicCurveEvaluator7bgnlineEv' filepath='libnurbs/internals/basiccrveval.cc' line='125' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='20'>
        <!-- void BasicCurveEvaluator::endline() -->
        <function-decl name='endline' mangled-name='_ZN19BasicCurveEvaluator7endlineEv' filepath='libnurbs/internals/basiccrveval.cc' line='133' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct CurveMap -->
    <class-decl name='CurveMap' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-47'/>
    <!-- void (const GLfloat*) -->
    <function-type size-in-bits='64' hash='6884924904df04e1' id='type-id-45'>
      <!-- parameter of type 'const GLfloat*' -->
      <parameter type-id='type-id-42'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (const GLfloat*, void*) -->
    <function-type size-in-bits='64' hash='6884924904df04e1' id='type-id-46'>
      <!-- parameter of type 'const GLfloat*' -->
      <parameter type-id='type-id-42'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-30'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (GLenum) -->
    <function-type size-in-bits='64' hash='2bb88322482ae81c' id='type-id-52'>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='type-id-10'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (GLenum, void*) -->
    <function-type size-in-bits='64' hash='2bb88322482ae81c' id='type-id-53'>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='type-id-10'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-30'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (void*) -->
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-54'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-30'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- int (CachingEvaluator::*) () -->
    <function-type method-class-id='type-id-36' size-in-bits='64' hash='388da3fa973fde78' id='type-id-55'>
      <!-- implicit parameter of type 'CachingEvaluator*' -->
      <parameter type-id='type-id-37' is-artificial='yes'/>
      <!-- int -->
      <return type-id='type-id-3'/>
    </function-type>
    <!-- int (CachingEvaluator::*) (int) -->
    <function-type method-class-id='type-id-36' size-in-bits='64' hash='d628501fd2223339' id='type-id-56'>
      <!-- implicit parameter of type 'CachingEvaluator*' -->
      <parameter type-id='type-id-37' is-artificial='yes'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-3'/>
      <!-- int -->
      <return type-id='type-id-3'/>
    </function-type>
    <!-- void (BasicCurveEvaluator::*) () -->
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-57'>
      <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicCurveEvaluator::*) (REAL, REAL) -->
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='db8105e6b583cbd0' id='type-id-58'>
      <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicCurveEvaluator::*) (long int) -->
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='52c0efb08d2aa513#2' id='type-id-59'>
      <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicCurveEvaluator::*) (long int, REAL) -->
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='abf64f704bd8df76' id='type-id-60'>
      <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicCurveEvaluator::*) (long int, REAL*, REAL*) -->
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='ca180d896c71b6c7' id='type-id-61'>
      <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicCurveEvaluator::*) (long int, REAL, REAL) -->
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='3298e9f33f58ace5' id='type-id-62'>
      <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicCurveEvaluator::*) (long int, REAL, REAL, long int, long int, REAL*) -->
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='f98f6f059a92e1c7' id='type-id-63'>
      <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicCurveEvaluator::*) (long int, long int, long int) -->
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='2461ca6254ad53d2' id='type-id-64'>
      <!-- implicit parameter of type 'BasicCurveEvaluator*' -->
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (CachingEvaluator::*) () -->
    <function-type method-class-id='type-id-36' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-65'>
      <!-- implicit parameter of type 'CachingEvaluator*' -->
      <parameter type-id='type-id-37' is-artificial='yes'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (CachingEvaluator::*) (CachingEvaluator::ServiceMode, int) -->
    <function-type method-class-id='type-id-36' size-in-bits='64' hash='4fc416ef3d7eda10' id='type-id-66'>
      <!-- implicit parameter of type 'CachingEvaluator*' -->
      <parameter type-id='type-id-37' is-artificial='yes'/>
      <!-- parameter of type 'enum CachingEvaluator::ServiceMode' -->
      <parameter type-id='type-id-49'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-3'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (CachingEvaluator::*) (int) -->
    <function-type method-class-id='type-id-36' size-in-bits='64' hash='388da3fa973fde78' id='type-id-67'>
      <!-- implicit parameter of type 'CachingEvaluator*' -->
      <parameter type-id='type-id-37' is-artificial='yes'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-3'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLCurveEvaluator::*) () -->
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-68'>
      <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLCurveEvaluator::*) (REAL, REAL) -->
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='db8105e6b583cbd0' id='type-id-69'>
      <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLCurveEvaluator::*) (long int) -->
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='52c0efb08d2aa513#2' id='type-id-70'>
      <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLCurveEvaluator::*) (long int, REAL) -->
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='abf64f704bd8df76' id='type-id-71'>
      <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLCurveEvaluator::*) (long int, REAL*, REAL*) -->
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='ca180d896c71b6c7' id='type-id-72'>
      <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLCurveEvaluator::*) (long int, REAL, REAL) -->
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='3298e9f33f58ace5' id='type-id-73'>
      <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLCurveEvaluator::*) (long int, REAL, REAL, long int, long int, REAL*) -->
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='f98f6f059a92e1c7' id='type-id-74'>
      <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLCurveEvaluator::*) (long int, long int, long int) -->
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='2461ca6254ad53d2' id='type-id-75'>
      <!-- implicit parameter of type 'OpenGLCurveEvaluator*' -->
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glinterface.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- GLUnurbs* -->
    <pointer-type-def type-id='type-id-76' size-in-bits='64' hash='bf5246f21513cdf0' id='type-id-77'/>
    <!-- GLUnurbs* const -->
    <qualified-type-def type-id='type-id-77' const='yes' hash='be54080c8a86045a' id='type-id-78'/>
    <!-- OpenGLSurfaceEvaluator* -->
    <pointer-type-def type-id='type-id-79' size-in-bits='64' hash='19b75571e9e881e2' id='type-id-80'/>
    <!-- OpenGLSurfaceEvaluator* const -->
    <qualified-type-def type-id='type-id-80' const='yes' hash='f816f5cb4243b052' id='type-id-81'/>
    <!-- struct GLUnurbs -->
    <class-decl name='GLUnurbs' is-struct='yes' visibility='default' size-in-bits='1149440' filepath='libnurbs/interface/glrenderer.h' line='49' column='1' hash='76ef5da3535f3fd1' id='type-id-76'>
      <!-- class NurbsTessellator -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-82'/>
      <data-member access='public' layout-offset-in-bits='47616'>
        <!-- errorCallbackType GLUnurbs::errorCallback -->
        <var-decl name='errorCallback' type-id='type-id-83' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='71' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47680'>
        <!-- GLboolean GLUnurbs::autoloadmode -->
        <var-decl name='autoloadmode' type-id='type-id-84' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47744'>
        <!-- OpenGLSurfaceEvaluator GLUnurbs::surfaceEvaluator -->
        <var-decl name='surfaceEvaluator' type-id='type-id-79' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1121792'>
        <!-- OpenGLCurveEvaluator GLUnurbs::curveEvaluator -->
        <var-decl name='curveEvaluator' type-id='type-id-21' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1149376'>
        <!-- int GLUnurbs::callbackFlag -->
        <var-decl name='callbackFlag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='143' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <!-- void GLUnurbs::bgnrender() -->
        <function-decl name='bgnrender' mangled-name='_ZN8GLUnurbs9bgnrenderEv' filepath='libnurbs/interface/glrenderer.cc' line='107' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-77' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <!-- void GLUnurbs::endrender() -->
        <function-decl name='endrender' mangled-name='_ZN8GLUnurbs9endrenderEv' filepath='libnurbs/interface/glrenderer.cc' line='115' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-77' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <!-- void GLUnurbs::errorHandler(int) -->
        <function-decl name='errorHandler' mangled-name='_ZN8GLUnurbs12errorHandlerEi' filepath='libnurbs/interface/glrenderer.cc' line='120' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'GLUnurbs*' -->
          <parameter type-id='type-id-77' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3' filepath='libnurbs/interface/glrenderer.h' line='72' column='1'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct OpenGLSurfaceEvaluator -->
    <class-decl name='OpenGLSurfaceEvaluator' is-struct='yes' visibility='default' size-in-bits='1074048' filepath='libnurbs/interface/glsurfeval.h' line='100' column='1' hash='c36d377fe52f4bde' id='type-id-79'>
      <!-- struct BasicSurfaceEvaluator -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-85'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- StoredVertex* OpenGLSurfaceEvaluator::vertexCache[3] -->
        <var-decl name='vertexCache' type-id='type-id-86' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='180' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <!-- int OpenGLSurfaceEvaluator::tmeshing -->
        <var-decl name='tmeshing' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='181' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='288'>
        <!-- int OpenGLSurfaceEvaluator::which -->
        <var-decl name='which' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='182' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <!-- int OpenGLSurfaceEvaluator::vcount -->
        <var-decl name='vcount' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='183' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <!-- GLint OpenGLSurfaceEvaluator::gl_polygon_mode[2] -->
        <var-decl name='gl_polygon_mode' type-id='type-id-87' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='185' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <!-- bezierPatchMesh* OpenGLSurfaceEvaluator::global_bpm -->
        <var-decl name='global_bpm' type-id='type-id-14' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <!-- int OpenGLSurfaceEvaluator::output_triangles -->
        <var-decl name='output_triangles' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='189' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <!-- void (* OpenGLSurfaceEvaluator::beginCallBackN)(GLenum) -->
        <var-decl name='beginCallBackN' type-id='type-id-24' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <!-- void (* OpenGLSurfaceEvaluator::endCallBackN)(void) -->
        <var-decl name='endCallBackN' type-id='type-id-25' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <!-- void (* OpenGLSurfaceEvaluator::vertexCallBackN)(const GLfloat*) -->
        <var-decl name='vertexCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <!-- void (* OpenGLSurfaceEvaluator::normalCallBackN)(const GLfloat*) -->
        <var-decl name='normalCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='832'>
        <!-- void (* OpenGLSurfaceEvaluator::colorCallBackN)(const GLfloat*) -->
        <var-decl name='colorCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='896'>
        <!-- void (* OpenGLSurfaceEvaluator::texcoordCallBackN)(const GLfloat*) -->
        <var-decl name='texcoordCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='198' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='960'>
        <!-- void (* OpenGLSurfaceEvaluator::beginCallBackData)(GLenum, void*) -->
        <var-decl name='beginCallBackData' type-id='type-id-27' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='200' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1024'>
        <!-- void (* OpenGLSurfaceEvaluator::endCallBackData)(void*) -->
        <var-decl name='endCallBackData' type-id='type-id-28' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='201' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <!-- void (* OpenGLSurfaceEvaluator::vertexCallBackData)(const GLfloat*, void*) -->
        <var-decl name='vertexCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='202' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1152'>
        <!-- void (* OpenGLSurfaceEvaluator::normalCallBackData)(const GLfloat*, void*) -->
        <var-decl name='normalCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='203' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1216'>
        <!-- void (* OpenGLSurfaceEvaluator::colorCallBackData)(const GLfloat*, void*) -->
        <var-decl name='colorCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='204' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1280'>
        <!-- void (* OpenGLSurfaceEvaluator::texcoordCallBackData)(const GLfloat*, void*) -->
        <var-decl name='texcoordCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='205' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1344'>
        <!-- void* OpenGLSurfaceEvaluator::userData -->
        <var-decl name='userData' type-id='type-id-30' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='215' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <!-- int OpenGLSurfaceEvaluator::LOD_eval_level -->
        <var-decl name='LOD_eval_level' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1440'>
        <!-- int OpenGLSurfaceEvaluator::global_uorder -->
        <var-decl name='global_uorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='231' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <!-- int OpenGLSurfaceEvaluator::global_vorder -->
        <var-decl name='global_vorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1504'>
        <!-- REAL OpenGLSurfaceEvaluator::global_uprime -->
        <var-decl name='global_uprime' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='233' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1536'>
        <!-- REAL OpenGLSurfaceEvaluator::global_vprime -->
        <var-decl name='global_vprime' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='234' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1568'>
        <!-- REAL OpenGLSurfaceEvaluator::global_vprime_BV -->
        <var-decl name='global_vprime_BV' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='235' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1600'>
        <!-- REAL OpenGLSurfaceEvaluator::global_uprime_BU -->
        <var-decl name='global_uprime_BU' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1632'>
        <!-- int OpenGLSurfaceEvaluator::global_uorder_BV -->
        <var-decl name='global_uorder_BV' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <!-- int OpenGLSurfaceEvaluator::global_vorder_BV -->
        <var-decl name='global_vorder_BV' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='238' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1696'>
        <!-- int OpenGLSurfaceEvaluator::global_uorder_BU -->
        <var-decl name='global_uorder_BU' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='239' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1728'>
        <!-- int OpenGLSurfaceEvaluator::global_vorder_BU -->
        <var-decl name='global_vorder_BU' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='240' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1760'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ucoeff[40] -->
        <var-decl name='global_ucoeff' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3040'>
        <!-- REAL OpenGLSurfaceEvaluator::global_vcoeff[40] -->
        <var-decl name='global_vcoeff' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='243' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4320'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ucoeffDeriv[40] -->
        <var-decl name='global_ucoeffDeriv' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='244' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5600'>
        <!-- REAL OpenGLSurfaceEvaluator::global_vcoeffDeriv[40] -->
        <var-decl name='global_vcoeffDeriv' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6880'>
        <!-- REAL OpenGLSurfaceEvaluator::global_BV[40][4] -->
        <var-decl name='global_BV' type-id='type-id-88' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='247' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='12000'>
        <!-- REAL OpenGLSurfaceEvaluator::global_PBV[40][4] -->
        <var-decl name='global_PBV' type-id='type-id-88' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='248' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='17120'>
        <!-- REAL OpenGLSurfaceEvaluator::global_BU[40][4] -->
        <var-decl name='global_BU' type-id='type-id-88' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='249' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='22240'>
        <!-- REAL OpenGLSurfaceEvaluator::global_PBU[40][4] -->
        <var-decl name='global_PBU' type-id='type-id-88' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='250' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27392'>
        <!-- REAL* OpenGLSurfaceEvaluator::global_baseData -->
        <var-decl name='global_baseData' type-id='type-id-34' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27456'>
        <!-- int OpenGLSurfaceEvaluator::global_ev_k -->
        <var-decl name='global_ev_k' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='253' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27488'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ev_u1 -->
        <var-decl name='global_ev_u1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='254' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27520'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ev_u2 -->
        <var-decl name='global_ev_u2' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='255' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27552'>
        <!-- int OpenGLSurfaceEvaluator::global_ev_ustride -->
        <var-decl name='global_ev_ustride' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='256' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27584'>
        <!-- int OpenGLSurfaceEvaluator::global_ev_uorder -->
        <var-decl name='global_ev_uorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='257' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27616'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ev_v1 -->
        <var-decl name='global_ev_v1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='258' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27648'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ev_v2 -->
        <var-decl name='global_ev_v2' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='259' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27680'>
        <!-- int OpenGLSurfaceEvaluator::global_ev_vstride -->
        <var-decl name='global_ev_vstride' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='260' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27712'>
        <!-- int OpenGLSurfaceEvaluator::global_ev_vorder -->
        <var-decl name='global_ev_vorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='261' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27744'>
        <!-- REAL OpenGLSurfaceEvaluator::global_ev_ctlPoints[6400] -->
        <var-decl name='global_ev_ctlPoints' type-id='type-id-89' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='262' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232544'>
        <!-- REAL OpenGLSurfaceEvaluator::global_grid_u0 -->
        <var-decl name='global_grid_u0' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='264' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232576'>
        <!-- REAL OpenGLSurfaceEvaluator::global_grid_u1 -->
        <var-decl name='global_grid_u1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='265' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232608'>
        <!-- int OpenGLSurfaceEvaluator::global_grid_nu -->
        <var-decl name='global_grid_nu' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='266' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232640'>
        <!-- REAL OpenGLSurfaceEvaluator::global_grid_v0 -->
        <var-decl name='global_grid_v0' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='267' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232672'>
        <!-- REAL OpenGLSurfaceEvaluator::global_grid_v1 -->
        <var-decl name='global_grid_v1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='268' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232704'>
        <!-- int OpenGLSurfaceEvaluator::global_grid_nv -->
        <var-decl name='global_grid_nv' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='269' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232736'>
        <!-- surfEvalMachine OpenGLSurfaceEvaluator::em_vertex -->
        <var-decl name='em_vertex' type-id='type-id-90' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='349' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='443008'>
        <!-- surfEvalMachine OpenGLSurfaceEvaluator::em_normal -->
        <var-decl name='em_normal' type-id='type-id-90' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='350' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='653280'>
        <!-- surfEvalMachine OpenGLSurfaceEvaluator::em_color -->
        <var-decl name='em_color' type-id='type-id-90' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='351' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='863552'>
        <!-- surfEvalMachine OpenGLSurfaceEvaluator::em_texcoord -->
        <var-decl name='em_texcoord' type-id='type-id-90' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='352' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073824'>
        <!-- int OpenGLSurfaceEvaluator::auto_normal_flag -->
        <var-decl name='auto_normal_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='354' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073856'>
        <!-- int OpenGLSurfaceEvaluator::callback_auto_normal -->
        <var-decl name='callback_auto_normal' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='356' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073888'>
        <!-- int OpenGLSurfaceEvaluator::vertex_flag -->
        <var-decl name='vertex_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='357' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073920'>
        <!-- int OpenGLSurfaceEvaluator::normal_flag -->
        <var-decl name='normal_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='358' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073952'>
        <!-- int OpenGLSurfaceEvaluator::color_flag -->
        <var-decl name='color_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='359' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073984'>
        <!-- int OpenGLSurfaceEvaluator::texcoord_flag -->
        <var-decl name='texcoord_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='360' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <!-- OpenGLSurfaceEvaluator::~OpenGLSurfaceEvaluator(int) -->
        <function-decl name='~OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.cc' line='162' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3' filepath='libnurbs/interface/glsurfeval.h' line='153' column='1'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <!-- void OpenGLSurfaceEvaluator::range2f(long int, REAL*, REAL*) -->
        <function-decl name='range2f' mangled-name='_ZN22OpenGLSurfaceEvaluator7range2fElPfS0_' filepath='libnurbs/interface/glsurfeval.cc' line='258' column='1' visibility='default' binding='global' size-in-bits='64' hash='ca180d896c71b6c7'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <!-- void OpenGLSurfaceEvaluator::domain2f(REAL, REAL, REAL, REAL) -->
        <function-decl name='domain2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8domain2fEffff' filepath='libnurbs/interface/glsurfeval.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64' hash='595ddbe8c066a980'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <!-- void OpenGLSurfaceEvaluator::enable(long int) -->
        <function-decl name='enable' mangled-name='_ZN22OpenGLSurfaceEvaluator6enableEl' filepath='libnurbs/interface/glsurfeval.cc' line='185' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <!-- void OpenGLSurfaceEvaluator::disable(long int) -->
        <function-decl name='disable' mangled-name='_ZN22OpenGLSurfaceEvaluator7disableEl' filepath='libnurbs/interface/glsurfeval.cc' line='175' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <!-- void OpenGLSurfaceEvaluator::bgnmap2f(long int) -->
        <function-decl name='bgnmap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8bgnmap2fEl' filepath='libnurbs/interface/glsurfeval.cc' line='739' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <!-- void OpenGLSurfaceEvaluator::map2f(long int, REAL, REAL, long int, long int, REAL, REAL, long int, long int, REAL*) -->
        <function-decl name='map2f' mangled-name='_ZN22OpenGLSurfaceEvaluator5map2fElffllffllPf' filepath='libnurbs/interface/glsurfeval.cc' line='872' column='1' visibility='default' binding='global' size-in-bits='64' hash='da2f515917f7594c#2'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <!-- void OpenGLSurfaceEvaluator::mapgrid2f(long int, REAL, REAL, long int, REAL, REAL) -->
        <function-decl name='mapgrid2f' mangled-name='_ZN22OpenGLSurfaceEvaluator9mapgrid2fElfflff' filepath='libnurbs/interface/glsurfeval.cc' line='195' column='1' visibility='default' binding='global' size-in-bits='64' hash='28fdc77ce91afc79#2'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <!-- void OpenGLSurfaceEvaluator::mapmesh2f(long int, long int, long int, long int, long int) -->
        <function-decl name='mapmesh2f' mangled-name='_ZN22OpenGLSurfaceEvaluator9mapmesh2fElllll' filepath='libnurbs/interface/glsurfeval.cc' line='946' column='1' visibility='default' binding='global' size-in-bits='64' hash='de43da37f022a5b9'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <!-- void OpenGLSurfaceEvaluator::evalcoord2f(long int, REAL, REAL) -->
        <function-decl name='evalcoord2f' mangled-name='_ZN22OpenGLSurfaceEvaluator11evalcoord2fElff' filepath='libnurbs/interface/glsurfeval.cc' line='1042' column='1' visibility='default' binding='global' size-in-bits='64' hash='3298e9f33f58ace5'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <!-- void OpenGLSurfaceEvaluator::evalpoint2i(long int, long int) -->
        <function-decl name='evalpoint2i' mangled-name='_ZN22OpenGLSurfaceEvaluator11evalpoint2iEll' filepath='libnurbs/interface/glsurfeval.cc' line='1059' column='1' visibility='default' binding='global' size-in-bits='64' hash='b1dcd91100b153bb#2'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <!-- void OpenGLSurfaceEvaluator::endmap2f() -->
        <function-decl name='endmap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8endmap2fEv' filepath='libnurbs/interface/glsurfeval.cc' line='801' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <!-- void OpenGLSurfaceEvaluator::polymode(long int) -->
        <function-decl name='polymode' mangled-name='_ZN22OpenGLSurfaceEvaluator8polymodeEl' filepath='libnurbs/interface/glsurfeval.cc' line='219' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <!-- void OpenGLSurfaceEvaluator::bgnline() -->
        <function-decl name='bgnline' mangled-name='_ZN22OpenGLSurfaceEvaluator7bgnlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='240' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <!-- void OpenGLSurfaceEvaluator::endline() -->
        <function-decl name='endline' mangled-name='_ZN22OpenGLSurfaceEvaluator7endlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='249' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <!-- void OpenGLSurfaceEvaluator::bgnclosedline() -->
        <function-decl name='bgnclosedline' mangled-name='_ZN22OpenGLSurfaceEvaluator13bgnclosedlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='268' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <!-- void OpenGLSurfaceEvaluator::endclosedline() -->
        <function-decl name='endclosedline' mangled-name='_ZN22OpenGLSurfaceEvaluator13endclosedlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='277' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <!-- void OpenGLSurfaceEvaluator::bgntmesh() -->
        <function-decl name='bgntmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator8bgntmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <!-- void OpenGLSurfaceEvaluator::swaptmesh() -->
        <function-decl name='swaptmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator9swaptmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='305' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <!-- void OpenGLSurfaceEvaluator::endtmesh() -->
        <function-decl name='endtmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator8endtmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='312' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <!-- void OpenGLSurfaceEvaluator::bgnqstrip() -->
        <function-decl name='bgnqstrip' mangled-name='_ZN22OpenGLSurfaceEvaluator9bgnqstripEv' filepath='libnurbs/interface/glsurfeval.cc' line='712' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <!-- void OpenGLSurfaceEvaluator::endqstrip() -->
        <function-decl name='endqstrip' mangled-name='_ZN22OpenGLSurfaceEvaluator9endqstripEv' filepath='libnurbs/interface/glsurfeval.cc' line='725' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <!-- void OpenGLSurfaceEvaluator::bgntfan() -->
        <function-decl name='bgntfan' mangled-name='_ZN22OpenGLSurfaceEvaluator7bgntfanEv' filepath='libnurbs/interface/glsurfeval.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <!-- void OpenGLSurfaceEvaluator::endtfan() -->
        <function-decl name='endtfan' mangled-name='_ZN22OpenGLSurfaceEvaluator7endtfanEv' filepath='libnurbs/interface/glsurfeval.cc' line='334' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <!-- void OpenGLSurfaceEvaluator::evalUStrip(int, REAL, REAL*, int, REAL, REAL*) -->
        <function-decl name='evalUStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator10evalUStripEifPfifS0_' filepath='libnurbs/interface/glsurfeval.cc' line='343' column='1' visibility='default' binding='global' size-in-bits='64' hash='6f354a9a7516a40e'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <!-- void OpenGLSurfaceEvaluator::evalVStrip(int, REAL, REAL*, int, REAL, REAL*) -->
        <function-decl name='evalVStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator10evalVStripEifPfifS0_' filepath='libnurbs/interface/glsurfeval.cc' line='530' column='1' visibility='default' binding='global' size-in-bits='64' hash='6f354a9a7516a40e'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='34'>
        <!-- void OpenGLSurfaceEvaluator::inDoEvalCoord2NOGE(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE' mangled-name='_ZN22OpenGLSurfaceEvaluator18inDoEvalCoord2NOGEEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='283' column='1' visibility='default' binding='global' size-in-bits='64' hash='5a26a3f664666a50'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='35'>
        <!-- void OpenGLSurfaceEvaluator::inDoEvalCoord2NOGE_BU(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE_BU' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoEvalCoord2NOGE_BUEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' hash='5a26a3f664666a50'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='36'>
        <!-- void OpenGLSurfaceEvaluator::inDoEvalCoord2NOGE_BV(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE_BV' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoEvalCoord2NOGE_BVEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64' hash='5a26a3f664666a50'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='37'>
        <!-- void OpenGLSurfaceEvaluator::inPreEvaluateBV_intfac(REAL) -->
        <function-decl name='inPreEvaluateBV_intfac' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateBV_intfacEf' filepath='libnurbs/interface/glsurfeval.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64' hash='922f765c4b66cc08'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='38'>
        <!-- void OpenGLSurfaceEvaluator::inPreEvaluateBU_intfac(REAL) -->
        <function-decl name='inPreEvaluateBU_intfac' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateBU_intfacEf' filepath='libnurbs/interface/glsurfeval.h' line='321' column='1' visibility='default' binding='global' size-in-bits='64' hash='922f765c4b66cc08'>
          <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- GLUnurbs* gluNewNurbsRenderer() -->
    <function-decl name='gluNewNurbsRenderer' mangled-name='gluNewNurbsRenderer' filepath='libnurbs/interface/glinterface.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNewNurbsRenderer' hash='7e3eaf60ff8967c6'>
      <!-- GLUnurbs* -->
      <return type-id='type-id-77'/>
    </function-decl>
    <!-- void gluDeleteNurbsRenderer(GLUnurbs*) -->
    <function-decl name='gluDeleteNurbsRenderer' mangled-name='gluDeleteNurbsRenderer' filepath='libnurbs/interface/glinterface.cc' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluDeleteNurbsRenderer' hash='7e3eaf60ff8967c6'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void gluBeginSurface(GLUnurbs*) -->
    <function-decl name='gluBeginSurface' mangled-name='gluBeginSurface' filepath='libnurbs/interface/glinterface.cc' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginSurface' hash='7e3eaf60ff8967c6'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void gluBeginCurve(GLUnurbs*) -->
    <function-decl name='gluBeginCurve' mangled-name='gluBeginCurve' filepath='libnurbs/interface/glinterface.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginCurve' hash='7e3eaf60ff8967c6'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void gluEndCurve(GLUnurbs*) -->
    <function-decl name='gluEndCurve' mangled-name='gluEndCurve' filepath='libnurbs/interface/glinterface.cc' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndCurve' hash='7e3eaf60ff8967c6'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void gluEndSurface(GLUnurbs*) -->
    <function-decl name='gluEndSurface' mangled-name='gluEndSurface' filepath='libnurbs/interface/glinterface.cc' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndSurface' hash='7e3eaf60ff8967c6'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void gluBeginTrim(GLUnurbs*) -->
    <function-decl name='gluBeginTrim' mangled-name='gluBeginTrim' filepath='libnurbs/interface/glinterface.cc' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginTrim' hash='7e3eaf60ff8967c6'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void gluEndTrim(GLUnurbs*) -->
    <function-decl name='gluEndTrim' mangled-name='gluEndTrim' filepath='libnurbs/interface/glinterface.cc' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndTrim' hash='7e3eaf60ff8967c6'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void gluPwlCurve(GLUnurbs*, GLint, float*, GLint, GLenum) -->
    <function-decl name='gluPwlCurve' mangled-name='gluPwlCurve' filepath='libnurbs/interface/glinterface.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluPwlCurve' hash='b89d3b28bad786b2'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <!-- parameter of type 'float*' -->
      <parameter type-id='type-id-4' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='151' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='type-id-10' filepath='libnurbs/interface/glinterface.cc' line='151' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void gluNurbsCurve(GLUnurbs*, GLint, float*, GLint, float*, GLint, GLenum) -->
    <function-decl name='gluNurbsCurve' mangled-name='gluNurbsCurve' filepath='libnurbs/interface/glinterface.cc' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCurve' hash='f50221bdf8aaff31'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <!-- parameter of type 'float*' -->
      <parameter type-id='type-id-4' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <!-- parameter of type 'float*' -->
      <parameter type-id='type-id-4' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='type-id-10' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void gluNurbsSurface(GLUnurbs*, GLint, GLfloat*, GLint, GLfloat*, GLint, GLint, GLfloat*, GLint, GLint, GLenum) -->
    <function-decl name='gluNurbsSurface' mangled-name='gluNurbsSurface' filepath='libnurbs/interface/glinterface.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsSurface' hash='4f9eef60fbfae42d'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <!-- parameter of type 'GLfloat*' -->
      <parameter type-id='type-id-92' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='200' column='1'/>
      <!-- parameter of type 'GLfloat*' -->
      <parameter type-id='type-id-92' filepath='libnurbs/interface/glinterface.cc' line='200' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='201' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='201' column='1'/>
      <!-- parameter of type 'GLfloat*' -->
      <parameter type-id='type-id-92' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <!-- parameter of type 'typedef GLint' -->
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='type-id-10' filepath='libnurbs/interface/glinterface.cc' line='203' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void gluLoadSamplingMatrices(GLUnurbs*, const GLfloat*, const GLfloat*, const GLint*) -->
    <function-decl name='gluLoadSamplingMatrices' mangled-name='gluLoadSamplingMatrices' filepath='libnurbs/interface/glinterface.cc' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluLoadSamplingMatrices' hash='67f81c4135ac4ac1'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='235' column='1'/>
      <!-- parameter of type 'const GLfloat*' -->
      <parameter type-id='type-id-42' filepath='libnurbs/interface/glinterface.cc' line='235' column='1'/>
      <!-- parameter of type 'const GLfloat*' -->
      <parameter type-id='type-id-42' filepath='libnurbs/interface/glinterface.cc' line='236' column='1'/>
      <!-- parameter of type 'const GLint*' -->
      <parameter type-id='type-id-93' filepath='libnurbs/interface/glinterface.cc' line='237' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void gluNurbsProperty(GLUnurbs*, GLenum, GLfloat) -->
    <function-decl name='gluNurbsProperty' mangled-name='gluNurbsProperty' filepath='libnurbs/interface/glinterface.cc' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsProperty' hash='211625c25b1418ba'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='type-id-10' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <!-- parameter of type 'typedef GLfloat' -->
      <parameter type-id='type-id-40' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void gluGetNurbsProperty(GLUnurbs*, GLenum, GLfloat*) -->
    <function-decl name='gluGetNurbsProperty' mangled-name='gluGetNurbsProperty' filepath='libnurbs/interface/glinterface.cc' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluGetNurbsProperty' hash='cd7b84c102b682c9'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='type-id-10' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <!-- parameter of type 'GLfloat*' -->
      <parameter type-id='type-id-92' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void gluNurbsCallback(GLUnurbs*, GLenum, _GLUfuncptr) -->
    <function-decl name='gluNurbsCallback' mangled-name='gluNurbsCallback' filepath='libnurbs/interface/glinterface.cc' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallback' hash='b315c08e6afa5c4b'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <!-- parameter of type 'typedef GLenum' -->
      <parameter type-id='type-id-10' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <!-- parameter of type 'typedef _GLUfuncptr' -->
      <parameter type-id='type-id-94' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void gluNurbsCallbackDataEXT(GLUnurbs*, void*) -->
    <function-decl name='gluNurbsCallbackDataEXT' mangled-name='gluNurbsCallbackDataEXT' filepath='libnurbs/interface/glinterface.cc' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallbackDataEXT' hash='7e3eaf60ff8967c6'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-30' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void gluNurbsCallbackData(GLUnurbs*, void*) -->
    <function-decl name='gluNurbsCallbackData' mangled-name='gluNurbsCallbackData' filepath='libnurbs/interface/glinterface.cc' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallbackData' hash='7e3eaf60ff8967c6'>
      <!-- parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-30' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-decl>
    <!-- void (GLUnurbs::*) () -->
    <function-type method-class-id='type-id-76' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-95'>
      <!-- implicit parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' is-artificial='yes'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (GLUnurbs::*) (int) -->
    <function-type method-class-id='type-id-76' size-in-bits='64' hash='388da3fa973fde78' id='type-id-96'>
      <!-- implicit parameter of type 'GLUnurbs*' -->
      <parameter type-id='type-id-77' is-artificial='yes'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-3' filepath='libnurbs/interface/glrenderer.h' line='72' column='1'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLSurfaceEvaluator::*) () -->
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-97'>
      <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLSurfaceEvaluator::*) (REAL) -->
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='922f765c4b66cc08' id='type-id-98'>
      <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLSurfaceEvaluator::*) (REAL, REAL, REAL*, REAL*) -->
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='5a26a3f664666a50' id='type-id-99'>
      <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLSurfaceEvaluator::*) (REAL, REAL, REAL, REAL) -->
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='595ddbe8c066a980' id='type-id-100'>
      <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLSurfaceEvaluator::*) (int, REAL, REAL*, int, REAL, REAL*) -->
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='6f354a9a7516a40e' id='type-id-101'>
      <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLSurfaceEvaluator::*) (long int) -->
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='52c0efb08d2aa513#2' id='type-id-102'>
      <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLSurfaceEvaluator::*) (long int, REAL*, REAL*) -->
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='ca180d896c71b6c7' id='type-id-103'>
      <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLSurfaceEvaluator::*) (long int, REAL, REAL) -->
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='3298e9f33f58ace5' id='type-id-104'>
      <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLSurfaceEvaluator::*) (long int, REAL, REAL, long int, REAL, REAL) -->
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='28fdc77ce91afc79#2' id='type-id-105'>
      <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLSurfaceEvaluator::*) (long int, REAL, REAL, long int, long int, REAL, REAL, long int, long int, REAL*) -->
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='da2f515917f7594c#2' id='type-id-106'>
      <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLSurfaceEvaluator::*) (long int, long int) -->
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='b1dcd91100b153bb#2' id='type-id-107'>
      <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (OpenGLSurfaceEvaluator::*) (long int, long int, long int, long int, long int) -->
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='de43da37f022a5b9' id='type-id-108'>
      <!-- implicit parameter of type 'OpenGLSurfaceEvaluator*' -->
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glrenderer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- GLfloat[4] -->
    <array-type-def dimensions='1' type-id='type-id-40' size-in-bits='128' hash='30d5881e91c9cd09' id='type-id-109'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-110'/>
    </array-type-def>
    <!-- typedef void (*)(GLenum) errorCallbackType -->
    <typedef-decl name='errorCallbackType' type-id='type-id-24' size-in-bits='64' filepath='libnurbs/interface/glrenderer.h' line='46' column='1' hash='fd7a63c0c6c822c4' id='type-id-83'/>
    <!-- GLfloat(*)[4] -->
    <pointer-type-def type-id='type-id-109' size-in-bits='64' hash='0f799f9d7d871c20' id='type-id-111'/>
    <!-- class NurbsTessellator -->
    <class-decl name='NurbsTessellator' visibility='default' size-in-bits='47616' filepath='libnurbs/internals/nurbstess.h' line='53' column='1' hash='bbfc714e32d3042e' id='type-id-82'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <!-- Renderhints NurbsTessellator::renderhints -->
        <var-decl name='renderhints' type-id='type-id-112' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='104' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <!-- Maplist NurbsTessellator::maplist -->
        <var-decl name='maplist' type-id='type-id-113' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='105' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3008'>
        <!-- Backend NurbsTessellator::backend -->
        <var-decl name='backend' type-id='type-id-114' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3648'>
        <!-- Subdivider NurbsTessellator::subdivider -->
        <var-decl name='subdivider' type-id='type-id-115' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='24064'>
        <!-- JumpBuffer* NurbsTessellator::jumpbuffer -->
        <var-decl name='jumpbuffer' type-id='type-id-116' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='135' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='24128'>
        <!-- Pool NurbsTessellator::o_pwlcurvePool -->
        <var-decl name='o_pwlcurvePool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='136' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26624'>
        <!-- Pool NurbsTessellator::o_nurbscurvePool -->
        <var-decl name='o_nurbscurvePool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='29120'>
        <!-- Pool NurbsTessellator::o_curvePool -->
        <var-decl name='o_curvePool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='138' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='31616'>
        <!-- Pool NurbsTessellator::o_trimPool -->
        <var-decl name='o_trimPool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='139' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='34112'>
        <!-- Pool NurbsTessellator::o_surfacePool -->
        <var-decl name='o_surfacePool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='36608'>
        <!-- Pool NurbsTessellator::o_nurbssurfacePool -->
        <var-decl name='o_nurbssurfacePool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='141' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='39104'>
        <!-- Pool NurbsTessellator::propertyPool -->
        <var-decl name='propertyPool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='142' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='41600'>
        <!-- Pool NurbsTessellator::quiltPool -->
        <var-decl name='quiltPool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='144' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='44096'>
        <!-- TrimVertexPool NurbsTessellator::extTrimVertexPool -->
        <var-decl name='extTrimVertexPool' type-id='type-id-118' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='146' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46720'>
        <!-- int NurbsTessellator::inSurface -->
        <var-decl name='inSurface' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='148' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46752'>
        <!-- int NurbsTessellator::inCurve -->
        <var-decl name='inCurve' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='149' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46784'>
        <!-- int NurbsTessellator::inTrim -->
        <var-decl name='inTrim' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='150' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46816'>
        <!-- int NurbsTessellator::isCurveModified -->
        <var-decl name='isCurveModified' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='151' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46848'>
        <!-- int NurbsTessellator::isTrimModified -->
        <var-decl name='isTrimModified' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='152' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46880'>
        <!-- int NurbsTessellator::isSurfaceModified -->
        <var-decl name='isSurfaceModified' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='153' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46912'>
        <!-- int NurbsTessellator::isDataValid -->
        <var-decl name='isDataValid' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='154' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46944'>
        <!-- int NurbsTessellator::numTrims -->
        <var-decl name='numTrims' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='155' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46976'>
        <!-- int NurbsTessellator::playBack -->
        <var-decl name='playBack' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='156' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47040'>
        <!-- O_trim** NurbsTessellator::nextTrim -->
        <var-decl name='nextTrim' type-id='type-id-119' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='158' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47104'>
        <!-- O_curve** NurbsTessellator::nextCurve -->
        <var-decl name='nextCurve' type-id='type-id-120' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='159' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47168'>
        <!-- O_nurbscurve** NurbsTessellator::nextNurbscurve -->
        <var-decl name='nextNurbscurve' type-id='type-id-121' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='160' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47232'>
        <!-- O_pwlcurve** NurbsTessellator::nextPwlcurve -->
        <var-decl name='nextPwlcurve' type-id='type-id-122' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='161' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47296'>
        <!-- O_nurbssurface** NurbsTessellator::nextNurbssurface -->
        <var-decl name='nextNurbssurface' type-id='type-id-123' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='162' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47360'>
        <!-- O_surface* NurbsTessellator::currentSurface -->
        <var-decl name='currentSurface' type-id='type-id-124' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='164' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47424'>
        <!-- O_trim* NurbsTessellator::currentTrim -->
        <var-decl name='currentTrim' type-id='type-id-125' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='165' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47488'>
        <!-- O_curve* NurbsTessellator::currentCurve -->
        <var-decl name='currentCurve' type-id='type-id-126' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='166' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47552'>
        <!-- DisplayList* NurbsTessellator::dl -->
        <var-decl name='dl' type-id='type-id-127' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='168' column='1'/>
      </data-member>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <!-- NurbsTessellator::~NurbsTessellator(int) -->
        <function-decl name='~NurbsTessellator' filepath='libnurbs/internals/nurbsinterfac.cc' line='88' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-128' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <!-- void NurbsTessellator::bgnrender() -->
        <function-decl name='bgnrender' mangled-name='_ZN16NurbsTessellator9bgnrenderEv' filepath='libnurbs/internals/nurbstess.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-128' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <!-- void NurbsTessellator::endrender() -->
        <function-decl name='endrender' mangled-name='_ZN16NurbsTessellator9endrenderEv' filepath='libnurbs/internals/nurbstess.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-128' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <!-- void NurbsTessellator::makeobj(int) -->
        <function-decl name='makeobj' mangled-name='_ZN16NurbsTessellator7makeobjEi' filepath='libnurbs/internals/nurbstess.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-128' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <!-- void NurbsTessellator::closeobj() -->
        <function-decl name='closeobj' mangled-name='_ZN16NurbsTessellator8closeobjEv' filepath='libnurbs/internals/nurbstess.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-128' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='6'>
        <!-- void NurbsTessellator::errorHandler(int) -->
        <function-decl name='errorHandler' mangled-name='_ZN16NurbsTessellator12errorHandlerEi' filepath='libnurbs/internals/nurbstess.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'NurbsTessellator*' -->
          <parameter type-id='type-id-128' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- void (NurbsTessellator::*) () -->
    <function-type method-class-id='type-id-82' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-129'>
      <!-- implicit parameter of type 'NurbsTessellator*' -->
      <parameter type-id='type-id-128' is-artificial='yes'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (NurbsTessellator::*) (int) -->
    <function-type method-class-id='type-id-82' size-in-bits='64' hash='388da3fa973fde78' id='type-id-130'>
      <!-- implicit parameter of type 'NurbsTessellator*' -->
      <parameter type-id='type-id-128' is-artificial='yes'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-3'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glsurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- GLint[2] -->
    <array-type-def dimensions='1' type-id='type-id-91' size-in-bits='64' hash='df69d46a77f6fb57' id='type-id-87'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-131'/>
    </array-type-def>
    <!-- REAL[2] -->
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='64' hash='172869b0f34e848f' id='type-id-132'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-131'/>
    </array-type-def>
    <!-- REAL[3] -->
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='96' hash='63a51e8a60f761fe' id='type-id-133'>
      <!-- <anonymous range>[3] -->
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-134'/>
    </array-type-def>
    <!-- REAL[40][4] -->
    <array-type-def dimensions='2' type-id='type-id-15' size-in-bits='5120' hash='242ce12a4ae26fc1' id='type-id-88'>
      <!-- <anonymous range>[40] -->
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='type-id-20'/>
      <!-- <anonymous range>[4] -->
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-110'/>
    </array-type-def>
    <!-- REAL[6400] -->
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='204800' hash='681ba3623c4f0d48' id='type-id-89'>
      <!-- <anonymous range>[6400] -->
      <subrange length='6400' lower-bound='0' upper-bound='6399' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='3f44e66942978c4d' id='type-id-135'/>
    </array-type-def>
    <!-- StoredVertex*[3] -->
    <array-type-def dimensions='1' type-id='type-id-136' size-in-bits='192' hash='92476f5f25008493' id='type-id-86'>
      <!-- <anonymous range>[3] -->
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-134'/>
    </array-type-def>
    <!-- class StoredVertex -->
    <class-decl name='StoredVertex' visibility='default' size-in-bits='256' filepath='libnurbs/interface/glsurfeval.h' line='84' column='1' hash='fb3da055512c436c' id='type-id-137'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- int StoredVertex::type -->
        <var-decl name='type' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='95' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <!-- REAL StoredVertex::coord[2] -->
        <var-decl name='coord' type-id='type-id-132' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='96' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- long int StoredVertex::point[2] -->
        <var-decl name='point' type-id='type-id-138' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <!-- long int[2] -->
    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='128' hash='6eb4544bb476592b#2' id='type-id-138'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-131'/>
    </array-type-def>
    <!-- struct surfEvalMachine -->
    <class-decl name='surfEvalMachine' is-struct='yes' visibility='default' size-in-bits='210272' filepath='libnurbs/interface/glsurfeval.h' line='63' column='1' hash='d6c83745c0c47ccb' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- REAL surfEvalMachine::uprime -->
        <var-decl name='uprime' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- REAL surfEvalMachine::vprime -->
        <var-decl name='vprime' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int surfEvalMachine::k -->
        <var-decl name='k' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- REAL surfEvalMachine::u1 -->
        <var-decl name='u1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- REAL surfEvalMachine::u2 -->
        <var-decl name='u2' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int surfEvalMachine::ustride -->
        <var-decl name='ustride' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int surfEvalMachine::uorder -->
        <var-decl name='uorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- REAL surfEvalMachine::v1 -->
        <var-decl name='v1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- REAL surfEvalMachine::v2 -->
        <var-decl name='v2' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- int surfEvalMachine::vstride -->
        <var-decl name='vstride' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int surfEvalMachine::vorder -->
        <var-decl name='vorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <!-- REAL surfEvalMachine::ctlPoints[6400] -->
        <var-decl name='ctlPoints' type-id='type-id-89' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='205152'>
        <!-- REAL surfEvalMachine::ucoeff[40] -->
        <var-decl name='ucoeff' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='206432'>
        <!-- REAL surfEvalMachine::vcoeff[40] -->
        <var-decl name='vcoeff' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='207712'>
        <!-- REAL surfEvalMachine::ucoeffDeriv[40] -->
        <var-decl name='ucoeffDeriv' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208992'>
        <!-- REAL surfEvalMachine::vcoeffDeriv[40] -->
        <var-decl name='vcoeffDeriv' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef surfEvalMachine surfEvalMachine -->
    <typedef-decl name='surfEvalMachine' type-id='type-id-139' size-in-bits='210272' filepath='libnurbs/interface/glsurfeval.h' line='80' column='1' id='type-id-90'/>
    <!-- REAL(*)[3] -->
    <pointer-type-def type-id='type-id-133' size-in-bits='64' hash='e033cae97beb5ed2' id='type-id-140'/>
    <!-- StoredVertex* -->
    <pointer-type-def type-id='type-id-137' size-in-bits='64' hash='268680ca59389c6b' id='type-id-136'/>
    <!-- StoredVertex* const -->
    <qualified-type-def type-id='type-id-136' const='yes' hash='1ab0b1205c0b330c' id='type-id-141'/>
    <!-- surfEvalMachine* -->
    <pointer-type-def type-id='type-id-90' size-in-bits='64' hash='9e72b4c5212f5be5' id='type-id-142'/>
    <!-- SurfaceMap* -->
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-144'/>
    <!-- class BasicSurfaceEvaluator -->
    <class-decl name='BasicSurfaceEvaluator' visibility='default' size-in-bits='64' filepath='libnurbs/internals/basicsurfeval.h' line='43' column='1' hash='eea24f113fefc500' id='type-id-85'>
      <!-- class CachingEvaluator -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-36'/>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <!-- BasicSurfaceEvaluator::~BasicSurfaceEvaluator(int) -->
        <function-decl name='~BasicSurfaceEvaluator' filepath='libnurbs/internals/basicsurfeval.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-3' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='9'>
        <!-- void BasicSurfaceEvaluator::range2f(long int, REAL*, REAL*) -->
        <function-decl name='range2f' mangled-name='_ZN21BasicSurfaceEvaluator7range2fElPfS0_' filepath='libnurbs/internals/basicsurfeval.cc' line='65' column='1' visibility='default' binding='global' size-in-bits='64' hash='ca180d896c71b6c7'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='10'>
        <!-- void BasicSurfaceEvaluator::domain2f(REAL, REAL, REAL, REAL) -->
        <function-decl name='domain2f' mangled-name='_ZN21BasicSurfaceEvaluator8domain2fEffff' filepath='libnurbs/internals/basicsurfeval.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64' hash='595ddbe8c066a980'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='11'>
        <!-- void BasicSurfaceEvaluator::enable(long int) -->
        <function-decl name='enable' mangled-name='_ZN21BasicSurfaceEvaluator6enableEl' filepath='libnurbs/internals/basicsurfeval.cc' line='74' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='12'>
        <!-- void BasicSurfaceEvaluator::disable(long int) -->
        <function-decl name='disable' mangled-name='_ZN21BasicSurfaceEvaluator7disableEl' filepath='libnurbs/internals/basicsurfeval.cc' line='82' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='13'>
        <!-- void BasicSurfaceEvaluator::bgnmap2f(long int) -->
        <function-decl name='bgnmap2f' mangled-name='_ZN21BasicSurfaceEvaluator8bgnmap2fEl' filepath='libnurbs/internals/basicsurfeval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='14'>
        <!-- void BasicSurfaceEvaluator::map2f(long int, REAL, REAL, long int, long int, REAL, REAL, long int, long int, REAL*) -->
        <function-decl name='map2f' mangled-name='_ZN21BasicSurfaceEvaluator5map2fElffllffllPf' filepath='libnurbs/internals/basicsurfeval.cc' line='106' column='1' visibility='default' binding='global' size-in-bits='64' hash='da2f515917f7594c'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='15'>
        <!-- void BasicSurfaceEvaluator::mapgrid2f(long int, REAL, REAL, long int, REAL, REAL) -->
        <function-decl name='mapgrid2f' mangled-name='_ZN21BasicSurfaceEvaluator9mapgrid2fElfflff' filepath='libnurbs/internals/basicsurfeval.cc' line='116' column='1' visibility='default' binding='global' size-in-bits='64' hash='28fdc77ce91afc79'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='16'>
        <!-- void BasicSurfaceEvaluator::mapmesh2f(long int, long int, long int, long int, long int) -->
        <function-decl name='mapmesh2f' mangled-name='_ZN21BasicSurfaceEvaluator9mapmesh2fElllll' filepath='libnurbs/internals/basicsurfeval.cc' line='124' column='1' visibility='default' binding='global' size-in-bits='64' hash='de43da37f022a5b9'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='17'>
        <!-- void BasicSurfaceEvaluator::evalcoord2f(long int, REAL, REAL) -->
        <function-decl name='evalcoord2f' mangled-name='_ZN21BasicSurfaceEvaluator11evalcoord2fElff' filepath='libnurbs/internals/basicsurfeval.cc' line='132' column='1' visibility='default' binding='global' size-in-bits='64' hash='3298e9f33f58ace5'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='18'>
        <!-- void BasicSurfaceEvaluator::evalpoint2i(long int, long int) -->
        <function-decl name='evalpoint2i' mangled-name='_ZN21BasicSurfaceEvaluator11evalpoint2iEll' filepath='libnurbs/internals/basicsurfeval.cc' line='140' column='1' visibility='default' binding='global' size-in-bits='64' hash='b1dcd91100b153bb'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='19'>
        <!-- void BasicSurfaceEvaluator::endmap2f() -->
        <function-decl name='endmap2f' mangled-name='_ZN21BasicSurfaceEvaluator8endmap2fEv' filepath='libnurbs/internals/basicsurfeval.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='20'>
        <!-- void BasicSurfaceEvaluator::polymode(long int) -->
        <function-decl name='polymode' mangled-name='_ZN21BasicSurfaceEvaluator8polymodeEl' filepath='libnurbs/internals/basicsurfeval.cc' line='57' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'long int' -->
          <parameter type-id='type-id-33'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='21'>
        <!-- void BasicSurfaceEvaluator::bgnline() -->
        <function-decl name='bgnline' mangled-name='_ZN21BasicSurfaceEvaluator7bgnlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='148' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='22'>
        <!-- void BasicSurfaceEvaluator::endline() -->
        <function-decl name='endline' mangled-name='_ZN21BasicSurfaceEvaluator7endlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='156' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='23'>
        <!-- void BasicSurfaceEvaluator::bgnclosedline() -->
        <function-decl name='bgnclosedline' mangled-name='_ZN21BasicSurfaceEvaluator13bgnclosedlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='24'>
        <!-- void BasicSurfaceEvaluator::endclosedline() -->
        <function-decl name='endclosedline' mangled-name='_ZN21BasicSurfaceEvaluator13endclosedlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='172' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='25'>
        <!-- void BasicSurfaceEvaluator::bgntmesh() -->
        <function-decl name='bgntmesh' mangled-name='_ZN21BasicSurfaceEvaluator8bgntmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='194' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='26'>
        <!-- void BasicSurfaceEvaluator::swaptmesh() -->
        <function-decl name='swaptmesh' mangled-name='_ZN21BasicSurfaceEvaluator9swaptmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='202' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='27'>
        <!-- void BasicSurfaceEvaluator::endtmesh() -->
        <function-decl name='endtmesh' mangled-name='_ZN21BasicSurfaceEvaluator8endtmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='210' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='28'>
        <!-- void BasicSurfaceEvaluator::bgnqstrip() -->
        <function-decl name='bgnqstrip' mangled-name='_ZN21BasicSurfaceEvaluator9bgnqstripEv' filepath='libnurbs/internals/basicsurfeval.cc' line='218' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='29'>
        <!-- void BasicSurfaceEvaluator::endqstrip() -->
        <function-decl name='endqstrip' mangled-name='_ZN21BasicSurfaceEvaluator9endqstripEv' filepath='libnurbs/internals/basicsurfeval.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='30'>
        <!-- void BasicSurfaceEvaluator::bgntfan() -->
        <function-decl name='bgntfan' mangled-name='_ZN21BasicSurfaceEvaluator7bgntfanEv' filepath='libnurbs/internals/basicsurfeval.cc' line='180' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='31'>
        <!-- void BasicSurfaceEvaluator::endtfan() -->
        <function-decl name='endtfan' mangled-name='_ZN21BasicSurfaceEvaluator7endtfanEv' filepath='libnurbs/internals/basicsurfeval.cc' line='188' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='32'>
        <!-- void BasicSurfaceEvaluator::evalUStrip(int, REAL, REAL*, int, REAL, REAL*) -->
        <function-decl name='evalUStrip' mangled-name='_ZN21BasicSurfaceEvaluator10evalUStripEifPfifS0_' filepath='libnurbs/internals/basicsurfeval.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64' hash='6f354a9a7516a40e'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='33'>
        <!-- void BasicSurfaceEvaluator::evalVStrip(int, REAL, REAL*, int, REAL, REAL*) -->
        <function-decl name='evalVStrip' mangled-name='_ZN21BasicSurfaceEvaluator10evalVStripEifPfifS0_' filepath='libnurbs/internals/basicsurfeval.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' hash='6f354a9a7516a40e'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='34'>
        <!-- void BasicSurfaceEvaluator::inDoEvalCoord2NOGE(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE' mangled-name='_ZN21BasicSurfaceEvaluator18inDoEvalCoord2NOGEEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' hash='5a26a3f664666a50'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='35'>
        <!-- void BasicSurfaceEvaluator::inDoEvalCoord2NOGE_BU(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE_BU' mangled-name='_ZN21BasicSurfaceEvaluator21inDoEvalCoord2NOGE_BUEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' hash='5a26a3f664666a50'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='36'>
        <!-- void BasicSurfaceEvaluator::inDoEvalCoord2NOGE_BV(REAL, REAL, REAL*, REAL*) -->
        <function-decl name='inDoEvalCoord2NOGE_BV' mangled-name='_ZN21BasicSurfaceEvaluator21inDoEvalCoord2NOGE_BVEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64' hash='5a26a3f664666a50'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- parameter of type 'REAL*' -->
          <parameter type-id='type-id-34'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='37'>
        <!-- void BasicSurfaceEvaluator::inPreEvaluateBV_intfac(REAL) -->
        <function-decl name='inPreEvaluateBV_intfac' mangled-name='_ZN21BasicSurfaceEvaluator22inPreEvaluateBV_intfacEf' filepath='libnurbs/internals/basicsurfeval.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64' hash='922f765c4b66cc08'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='38'>
        <!-- void BasicSurfaceEvaluator::inPreEvaluateBU_intfac(REAL) -->
        <function-decl name='inPreEvaluateBU_intfac' mangled-name='_ZN21BasicSurfaceEvaluator22inPreEvaluateBU_intfacEf' filepath='libnurbs/internals/basicsurfeval.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' hash='922f765c4b66cc08'>
          <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <!-- parameter of type 'typedef REAL' -->
          <parameter type-id='type-id-15'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- struct SurfaceMap -->
    <class-decl name='SurfaceMap' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-143'/>
    <!-- void (BasicSurfaceEvaluator::*) () -->
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-146'>
      <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicSurfaceEvaluator::*) (REAL) -->
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='922f765c4b66cc08' id='type-id-147'>
      <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicSurfaceEvaluator::*) (REAL, REAL, REAL*, REAL*) -->
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='5a26a3f664666a50' id='type-id-148'>
      <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicSurfaceEvaluator::*) (REAL, REAL, REAL, REAL) -->
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='595ddbe8c066a980' id='type-id-149'>
      <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicSurfaceEvaluator::*) (int, REAL, REAL*, int, REAL, REAL*) -->
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='6f354a9a7516a40e' id='type-id-150'>
      <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicSurfaceEvaluator::*) (long int) -->
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='52c0efb08d2aa513#2' id='type-id-151'>
      <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicSurfaceEvaluator::*) (long int, REAL*, REAL*) -->
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='ca180d896c71b6c7' id='type-id-152'>
      <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicSurfaceEvaluator::*) (long int, REAL, REAL) -->
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='3298e9f33f58ace5' id='type-id-153'>
      <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicSurfaceEvaluator::*) (long int, REAL, REAL, long int, REAL, REAL) -->
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='28fdc77ce91afc79' id='type-id-154'>
      <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicSurfaceEvaluator::*) (long int, REAL, REAL, long int, long int, REAL, REAL, long int, long int, REAL*) -->
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='da2f515917f7594c' id='type-id-155'>
      <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'typedef REAL' -->
      <parameter type-id='type-id-15'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'REAL*' -->
      <parameter type-id='type-id-34'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicSurfaceEvaluator::*) (long int, long int) -->
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='b1dcd91100b153bb' id='type-id-156'>
      <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (BasicSurfaceEvaluator::*) (long int, long int, long int, long int, long int) -->
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='de43da37f022a5b9' id='type-id-157'>
      <!-- implicit parameter of type 'BasicSurfaceEvaluator*' -->
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- parameter of type 'long int' -->
      <parameter type-id='type-id-33'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/incurveeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/insurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-158'/>
    <!-- char*[32] -->
    <array-type-def dimensions='1' type-id='type-id-159' size-in-bits='2048' hash='967be61c43ecd18f' id='type-id-160'>
      <!-- <anonymous range>[32] -->
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-161'/>
    </array-type-def>
    <!-- class Buffer -->
    <class-decl name='Buffer' visibility='default' size-in-bits='64' filepath='libnurbs/internals/bufpool.h' line='45' column='1' hash='dabb8e345199e496' id='type-id-162'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Buffer* Buffer::next -->
        <var-decl name='next' type-id='type-id-163' visibility='default' filepath='libnurbs/internals/bufpool.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <!-- class Pool -->
    <class-decl name='Pool' visibility='default' size-in-bits='2496' filepath='libnurbs/internals/bufpool.h' line='50' column='1' hash='1474a5075d7d2ac2' id='type-id-117'>
      <member-type access='protected'>
        <!-- enum Pool::Magic -->
        <enum-decl name='Magic' size-in-bits='32' alignment-in-bits='32' filepath='libnurbs/internals/bufpool.h' line='70' column='1' hash='930824abf210575b' id='type-id-164'>
          <underlying-type type-id='type-id-50'/>
          <enumerator name='is_allocated' value='62369'/>
          <enumerator name='is_free' value='61858'/>
        </enum-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <!-- Buffer* Pool::freelist -->
        <var-decl name='freelist' type-id='type-id-163' visibility='default' filepath='libnurbs/internals/bufpool.h' line='62' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <!-- char* Pool::blocklist[32] -->
        <var-decl name='blocklist' type-id='type-id-160' visibility='default' filepath='libnurbs/internals/bufpool.h' line='63' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2112'>
        <!-- int Pool::nextblock -->
        <var-decl name='nextblock' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='64' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2176'>
        <!-- char* Pool::curblock -->
        <var-decl name='curblock' type-id='type-id-159' visibility='default' filepath='libnurbs/internals/bufpool.h' line='65' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2240'>
        <!-- int Pool::buffersize -->
        <var-decl name='buffersize' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='66' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2272'>
        <!-- int Pool::nextsize -->
        <var-decl name='nextsize' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='67' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2304'>
        <!-- int Pool::nextfree -->
        <var-decl name='nextfree' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='68' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2336'>
        <!-- int Pool::initsize -->
        <var-decl name='initsize' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='69' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2368'>
        <!-- const char* Pool::name -->
        <var-decl name='name' type-id='type-id-165' visibility='default' filepath='libnurbs/internals/bufpool.h' line='71' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2432'>
        <!-- Pool::Magic Pool::magic -->
        <var-decl name='magic' type-id='type-id-164' visibility='default' filepath='libnurbs/internals/bufpool.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <!-- class PooledObj -->
    <class-decl name='PooledObj' visibility='default' size-in-bits='8' filepath='libnurbs/internals/bufpool.h' line='118' column='1' hash='c7d200bffa9b2d36' id='type-id-166'/>
    <!-- class PwlArc -->
    <class-decl name='PwlArc' visibility='default' size-in-bits='192' filepath='libnurbs/internals/pwlarc.h' line='44' column='1' hash='2cc8dba217ae295b' id='type-id-167'>
      <!-- class PooledObj -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- TrimVertex* PwlArc::pts -->
        <var-decl name='pts' type-id='type-id-168' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- int PwlArc::npts -->
        <var-decl name='npts' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- long int PwlArc::type -->
        <var-decl name='type' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <!-- enum arc_side -->
    <enum-decl name='arc_side' size-in-bits='32' alignment-in-bits='32' filepath='libnurbs/internals/arc.h' line='52' column='1' hash='60b6cd228bb84059' id='type-id-169'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='arc_none' value='0'/>
      <enumerator name='arc_right' value='1'/>
      <enumerator name='arc_top' value='2'/>
      <enumerator name='arc_left' value='3'/>
      <enumerator name='arc_bottom' value='4'/>
    </enum-decl>
    <!-- struct Arc -->
    <class-decl name='Arc' is-struct='yes' visibility='default' size-in-bits='448' filepath='libnurbs/internals/arc.h' line='55' column='1' hash='60098f6f8ef2d5b9' id='type-id-170'>
      <!-- class PooledObj -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='public' static='yes'>
        <!-- static const int Arc::bezier_tag -->
        <var-decl name='bezier_tag' type-id='type-id-43' mangled-name='_ZN3Arc10bezier_tagE' visibility='default' filepath='libnurbs/internals/arc.cc' line='52' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static const int Arc::arc_tag -->
        <var-decl name='arc_tag' type-id='type-id-43' mangled-name='_ZN3Arc7arc_tagE' visibility='default' filepath='libnurbs/internals/arc.cc' line='53' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static const int Arc::tail_tag -->
        <var-decl name='tail_tag' type-id='type-id-43' mangled-name='_ZN3Arc8tail_tagE' visibility='default' filepath='libnurbs/internals/arc.cc' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Arc_ptr Arc::prev -->
        <var-decl name='prev' type-id='type-id-171' visibility='default' filepath='libnurbs/internals/arc.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- Arc_ptr Arc::next -->
        <var-decl name='next' type-id='type-id-171' visibility='default' filepath='libnurbs/internals/arc.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- Arc_ptr Arc::link -->
        <var-decl name='link' type-id='type-id-171' visibility='default' filepath='libnurbs/internals/arc.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- BezierArc* Arc::bezierArc -->
        <var-decl name='bezierArc' type-id='type-id-172' visibility='default' filepath='libnurbs/internals/arc.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- PwlArc* Arc::pwlArc -->
        <var-decl name='pwlArc' type-id='type-id-173' visibility='default' filepath='libnurbs/internals/arc.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- long int Arc::type -->
        <var-decl name='type' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/arc.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- long int Arc::nuid -->
        <var-decl name='nuid' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/arc.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct TrimVertex -->
    <class-decl name='TrimVertex' is-struct='yes' visibility='default' size-in-bits='128' filepath='libnurbs/internals/trimvertex.h' line='43' column='1' hash='c48342ca8a15d373#2' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- REAL TrimVertex::param[2] -->
        <var-decl name='param' type-id='type-id-132' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- long int TrimVertex::nuid -->
        <var-decl name='nuid' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef Arc* Arc_ptr -->
    <typedef-decl name='Arc_ptr' type-id='type-id-175' size-in-bits='64' filepath='libnurbs/internals/arc.h' line='50' column='1' hash='7592de82c2146a26' id='type-id-171'/>
    <!-- typedef unsigned long int size_t -->
    <typedef-decl name='size_t' type-id='type-id-17' size-in-bits='64' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/include/stddef.h' line='211' column='1' hash='8fdc5eea2983a729' id='type-id-176'/>
    <!-- Arc* -->
    <pointer-type-def type-id='type-id-170' size-in-bits='64' hash='7592de82c2146a26' id='type-id-175'/>
    <!-- Arc* const -->
    <qualified-type-def type-id='type-id-175' const='yes' hash='bd90a587757f73df' id='type-id-177'/>
    <!-- Arc_ptr* -->
    <pointer-type-def type-id='type-id-171' size-in-bits='64' hash='67e107d55067cf98' id='type-id-178'/>
    <!-- BezierArc* -->
    <pointer-type-def type-id='type-id-179' size-in-bits='64' hash='77eaa23958eb0b5f' id='type-id-172'/>
    <!-- Buffer* -->
    <pointer-type-def type-id='type-id-162' size-in-bits='64' hash='939b08df96ab7482' id='type-id-163'/>
    <!-- Pool& -->
    <reference-type-def kind='lvalue' type-id='type-id-117' size-in-bits='64' hash='c81ffa3102ef3c83' id='type-id-180'/>
    <!-- Pool* -->
    <pointer-type-def type-id='type-id-117' size-in-bits='64' hash='32f8cd54243ee538' id='type-id-181'/>
    <!-- PooledObj* -->
    <pointer-type-def type-id='type-id-166' size-in-bits='64' hash='555e3033b4a1e61b' id='type-id-182'/>
    <!-- PwlArc* -->
    <pointer-type-def type-id='type-id-167' size-in-bits='64' hash='74ff07819dae74db' id='type-id-173'/>
    <!-- TrimVertex* -->
    <pointer-type-def type-id='type-id-174' size-in-bits='64' hash='ff6cddff133e642c#2' id='type-id-168'/>
    <!-- char* -->
    <pointer-type-def type-id='type-id-158' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-159'/>
    <!-- const char -->
    <qualified-type-def type-id='type-id-158' const='yes' hash='3e50fd33f9bb78d9' id='type-id-183'/>
    <!-- const char* -->
    <pointer-type-def type-id='type-id-183' size-in-bits='64' hash='c44743f354f6a443' id='type-id-165'/>
    <!-- struct BezierArc -->
    <class-decl name='BezierArc' is-struct='yes' visibility='default' size-in-bits='256' filepath='libnurbs/internals/bezierarc.h' line='43' column='1' hash='df8c7971f3b76a9f' id='type-id-179'>
      <!-- class PooledObj -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- REAL* BezierArc::cpts -->
        <var-decl name='cpts' type-id='type-id-34' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int BezierArc::order -->
        <var-decl name='order' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- int BezierArc::stride -->
        <var-decl name='stride' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- long int BezierArc::type -->
        <var-decl name='type' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- Mapdesc* BezierArc::mapdesc -->
        <var-decl name='mapdesc' type-id='type-id-184' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='48' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arcsorter.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- REAL[4] -->
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='128' hash='a4b6ed908a82d30e' id='type-id-185'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-110'/>
    </array-type-def>
    <!-- __jmp_buf_tag[1] -->
    <array-type-def dimensions='1' type-id='type-id-186' size-in-bits='1600' hash='4b439ea14699207c#2' id='type-id-187'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-188'/>
    </array-type-def>
    <!-- class ArcSdirSorter -->
    <class-decl name='ArcSdirSorter' visibility='default' size-in-bits='192' filepath='libnurbs/internals/arcsorter.h' line='57' column='1' hash='3df63754bb94d40b' id='type-id-189'>
      <!-- class ArcSorter -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-190'/>
      <member-function access='private' vtable-offset='2'>
        <!-- int ArcSdirSorter::qscmp(char*, char*) -->
        <function-decl name='qscmp' mangled-name='_ZN13ArcSdirSorter5qscmpEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='93' column='1' visibility='default' binding='global' size-in-bits='64' hash='c4d8735456ba2786'>
          <!-- implicit parameter of type 'ArcSdirSorter*' -->
          <parameter type-id='type-id-191' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- int -->
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class ArcSorter -->
    <class-decl name='ArcSorter' visibility='default' size-in-bits='192' filepath='libnurbs/internals/arcsorter.h' line='44' column='1' hash='e5552dc0a9d3b79b' id='type-id-190'>
      <!-- class Sorter -->
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-192'/>
      <data-member access='protected' layout-offset-in-bits='128'>
        <!-- Subdivider& ArcSorter::subdivider -->
        <var-decl name='subdivider' type-id='type-id-193' visibility='default' filepath='libnurbs/internals/arcsorter.h' line='50' column='1'/>
      </data-member>
      <member-function access='protected' vtable-offset='2'>
        <!-- int ArcSorter::qscmp(char*, char*) -->
        <function-decl name='qscmp' mangled-name='_ZN9ArcSorter5qscmpEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='53' column='1' visibility='default' binding='global' size-in-bits='64' hash='c4d8735456ba2786'>
          <!-- implicit parameter of type 'ArcSorter*' -->
          <parameter type-id='type-id-194' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- int -->
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <!-- void ArcSorter::qsexc(char*, char*) -->
        <function-decl name='qsexc' mangled-name='_ZN9ArcSorter5qsexcEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64' hash='6faa8831d3af3ad4'>
          <!-- implicit parameter of type 'ArcSorter*' -->
          <parameter type-id='type-id-194' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <!-- void ArcSorter::qstexc(char*, char*, char*) -->
        <function-decl name='qstexc' mangled-name='_ZN9ArcSorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/arcsorter.cc' line='76' column='1' visibility='default' binding='global' size-in-bits='64' hash='9895045035709c6f'>
          <!-- implicit parameter of type 'ArcSorter*' -->
          <parameter type-id='type-id-194' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class ArcTdirSorter -->
    <class-decl name='ArcTdirSorter' visibility='default' size-in-bits='192' filepath='libnurbs/internals/arcsorter.h' line='65' column='1' hash='9db04392235eae57' id='type-id-195'>
      <!-- class ArcSorter -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-190'/>
      <member-function access='private' vtable-offset='2'>
        <!-- int ArcTdirSorter::qscmp(char*, char*) -->
        <function-decl name='qscmp' mangled-name='_ZN13ArcTdirSorter5qscmpEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='138' column='1' visibility='default' binding='global' size-in-bits='64' hash='c4d8735456ba2786'>
          <!-- implicit parameter of type 'ArcTdirSorter*' -->
          <parameter type-id='type-id-196' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- int -->
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class ArcTessellator -->
    <class-decl name='ArcTessellator' visibility='default' size-in-bits='128' filepath='libnurbs/internals/arctess.h' line='47' column='1' hash='ac296043e3188846' id='type-id-197'>
      <data-member access='public' static='yes'>
        <!-- static REAL ArcTessellator::gl_Bernstein[][24][24] -->
        <var-decl name='gl_Bernstein' type-id='type-id-198' mangled-name='_ZN14ArcTessellator12gl_BernsteinE' visibility='default' filepath='libnurbs/internals/arctess.cc' line='504' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Pool& ArcTessellator::pwlarcpool -->
        <var-decl name='pwlarcpool' type-id='type-id-180' visibility='default' filepath='libnurbs/internals/arctess.h' line='61' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- TrimVertexPool& ArcTessellator::trimvertexpool -->
        <var-decl name='trimvertexpool' type-id='type-id-199' visibility='default' filepath='libnurbs/internals/arctess.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <!-- class Bin -->
    <class-decl name='Bin' visibility='default' size-in-bits='128' filepath='libnurbs/internals/bin.h' line='44' column='1' hash='30e025f22d78beee' id='type-id-200'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Arc_ptr Bin::head -->
        <var-decl name='head' type-id='type-id-171' visibility='default' filepath='libnurbs/internals/bin.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- Arc_ptr Bin::current -->
        <var-decl name='current' type-id='type-id-171' visibility='default' filepath='libnurbs/internals/bin.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <!-- class Flist -->
    <class-decl name='Flist' visibility='default' size-in-bits='320' filepath='libnurbs/internals/flist.h' line='42' column='1' hash='ed01e75ad9680649' id='type-id-201'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- REAL* Flist::pts -->
        <var-decl name='pts' type-id='type-id-34' visibility='default' filepath='libnurbs/internals/flist.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- int Flist::npts -->
        <var-decl name='npts' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/flist.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <!-- int Flist::start -->
        <var-decl name='start' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/flist.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- int Flist::end -->
        <var-decl name='end' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/flist.h' line='47' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <!-- FlistSorter Flist::sorter -->
        <var-decl name='sorter' type-id='type-id-202' visibility='default' filepath='libnurbs/internals/flist.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <!-- class Subdivider -->
    <class-decl name='Subdivider' visibility='default' size-in-bits='20416' filepath='libnurbs/internals/subdivider.h' line='55' column='1' hash='e07e7a27aef7650b' id='type-id-115'>
      <member-type access='private'>
        <!-- enum Subdivider::dir -->
        <enum-decl name='dir' size-in-bits='32' alignment-in-bits='32' filepath='libnurbs/internals/subdivider.h' line='105' column='1' hash='ba4254643f3a6fa0' id='type-id-203'>
          <underlying-type type-id='type-id-50'/>
          <enumerator name='down' value='0'/>
          <enumerator name='same' value='1'/>
          <enumerator name='up' value='2'/>
          <enumerator name='none' value='3'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Slicer Subdivider::slicer -->
        <var-decl name='slicer' type-id='type-id-204' visibility='default' filepath='libnurbs/internals/subdivider.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8064'>
        <!-- ArcTessellator Subdivider::arctessellator -->
        <var-decl name='arctessellator' type-id='type-id-197' visibility='default' filepath='libnurbs/internals/subdivider.h' line='113' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8192'>
        <!-- Pool Subdivider::arcpool -->
        <var-decl name='arcpool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/subdivider.h' line='114' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='10688'>
        <!-- Pool Subdivider::bezierarcpool -->
        <var-decl name='bezierarcpool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/subdivider.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='13184'>
        <!-- Pool Subdivider::pwlarcpool -->
        <var-decl name='pwlarcpool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/subdivider.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='15680'>
        <!-- TrimVertexPool Subdivider::trimvertexpool -->
        <var-decl name='trimvertexpool' type-id='type-id-118' visibility='default' filepath='libnurbs/internals/subdivider.h' line='117' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18304'>
        <!-- JumpBuffer* Subdivider::jumpbuffer -->
        <var-decl name='jumpbuffer' type-id='type-id-116' visibility='default' filepath='libnurbs/internals/subdivider.h' line='119' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18368'>
        <!-- Renderhints& Subdivider::renderhints -->
        <var-decl name='renderhints' type-id='type-id-205' visibility='default' filepath='libnurbs/internals/subdivider.h' line='120' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18432'>
        <!-- Backend& Subdivider::backend -->
        <var-decl name='backend' type-id='type-id-206' visibility='default' filepath='libnurbs/internals/subdivider.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18496'>
        <!-- Bin Subdivider::initialbin -->
        <var-decl name='initialbin' type-id='type-id-200' visibility='default' filepath='libnurbs/internals/subdivider.h' line='123' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18624'>
        <!-- Arc_ptr Subdivider::pjarc -->
        <var-decl name='pjarc' type-id='type-id-171' visibility='default' filepath='libnurbs/internals/subdivider.h' line='124' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18688'>
        <!-- int Subdivider::s_index -->
        <var-decl name='s_index' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/subdivider.h' line='125' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18720'>
        <!-- int Subdivider::t_index -->
        <var-decl name='t_index' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/subdivider.h' line='126' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18752'>
        <!-- Quilt* Subdivider::qlist -->
        <var-decl name='qlist' type-id='type-id-207' visibility='default' filepath='libnurbs/internals/subdivider.h' line='127' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18816'>
        <!-- Flist Subdivider::spbrkpts -->
        <var-decl name='spbrkpts' type-id='type-id-201' visibility='default' filepath='libnurbs/internals/subdivider.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19136'>
        <!-- Flist Subdivider::tpbrkpts -->
        <var-decl name='tpbrkpts' type-id='type-id-201' visibility='default' filepath='libnurbs/internals/subdivider.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19456'>
        <!-- Flist Subdivider::smbrkpts -->
        <var-decl name='smbrkpts' type-id='type-id-201' visibility='default' filepath='libnurbs/internals/subdivider.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19776'>
        <!-- Flist Subdivider::tmbrkpts -->
        <var-decl name='tmbrkpts' type-id='type-id-201' visibility='default' filepath='libnurbs/internals/subdivider.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20096'>
        <!-- REAL Subdivider::stepsizes[4] -->
        <var-decl name='stepsizes' type-id='type-id-185' visibility='default' filepath='libnurbs/internals/subdivider.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20224'>
        <!-- int Subdivider::showDegenerate -->
        <var-decl name='showDegenerate' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/subdivider.h' line='133' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20256'>
        <!-- int Subdivider::isArcTypeBezier -->
        <var-decl name='isArcTypeBezier' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/subdivider.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20288'>
        <!-- REAL Subdivider::domain_distance_u_rate -->
        <var-decl name='domain_distance_u_rate' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/subdivider.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20320'>
        <!-- REAL Subdivider::domain_distance_v_rate -->
        <var-decl name='domain_distance_v_rate' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/subdivider.h' line='189' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20352'>
        <!-- int Subdivider::is_domain_distance_sampling -->
        <var-decl name='is_domain_distance_sampling' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/subdivider.h' line='190' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct JumpBuffer -->
    <class-decl name='JumpBuffer' is-struct='yes' visibility='default' size-in-bits='1600' filepath='libnurbs/internals/mysetjmp.h' line='56' column='1' hash='cf8628326d01df27' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- jmp_buf JumpBuffer::buf -->
        <var-decl name='buf' type-id='type-id-209' visibility='default' filepath='libnurbs/internals/mysetjmp.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct TrimVertexPool -->
    <class-decl name='TrimVertexPool' is-struct='yes' visibility='default' size-in-bits='2624' filepath='libnurbs/internals/trimvertpool.h' line='45' column='1' hash='07f257573fda4c2d#2' id='type-id-118'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Pool TrimVertexPool::pool -->
        <var-decl name='pool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2496'>
        <!-- TrimVertex** TrimVertexPool::vlist -->
        <var-decl name='vlist' type-id='type-id-210' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2560'>
        <!-- int TrimVertexPool::nextvlistslot -->
        <var-decl name='nextvlistslot' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2592'>
        <!-- int TrimVertexPool::vlistsize -->
        <var-decl name='vlistsize' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct __jmp_buf_tag -->
    <class-decl name='__jmp_buf_tag' is-struct='yes' visibility='default' size-in-bits='1600' filepath='/usr/include/setjmp.h' line='36' column='1' hash='0d7cc580e71a7367#2' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __jmp_buf __jmp_buf_tag::__jmpbuf -->
        <var-decl name='__jmpbuf' type-id='type-id-211' visibility='default' filepath='/usr/include/setjmp.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- int __jmp_buf_tag::__mask_was_saved -->
        <var-decl name='__mask_was_saved' type-id='type-id-3' visibility='default' filepath='/usr/include/setjmp.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- __sigset_t __jmp_buf_tag::__saved_mask -->
        <var-decl name='__saved_mask' type-id='type-id-212' visibility='default' filepath='/usr/include/setjmp.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __jmp_buf_tag[1] jmp_buf -->
    <typedef-decl name='jmp_buf' type-id='type-id-187' size-in-bits='1600' filepath='/usr/include/setjmp.h' line='49' column='1' hash='4b439ea14699207c#2' id='type-id-209'/>
    <!-- Arc** -->
    <pointer-type-def type-id='type-id-175' size-in-bits='64' hash='a84f0a141ff2344f' id='type-id-213'/>
    <!-- ArcSdirSorter* -->
    <pointer-type-def type-id='type-id-189' size-in-bits='64' hash='d8b5445e1c581e3f' id='type-id-191'/>
    <!-- ArcSdirSorter* const -->
    <qualified-type-def type-id='type-id-191' const='yes' hash='ea0470eda9dd8edf' id='type-id-214'/>
    <!-- ArcSorter* -->
    <pointer-type-def type-id='type-id-190' size-in-bits='64' hash='d6d8f16e6889ba55' id='type-id-194'/>
    <!-- ArcSorter* const -->
    <qualified-type-def type-id='type-id-194' const='yes' hash='fd752c57ff01e362' id='type-id-215'/>
    <!-- ArcTdirSorter* -->
    <pointer-type-def type-id='type-id-195' size-in-bits='64' hash='8805da223a64fd2e' id='type-id-196'/>
    <!-- ArcTdirSorter* const -->
    <qualified-type-def type-id='type-id-196' const='yes' hash='ab3c4482c342be15' id='type-id-216'/>
    <!-- ArcTessellator* -->
    <pointer-type-def type-id='type-id-197' size-in-bits='64' hash='559d33674b51c9b6' id='type-id-217'/>
    <!-- Backend& -->
    <reference-type-def kind='lvalue' type-id='type-id-114' size-in-bits='64' hash='78c5321939a1837b' id='type-id-206'/>
    <!-- Bin& -->
    <reference-type-def kind='lvalue' type-id='type-id-200' size-in-bits='64' hash='a2b468a5cde17cb2' id='type-id-218'/>
    <!-- Bin* -->
    <pointer-type-def type-id='type-id-200' size-in-bits='64' hash='1a12c542dbb32903' id='type-id-219'/>
    <!-- Curvelist& -->
    <reference-type-def kind='lvalue' type-id='type-id-220' size-in-bits='64' hash='7f67e6037c9bf5ce' id='type-id-221'/>
    <!-- Flist* -->
    <pointer-type-def type-id='type-id-201' size-in-bits='64' hash='caff59106cfcf0d0' id='type-id-222'/>
    <!-- JumpBuffer* -->
    <pointer-type-def type-id='type-id-208' size-in-bits='64' hash='43c270a68427de26' id='type-id-116'/>
    <!-- Patchlist& -->
    <reference-type-def kind='lvalue' type-id='type-id-223' size-in-bits='64' hash='94baa2e3cbd25cf3' id='type-id-224'/>
    <!-- Quilt* -->
    <pointer-type-def type-id='type-id-225' size-in-bits='64' hash='37bd09d8ed3141bd#2' id='type-id-207'/>
    <!-- Renderhints& -->
    <reference-type-def kind='lvalue' type-id='type-id-112' size-in-bits='64' hash='a8b3a211c33d5daa' id='type-id-205'/>
    <!-- Sorter* -->
    <pointer-type-def type-id='type-id-192' size-in-bits='64' hash='2de42bda4f3d6ff1' id='type-id-226'/>
    <!-- Sorter* const -->
    <qualified-type-def type-id='type-id-226' const='yes' hash='e0206004930aa7c7' id='type-id-227'/>
    <!-- Subdivider& -->
    <reference-type-def kind='lvalue' type-id='type-id-115' size-in-bits='64' hash='27fdeca5734a3272' id='type-id-193'/>
    <!-- Subdivider* -->
    <pointer-type-def type-id='type-id-115' size-in-bits='64' hash='85290dc3d0ec3f5e' id='type-id-228'/>
    <!-- TrimVertex** -->
    <pointer-type-def type-id='type-id-168' size-in-bits='64' hash='964a41fa3f251240#2' id='type-id-210'/>
    <!-- TrimVertexPool& -->
    <reference-type-def kind='lvalue' type-id='type-id-118' size-in-bits='64' hash='871189a2a73bfe6b' id='type-id-199'/>
    <!-- TrimVertexPool* -->
    <pointer-type-def type-id='type-id-118' size-in-bits='64' hash='96a9052532590d45#2' id='type-id-229'/>
    <!-- const REAL -->
    <qualified-type-def type-id='type-id-15' const='yes' hash='f8b423684ef46369' id='type-id-230'/>
    <!-- const REAL* -->
    <pointer-type-def type-id='type-id-230' size-in-bits='64' hash='f2756299d11b5293' id='type-id-231'/>
    <!-- class FlistSorter -->
    <class-decl name='FlistSorter' visibility='default' size-in-bits='128' filepath='libnurbs/internals/flistsorter.h' line='42' column='1' hash='4a25006e8d053432' id='type-id-202'>
      <!-- class Sorter -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-192'/>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <!-- FlistSorter::~FlistSorter(int) -->
        <function-decl name='~FlistSorter' filepath='libnurbs/internals/flistsorter.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'FlistSorter*' -->
          <parameter type-id='type-id-232' is-artificial='yes'/>
          <!-- artificial parameter of type 'int' -->
          <parameter type-id='type-id-3' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <!-- int FlistSorter::qscmp(char*, char*) -->
        <function-decl name='qscmp' mangled-name='_ZN11FlistSorter5qscmpEPcS0_' filepath='libnurbs/internals/flistsorter.cc' line='54' column='1' visibility='default' binding='global' size-in-bits='64' hash='c4d8735456ba2786'>
          <!-- implicit parameter of type 'FlistSorter*' -->
          <parameter type-id='type-id-232' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- int -->
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='3'>
        <!-- void FlistSorter::qsexc(char*, char*) -->
        <function-decl name='qsexc' mangled-name='_ZN11FlistSorter5qsexcEPcS0_' filepath='libnurbs/internals/flistsorter.cc' line='62' column='1' visibility='default' binding='global' size-in-bits='64' hash='6faa8831d3af3ad4'>
          <!-- implicit parameter of type 'FlistSorter*' -->
          <parameter type-id='type-id-232' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <!-- void FlistSorter::qstexc(char*, char*, char*) -->
        <function-decl name='qstexc' mangled-name='_ZN11FlistSorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/flistsorter.cc' line='72' column='1' visibility='default' binding='global' size-in-bits='64' hash='9895045035709c6f'>
          <!-- implicit parameter of type 'FlistSorter*' -->
          <parameter type-id='type-id-232' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class Slicer -->
    <class-decl name='Slicer' visibility='default' size-in-bits='8064' filepath='libnurbs/internals/slicer.h' line='49' column='1' hash='371b7154561f514b' id='type-id-204'>
      <!-- class CoveAndTiler -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-233'/>
      <!-- class Mesher -->
      <base-class access='public' layout-offset-in-bits='128' type-id='type-id-234'/>
      <data-member access='private' layout-offset-in-bits='5248'>
        <!-- Backend& Slicer::backend -->
        <var-decl name='backend' type-id='type-id-206' visibility='default' filepath='libnurbs/internals/slicer.h' line='72' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5312'>
        <!-- REAL Slicer::oneOverDu -->
        <var-decl name='oneOverDu' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/slicer.h' line='73' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5344'>
        <!-- REAL Slicer::du -->
        <var-decl name='du' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/slicer.h' line='74' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5376'>
        <!-- REAL Slicer::dv -->
        <var-decl name='dv' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/slicer.h' line='74' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5408'>
        <!-- int Slicer::isolines -->
        <var-decl name='isolines' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/slicer.h' line='75' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5440'>
        <!-- int Slicer::ulinear -->
        <var-decl name='ulinear' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/slicer.h' line='81' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5472'>
        <!-- int Slicer::vlinear -->
        <var-decl name='vlinear' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/slicer.h' line='82' column='1'/>
      </data-member>
    </class-decl>
    <!-- class Sorter -->
    <class-decl name='Sorter' visibility='default' size-in-bits='128' filepath='libnurbs/internals/sorter.h' line='36' column='1' hash='59bd41271eb043fb' id='type-id-192'>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- int Sorter::es -->
        <var-decl name='es' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/sorter.h' line='49' column='1'/>
      </data-member>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <!-- Sorter::~Sorter(int) -->
        <function-decl name='~Sorter' filepath='libnurbs/internals/sorter.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'Sorter*' -->
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-3'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <!-- int Sorter::qscmp(char*, char*) -->
        <function-decl name='qscmp' mangled-name='_ZN6Sorter5qscmpEPcS0_' filepath='libnurbs/internals/sorter.cc' line='56' column='1' visibility='default' binding='global' size-in-bits='64' hash='c4d8735456ba2786'>
          <!-- implicit parameter of type 'Sorter*' -->
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- int -->
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='3'>
        <!-- void Sorter::qsexc(char*, char*) -->
        <function-decl name='qsexc' mangled-name='_ZN6Sorter5qsexcEPcS0_' filepath='libnurbs/internals/sorter.cc' line='64' column='1' visibility='default' binding='global' size-in-bits='64' hash='6faa8831d3af3ad4'>
          <!-- implicit parameter of type 'Sorter*' -->
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <!-- void Sorter::qstexc(char*, char*, char*) -->
        <function-decl name='qstexc' mangled-name='_ZN6Sorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/sorter.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64' hash='9895045035709c6f'>
          <!-- implicit parameter of type 'Sorter*' -->
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-159'/>
          <!-- void -->
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class Backend -->
    <class-decl name='Backend' visibility='default' size-in-bits='640' filepath='libnurbs/internals/backend.h' line='46' column='1' hash='291169213eae5d36' id='type-id-114'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- BasicCurveEvaluator& Backend::curveEvaluator -->
        <var-decl name='curveEvaluator' type-id='type-id-235' visibility='default' filepath='libnurbs/internals/backend.h' line='48' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- BasicSurfaceEvaluator& Backend::surfaceEvaluator -->
        <var-decl name='surfaceEvaluator' type-id='type-id-236' visibility='default' filepath='libnurbs/internals/backend.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- int Backend::wireframetris -->
        <var-decl name='wireframetris' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/backend.h' line='105' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <!-- int Backend::wireframequads -->
        <var-decl name='wireframequads' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/backend.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <!-- int Backend::npts -->
        <var-decl name='npts' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/backend.h' line='107' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <!-- REAL Backend::mesh[3][4] -->
        <var-decl name='mesh' type-id='type-id-237' visibility='default' filepath='libnurbs/internals/backend.h' line='108' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='608'>
        <!-- int Backend::meshindex -->
        <var-decl name='meshindex' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/backend.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <!-- class Curvelist -->
    <class-decl name='Curvelist' visibility='default' size-in-bits='256' filepath='libnurbs/internals/curvelist.h' line='47' column='1' hash='de324befef678d0d' id='type-id-220'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Curve* Curvelist::curve -->
        <var-decl name='curve' type-id='type-id-238' visibility='default' filepath='libnurbs/internals/curvelist.h' line='57' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- float Curvelist::range[3] -->
        <var-decl name='range' type-id='type-id-239' visibility='default' filepath='libnurbs/internals/curvelist.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <!-- int Curvelist::needsSubdivision -->
        <var-decl name='needsSubdivision' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/curvelist.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <!-- float Curvelist::stepsize -->
        <var-decl name='stepsize' type-id='type-id-2' visibility='default' filepath='libnurbs/internals/curvelist.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <!-- class Patchlist -->
    <class-decl name='Patchlist' visibility='default' size-in-bits='640' filepath='libnurbs/internals/patchlist.h' line='45' column='1' hash='f1007cf4aca570c8' id='type-id-223'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Patch* Patchlist::patch -->
        <var-decl name='patch' type-id='type-id-240' visibility='default' filepath='libnurbs/internals/patchlist.h' line='63' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- int Patchlist::notInBbox -->
        <var-decl name='notInBbox' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/patchlist.h' line='64' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <!-- int Patchlist::needsSampling -->
        <var-decl name='needsSampling' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/patchlist.h' line='65' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- Pspec Patchlist::pspec[2] -->
        <var-decl name='pspec' type-id='type-id-241' visibility='default' filepath='libnurbs/internals/patchlist.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct Quilt -->
    <class-decl name='Quilt' is-struct='yes' visibility='default' size-in-bits='896' filepath='libnurbs/internals/quilt.h' line='64' column='1' hash='d7e35441ed9bce86#2' id='type-id-225'>
      <!-- class PooledObj -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Mapdesc* Quilt::mapdesc -->
        <var-decl name='mapdesc' type-id='type-id-184' visibility='default' filepath='libnurbs/internals/quilt.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- REAL* Quilt::cpts -->
        <var-decl name='cpts' type-id='type-id-34' visibility='default' filepath='libnurbs/internals/quilt.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- Quiltspec Quilt::qspec[2] -->
        <var-decl name='qspec' type-id='type-id-242' visibility='default' filepath='libnurbs/internals/quilt.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- Quiltspec_ptr Quilt::eqspec -->
        <var-decl name='eqspec' type-id='type-id-243' visibility='default' filepath='libnurbs/internals/quilt.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- Quilt* Quilt::next -->
        <var-decl name='next' type-id='type-id-207' visibility='default' filepath='libnurbs/internals/quilt.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct Renderhints -->
    <class-decl name='Renderhints' is-struct='yes' visibility='default' size-in-bits='256' filepath='libnurbs/internals/renderhints.h' line='41' column='1' hash='cea3038128ac762e#2' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- REAL Renderhints::display_method -->
        <var-decl name='display_method' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/renderhints.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- REAL Renderhints::errorchecking -->
        <var-decl name='errorchecking' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/renderhints.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- REAL Renderhints::subdivisions -->
        <var-decl name='subdivisions' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/renderhints.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- REAL Renderhints::tmp1 -->
        <var-decl name='tmp1' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/renderhints.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int Renderhints::displaydomain -->
        <var-decl name='displaydomain' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/renderhints.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int Renderhints::maxsubdivisions -->
        <var-decl name='maxsubdivisions' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/renderhints.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int Renderhints::wiretris -->
        <var-decl name='wiretris' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/renderhints.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- int Renderhints::wirequads -->
        <var-decl name='wirequads' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/renderhints.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <!-- int (ArcSdirSorter::*) (char*, char*) -->
    <function-type method-class-id='type-id-189' size-in-bits='64' hash='c4d8735456ba2786' id='type-id-244'>
      <!-- implicit parameter of type 'ArcSdirSorter*' -->
      <parameter type-id='type-id-191' is-artificial='yes'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- int -->
      <return type-id='type-id-3'/>
    </function-type>
    <!-- int (ArcSorter::*) (char*, char*) -->
    <function-type method-class-id='type-id-190' size-in-bits='64' hash='c4d8735456ba2786' id='type-id-245'>
      <!-- implicit parameter of type 'ArcSorter*' -->
      <parameter type-id='type-id-194' is-artificial='yes'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- int -->
      <return type-id='type-id-3'/>
    </function-type>
    <!-- int (ArcTdirSorter::*) (char*, char*) -->
    <function-type method-class-id='type-id-195' size-in-bits='64' hash='c4d8735456ba2786' id='type-id-246'>
      <!-- implicit parameter of type 'ArcTdirSorter*' -->
      <parameter type-id='type-id-196' is-artificial='yes'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- int -->
      <return type-id='type-id-3'/>
    </function-type>
    <!-- int (FlistSorter::*) (char*, char*) -->
    <function-type method-class-id='type-id-202' size-in-bits='64' hash='c4d8735456ba2786' id='type-id-247'>
      <!-- implicit parameter of type 'FlistSorter*' -->
      <parameter type-id='type-id-232' is-artificial='yes'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- int -->
      <return type-id='type-id-3'/>
    </function-type>
    <!-- int (Sorter::*) (char*, char*) -->
    <function-type method-class-id='type-id-192' size-in-bits='64' hash='c4d8735456ba2786' id='type-id-248'>
      <!-- implicit parameter of type 'Sorter*' -->
      <parameter type-id='type-id-226' is-artificial='yes'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- int -->
      <return type-id='type-id-3'/>
    </function-type>
    <!-- void (ArcSorter::*) (char*, char*) -->
    <function-type method-class-id='type-id-190' size-in-bits='64' hash='6faa8831d3af3ad4' id='type-id-249'>
      <!-- implicit parameter of type 'ArcSorter*' -->
      <parameter type-id='type-id-194' is-artificial='yes'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (ArcSorter::*) (char*, char*, char*) -->
    <function-type method-class-id='type-id-190' size-in-bits='64' hash='9895045035709c6f' id='type-id-250'>
      <!-- implicit parameter of type 'ArcSorter*' -->
      <parameter type-id='type-id-194' is-artificial='yes'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (FlistSorter::*) (char*, char*) -->
    <function-type method-class-id='type-id-202' size-in-bits='64' hash='6faa8831d3af3ad4' id='type-id-251'>
      <!-- implicit parameter of type 'FlistSorter*' -->
      <parameter type-id='type-id-232' is-artificial='yes'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (FlistSorter::*) (char*, char*, char*) -->
    <function-type method-class-id='type-id-202' size-in-bits='64' hash='9895045035709c6f' id='type-id-252'>
      <!-- implicit parameter of type 'FlistSorter*' -->
      <parameter type-id='type-id-232' is-artificial='yes'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (Sorter::*) (char*, char*) -->
    <function-type method-class-id='type-id-192' size-in-bits='64' hash='6faa8831d3af3ad4' id='type-id-253'>
      <!-- implicit parameter of type 'Sorter*' -->
      <parameter type-id='type-id-226' is-artificial='yes'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
    <!-- void (Sorter::*) (char*, char*, char*) -->
    <function-type method-class-id='type-id-192' size-in-bits='64' hash='9895045035709c6f' id='type-id-254'>
      <!-- implicit parameter of type 'Sorter*' -->
      <parameter type-id='type-id-226' is-artificial='yes'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-159'/>
      <!-- void -->
      <return type-id='type-id-32'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arctess.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- REAL[][24][24] -->
    <array-type-def dimensions='3' type-id='type-id-15' size-in-bits='unknown' hash='e76496ec7939223d' id='type-id-198'>
      <!-- <anonymous range>[] -->
      <subrange length='unknown' lower-bound='0' upper-bound='0' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-255'/>
      <!-- <anonymous range>[24] -->
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='e7b8d3aa178b54e4' id='type-id-256'/>
      <!-- <anonymous range>[24] -->
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='e7b8d3aa178b54e4' id='type-id-256'/>
    </array-type-def>
    <!-- ArcTessellator* const -->
    <qualified-type-def type-id='type-id-217' const='yes' hash='210778ca2e0f5b63' id='type-id-257'/>
    <!-- Mapdesc* -->
    <pointer-type-def type-id='type-id-258' size-in-bits='64' hash='03638f3000f2014f#2' id='type-id-184'/>
    <!-- Pool* const -->
    <qualified-type-def type-id='type-id-181' const='yes' hash='c8cfb5c78016b51a' id='type-id-259'/>
    <!-- PwlArc* const -->
    <qualified-type-def type-id='type-id-173' const='yes' hash='a6ba35a4449d6d01' id='type-id-260'/>
    <!-- struct Mapdesc -->
    <class-decl name='Mapdesc' is-struct='yes' visibility='default' size-in-bits='3392' filepath='libnurbs/internals/mapdesc.h' line='49' column='1' hash='fc4ab9039f5be164#2' id='type-id-258'>
      <!-- class PooledObj -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- REAL Mapdesc::pixel_tolerance -->
        <var-decl name='pixel_tolerance' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- REAL Mapdesc::error_tolerance -->
        <var-decl name='error_tolerance' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- REAL Mapdesc::object_space_error_tolerance -->
        <var-decl name='object_space_error_tolerance' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- REAL Mapdesc::clampfactor -->
        <var-decl name='clampfactor' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- REAL Mapdesc::minsavings -->
        <var-decl name='minsavings' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- REAL Mapdesc::maxrate -->
        <var-decl name='maxrate' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- REAL Mapdesc::maxsrate -->
        <var-decl name='maxsrate' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- REAL Mapdesc::maxtrate -->
        <var-decl name='maxtrate' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- REAL Mapdesc::bboxsize[5] -->
        <var-decl name='bboxsize' type-id='type-id-261' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <!-- long int Mapdesc::type -->
        <var-decl name='type' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <!-- int Mapdesc::isrational -->
        <var-decl name='isrational' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='544'>
        <!-- int Mapdesc::ncoords -->
        <var-decl name='ncoords' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='117' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <!-- int Mapdesc::hcoords -->
        <var-decl name='hcoords' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='118' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='608'>
        <!-- int Mapdesc::inhcoords -->
        <var-decl name='inhcoords' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='119' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <!-- int Mapdesc::mask -->
        <var-decl name='mask' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='120' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='672'>
        <!-- Maxmatrix Mapdesc::bmat -->
        <var-decl name='bmat' type-id='type-id-262' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <!-- Maxmatrix Mapdesc::cmat -->
        <var-decl name='cmat' type-id='type-id-262' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='122' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2272'>
        <!-- Maxmatrix Mapdesc::smat -->
        <var-decl name='smat' type-id='type-id-262' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='123' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3072'>
        <!-- REAL Mapdesc::s_steps -->
        <var-decl name='s_steps' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='124' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3104'>
        <!-- REAL Mapdesc::t_steps -->
        <var-decl name='t_steps' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='125' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3136'>
        <!-- REAL Mapdesc::sampling_method -->
        <var-decl name='sampling_method' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='126' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3168'>
        <!-- REAL Mapdesc::culling_method -->
        <var-decl name='culling_method' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='127' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3200'>
        <!-- REAL Mapdesc::bbox_subdividing -->
        <var-decl name='bbox_subdividing' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3264'>
        <!-- Mapdesc* Mapdesc::next -->
        <var-decl name='next' type-id='type-id-184' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3328'>
        <!-- Backend& Mapdesc::backend -->
        <var-decl name='backend' type-id='type-id-206' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='130' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/backend.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- REAL[3][4] -->
    <array-type-def dimensions='2' type-id='type-id-15' size-in-bits='384' hash='afb9d7011d6c1248' id='type-id-237'>
      <!-- <anonymous range>[3] -->
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-134'/>
      <!-- <anonymous range>[4] -->
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-110'/>
    </array-type-def>
    <!-- class GridTrimVertex -->
    <class-decl name='GridTrimVertex' visibility='default' size-in-bits='384' filepath='libnurbs/internals/gridtrimvertex.h' line='45' column='1' hash='16d695ecc5d006e8' id='type-id-263'>
      <!-- class PooledObj -->
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- TrimVertex GridTrimVertex::dummyt -->
        <var-decl name='dummyt' type-id='type-id-264' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- GridVertex GridTrimVertex::dummyg -->
        <var-decl name='dummyg' type-id='type-id-265' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='48' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <!-- TrimVertex* GridTrimVertex::t -->
        <var-decl name='t' type-id='type-id-266' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <!-- GridVertex* GridTrimVertex::g -->
        <var-decl name='g' type-id='type-id-267' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <!-- class TrimVertex -->
    <class-decl name='TrimVertex' visibility='default' size-in-bits='128' filepath='libnurbs/internals/trimvertex.h' line='43' column='1' hash='c48342ca8a15d373' id='type-id-264'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- REAL TrimVertex::param[2] -->
        <var-decl name='param' type-id='type-id-132' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- long int TrimVertex::nuid -->
        <var-decl name='nuid' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct GridVertex -->
    <class-decl name='GridVertex' is-struct='yes' visibility='default' size-in-bits='128' filepath='libnurbs/internals/gridvertex.h' line='39' column='1' hash='75bd81e6b709a8fc' id='type-id-265'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- long int GridVertex::gparam[2] -->
        <var-decl name='gparam' type-id='type-id-138' visibility='default' filepath='libnurbs/internals/gridvertex.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <!-- Backend* -->
    <pointer-type-def type-id='type-id-114' size-in-bits='64' hash='3d13b03f14cff06a' id='type-id-268'/>
    <!-- Backend* const -->
    <qualified-type-def type-id='type-id-268' const='yes' hash='3e5f9aa6c8adf93c' id='type-id-269'/>
    <!-- BasicCurveEvaluator& -->
    <reference-type-def kind='lvalue' type-id='type-id-22' size-in-bits='64' hash='646bc7330120c357' id='type-id-235'/>
    <!-- BasicSurfaceEvaluator& -->
    <reference-type-def kind='lvalue' type-id='type-id-85' size-in-bits='64' hash='9769dc3ef09d2dfb' id='type-id-236'/>
    <!-- GridTrimVertex* -->
    <pointer-type-def type-id='type-id-263' size-in-bits='64' hash='69f5480fce10c1f1' id='type-id-270'/>
    <!-- GridTrimVertex* const -->
    <qualified-type-def type-id='type-id-270' const='yes' hash='4cfac5020b98363e' id='type-id-271'/>
    <!-- GridVertex* -->
    <pointer-type-def type-id='type-id-265' size-in-bits='64' hash='0cd4a41bc60dd063' id='type-id-267'/>
    <!-- TrimVertex* -->
    <pointer-type-def type-id='type-id-264' size-in-bits='64' hash='ff6cddff133e642c' id='type-id-266'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/basiccrveval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- BasicCurveEvaluator* -->
    <pointer-type-def type-id='type-id-22' size-in-bits='64' hash='e50390d871b09e56' id='type-id-51'/>
    <!-- BasicCurveEvaluator* const -->
    <qualified-type-def type-id='type-id-51' const='yes' hash='9316c4e4919e6cf1' id='type-id-272'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/basicsurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- BasicSurfaceEvaluator* -->
    <pointer-type-def type-id='type-id-85' size-in-bits='64' hash='3e1877a24326b79b' id='type-id-145'/>
    <!-- BasicSurfaceEvaluator* const -->
    <qualified-type-def type-id='type-id-145' const='yes' hash='a286e5fd6e4325bc' id='type-id-273'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/bin.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- Bin* const -->
    <qualified-type-def type-id='type-id-219' const='yes' hash='27aa61e0bd28d68c' id='type-id-274'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/bufpool.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/cachingeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/ccw.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- Subdivider* const -->
    <qualified-type-def type-id='type-id-228' const='yes' hash='d6b267934edb6333' id='type-id-275'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/coveandtiler.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- class CoveAndTiler -->
    <class-decl name='CoveAndTiler' visibility='default' size-in-bits='2688' filepath='libnurbs/internals/coveandtiler.h' line='46' column='1' hash='4f1df80d680fd431' id='type-id-233'>
      <!-- class TrimRegion -->
      <base-class access='public' layout-offset-in-bits='192' is-virtual='yes' type-id='type-id-276'/>
      <data-member access='public' static='yes'>
        <!-- static const int CoveAndTiler::MAXSTRIPSIZE -->
        <var-decl name='MAXSTRIPSIZE' type-id='type-id-43' mangled-name='_ZN12CoveAndTiler12MAXSTRIPSIZEE' visibility='default' filepath='libnurbs/internals/coveandtiler.cc' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- Backend& CoveAndTiler::backend -->
        <var-decl name='backend' type-id='type-id-206' visibility='default' filepath='libnurbs/internals/coveandtiler.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <!-- class Jarcloc -->
    <class-decl name='Jarcloc' visibility='default' size-in-bits='192' filepath='libnurbs/internals/jarcloc.h' line='41' column='1' hash='0eb1c79a74ee08df' id='type-id-277'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Arc_ptr Jarcloc::arc -->
        <var-decl name='arc' type-id='type-id-171' visibility='default' filepath='libnurbs/internals/jarcloc.h' line='43' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- TrimVertex* Jarcloc::p -->
        <var-decl name='p' type-id='type-id-266' visibility='default' filepath='libnurbs/internals/jarcloc.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- TrimVertex* Jarcloc::plast -->
        <var-decl name='plast' type-id='type-id-266' visibility='default' filepath='libnurbs/internals/jarcloc.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <!-- class TrimRegion -->
    <class-decl name='TrimRegion' visibility='default' size-in-bits='2560' filepath='libnurbs/internals/trimregion.h' line='46' column='1' hash='422b68d80547409e' id='type-id-276'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Trimline TrimRegion::left -->
        <var-decl name='left' type-id='type-id-278' visibility='default' filepath='libnurbs/internals/trimregion.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='832'>
        <!-- Trimline TrimRegion::right -->
        <var-decl name='right' type-id='type-id-278' visibility='default' filepath='libnurbs/internals/trimregion.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <!-- Gridline TrimRegion::top -->
        <var-decl name='top' type-id='type-id-279' visibility='default' filepath='libnurbs/internals/trimregion.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1984'>
        <!-- Gridline TrimRegion::bot -->
        <var-decl name='bot' type-id='type-id-279' visibility='default' filepath='libnurbs/internals/trimregion.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2304'>
        <!-- Uarray TrimRegion::uarray -->
        <var-decl name='uarray' type-id='type-id-280' visibility='default' filepath='libnurbs/internals/trimregion.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2496'>
        <!-- REAL TrimRegion::oneOverDu -->
        <var-decl name='oneOverDu' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/trimregion.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <!-- class Trimline -->
    <class-decl name='Trimline' visibility='default' size-in-bits='832' filepath='libnurbs/internals/trimline.h' line='46' column='1' hash='b6e3a9af3841f11a' id='type-id-278'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- TrimVertex** Trimline::pts -->
        <var-decl name='pts' type-id='type-id-281' visibility='default' filepath='libnurbs/internals/trimline.h' line='48' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- long int Trimline::numverts -->
        <var-decl name='numverts' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/trimline.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- long int Trimline::i -->
        <var-decl name='i' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/trimline.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <!-- long int Trimline::size -->
        <var-decl name='size' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/trimline.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <!-- Jarcloc Trimline::jarcl -->
        <var-decl name='jarcl' type-id='type-id-277' visibility='default' filepath='libnurbs/internals/trimline.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <!-- TrimVertex Trimline::t -->
        <var-decl name='t' type-id='type-id-264' visibility='default' filepath='libnurbs/internals/trimline.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <!-- TrimVertex Trimline::b -->
        <var-decl name='b' type-id='type-id-264' visibility='default' filepath='libnurbs/internals/trimline.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <!-- TrimVertex* Trimline::tinterp -->
        <var-decl name='tinterp' type-id='type-id-266' visibility='default' filepath='libnurbs/internals/trimline.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <!-- TrimVertex* Trimline::binterp -->
        <var-decl name='binterp' type-id='type-id-266' visibility='default' filepath='libnurbs/internals/trimline.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <!-- class Uarray -->
    <class-decl name='Uarray' visibility='default' size-in-bits='192' filepath='libnurbs/internals/uarray.h' line='44' column='1' hash='61fe088e9976fa38' id='type-id-280'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- long int Uarray::size -->
        <var-decl name='size' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/uarray.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- long int Uarray::ulines -->
        <var-decl name='ulines' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/uarray.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- REAL* Uarray::uarray -->
        <var-decl name='uarray' type-id='type-id-34' visibility='default' filepath='libnurbs/internals/uarray.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct Gridline -->
    <class-decl name='Gridline' is-struct='yes' visibility='default' size-in-bits='320' filepath='libnurbs/internals/gridline.h' line='39' column='1' hash='67020be818a3d99b' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- long int Gridline::v -->
        <var-decl name='v' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/gridline.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- REAL Gridline::vval -->
        <var-decl name='vval' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/gridline.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- long int Gridline::vindex -->
        <var-decl name='vindex' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/gridline.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- long int Gridline::ustart -->
        <var-decl name='ustart' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/gridline.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- long int Gridline::uend -->
        <var-decl name='uend' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/gridline.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <!-- CoveAndTiler* -->
    <pointer-type-def type-id='type-id-233' size-in-bits='64' hash='43a83375c36f045a' id='type-id-282'/>
    <!-- CoveAndTiler* const -->
    <qualified-type-def type-id='type-id-282' const='yes' hash='571b72d7552ab9b1' id='type-id-283'/>
    <!-- GridTrimVertex& -->
    <reference-type-def kind='lvalue' type-id='type-id-263' size-in-bits='64' hash='454cd70a67ed3172' id='type-id-284'/>
    <!-- GridVertex& -->
    <reference-type-def kind='lvalue' type-id='type-id-265' size-in-bits='64' hash='708958d555016dd0' id='type-id-285'/>
    <!-- GridVertex* const -->
    <qualified-type-def type-id='type-id-267' const='yes' hash='22c895ea93c41451' id='type-id-286'/>
    <!-- Jarcloc* -->
    <pointer-type-def type-id='type-id-277' size-in-bits='64' hash='66ab13957b849a9e' id='type-id-287'/>
    <!-- TrimRegion* -->
    <pointer-type-def type-id='type-id-276' size-in-bits='64' hash='8d45282821c8ddc4' id='type-id-288'/>
    <!-- TrimVertex** -->
    <pointer-type-def type-id='type-id-266' size-in-bits='64' hash='964a41fa3f251240' id='type-id-281'/>
    <!-- Trimline* -->
    <pointer-type-def type-id='type-id-278' size-in-bits='64' hash='7aa8a89fec61bd0a' id='type-id-289'/>
    <!-- Trimline* const -->
    <qualified-type-def type-id='type-id-289' const='yes' hash='18260f538ce83fdb' id='type-id-290'/>
    <!-- Uarray* -->
    <pointer-type-def type-id='type-id-280' size-in-bits='64' hash='26bb112677d1205a' id='type-id-291'/>
    <!-- void** const -->
    <qualified-type-def type-id='type-id-292' const='yes' hash='52c4b44d191c43e5' id='type-id-293'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/curve.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <!-- Quiltspec[2] -->
    <array-type-def dimensions='1' type-id='type-id-294' size-in-bits='640' hash='6744a540e8dd783a' id='type-id-242'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-131'/>
    </array-type-def>
    <!-- REAL[120] -->
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='3840' hash='c42532f87de6f864' id='type-id-295'>
      <!-- <anonymous range>[120] -->
      <subrange length='120' lower-bound='0' upper-bound='119' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='c13a015dfac3e71d' id='type-id-296'/>
    </array-type-def>
    <!-- REAL[5] -->
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='160' hash='8ec6aa0cab893377' id='type-id-261'>
      <!-- <anonymous range>[5] -->
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='type-id-297'/>
    </array-type-def>
    <!-- REAL[5][5] -->
    <array-type-def dimensions='2' type-id='type-id-15' size-in-bits='800' hash='ed8021aa46eaf1df' id='type-id-298'>
      <!-- <anonymous range>[5] -->
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='type-id-297'/>
      <!-- <anonymous range>[5] -->
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='type-id-297'/>
    </array-type-def>
    <!-- class Curve -->
    <class-decl name='Curve' visibility='default' size-in-bits='8128' filepath='libnurbs/internals/curve.h' line='46' column='1' hash='3399d7cc6a3a38ac' id='type-id-299'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- Curve* Curve::next -->
        <var-decl name='next' type-id='type-id-300' visibility='default' filepath='libnurbs/internals/curve.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- Mapdesc* Curve::mapdesc -->
        <var-decl name='mapdesc' type-id='type-id-184' visibility='default' filepath='libnurbs/internals/curve.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- int Curve::stride -->
        <var-decl name='stride' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/curve.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <!-- int Curve::order -->
        <var-decl name='order' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/curve.h' line='55' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <!-- int Curve::cullval -->
        <var-decl name='cullval' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/curve.h' line='56' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <!-- int Curve::needsSampling -->
        <var-decl name='needsSampling' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/curve.h' line='57' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <!-- REAL Curve::cpts[120] -->
        <var-decl name='cpts' type-id='type-id-295' visibility='default' filepath='libnurbs/internals/curve.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4096'>
        <!-- REAL Curve::spts[120] -->
        <var-decl name='spts' type-id='type-id-295' visibility='default' filepath='libnurbs/internals/curve.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7936'>
        <!-- REAL Curve::stepsize -->
        <var-decl name='stepsize' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/curve.h' line='60' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7968'>
        <!-- REAL Curve::minstepsize -->
        <var-decl name='minstepsize' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/curve.h' line='61' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8000'>
        <!-- REAL Curve::range[3] -->
        <var-decl name='range' type-id='type-id-133' visibility='default' filepath='libnurbs/internals/curve.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <!-- float[4] -->
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='128' hash='b3db84c58df322c1' id='type-id-301'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-110'/>
    </array-type-def>
    <!-- int[2] -->
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='64' hash='8198620b8b558cae' id='type-id-302'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-131'/>
    </array-type-def>
    <!-- struct Quiltspec -->
    <class-decl name='Quiltspec' is-struct='yes' visibility='default' size-in-bits='320' filepath='libnurbs/internals/quilt.h' line='51' column='1' hash='f6d49659f6f074b6' id='type-id-294'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int Quiltspec::stride -->
        <var-decl name='stride' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/quilt.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- int Quiltspec::width -->
        <var-decl name='width' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/quilt.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int Quiltspec::offset -->
        <var-decl name='offset' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/quilt.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- int Quiltspec::order -->
        <var-decl name='order' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/quilt.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int Quiltspec::index -->
        <var-decl name='index' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/quilt.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int Quiltspec::bdry[2] -->
        <var-decl name='bdry' type-id='type-id-302' visibility='default' filepath='libnurbs/internals/quilt.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- REAL Quiltspec::step_size -->
        <var-decl name='step_size' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/quilt.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- Knot* Quiltspec::breakpoints -->
        <var-decl name='breakpoints' type-id='type-id-303' visibility='default' filepath='libnurbs/internals/quilt.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef REAL Knot -->
    <typedef-decl name='Knot' type-id='type-id-15' size-in-bits='32' filepath='libnurbs/internals/types.h' line='45' column='1' hash='d7ec3bf03d3c5690' id='type-id-304'/>
    <!-- typedef REAL[5][5] Maxmatrix -->
    <typedef-decl name='Maxmatrix' type-id='type-id-298' size-in-bits='800' filepath='libnurbs/internals/mapdesc.h' line='45' column='1' hash='ed8021aa46eaf1df' id='type-id-262'/>
    <!-- typedef Quilt* Quilt_ptr -->
    <typedef-decl name='Quilt_ptr' type-id='type-id-207' size-in-bits='64' filepath='libnurbs/internals/quilt.h' line='90' column='1' hash='37bd09d8ed3141bd#2' id='type-id-305'/>
    <!-- typedef Quiltspec* Quiltspec_ptr -->
    <typedef-decl name='Quiltspec_ptr' type-id='type-id-306' size-in-bits='64' filepath='libnurbs/internals/quilt.h' line='62' column='1' hash='654081573a898bb4' id='type-id-243'/>
    <!-- Curve& -->
    <reference-type-def kind='lvalue' type-id='type-id-299' size-in-bits='64' hash='4adf16ffce66e572' id='type-id-307'/>
    <!-- Curve* -->
    <pointer-type-def type-id='type-id-299' size-in-bits='64' hash='424f37f9dde4d90f' id='type-id-300'/>
    <!-- Curve* const -->
    <qualified-type-def type-id='type-id-300' const='yes' hash='b73ac08c78f4e8d8' id='type-id-308'/>
    <!-- Flist& -->
    <reference-type-def kind='lvalue' type-id='type-id-201' size-in-bits='64' hash='a261777afdcc774b' id='type-id-309'/>
    <!-- Knot* -->
    <pointer-type-def type-id='type-id-304' size-in-bits='64' hash='26236de9c59bd1bd' id='type-id-303'/>
    <!-- Knotvector& -->
    <reference-type-def kind='lvalue' type-id='type-id-310' size-in-bits='64' hash='cdd6ae6ed0360485' id='type-id-311'/>
    <!-- Mapdesc* const -->
    <qualified-type-def type-id='type-id-184' const='yes' hash='1c52f06814e3760c#2' id='type-id-312'/>
    <!-- Quiltspec* -->
