<abi-corpus version='2.4' soname='libharfbuzz.so.0'>
  <elf-needed>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libfreetype.so.6'/>
    <dependency name='libpng16.so.16'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='librt.so.1'/>
    <dependency name='libbz2.so.1'/>
    <dependency name='libz.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- _fini -->
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- _init -->
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_blob_create -->
    <elf-symbol name='hb_blob_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_blob_create_sub_blob -->
    <elf-symbol name='hb_blob_create_sub_blob' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_blob_destroy -->
    <elf-symbol name='hb_blob_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_blob_get_data -->
    <elf-symbol name='hb_blob_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_blob_get_data_writable -->

    <!-- hb_unicode_funcs_get_parent -->
    <elf-symbol name='hb_unicode_funcs_get_parent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_get_user_data -->
    <elf-symbol name='hb_unicode_funcs_get_user_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_is_immutable -->
    <elf-symbol name='hb_unicode_funcs_is_immutable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_make_immutable -->
    <elf-symbol name='hb_unicode_funcs_make_immutable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_reference -->
    <elf-symbol name='hb_unicode_funcs_reference' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_combining_class_func -->
    <elf-symbol name='hb_unicode_funcs_set_combining_class_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_compose_func -->
    <elf-symbol name='hb_unicode_funcs_set_compose_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_decompose_compatibility_func -->
    <elf-symbol name='hb_unicode_funcs_set_decompose_compatibility_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_decompose_func -->
    <elf-symbol name='hb_unicode_funcs_set_decompose_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_eastasian_width_func -->
    <elf-symbol name='hb_unicode_funcs_set_eastasian_width_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_general_category_func -->
    <elf-symbol name='hb_unicode_funcs_set_general_category_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_mirroring_func -->
    <elf-symbol name='hb_unicode_funcs_set_mirroring_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_script_func -->
    <elf-symbol name='hb_unicode_funcs_set_script_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_funcs_set_user_data -->
    <elf-symbol name='hb_unicode_funcs_set_user_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_general_category -->
    <elf-symbol name='hb_unicode_general_category' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_mirroring -->
    <elf-symbol name='hb_unicode_mirroring' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_unicode_script -->
    <elf-symbol name='hb_unicode_script' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_version -->
    <elf-symbol name='hb_version' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_version_atleast -->
    <elf-symbol name='hb_version_atleast' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- hb_version_string -->
    <elf-symbol name='hb_version_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='hb-blob.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- bool -->
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='type-id-1'/>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-2'/>
    <!-- char[40] -->
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='320' hash='e7f9696e246a3049' id='type-id-3'>
      <!-- <anonymous range>[40] -->
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='type-id-5'/>
    </array-type-def>
    <!-- enum hb_memory_mode_t -->
    <enum-decl name='hb_memory_mode_t' size-in-bits='32' alignment-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.h' line='58' column='1' hash='2e360cabbd23f841' id='type-id-6'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_MEMORY_MODE_DUPLICATE' value='0'/>
      <enumerator name='HB_MEMORY_MODE_READONLY' value='1'/>
      <enumerator name='HB_MEMORY_MODE_WRITABLE' value='2'/>
      <enumerator name='HB_MEMORY_MODE_READONLY_MAY_MAKE_WRITABLE' value='3'/>
    </enum-decl>
    <!-- hb_user_data_array_t::hb_user_data_item_t[2] -->
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='384' hash='5ab74755e46ef99c' id='type-id-9'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-10'/>
    </array-type-def>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-11'/>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-12'/>
    <!-- struct __pthread_internal_list -->
    <class-decl name='__pthread_internal_list' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/pthreadtypes.h' line='62' column='1' hash='5bcfb7f1ab39fa47' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __pthread_internal_list* __pthread_internal_list::__prev -->
        <var-decl name='__prev' type-id='type-id-14' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- __pthread_internal_list* __pthread_internal_list::__next -->
        <var-decl name='__next' type-id='type-id-14' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_blob_t -->
    <class-decl name='hb_blob_t' is-struct='yes' visibility='default' size-in-bits='1216' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='53' column='1' hash='2de9bdd27c4a504b' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_blob_t::header -->
        <var-decl name='header' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- bool hb_blob_t::immutable -->
        <var-decl name='immutable' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- const char* hb_blob_t::data -->
        <var-decl name='data' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- unsigned int hb_blob_t::length -->
        <var-decl name='length' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <!-- hb_memory_mode_t hb_blob_t::mode -->
        <var-decl name='mode' type-id='type-id-6' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- void* hb_blob_t::user_data -->
        <var-decl name='user_data' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- hb_destroy_func_t hb_blob_t::destroy -->
        <var-decl name='destroy' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='64' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t> -->
    <class-decl name='hb_lockable_set_t&lt;hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t&gt;' is-struct='yes' visibility='default' size-in-bits='512' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='449' column='1' hash='7cec7e205b9dc476' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u> hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>::items -->
        <var-decl name='items' type-id='type-id-22' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='450' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_mutex_t -->
    <class-decl name='hb_mutex_t' is-struct='yes' visibility='default' size-in-bits='320' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='117' column='1' hash='7e13e7d439db312c' id='type-id-23'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_mutex_impl_t hb_mutex_t::m -->
        <var-decl name='m' type-id='type-id-24' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='120' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_object_header_t -->
    <class-decl name='hb_object_header_t' is-struct='yes' visibility='default' size-in-bits='896' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='101' column='1' hash='7a3c0823d886fb49' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_reference_count_t hb_object_header_t::ref_count -->
        <var-decl name='ref_count' type-id='type-id-25' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_user_data_array_t hb_object_header_t::user_data -->
        <var-decl name='user_data' type-id='type-id-26' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='103' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u> -->
    <class-decl name='hb_prealloced_array_t&lt;hb_user_data_array_t::hb_user_data_item_t, 2u&gt;' is-struct='yes' visibility='default' size-in-bits='512' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='329' column='1' hash='d0ea85a50386720c' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::len -->
        <var-decl name='len' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::allocated -->
        <var-decl name='allocated' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_user_data_array_t::hb_user_data_item_t* hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::array -->
        <var-decl name='array' type-id='type-id-27' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- hb_user_data_array_t::hb_user_data_item_t hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>::static_array[2] -->
        <var-decl name='static_array' type-id='type-id-9' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='333' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_reference_count_t -->
    <class-decl name='hb_reference_count_t' is-struct='yes' visibility='default' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='53' column='1' hash='7cc5b2f3c614b115' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_atomic_int_t hb_reference_count_t::ref_count -->
        <var-decl name='ref_count' type-id='type-id-28' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='54' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_user_data_array_t -->
    <class-decl name='hb_user_data_array_t' is-struct='yes' visibility='default' size-in-bits='832' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='70' column='1' hash='bddbeb41885c64a1' id='type-id-26'>
      <member-type access='public'>
        <!-- struct hb_user_data_array_t::hb_user_data_item_t -->
        <class-decl name='hb_user_data_item_t' is-struct='yes' visibility='default' size-in-bits='192' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='71' column='1' hash='ce192cee24bc153f' id='type-id-8'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_user_data_key_t* hb_user_data_array_t::hb_user_data_item_t::key -->
            <var-decl name='key' type-id='type-id-29' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='72' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- void* hb_user_data_array_t::hb_user_data_item_t::data -->
            <var-decl name='data' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='73' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_destroy_func_t hb_user_data_array_t::hb_user_data_item_t::destroy -->
            <var-decl name='destroy' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='74' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_mutex_t hb_user_data_array_t::lock -->
        <var-decl name='lock' type-id='type-id-23' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t> hb_user_data_array_t::items -->
        <var-decl name='items' type-id='type-id-21' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-object-private.hh' line='83' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_user_data_key_t -->
    <class-decl name='hb_user_data_key_t' is-struct='yes' visibility='default' size-in-bits='8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='334' column='1' hash='620a81a53f0dd4d1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- char hb_user_data_key_t::unused -->
        <var-decl name='unused' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __pthread_internal_list __pthread_list_t -->
    <typedef-decl name='__pthread_list_t' type-id='type-id-13' size-in-bits='128' filepath='/usr/include/bits/pthreadtypes.h' line='65' column='1' id='type-id-31'/>
    <!-- typedef int hb_atomic_int_t -->
    <typedef-decl name='hb_atomic_int_t' type-id='type-id-11' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-atomic-private.hh' line='94' column='1' hash='09d17c08f594edc7' id='type-id-28'/>
    <!-- typedef hb_blob_t hb_blob_t -->
    <typedef-decl name='hb_blob_t' type-id='type-id-15' size-in-bits='1216' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.h' line='65' column='1' id='type-id-32'/>
    <!-- typedef int hb_bool_t -->
    <typedef-decl name='hb_bool_t' type-id='type-id-11' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='73' column='1' hash='09d17c08f594edc7' id='type-id-33'/>
    <!-- typedef void (*)(void*) hb_destroy_func_t -->
    <typedef-decl name='hb_destroy_func_t' type-id='type-id-34' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='339' column='1' hash='fd7a63c0c6c822c4' id='type-id-20'/>
    <!-- typedef pthread_mutex_t hb_mutex_impl_t -->
    <typedef-decl name='hb_mutex_impl_t' type-id='type-id-35' size-in-bits='320' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-mutex-private.hh' line='59' column='1' id='type-id-24'/>
    <!-- typedef hb_user_data_key_t hb_user_data_key_t -->
    <typedef-decl name='hb_user_data_key_t' type-id='type-id-30' size-in-bits='8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='337' column='1' id='type-id-36'/>
    <!-- union pthread_mutex_t -->
    <union-decl name='pthread_mutex_t' visibility='default' size-in-bits='320' filepath='/usr/include/bits/pthreadtypes.h' line='77' column='1' hash='8e3e5ddbcaed875f' id='type-id-35'>
      <member-type access='public'>
        <!-- struct pthread_mutex_t::__pthread_mutex_s -->
        <class-decl name='__pthread_mutex_s' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/include/bits/pthreadtypes.h' line='79' column='1' hash='990722c309ed7e68' id='type-id-37'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- int pthread_mutex_t::__pthread_mutex_s::__lock -->
            <var-decl name='__lock' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <!-- unsigned int pthread_mutex_t::__pthread_mutex_s::__count -->
            <var-decl name='__count' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='81' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- int pthread_mutex_t::__pthread_mutex_s::__owner -->
            <var-decl name='__owner' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='82' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <!-- unsigned int pthread_mutex_t::__pthread_mutex_s::__nusers -->
            <var-decl name='__nusers' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='84' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- int pthread_mutex_t::__pthread_mutex_s::__kind -->
            <var-decl name='__kind' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='88' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='160'>
            <!-- int pthread_mutex_t::__pthread_mutex_s::__spins -->
            <var-decl name='__spins' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='90' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- __pthread_list_t pthread_mutex_t::__pthread_mutex_s::__list -->
            <var-decl name='__list' type-id='type-id-31' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='91' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public'>
        <!-- pthread_mutex_t::__pthread_mutex_s pthread_mutex_t::__data -->
        <var-decl name='__data' type-id='type-id-37' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='101' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- char pthread_mutex_t::__size[40] -->
        <var-decl name='__size' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='102' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- long int pthread_mutex_t::__align -->
        <var-decl name='__align' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='103' column='1'/>
      </data-member>
    </union-decl>
    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='type-id-7'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-18'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-4'/>
    <!-- __pthread_internal_list* -->
    <pointer-type-def type-id='type-id-13' size-in-bits='64' hash='b83eb2deac70d470' id='type-id-14'/>
    <!-- char* -->
    <pointer-type-def type-id='type-id-2' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-38'/>
    <!-- const char -->
    <qualified-type-def type-id='type-id-2' const='yes' hash='3e50fd33f9bb78d9' id='type-id-39'/>
    <!-- const char* -->
    <pointer-type-def type-id='type-id-39' size-in-bits='64' hash='c44743f354f6a443' id='type-id-17'/>
    <!-- const hb_blob_t -->
    <qualified-type-def type-id='type-id-15' const='yes' hash='f8e4fdd1c9cbb04b' id='type-id-40'/>
    <!-- const hb_blob_t* -->
    <pointer-type-def type-id='type-id-40' size-in-bits='64' hash='9bb2b6ebd81b13ac' id='type-id-41'/>
    <!-- const hb_object_header_t -->
    <qualified-type-def type-id='type-id-16' const='yes' hash='f1d7164d1f9fbe2d' id='type-id-42'/>
    <!-- const hb_object_header_t* -->
    <pointer-type-def type-id='type-id-42' size-in-bits='64' hash='77532893be594f8d' id='type-id-43'/>
    <!-- const hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u> -->
    <qualified-type-def type-id='type-id-22' const='yes' hash='6a8d0ba0222be6d9' id='type-id-44'/>
    <!-- const hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>* -->
    <pointer-type-def type-id='type-id-44' size-in-bits='64' hash='067973b54b25fe20' id='type-id-45'/>
    <!-- const hb_reference_count_t -->
    <qualified-type-def type-id='type-id-25' const='yes' hash='050336d897288cee' id='type-id-46'/>
    <!-- const hb_reference_count_t* -->
    <pointer-type-def type-id='type-id-46' size-in-bits='64' hash='0b6af1c8d843dfd4' id='type-id-47'/>
    <!-- const hb_reference_count_t* const -->
    <qualified-type-def type-id='type-id-47' const='yes' hash='22311e351823bcce' id='type-id-48'/>
    <!-- const hb_user_data_array_t::hb_user_data_item_t -->
    <qualified-type-def type-id='type-id-8' const='yes' hash='c687a1d5c4e477b1' id='type-id-49'/>
    <!-- const hb_user_data_array_t::hb_user_data_item_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-49' size-in-bits='64' hash='cdcc9f416ddb6b27' id='type-id-50'/>
    <!-- const hb_user_data_array_t::hb_user_data_item_t* -->
    <pointer-type-def type-id='type-id-49' size-in-bits='64' hash='67cc167e88b67590' id='type-id-51'/>
    <!-- hb_blob_t* -->
    <pointer-type-def type-id='type-id-32' size-in-bits='64' hash='623d24683d013c3b' id='type-id-52'/>
    <!-- hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>* -->
    <pointer-type-def type-id='type-id-21' size-in-bits='64' hash='03661edb3be27199' id='type-id-53'/>
    <!-- hb_lockable_set_t<hb_user_data_array_t::hb_user_data_item_t, hb_mutex_t>* const -->
    <qualified-type-def type-id='type-id-53' const='yes' hash='208c8741136736bf' id='type-id-54'/>
    <!-- hb_mutex_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-23' size-in-bits='64' hash='b98eba5266391aab' id='type-id-55'/>
    <!-- hb_mutex_t* -->
    <pointer-type-def type-id='type-id-23' size-in-bits='64' hash='d33f1a7f974b46c8' id='type-id-56'/>
    <!-- hb_mutex_t* const -->
    <qualified-type-def type-id='type-id-56' const='yes' hash='2a1d8906d7f951cd' id='type-id-57'/>
    <!-- hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>* -->
    <pointer-type-def type-id='type-id-22' size-in-bits='64' hash='9fbf81eb22028dc0' id='type-id-58'/>
    <!-- hb_prealloced_array_t<hb_user_data_array_t::hb_user_data_item_t, 2u>* const -->
    <qualified-type-def type-id='type-id-58' const='yes' hash='5a121060c3fc52df' id='type-id-59'/>
    <!-- hb_reference_count_t* -->
    <pointer-type-def type-id='type-id-25' size-in-bits='64' hash='e1846e39a4aee102' id='type-id-60'/>
    <!-- hb_reference_count_t* const -->
    <qualified-type-def type-id='type-id-60' const='yes' hash='3730f1c124a083f5' id='type-id-61'/>
    <!-- hb_user_data_array_t* -->
    <pointer-type-def type-id='type-id-26' size-in-bits='64' hash='aeed1d3c673d6914' id='type-id-62'/>
    <!-- hb_user_data_array_t* const -->
    <qualified-type-def type-id='type-id-62' const='yes' hash='e9de32a359ef4eb9' id='type-id-63'/>
    <!-- hb_user_data_array_t::hb_user_data_item_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-8' size-in-bits='64' hash='ed5b5f8f28c008f0' id='type-id-64'/>
    <!-- hb_user_data_array_t::hb_user_data_item_t* -->
    <pointer-type-def type-id='type-id-8' size-in-bits='64' hash='b3f8fb17d3a56c8f' id='type-id-27'/>
    <!-- hb_user_data_array_t::hb_user_data_item_t* const -->
    <qualified-type-def type-id='type-id-27' const='yes' hash='924127bddcb7b058' id='type-id-65'/>
    <!-- hb_user_data_key_t* -->
    <pointer-type-def type-id='type-id-36' size-in-bits='64' hash='e118be5cb92c381a' id='type-id-29'/>
    <!-- unsigned int* -->
    <pointer-type-def type-id='type-id-18' size-in-bits='64' hash='232fa04f890c2a5a' id='type-id-66'/>
    <!-- void (*)(void*) -->
    <pointer-type-def type-id='type-id-67' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-34'/>
    <!-- hb_blob_t* hb_blob_create(const char*, unsigned int, hb_memory_mode_t, void*, hb_destroy_func_t) -->
    <function-decl name='hb_blob_create' mangled-name='hb_blob_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_create' hash='4b3ca9677072ac12'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-17' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='97' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='98' column='1'/>
      <!-- parameter of type 'enum hb_memory_mode_t' -->
      <parameter type-id='type-id-6' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='99' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='100' column='1'/>
      <!-- parameter of type 'typedef hb_destroy_func_t' -->
      <parameter type-id='type-id-20' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='101' column='1'/>
      <!-- hb_blob_t* -->
      <return type-id='type-id-52'/>
    </function-decl>
    <!-- hb_blob_t* hb_blob_create_sub_blob(hb_blob_t*, unsigned int, unsigned int) -->
    <function-decl name='hb_blob_create_sub_blob' mangled-name='hb_blob_create_sub_blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_create_sub_blob' hash='cddb0b215f5d819a'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-52' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='150' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='151' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='152' column='1'/>
      <!-- hb_blob_t* -->
      <return type-id='type-id-52'/>
    </function-decl>
    <!-- hb_blob_t* hb_blob_get_empty() -->
    <function-decl name='hb_blob_get_empty' mangled-name='hb_blob_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_empty' hash='a96e1bacbac8a189'>
      <!-- hb_blob_t* -->
      <return type-id='type-id-52'/>
    </function-decl>
    <!-- hb_blob_t* hb_blob_reference(hb_blob_t*) -->
    <function-decl name='hb_blob_reference' mangled-name='hb_blob_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_reference' hash='bdcd6aacf8486bc9'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-52' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='213' column='1'/>
      <!-- hb_blob_t* -->
      <return type-id='type-id-52'/>
    </function-decl>
    <!-- void hb_blob_destroy(hb_blob_t*) -->
    <function-decl name='hb_blob_destroy' mangled-name='hb_blob_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_destroy' hash='a96e1bacbac8a189'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-52' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_bool_t hb_blob_set_user_data(hb_blob_t*, hb_user_data_key_t*, void*, hb_destroy_func_t, hb_bool_t) -->
    <function-decl name='hb_blob_set_user_data' mangled-name='hb_blob_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_set_user_data' hash='7dc8da94276310bd'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-52' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='253' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='type-id-29' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='254' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='255' column='1'/>
      <!-- parameter of type 'typedef hb_destroy_func_t' -->
      <parameter type-id='type-id-20' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='256' column='1'/>
      <!-- parameter of type 'typedef hb_bool_t' -->
      <parameter type-id='type-id-33' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='257' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-decl>
    <!-- void* hb_blob_get_user_data(hb_blob_t*, hb_user_data_key_t*) -->
    <function-decl name='hb_blob_get_user_data' mangled-name='hb_blob_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_user_data' hash='5bc8768cafa09ba6'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-52' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='274' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='type-id-29' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='275' column='1'/>
      <!-- void* -->
      <return type-id='type-id-19'/>
    </function-decl>
    <!-- void hb_blob_make_immutable(hb_blob_t*) -->
    <function-decl name='hb_blob_make_immutable' mangled-name='hb_blob_make_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_make_immutable' hash='a96e1bacbac8a189'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-52' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='290' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_bool_t hb_blob_is_immutable(hb_blob_t*) -->
    <function-decl name='hb_blob_is_immutable' mangled-name='hb_blob_is_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_is_immutable' hash='0b3693793f3da217'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-52' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='309' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-decl>
    <!-- unsigned int hb_blob_get_length(hb_blob_t*) -->
    <function-decl name='hb_blob_get_length' mangled-name='hb_blob_get_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_length' hash='419fea7a8eec93db'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-52' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='326' column='1'/>
      <!-- unsigned int -->
      <return type-id='type-id-18'/>
    </function-decl>
    <!-- const char* hb_blob_get_data(hb_blob_t*, unsigned int*) -->
    <function-decl name='hb_blob_get_data' mangled-name='hb_blob_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_data' hash='0aeaa55254f6d882'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-52' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-66' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='343' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- char* hb_blob_get_data_writable(hb_blob_t*, unsigned int*) -->
    <function-decl name='hb_blob_get_data_writable' mangled-name='hb_blob_get_data_writable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_blob_get_data_writable' hash='3000ca6d0912d350'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-52' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-66' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-blob.cc' line='368' column='1'/>
      <!-- char* -->
      <return type-id='type-id-38'/>
    </function-decl>
    <!-- void -->
    <type-decl name='void' id='type-id-68'/>
    <!-- void* -->
    <pointer-type-def type-id='type-id-68' id='type-id-19'/>
    <!-- void (void*) -->
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-67'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hb-buffer-serialize.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- const char*[8] -->
    <array-type-def dimensions='1' type-id='type-id-17' size-in-bits='512' hash='6ae918dd8852c41e' id='type-id-69'>
      <!-- <anonymous range>[8] -->
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-70'/>
    </array-type-def>
    <!-- enum hb_buffer_content_type_t -->
    <enum-decl name='hb_buffer_content_type_t' size-in-bits='32' alignment-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='119' column='1' hash='15ea6c55061e7f46' id='type-id-71'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_INVALID' value='0'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_UNICODE' value='1'/>
      <enumerator name='HB_BUFFER_CONTENT_TYPE_GLYPHS' value='2'/>
    </enum-decl>
    <!-- enum hb_buffer_flags_t -->
    <enum-decl name='hb_buffer_flags_t' size-in-bits='32' alignment-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='174' column='1' hash='fe6997ee9fe9c495' id='type-id-72'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_BUFFER_FLAG_DEFAULT' value='0'/>
      <enumerator name='HB_BUFFER_FLAG_BOT' value='1'/>
      <enumerator name='HB_BUFFER_FLAG_EOT' value='2'/>
      <enumerator name='HB_BUFFER_FLAG_PRESERVE_DEFAULT_IGNORABLES' value='4'/>
    </enum-decl>
    <!-- enum hb_buffer_serialize_flags_t -->
    <enum-decl name='hb_buffer_serialize_flags_t' size-in-bits='32' alignment-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='298' column='1' hash='30565f5c84eceec5' id='type-id-73'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_DEFAULT' value='0'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_CLUSTERS' value='1'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_POSITIONS' value='2'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FLAG_NO_GLYPH_NAMES' value='4'/>
    </enum-decl>
    <!-- enum hb_buffer_serialize_format_t -->
    <enum-decl name='hb_buffer_serialize_format_t' size-in-bits='32' alignment-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='305' column='1' hash='818693bbbd4462df' id='type-id-74'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_TEXT' value='1413830740'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_JSON' value='1246973774'/>
      <enumerator name='HB_BUFFER_SERIALIZE_FORMAT_INVALID' value='0'/>
    </enum-decl>
    <!-- enum hb_direction_t -->
    <enum-decl name='hb_direction_t' size-in-bits='32' alignment-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='111' column='1' hash='6158bf8446533ca5' id='type-id-75'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_DIRECTION_INVALID' value='0'/>
      <enumerator name='HB_DIRECTION_LTR' value='4'/>
      <enumerator name='HB_DIRECTION_RTL' value='5'/>
      <enumerator name='HB_DIRECTION_TTB' value='6'/>
      <enumerator name='HB_DIRECTION_BTT' value='7'/>
    </enum-decl>
    <!-- enum hb_script_t -->
    <enum-decl name='hb_script_t' size-in-bits='32' alignment-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='157' column='1' hash='e386c3eb5977ab54' id='type-id-76'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_SCRIPT_COMMON' value='1517910393'/>
      <enumerator name='HB_SCRIPT_INHERITED' value='1516858984'/>
      <enumerator name='HB_SCRIPT_UNKNOWN' value='1517976186'/>
      <enumerator name='HB_SCRIPT_ARABIC' value='1098015074'/>
      <enumerator name='HB_SCRIPT_ARMENIAN' value='1098018158'/>
      <enumerator name='HB_SCRIPT_BENGALI' value='1113943655'/>
      <enumerator name='HB_SCRIPT_CYRILLIC' value='1132032620'/>
      <enumerator name='HB_SCRIPT_DEVANAGARI' value='1147500129'/>
      <enumerator name='HB_SCRIPT_GEORGIAN' value='1197830002'/>
      <enumerator name='HB_SCRIPT_GREEK' value='1198679403'/>
      <enumerator name='HB_SCRIPT_GUJARATI' value='1198877298'/>
      <enumerator name='HB_SCRIPT_GURMUKHI' value='1198879349'/>
      <enumerator name='HB_SCRIPT_HANGUL' value='1214344807'/>
      <enumerator name='HB_SCRIPT_HAN' value='1214344809'/>
      <enumerator name='HB_SCRIPT_HEBREW' value='1214603890'/>
      <enumerator name='HB_SCRIPT_HIRAGANA' value='1214870113'/>
      <enumerator name='HB_SCRIPT_KANNADA' value='1265525857'/>
      <enumerator name='HB_SCRIPT_KATAKANA' value='1264676449'/>
      <enumerator name='HB_SCRIPT_LAO' value='1281453935'/>
      <enumerator name='HB_SCRIPT_LATIN' value='1281455214'/>
      <enumerator name='HB_SCRIPT_MALAYALAM' value='1298954605'/>
      <enumerator name='HB_SCRIPT_ORIYA' value='1332902241'/>
      <enumerator name='HB_SCRIPT_TAMIL' value='1415671148'/>
      <enumerator name='HB_SCRIPT_TELUGU' value='1415933045'/>
      <enumerator name='HB_SCRIPT_THAI' value='1416126825'/>
      <enumerator name='HB_SCRIPT_TIBETAN' value='1416192628'/>
      <enumerator name='HB_SCRIPT_BOPOMOFO' value='1114599535'/>
      <enumerator name='HB_SCRIPT_BRAILLE' value='1114792297'/>
      <enumerator name='HB_SCRIPT_CANADIAN_SYLLABICS' value='1130458739'/>
      <enumerator name='HB_SCRIPT_CHEROKEE' value='1130915186'/>
      <enumerator name='HB_SCRIPT_ETHIOPIC' value='1165256809'/>
      <enumerator name='HB_SCRIPT_KHMER' value='1265134962'/>
      <enumerator name='HB_SCRIPT_MONGOLIAN' value='1299148391'/>
      <enumerator name='HB_SCRIPT_MYANMAR' value='1299803506'/>
      <enumerator name='HB_SCRIPT_OGHAM' value='1332175213'/>
      <enumerator name='HB_SCRIPT_RUNIC' value='1383427698'/>
      <enumerator name='HB_SCRIPT_SINHALA' value='1399418472'/>
      <enumerator name='HB_SCRIPT_SYRIAC' value='1400468067'/>
      <enumerator name='HB_SCRIPT_THAANA' value='1416126817'/>
      <enumerator name='HB_SCRIPT_YI' value='1500080489'/>
      <enumerator name='HB_SCRIPT_DESERET' value='1148416628'/>
      <enumerator name='HB_SCRIPT_GOTHIC' value='1198486632'/>
      <enumerator name='HB_SCRIPT_OLD_ITALIC' value='1232363884'/>
      <enumerator name='HB_SCRIPT_BUHID' value='1114990692'/>
      <enumerator name='HB_SCRIPT_HANUNOO' value='1214344815'/>
      <enumerator name='HB_SCRIPT_TAGALOG' value='1416064103'/>
      <enumerator name='HB_SCRIPT_TAGBANWA' value='1415669602'/>
      <enumerator name='HB_SCRIPT_CYPRIOT' value='1131442804'/>
      <enumerator name='HB_SCRIPT_LIMBU' value='1281977698'/>
      <enumerator name='HB_SCRIPT_LINEAR_B' value='1281977954'/>
      <enumerator name='HB_SCRIPT_OSMANYA' value='1332964705'/>
      <enumerator name='HB_SCRIPT_SHAVIAN' value='1399349623'/>
      <enumerator name='HB_SCRIPT_TAI_LE' value='1415670885'/>
      <enumerator name='HB_SCRIPT_UGARITIC' value='1432838514'/>
      <enumerator name='HB_SCRIPT_BUGINESE' value='1114990441'/>
      <enumerator name='HB_SCRIPT_COPTIC' value='1131376756'/>
      <enumerator name='HB_SCRIPT_GLAGOLITIC' value='1198285159'/>
      <enumerator name='HB_SCRIPT_KHAROSHTHI' value='1265131890'/>
      <enumerator name='HB_SCRIPT_NEW_TAI_LUE' value='1415670901'/>
      <enumerator name='HB_SCRIPT_OLD_PERSIAN' value='1483761007'/>
      <enumerator name='HB_SCRIPT_SYLOTI_NAGRI' value='1400466543'/>
      <enumerator name='HB_SCRIPT_TIFINAGH' value='1415999079'/>
      <enumerator name='HB_SCRIPT_BALINESE' value='1113681001'/>
      <enumerator name='HB_SCRIPT_CUNEIFORM' value='1483961720'/>
      <enumerator name='HB_SCRIPT_NKO' value='1315663727'/>
      <enumerator name='HB_SCRIPT_PHAGS_PA' value='1349017959'/>
      <enumerator name='HB_SCRIPT_PHOENICIAN' value='1349021304'/>
      <enumerator name='HB_SCRIPT_CARIAN' value='1130459753'/>
      <enumerator name='HB_SCRIPT_CHAM' value='1130914157'/>
      <enumerator name='HB_SCRIPT_KAYAH_LI' value='1264675945'/>
      <enumerator name='HB_SCRIPT_LEPCHA' value='1281716323'/>
      <enumerator name='HB_SCRIPT_LYCIAN' value='1283023721'/>
      <enumerator name='HB_SCRIPT_LYDIAN' value='1283023977'/>
      <enumerator name='HB_SCRIPT_OL_CHIKI' value='1332503403'/>
      <enumerator name='HB_SCRIPT_REJANG' value='1382706791'/>
      <enumerator name='HB_SCRIPT_SAURASHTRA' value='1398895986'/>
      <enumerator name='HB_SCRIPT_SUNDANESE' value='1400204900'/>
      <enumerator name='HB_SCRIPT_VAI' value='1449224553'/>
      <enumerator name='HB_SCRIPT_AVESTAN' value='1098281844'/>
      <enumerator name='HB_SCRIPT_BAMUM' value='1113681269'/>
      <enumerator name='HB_SCRIPT_EGYPTIAN_HIEROGLYPHS' value='1164409200'/>
      <enumerator name='HB_SCRIPT_IMPERIAL_ARAMAIC' value='1098018153'/>
      <enumerator name='HB_SCRIPT_INSCRIPTIONAL_PAHLAVI' value='1349020777'/>
      <enumerator name='HB_SCRIPT_INSCRIPTIONAL_PARTHIAN' value='1349678185'/>
      <enumerator name='HB_SCRIPT_JAVANESE' value='1247901281'/>
      <enumerator name='HB_SCRIPT_KAITHI' value='1265920105'/>
      <enumerator name='HB_SCRIPT_LISU' value='1281979253'/>
      <enumerator name='HB_SCRIPT_MEETEI_MAYEK' value='1299473769'/>
      <enumerator name='HB_SCRIPT_OLD_SOUTH_ARABIAN' value='1398895202'/>
      <enumerator name='HB_SCRIPT_OLD_TURKIC' value='1332898664'/>
      <enumerator name='HB_SCRIPT_SAMARITAN' value='1398893938'/>
      <enumerator name='HB_SCRIPT_TAI_THAM' value='1281453665'/>
      <enumerator name='HB_SCRIPT_TAI_VIET' value='1415673460'/>
      <enumerator name='HB_SCRIPT_BATAK' value='1113683051'/>
      <enumerator name='HB_SCRIPT_BRAHMI' value='1114792296'/>
      <enumerator name='HB_SCRIPT_MANDAIC' value='1298230884'/>
      <enumerator name='HB_SCRIPT_CHAKMA' value='1130457965'/>
      <enumerator name='HB_SCRIPT_MEROITIC_CURSIVE' value='1298494051'/>
      <enumerator name='HB_SCRIPT_MEROITIC_HIEROGLYPHS' value='1298494063'/>
      <enumerator name='HB_SCRIPT_MIAO' value='1349284452'/>
      <enumerator name='HB_SCRIPT_SHARADA' value='1399353956'/>
      <enumerator name='HB_SCRIPT_SORA_SOMPENG' value='1399812705'/>
      <enumerator name='HB_SCRIPT_TAKRI' value='1415670642'/>
      <enumerator name='HB_SCRIPT_BASSA_VAH' value='1113682803'/>
      <enumerator name='HB_SCRIPT_CAUCASIAN_ALBANIAN' value='1097295970'/>
      <enumerator name='HB_SCRIPT_DUPLOYAN' value='1148547180'/>
      <enumerator name='HB_SCRIPT_ELBASAN' value='1164730977'/>
      <enumerator name='HB_SCRIPT_GRANTHA' value='1198678382'/>
      <enumerator name='HB_SCRIPT_KHOJKI' value='1265135466'/>
      <enumerator name='HB_SCRIPT_KHUDAWADI' value='1399418468'/>
      <enumerator name='HB_SCRIPT_LINEAR_A' value='1281977953'/>
      <enumerator name='HB_SCRIPT_MAHAJANI' value='1298229354'/>
      <enumerator name='HB_SCRIPT_MANICHAEAN' value='1298230889'/>
      <enumerator name='HB_SCRIPT_MENDE_KIKAKUI' value='1298493028'/>
      <enumerator name='HB_SCRIPT_MODI' value='1299145833'/>
      <enumerator name='HB_SCRIPT_MRO' value='1299345263'/>
      <enumerator name='HB_SCRIPT_NABATAEAN' value='1315070324'/>
      <enumerator name='HB_SCRIPT_OLD_NORTH_ARABIAN' value='1315009122'/>
      <enumerator name='HB_SCRIPT_OLD_PERMIC' value='1348825709'/>
      <enumerator name='HB_SCRIPT_PAHAWH_HMONG' value='1215131239'/>
      <enumerator name='HB_SCRIPT_PALMYRENE' value='1348562029'/>
      <enumerator name='HB_SCRIPT_PAU_CIN_HAU' value='1348564323'/>
      <enumerator name='HB_SCRIPT_PSALTER_PAHLAVI' value='1349020784'/>
      <enumerator name='HB_SCRIPT_SIDDHAM' value='1399415908'/>
      <enumerator name='HB_SCRIPT_TIRHUTA' value='1416196712'/>
      <enumerator name='HB_SCRIPT_WARANG_CITI' value='1466004065'/>
      <enumerator name='HB_SCRIPT_INVALID' value='0'/>
      <enumerator name='_HB_SCRIPT_MAX_VALUE' value='4294967295'/>
      <enumerator name='_HB_SCRIPT_MAX_VALUE_SIGNED' value='2147483647'/>
    </enum-decl>
    <!-- enum hb_unicode_combining_class_t -->
    <enum-decl name='hb_unicode_combining_class_t' size-in-bits='32' alignment-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='87' column='1' hash='f8320278ae7fe075' id='type-id-77'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_NOT_REORDERED' value='0'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_OVERLAY' value='1'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_NUKTA' value='7'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_KANA_VOICING' value='8'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_VIRAMA' value='9'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC10' value='10'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC11' value='11'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC12' value='12'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC13' value='13'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC14' value='14'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC15' value='15'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC16' value='16'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC17' value='17'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC18' value='18'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC19' value='19'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC20' value='20'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC21' value='21'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC22' value='22'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC23' value='23'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC24' value='24'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC25' value='25'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC26' value='26'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC27' value='27'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC28' value='28'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC29' value='29'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC30' value='30'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC31' value='31'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC32' value='32'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC33' value='33'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC34' value='34'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC35' value='35'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC36' value='36'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC84' value='84'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC91' value='91'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC103' value='103'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC107' value='107'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC118' value='118'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC122' value='122'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC129' value='129'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC130' value='130'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_CCC133' value='132'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_BELOW_LEFT' value='200'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_BELOW' value='202'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_ABOVE' value='214'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ATTACHED_ABOVE_RIGHT' value='216'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW_LEFT' value='218'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW' value='220'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_BELOW_RIGHT' value='222'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_LEFT' value='224'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_RIGHT' value='226'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE_LEFT' value='228'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE' value='230'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_ABOVE_RIGHT' value='232'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_DOUBLE_BELOW' value='233'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_DOUBLE_ABOVE' value='234'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_IOTA_SUBSCRIPT' value='240'/>
      <enumerator name='HB_UNICODE_COMBINING_CLASS_INVALID' value='255'/>
    </enum-decl>
    <!-- enum hb_unicode_general_category_t -->
    <enum-decl name='hb_unicode_general_category_t' size-in-bits='32' alignment-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='46' column='1' hash='33bbb06bb111b9ab' id='type-id-78'>
      <underlying-type type-id='type-id-7'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CONTROL' value='0'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_FORMAT' value='1'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_UNASSIGNED' value='2'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_PRIVATE_USE' value='3'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SURROGATE' value='4'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LOWERCASE_LETTER' value='5'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MODIFIER_LETTER' value='6'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_LETTER' value='7'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_TITLECASE_LETTER' value='8'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_UPPERCASE_LETTER' value='9'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SPACING_MARK' value='10'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_ENCLOSING_MARK' value='11'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_NON_SPACING_MARK' value='12'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_DECIMAL_NUMBER' value='13'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LETTER_NUMBER' value='14'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_NUMBER' value='15'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CONNECT_PUNCTUATION' value='16'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_DASH_PUNCTUATION' value='17'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CLOSE_PUNCTUATION' value='18'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_FINAL_PUNCTUATION' value='19'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_INITIAL_PUNCTUATION' value='20'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_PUNCTUATION' value='21'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OPEN_PUNCTUATION' value='22'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_CURRENCY_SYMBOL' value='23'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MODIFIER_SYMBOL' value='24'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_MATH_SYMBOL' value='25'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_OTHER_SYMBOL' value='26'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_LINE_SEPARATOR' value='27'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_PARAGRAPH_SEPARATOR' value='28'/>
      <enumerator name='HB_UNICODE_GENERAL_CATEGORY_SPACE_SEPARATOR' value='29'/>
    </enum-decl>
    <!-- hb_codepoint_t[2][5] -->
    <array-type-def dimensions='2' type-id='type-id-79' size-in-bits='320' hash='9b89a095d595dfc7' id='type-id-80'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-10'/>
      <!-- <anonymous range>[5] -->
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='type-id-81'/>
    </array-type-def>
    <!-- int16_t[2] -->
    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='32' hash='83864ad070b09a53' id='type-id-83'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-10'/>
    </array-type-def>
    <!-- int8_t[4] -->
    <array-type-def dimensions='1' type-id='type-id-84' size-in-bits='32' hash='cffa64b88ee2b00c' id='type-id-85'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-86'/>
    </array-type-def>
    <!-- short int -->
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#3' id='type-id-87'/>
    <!-- signed char -->
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='type-id-88'/>
    <!-- struct hb_buffer_t -->
    <class-decl name='hb_buffer_t' is-struct='yes' visibility='default' size-in-bits='2752' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='46' column='1' hash='1c895cf953e7d835' id='type-id-89'>
      <member-type access='public'>
        <!-- typedef long int hb_buffer_t::scratch_buffer_t -->
        <typedef-decl name='scratch_buffer_t' type-id='type-id-12' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='190' column='1' hash='b119fe0931d2ee10' id='type-id-90'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_buffer_t::header -->
        <var-decl name='header' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_unicode_funcs_t* hb_buffer_t::unicode -->
        <var-decl name='unicode' type-id='type-id-91' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- hb_buffer_flags_t hb_buffer_t::flags -->
        <var-decl name='flags' type-id='type-id-72' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <!-- hb_codepoint_t hb_buffer_t::replacement -->
        <var-decl name='replacement' type-id='type-id-79' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- hb_buffer_content_type_t hb_buffer_t::content_type -->
        <var-decl name='content_type' type-id='type-id-71' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- hb_segment_properties_t hb_buffer_t::props -->
        <var-decl name='props' type-id='type-id-92' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- bool hb_buffer_t::in_error -->
        <var-decl name='in_error' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1352'>
        <!-- bool hb_buffer_t::have_output -->
        <var-decl name='have_output' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1360'>
        <!-- bool hb_buffer_t::have_positions -->
        <var-decl name='have_positions' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <!-- unsigned int hb_buffer_t::idx -->
        <var-decl name='idx' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- unsigned int hb_buffer_t::len -->
        <var-decl name='len' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <!-- unsigned int hb_buffer_t::out_len -->
        <var-decl name='out_len' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <!-- unsigned int hb_buffer_t::allocated -->
        <var-decl name='allocated' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <!-- hb_glyph_info_t* hb_buffer_t::info -->
        <var-decl name='info' type-id='type-id-93' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <!-- hb_glyph_info_t* hb_buffer_t::out_info -->
        <var-decl name='out_info' type-id='type-id-93' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <!-- hb_glyph_position_t* hb_buffer_t::pos -->
        <var-decl name='pos' type-id='type-id-94' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <!-- unsigned int hb_buffer_t::serial -->
        <var-decl name='serial' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <!-- uint8_t hb_buffer_t::allocated_var_bytes[8] -->
        <var-decl name='allocated_var_bytes' type-id='type-id-95' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <!-- const char* hb_buffer_t::allocated_var_owner[8] -->
        <var-decl name='allocated_var_owner' type-id='type-id-69' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <!-- hb_codepoint_t hb_buffer_t::context[2][5] -->
        <var-decl name='context' type-id='type-id-80' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <!-- unsigned int hb_buffer_t::context_len[2] -->
        <var-decl name='context_len' type-id='type-id-96' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-private.hh' line='94' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_glyph_info_t -->
    <class-decl name='hb_glyph_info_t' is-struct='yes' visibility='default' size-in-bits='160' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='44' column='1' hash='aa7d0662e60d913c' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_codepoint_t hb_glyph_info_t::codepoint -->
        <var-decl name='codepoint' type-id='type-id-79' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- hb_mask_t hb_glyph_info_t::mask -->
        <var-decl name='mask' type-id='type-id-98' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- uint32_t hb_glyph_info_t::cluster -->
        <var-decl name='cluster' type-id='type-id-99' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- hb_var_int_t hb_glyph_info_t::var1 -->
        <var-decl name='var1' type-id='type-id-100' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- hb_var_int_t hb_glyph_info_t::var2 -->
        <var-decl name='var2' type-id='type-id-100' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_glyph_position_t -->
    <class-decl name='hb_glyph_position_t' is-struct='yes' visibility='default' size-in-bits='160' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='54' column='1' hash='6630a8569786d4df' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_position_t hb_glyph_position_t::x_advance -->
        <var-decl name='x_advance' type-id='type-id-102' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- hb_position_t hb_glyph_position_t::y_advance -->
        <var-decl name='y_advance' type-id='type-id-102' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_position_t hb_glyph_position_t::x_offset -->
        <var-decl name='x_offset' type-id='type-id-102' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- hb_position_t hb_glyph_position_t::y_offset -->
        <var-decl name='y_offset' type-id='type-id-102' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- hb_var_int_t hb_glyph_position_t::var -->
        <var-decl name='var' type-id='type-id-100' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_segment_properties_t -->
    <class-decl name='hb_segment_properties_t' is-struct='yes' visibility='default' size-in-bits='256' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='65' column='1' hash='4db6dc1ad0b4ae20' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_direction_t hb_segment_properties_t::direction -->
        <var-decl name='direction' type-id='type-id-75' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- hb_script_t hb_segment_properties_t::script -->
        <var-decl name='script' type-id='type-id-76' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_language_t hb_segment_properties_t::language -->
        <var-decl name='language' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* hb_segment_properties_t::reserved1 -->
        <var-decl name='reserved1' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void* hb_segment_properties_t::reserved2 -->
        <var-decl name='reserved2' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_unicode_funcs_t -->
    <class-decl name='hb_unicode_funcs_t' is-struct='yes' visibility='default' size-in-bits='2560' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='64' column='1' hash='df62c8ec54a5604d' id='type-id-105'>
      <member-type access='public'>
        <!-- struct {hb_destroy_func_t combining_class; hb_destroy_func_t eastasian_width; hb_destroy_func_t general_category; hb_destroy_func_t mirroring; hb_destroy_func_t script; hb_destroy_func_t compose; hb_destroy_func_t decompose; hb_destroy_func_t decompose_compatibility;} -->
        <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='512' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='215' column='1' hash='dad2e3f8868fb9bc#3' id='type-id-106'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_destroy_func_t combining_class -->
            <var-decl name='combining_class' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_destroy_func_t eastasian_width -->
            <var-decl name='eastasian_width' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_destroy_func_t general_category -->
            <var-decl name='general_category' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- hb_destroy_func_t mirroring -->
            <var-decl name='mirroring' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- hb_destroy_func_t script -->
            <var-decl name='script' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- hb_destroy_func_t compose -->
            <var-decl name='compose' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- hb_destroy_func_t decompose -->
            <var-decl name='decompose' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- hb_destroy_func_t decompose_compatibility -->
            <var-decl name='decompose_compatibility' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='217' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <!-- struct {hb_unicode_combining_class_func_t combining_class; hb_unicode_eastasian_width_func_t eastasian_width; hb_unicode_general_category_func_t general_category; hb_unicode_mirroring_func_t mirroring; hb_unicode_script_func_t script; hb_unicode_compose_func_t compose; hb_unicode_decompose_func_t decompose; hb_unicode_decompose_compatibility_func_t decompose_compatibility;} -->
        <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='512' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='203' column='1' hash='dad2e3f8868fb9bc#6' id='type-id-107'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_unicode_combining_class_func_t combining_class -->
            <var-decl name='combining_class' type-id='type-id-108' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_unicode_eastasian_width_func_t eastasian_width -->
            <var-decl name='eastasian_width' type-id='type-id-109' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_unicode_general_category_func_t general_category -->
            <var-decl name='general_category' type-id='type-id-110' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- hb_unicode_mirroring_func_t mirroring -->
            <var-decl name='mirroring' type-id='type-id-111' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- hb_unicode_script_func_t script -->
            <var-decl name='script' type-id='type-id-112' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- hb_unicode_compose_func_t compose -->
            <var-decl name='compose' type-id='type-id-113' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- hb_unicode_decompose_func_t decompose -->
            <var-decl name='decompose' type-id='type-id-114' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- hb_unicode_decompose_compatibility_func_t decompose_compatibility -->
            <var-decl name='decompose_compatibility' type-id='type-id-115' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='205' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <!-- struct {void* combining_class; void* eastasian_width; void* general_category; void* mirroring; void* script; void* compose; void* decompose; void* decompose_compatibility;} -->
        <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='512' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='209' column='1' hash='dbcf8465cf0418f3#7' id='type-id-116'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- void* combining_class -->
            <var-decl name='combining_class' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- void* eastasian_width -->
            <var-decl name='eastasian_width' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- void* general_category -->
            <var-decl name='general_category' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- void* mirroring -->
            <var-decl name='mirroring' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- void* script -->
            <var-decl name='script' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- void* compose -->
            <var-decl name='compose' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- void* decompose -->
            <var-decl name='decompose' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- void* decompose_compatibility -->
            <var-decl name='decompose_compatibility' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='211' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_unicode_funcs_t::header -->
        <var-decl name='header' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_unicode_funcs_t* hb_unicode_funcs_t::parent -->
        <var-decl name='parent' type-id='type-id-117' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- bool hb_unicode_funcs_t::immutable -->
        <var-decl name='immutable' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- struct {hb_unicode_combining_class_func_t combining_class; hb_unicode_eastasian_width_func_t eastasian_width; hb_unicode_general_category_func_t general_category; hb_unicode_mirroring_func_t mirroring; hb_unicode_script_func_t script; hb_unicode_compose_func_t compose; hb_unicode_decompose_func_t decompose; hb_unicode_decompose_compatibility_func_t decompose_compatibility;} hb_unicode_funcs_t::func -->
        <var-decl name='func' type-id='type-id-107' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <!-- struct {void* combining_class; void* eastasian_width; void* general_category; void* mirroring; void* script; void* compose; void* decompose; void* decompose_compatibility;} hb_unicode_funcs_t::user_data -->
        <var-decl name='user_data' type-id='type-id-116' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <!-- struct {hb_destroy_func_t combining_class; hb_destroy_func_t eastasian_width; hb_destroy_func_t general_category; hb_destroy_func_t mirroring; hb_destroy_func_t script; hb_destroy_func_t compose; hb_destroy_func_t decompose; hb_destroy_func_t decompose_compatibility;} hb_unicode_funcs_t::destroy -->
        <var-decl name='destroy' type-id='type-id-106' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode-private.hh' line='219' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef hb_buffer_t hb_buffer_t -->
    <typedef-decl name='hb_buffer_t' type-id='type-id-89' size-in-bits='2752' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='93' column='1' id='type-id-118'/>
    <!-- typedef uint32_t hb_codepoint_t -->
    <typedef-decl name='hb_codepoint_t' type-id='type-id-99' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='75' column='1' hash='e66b43f97c38e87a' id='type-id-79'/>
    <!-- typedef hb_font_t hb_font_t -->
    <typedef-decl name='hb_font_t' type-id='type-id-119' size-in-bits='1536' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='40' column='1' id='type-id-120'/>
    <!-- typedef hb_glyph_info_t hb_glyph_info_t -->
    <typedef-decl name='hb_glyph_info_t' type-id='type-id-97' size-in-bits='160' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='52' column='1' id='type-id-121'/>
    <!-- typedef hb_glyph_position_t hb_glyph_position_t -->
    <typedef-decl name='hb_glyph_position_t' type-id='type-id-101' size-in-bits='160' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='62' column='1' id='type-id-122'/>
    <!-- typedef const hb_language_impl_t* hb_language_t -->
    <typedef-decl name='hb_language_t' type-id='type-id-123' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='137' column='1' hash='a898ddd1e10d746b' id='type-id-104'/>
    <!-- typedef uint32_t hb_mask_t -->
    <typedef-decl name='hb_mask_t' type-id='type-id-99' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='77' column='1' hash='e66b43f97c38e87a' id='type-id-98'/>
    <!-- typedef int32_t hb_position_t -->
    <typedef-decl name='hb_position_t' type-id='type-id-124' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='76' column='1' hash='09d17c08f594edc7' id='type-id-102'/>
    <!-- typedef hb_segment_properties_t hb_segment_properties_t -->
    <typedef-decl name='hb_segment_properties_t' type-id='type-id-103' size-in-bits='256' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.h' line='72' column='1' id='type-id-92'/>
    <!-- typedef hb_unicode_combining_class_t (*)(hb_unicode_funcs_t*, hb_codepoint_t, void*) hb_unicode_combining_class_func_t -->
    <typedef-decl name='hb_unicode_combining_class_func_t' type-id='type-id-125' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='224' column='1' hash='fd7a63c0c6c822c4' id='type-id-108'/>
    <!-- typedef hb_bool_t (*)(hb_unicode_funcs_t*, hb_codepoint_t, hb_codepoint_t, hb_codepoint_t*, void*) hb_unicode_compose_func_t -->
    <typedef-decl name='hb_unicode_compose_func_t' type-id='type-id-126' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='242' column='1' hash='fd7a63c0c6c822c4' id='type-id-113'/>
    <!-- typedef unsigned int (*)(hb_unicode_funcs_t*, hb_codepoint_t, hb_codepoint_t*, void*) hb_unicode_decompose_compatibility_func_t -->
    <typedef-decl name='hb_unicode_decompose_compatibility_func_t' type-id='type-id-127' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='270' column='1' hash='fd7a63c0c6c822c4' id='type-id-115'/>
    <!-- typedef hb_bool_t (*)(hb_unicode_funcs_t*, hb_codepoint_t, hb_codepoint_t*, hb_codepoint_t*, void*) hb_unicode_decompose_func_t -->
    <typedef-decl name='hb_unicode_decompose_func_t' type-id='type-id-128' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='247' column='1' hash='fd7a63c0c6c822c4' id='type-id-114'/>
    <!-- typedef unsigned int (*)(hb_unicode_funcs_t*, hb_codepoint_t, void*) hb_unicode_eastasian_width_func_t -->
    <typedef-decl name='hb_unicode_eastasian_width_func_t' type-id='type-id-129' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='227' column='1' hash='fd7a63c0c6c822c4' id='type-id-109'/>
    <!-- typedef hb_unicode_funcs_t hb_unicode_funcs_t -->
    <typedef-decl name='hb_unicode_funcs_t' type-id='type-id-105' size-in-bits='2560' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='171' column='1' id='type-id-130'/>
    <!-- typedef hb_unicode_general_category_t (*)(hb_unicode_funcs_t*, hb_codepoint_t, void*) hb_unicode_general_category_func_t -->
    <typedef-decl name='hb_unicode_general_category_func_t' type-id='type-id-131' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='230' column='1' hash='fd7a63c0c6c822c4' id='type-id-110'/>
    <!-- typedef hb_codepoint_t (*)(hb_unicode_funcs_t*, hb_codepoint_t, void*) hb_unicode_mirroring_func_t -->
    <typedef-decl name='hb_unicode_mirroring_func_t' type-id='type-id-132' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='233' column='1' hash='fd7a63c0c6c822c4' id='type-id-111'/>
    <!-- typedef hb_script_t (*)(hb_unicode_funcs_t*, hb_codepoint_t, void*) hb_unicode_script_func_t -->
    <typedef-decl name='hb_unicode_script_func_t' type-id='type-id-133' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-unicode.h' line='236' column='1' hash='fd7a63c0c6c822c4' id='type-id-112'/>
    <!-- typedef _hb_var_int_t hb_var_int_t -->
    <typedef-decl name='hb_var_int_t' type-id='type-id-134' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='86' column='1' id='type-id-100'/>
    <!-- typedef short int int16_t -->
    <typedef-decl name='int16_t' type-id='type-id-87' size-in-bits='16' filepath='/usr/include/stdint.h' line='38' column='1' hash='6c2352eccdcd3eea' id='type-id-82'/>
    <!-- typedef int int32_t -->
    <typedef-decl name='int32_t' type-id='type-id-11' size-in-bits='32' filepath='/usr/include/stdint.h' line='39' column='1' hash='09d17c08f594edc7' id='type-id-124'/>
    <!-- typedef signed char int8_t -->
    <typedef-decl name='int8_t' type-id='type-id-88' size-in-bits='8' filepath='/usr/include/stdint.h' line='37' column='1' hash='3c595c3350588f18' id='type-id-84'/>
    <!-- typedef unsigned short int uint16_t -->
    <typedef-decl name='uint16_t' type-id='type-id-135' size-in-bits='16' filepath='/usr/include/stdint.h' line='50' column='1' hash='d7723bb93a30b11d' id='type-id-136'/>
    <!-- typedef unsigned int uint32_t -->
    <typedef-decl name='uint32_t' type-id='type-id-18' size-in-bits='32' filepath='/usr/include/stdint.h' line='52' column='1' hash='e66b43f97c38e87a' id='type-id-99'/>
    <!-- typedef unsigned char uint8_t -->
    <typedef-decl name='uint8_t' type-id='type-id-137' size-in-bits='8' filepath='/usr/include/stdint.h' line='49' column='1' hash='6ebac62b3366db68' id='type-id-138'/>
    <!-- uint16_t[2] -->
    <array-type-def dimensions='1' type-id='type-id-136' size-in-bits='32' hash='975bc66ad2566878' id='type-id-139'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-10'/>
    </array-type-def>
    <!-- uint8_t[4] -->
    <array-type-def dimensions='1' type-id='type-id-138' size-in-bits='32' hash='7df313b77e5f7cf4' id='type-id-140'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-86'/>
    </array-type-def>
    <!-- uint8_t[8] -->
    <array-type-def dimensions='1' type-id='type-id-138' size-in-bits='64' hash='24c833a0e6bde8ce' id='type-id-95'>
      <!-- <anonymous range>[8] -->
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-70'/>
    </array-type-def>
    <!-- union _hb_var_int_t -->
    <union-decl name='_hb_var_int_t' visibility='default' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='79' column='1' hash='77b29140c773075d' id='type-id-134'>
      <data-member access='public'>
        <!-- uint32_t _hb_var_int_t::u32 -->
        <var-decl name='u32' type-id='type-id-99' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='80' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- int32_t _hb_var_int_t::i32 -->
        <var-decl name='i32' type-id='type-id-124' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='81' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- uint16_t _hb_var_int_t::u16[2] -->
        <var-decl name='u16' type-id='type-id-139' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='82' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- int16_t _hb_var_int_t::i16[2] -->
        <var-decl name='i16' type-id='type-id-83' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='83' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- uint8_t _hb_var_int_t::u8[4] -->
        <var-decl name='u8' type-id='type-id-140' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='84' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- int8_t _hb_var_int_t::i8[4] -->
        <var-decl name='i8' type-id='type-id-85' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='85' column='1'/>
      </data-member>
    </union-decl>
    <!-- unsigned char -->
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='type-id-137'/>
    <!-- unsigned int[2] -->
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='64' hash='27faccd2350aa96c' id='type-id-96'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-10'/>
    </array-type-def>
    <!-- unsigned short int -->
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='type-id-135'/>
    <!-- const char** -->
    <pointer-type-def type-id='type-id-17' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-141'/>
    <!-- const hb_buffer_t -->
    <qualified-type-def type-id='type-id-89' const='yes' hash='547258d741fc1d43' id='type-id-142'/>
    <!-- const hb_buffer_t* -->
    <pointer-type-def type-id='type-id-142' size-in-bits='64' hash='96d0e3e8e9d3f972' id='type-id-143'/>
    <!-- const hb_codepoint_t -->
    <qualified-type-def type-id='type-id-79' const='yes' hash='dc51066c8c85514a' id='type-id-144'/>
    <!-- const hb_codepoint_t* -->
    <pointer-type-def type-id='type-id-144' size-in-bits='64' hash='8eabf7313b6c8286' id='type-id-145'/>
    <!-- const hb_glyph_info_t -->
    <qualified-type-def type-id='type-id-121' const='yes' hash='7fea344076224f78' id='type-id-146'/>
    <!-- const hb_glyph_info_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-146' size-in-bits='64' hash='b64b2075988aee0f' id='type-id-147'/>
    <!-- const hb_language_impl_t -->
    <qualified-type-def type-id='type-id-148' const='yes' hash='190c367d9b19e4b9' id='type-id-149'/>
    <!-- const hb_language_impl_t* -->
    <pointer-type-def type-id='type-id-149' size-in-bits='64' hash='a898ddd1e10d746b' id='type-id-123'/>
    <!-- const hb_unicode_funcs_t -->
    <qualified-type-def type-id='type-id-105' const='yes' hash='62c44bb45f3a33e2' id='type-id-150'/>
    <!-- const hb_unicode_funcs_t* -->
    <pointer-type-def type-id='type-id-150' size-in-bits='64' hash='15206993e337f225' id='type-id-151'/>
    <!-- hb_bool_t (*)(hb_unicode_funcs_t*, hb_codepoint_t, hb_codepoint_t*, hb_codepoint_t*, void*) -->
    <pointer-type-def type-id='type-id-152' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-128'/>
    <!-- hb_bool_t (*)(hb_unicode_funcs_t*, hb_codepoint_t, hb_codepoint_t, hb_codepoint_t*, void*) -->
    <pointer-type-def type-id='type-id-153' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-126'/>
    <!-- hb_buffer_t* -->
    <pointer-type-def type-id='type-id-89' size-in-bits='64' hash='8fb8235dab07d52a' id='type-id-154'/>
    <!-- hb_buffer_t* -->
    <pointer-type-def type-id='type-id-118' size-in-bits='64' hash='8fb8235dab07d52a#2' id='type-id-155'/>
    <!-- hb_buffer_t::scratch_buffer_t* -->
    <pointer-type-def type-id='type-id-90' size-in-bits='64' hash='efef02b98e90b82f' id='type-id-156'/>
    <!-- hb_codepoint_t (*)(hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <pointer-type-def type-id='type-id-157' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-132'/>
    <!-- hb_codepoint_t* -->
    <pointer-type-def type-id='type-id-79' size-in-bits='64' hash='57a1bf43f13253a8' id='type-id-158'/>
    <!-- hb_font_t* -->
    <pointer-type-def type-id='type-id-120' size-in-bits='64' hash='34a0b9bb2e195ba5#2' id='type-id-159'/>
    <!-- hb_glyph_info_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-121' size-in-bits='64' hash='bc3081839483360a' id='type-id-160'/>
    <!-- hb_glyph_info_t* -->
    <pointer-type-def type-id='type-id-121' size-in-bits='64' hash='6c5f81af0c495d8d' id='type-id-93'/>
    <!-- hb_glyph_position_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-122' size-in-bits='64' hash='3954b3d046bf68f3' id='type-id-161'/>
    <!-- hb_glyph_position_t* -->
    <pointer-type-def type-id='type-id-122' size-in-bits='64' hash='0974e855692a608e' id='type-id-94'/>
    <!-- hb_script_t (*)(hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <pointer-type-def type-id='type-id-162' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-133'/>
    <!-- hb_unicode_combining_class_t (*)(hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <pointer-type-def type-id='type-id-163' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-125'/>
    <!-- hb_unicode_funcs_t* -->
    <pointer-type-def type-id='type-id-105' size-in-bits='64' hash='407d1119c2cf99b3' id='type-id-117'/>
    <!-- hb_unicode_funcs_t* -->
    <pointer-type-def type-id='type-id-130' size-in-bits='64' hash='407d1119c2cf99b3#2' id='type-id-91'/>
    <!-- hb_unicode_general_category_t (*)(hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <pointer-type-def type-id='type-id-164' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-131'/>
    <!-- unsigned int (*)(hb_unicode_funcs_t*, hb_codepoint_t, hb_codepoint_t*, void*) -->
    <pointer-type-def type-id='type-id-165' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-127'/>
    <!-- unsigned int (*)(hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <pointer-type-def type-id='type-id-166' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-129'/>
    <!-- struct hb_font_t -->
    <class-decl name='hb_font_t' is-struct='yes' visibility='default' size-in-bits='1536' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='91' column='1' hash='fcb76e8a3a1caffc' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_font_t::header -->
        <var-decl name='header' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_bool_t hb_font_t::immutable -->
        <var-decl name='immutable' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- hb_font_t* hb_font_t::parent -->
        <var-decl name='parent' type-id='type-id-167' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- hb_face_t* hb_font_t::face -->
        <var-decl name='face' type-id='type-id-168' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- int hb_font_t::x_scale -->
        <var-decl name='x_scale' type-id='type-id-11' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <!-- int hb_font_t::y_scale -->
        <var-decl name='y_scale' type-id='type-id-11' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- unsigned int hb_font_t::x_ppem -->
        <var-decl name='x_ppem' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <!-- unsigned int hb_font_t::y_ppem -->
        <var-decl name='y_ppem' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- hb_font_funcs_t* hb_font_t::klass -->
        <var-decl name='klass' type-id='type-id-169' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- void* hb_font_t::user_data -->
        <var-decl name='user_data' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- hb_destroy_func_t hb_font_t::destroy -->
        <var-decl name='destroy' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- hb_shaper_data_t hb_font_t::shaper_data -->
        <var-decl name='shaper_data' type-id='type-id-170' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='110' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_language_impl_t -->
    <class-decl name='hb_language_impl_t' is-struct='yes' visibility='default' size-in-bits='8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='167' column='1' hash='21bd801917ba11db' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char hb_language_impl_t::s[1] -->
        <var-decl name='s' type-id='type-id-171' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='168' column='1'/>
      </data-member>
    </class-decl>
    <!-- const char** hb_buffer_serialize_list_formats() -->
    <function-decl name='hb_buffer_serialize_list_formats' mangled-name='hb_buffer_serialize_list_formats' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_list_formats' hash='45957723e80f55da'>
      <!-- const char** -->
      <return type-id='type-id-141'/>
    </function-decl>
    <!-- hb_buffer_serialize_format_t hb_buffer_serialize_format_from_string(const char*, int) -->
    <function-decl name='hb_buffer_serialize_format_from_string' mangled-name='hb_buffer_serialize_format_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_format_from_string' hash='2ab41696a50360fc'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-17' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='63' column='1'/>
      <!-- enum hb_buffer_serialize_format_t -->
      <return type-id='type-id-74'/>
    </function-decl>
    <!-- const char* hb_buffer_serialize_format_to_string(hb_buffer_serialize_format_t) -->
    <function-decl name='hb_buffer_serialize_format_to_string' mangled-name='hb_buffer_serialize_format_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_format_to_string' hash='37910ac7ce74901e'>
      <!-- parameter of type 'enum hb_buffer_serialize_format_t' -->
      <parameter type-id='type-id-74' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='80' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- unsigned int hb_buffer_serialize_glyphs(hb_buffer_t*, unsigned int, unsigned int, char*, unsigned int, unsigned int*, hb_font_t*, hb_buffer_serialize_format_t, hb_buffer_serialize_flags_t) -->
    <function-decl name='hb_buffer_serialize_glyphs' mangled-name='hb_buffer_serialize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_serialize_glyphs' hash='b0318ec41fbd6426'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='246' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='247' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='248' column='1'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-38' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='249' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='250' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-66' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='251' column='1'/>
      <!-- parameter of type 'hb_font_t*' -->
      <parameter type-id='type-id-159' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='252' column='1'/>
      <!-- parameter of type 'enum hb_buffer_serialize_format_t' -->
      <parameter type-id='type-id-74' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='253' column='1'/>
      <!-- parameter of type 'enum hb_buffer_serialize_flags_t' -->
      <parameter type-id='type-id-73' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='254' column='1'/>
      <!-- unsigned int -->
      <return type-id='type-id-18'/>
    </function-decl>
    <!-- hb_bool_t hb_buffer_deserialize_glyphs(hb_buffer_t*, const char*, int, const char**, hb_font_t*, hb_buffer_serialize_format_t) -->
    <function-decl name='hb_buffer_deserialize_glyphs' mangled-name='hb_buffer_deserialize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_deserialize_glyphs' hash='977255daa56c35ee'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='353' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-17' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='354' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='355' column='1'/>
      <!-- parameter of type 'const char**' -->
      <parameter type-id='type-id-141' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='356' column='1'/>
      <!-- parameter of type 'hb_font_t*' -->
      <parameter type-id='type-id-159' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='357' column='1'/>
      <!-- parameter of type 'enum hb_buffer_serialize_format_t' -->
      <parameter type-id='type-id-74' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer-serialize.cc' line='358' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-decl>
    <!-- hb_bool_t (hb_unicode_funcs_t*, hb_codepoint_t, hb_codepoint_t*, hb_codepoint_t*, void*) -->
    <function-type size-in-bits='64' hash='29c5d978b6ccbf03' id='type-id-152'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-91'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'hb_codepoint_t*' -->
      <parameter type-id='type-id-158'/>
      <!-- parameter of type 'hb_codepoint_t*' -->
      <parameter type-id='type-id-158'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-type>
    <!-- hb_bool_t (hb_unicode_funcs_t*, hb_codepoint_t, hb_codepoint_t, hb_codepoint_t*, void*) -->
    <function-type size-in-bits='64' hash='d27439a86e40ae93' id='type-id-153'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-91'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'hb_codepoint_t*' -->
      <parameter type-id='type-id-158'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-type>
    <!-- hb_codepoint_t (hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' hash='3f1f2ea965fe3fa0' id='type-id-157'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-91'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- typedef hb_codepoint_t -->
      <return type-id='type-id-79'/>
    </function-type>
    <!-- hb_script_t (hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' hash='edcb2877dee11a8d' id='type-id-162'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-91'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- enum hb_script_t -->
      <return type-id='type-id-76'/>
    </function-type>
    <!-- hb_unicode_combining_class_t (hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' hash='fc15171d9204fb5d' id='type-id-163'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-91'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- enum hb_unicode_combining_class_t -->
      <return type-id='type-id-77'/>
    </function-type>
    <!-- hb_unicode_general_category_t (hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' hash='ee1d1ff5f1479a23' id='type-id-164'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-91'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- enum hb_unicode_general_category_t -->
      <return type-id='type-id-78'/>
    </function-type>
    <!-- unsigned int (hb_unicode_funcs_t*, hb_codepoint_t, hb_codepoint_t*, void*) -->
    <function-type size-in-bits='64' hash='9bc1994ebe6f781f' id='type-id-165'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-91'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'hb_codepoint_t*' -->
      <parameter type-id='type-id-158'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- unsigned int -->
      <return type-id='type-id-18'/>
    </function-type>
    <!-- unsigned int (hb_unicode_funcs_t*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' hash='3f1f2ea965fe3fa0' id='type-id-166'>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-91'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- unsigned int -->
      <return type-id='type-id-18'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hb-buffer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- struct hb_utf_t<short unsigned int, true> -->
    <class-decl name='hb_utf_t&lt;short unsigned int, true&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='138' column='1' hash='cceb90dfee4f722b' id='type-id-172'/>
    <!-- struct hb_utf_t<unsigned char, true> -->
    <class-decl name='hb_utf_t&lt;unsigned char, true&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='39' column='1' hash='0a1dc120f4ae2205' id='type-id-173'/>
    <!-- struct hb_utf_t<unsigned int, true> -->
    <class-decl name='hb_utf_t&lt;unsigned int, true&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-utf-private.hh' line='32' column='1' hash='3153de52e9f8aad5' id='type-id-174'/>
    <!-- const hb_segment_properties_t -->
    <qualified-type-def type-id='type-id-92' const='yes' hash='6e14e41de72c9975' id='type-id-175'/>
    <!-- const hb_segment_properties_t* -->
    <pointer-type-def type-id='type-id-175' size-in-bits='64' hash='6df2a55282ed33b1' id='type-id-176'/>
    <!-- const uint16_t -->
    <qualified-type-def type-id='type-id-136' const='yes' hash='36aafc789d4497aa' id='type-id-177'/>
    <!-- const uint16_t* -->
    <pointer-type-def type-id='type-id-177' size-in-bits='64' hash='b701c601d134bee8' id='type-id-178'/>
    <!-- const uint32_t -->
    <qualified-type-def type-id='type-id-99' const='yes' hash='c615287ae67f9bdd' id='type-id-179'/>
    <!-- const uint32_t* -->
    <pointer-type-def type-id='type-id-179' size-in-bits='64' hash='1a33a64521c642b5' id='type-id-180'/>
    <!-- const uint8_t -->
    <qualified-type-def type-id='type-id-138' const='yes' hash='5a6582fbecdbfc78' id='type-id-181'/>
    <!-- const uint8_t* -->
    <pointer-type-def type-id='type-id-181' size-in-bits='64' hash='d2a42ec7d4838233' id='type-id-182'/>
    <!-- hb_buffer_t* const -->
    <qualified-type-def type-id='type-id-154' const='yes' hash='59e688c571f78367' id='type-id-183'/>
    <!-- hb_segment_properties_t* -->
    <pointer-type-def type-id='type-id-92' size-in-bits='64' hash='f55f69542bb4c6cf' id='type-id-184'/>
    <!-- hb_unicode_funcs_t* const -->
    <qualified-type-def type-id='type-id-117' const='yes' hash='0a886ef73f71caf2' id='type-id-185'/>
    <!-- hb_bool_t hb_segment_properties_equal(const hb_segment_properties_t*, const hb_segment_properties_t*) -->
    <function-decl name='hb_segment_properties_equal' mangled-name='hb_segment_properties_equal' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_segment_properties_equal' hash='15916b0eefbf143b'>
      <!-- parameter of type 'const hb_segment_properties_t*' -->
      <parameter type-id='type-id-176' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='40' column='1'/>
      <!-- parameter of type 'const hb_segment_properties_t*' -->
      <parameter type-id='type-id-176' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='41' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-decl>
    <!-- unsigned int hb_segment_properties_hash(const hb_segment_properties_t*) -->
    <function-decl name='hb_segment_properties_hash' mangled-name='hb_segment_properties_hash' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_segment_properties_hash' hash='4ceb70c3cb4c2eba'>
      <!-- parameter of type 'const hb_segment_properties_t*' -->
      <parameter type-id='type-id-176' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='52' column='1'/>
      <!-- unsigned int -->
      <return type-id='type-id-18'/>
    </function-decl>
    <!-- hb_buffer_t* hb_buffer_create() -->
    <function-decl name='hb_buffer_create' mangled-name='hb_buffer_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_create' hash='bcf3460e7eb0242a'>
      <!-- hb_buffer_t* -->
      <return type-id='type-id-155'/>
    </function-decl>
    <!-- hb_buffer_t* hb_buffer_get_empty() -->
    <function-decl name='hb_buffer_get_empty' mangled-name='hb_buffer_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_empty' hash='bcf3460e7eb0242a'>
      <!-- hb_buffer_t* -->
      <return type-id='type-id-155'/>
    </function-decl>
    <!-- hb_buffer_t* hb_buffer_reference(hb_buffer_t*) -->
    <function-decl name='hb_buffer_reference' mangled-name='hb_buffer_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reference' hash='8eb18b1b0d3344c6'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='731' column='1'/>
      <!-- hb_buffer_t* -->
      <return type-id='type-id-155'/>
    </function-decl>
    <!-- void hb_buffer_destroy(hb_buffer_t*) -->
    <function-decl name='hb_buffer_destroy' mangled-name='hb_buffer_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_destroy' hash='bcf3460e7eb0242a'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_bool_t hb_buffer_set_user_data(hb_buffer_t*, hb_user_data_key_t*, void*, hb_destroy_func_t, hb_bool_t) -->
    <function-decl name='hb_buffer_set_user_data' mangled-name='hb_buffer_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_user_data' hash='4c7e1f57dd9feed7'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='772' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='type-id-29' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='773' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='774' column='1'/>
      <!-- parameter of type 'typedef hb_destroy_func_t' -->
      <parameter type-id='type-id-20' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='775' column='1'/>
      <!-- parameter of type 'typedef hb_bool_t' -->
      <parameter type-id='type-id-33' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='776' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-decl>
    <!-- void* hb_buffer_get_user_data(hb_buffer_t*, hb_user_data_key_t*) -->
    <function-decl name='hb_buffer_get_user_data' mangled-name='hb_buffer_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_user_data' hash='2d50d4462a04d741'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='793' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='type-id-29' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='794' column='1'/>
      <!-- void* -->
      <return type-id='type-id-19'/>
    </function-decl>
    <!-- void hb_buffer_set_content_type(hb_buffer_t*, hb_buffer_content_type_t) -->
    <function-decl name='hb_buffer_set_content_type' mangled-name='hb_buffer_set_content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='810' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_content_type' hash='1e74328df891d219'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='810' column='1'/>
      <!-- parameter of type 'enum hb_buffer_content_type_t' -->
      <parameter type-id='type-id-71' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='811' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_buffer_content_type_t hb_buffer_get_content_type(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_content_type' mangled-name='hb_buffer_get_content_type' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_content_type' hash='b4966671876028aa'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='827' column='1'/>
      <!-- enum hb_buffer_content_type_t -->
      <return type-id='type-id-71'/>
    </function-decl>
    <!-- void hb_buffer_set_unicode_funcs(hb_buffer_t*, hb_unicode_funcs_t*) -->
    <function-decl name='hb_buffer_set_unicode_funcs' mangled-name='hb_buffer_set_unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_unicode_funcs' hash='5cddc38df87ca58a'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='843' column='1'/>
      <!-- parameter of type 'hb_unicode_funcs_t*' -->
      <parameter type-id='type-id-91' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='844' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_unicode_funcs_t* hb_buffer_get_unicode_funcs(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_unicode_funcs' mangled-name='hb_buffer_get_unicode_funcs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='869' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_unicode_funcs' hash='5974617b2b4907b4'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='869' column='1'/>
      <!-- hb_unicode_funcs_t* -->
      <return type-id='type-id-91'/>
    </function-decl>
    <!-- void hb_buffer_set_direction(hb_buffer_t*, hb_direction_t) -->
    <function-decl name='hb_buffer_set_direction' mangled-name='hb_buffer_set_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_direction' hash='872efdef38f6260a'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='884' column='1'/>
      <!-- parameter of type 'enum hb_direction_t' -->
      <parameter type-id='type-id-75' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='885' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_direction_t hb_buffer_get_direction(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_direction' mangled-name='hb_buffer_get_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_direction' hash='6e4e11983b2efd2a'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='905' column='1'/>
      <!-- enum hb_direction_t -->
      <return type-id='type-id-75'/>
    </function-decl>
    <!-- void hb_buffer_set_script(hb_buffer_t*, hb_script_t) -->
    <function-decl name='hb_buffer_set_script' mangled-name='hb_buffer_set_script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_script' hash='1be7fe47450f2b73'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='920' column='1'/>
      <!-- parameter of type 'enum hb_script_t' -->
      <parameter type-id='type-id-76' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='921' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_script_t hb_buffer_get_script(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_script' mangled-name='hb_buffer_get_script' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='940' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_script' hash='37ca86f3702bbad5'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='940' column='1'/>
      <!-- enum hb_script_t -->
      <return type-id='type-id-76'/>
    </function-decl>
    <!-- void hb_buffer_set_language(hb_buffer_t*, hb_language_t) -->
    <function-decl name='hb_buffer_set_language' mangled-name='hb_buffer_set_language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_language' hash='9d51c745256dfd73'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='955' column='1'/>
      <!-- parameter of type 'typedef hb_language_t' -->
      <parameter type-id='type-id-104' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='956' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_language_t hb_buffer_get_language(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_language' mangled-name='hb_buffer_get_language' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='975' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_language' hash='61076fe9fa6c9357'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='975' column='1'/>
      <!-- typedef hb_language_t -->
      <return type-id='type-id-104'/>
    </function-decl>
    <!-- void hb_buffer_set_segment_properties(hb_buffer_t*, const hb_segment_properties_t*) -->
    <function-decl name='hb_buffer_set_segment_properties' mangled-name='hb_buffer_set_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='990' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_segment_properties' hash='67c434e1254ab250'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='990' column='1'/>
      <!-- parameter of type 'const hb_segment_properties_t*' -->
      <parameter type-id='type-id-176' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='991' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- void hb_buffer_get_segment_properties(hb_buffer_t*, hb_segment_properties_t*) -->
    <function-decl name='hb_buffer_get_segment_properties' mangled-name='hb_buffer_get_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_segment_properties' hash='e0f58302a67b7d7b'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1009' column='1'/>
      <!-- parameter of type 'hb_segment_properties_t*' -->
      <parameter type-id='type-id-184' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1010' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- void hb_buffer_set_flags(hb_buffer_t*, hb_buffer_flags_t) -->
    <function-decl name='hb_buffer_set_flags' mangled-name='hb_buffer_set_flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_flags' hash='65f1cf9d35920f11'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1026' column='1'/>
      <!-- parameter of type 'enum hb_buffer_flags_t' -->
      <parameter type-id='type-id-72' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1027' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_buffer_flags_t hb_buffer_get_flags(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_flags' mangled-name='hb_buffer_get_flags' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1046' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_flags' hash='e321a7b63768c08f'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1046' column='1'/>
      <!-- enum hb_buffer_flags_t -->
      <return type-id='type-id-72'/>
    </function-decl>
    <!-- void hb_buffer_set_replacement_codepoint(hb_buffer_t*, hb_codepoint_t) -->
    <function-decl name='hb_buffer_set_replacement_codepoint' mangled-name='hb_buffer_set_replacement_codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1062' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_replacement_codepoint' hash='0c3bd7d406eece6f'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1062' column='1'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1063' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_codepoint_t hb_buffer_get_replacement_codepoint(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_replacement_codepoint' mangled-name='hb_buffer_get_replacement_codepoint' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_replacement_codepoint' hash='5736f53ea24415fa'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1082' column='1'/>
      <!-- typedef hb_codepoint_t -->
      <return type-id='type-id-79'/>
    </function-decl>
    <!-- void hb_buffer_reset(hb_buffer_t*) -->
    <function-decl name='hb_buffer_reset' mangled-name='hb_buffer_reset' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1097' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reset' hash='bcf3460e7eb0242a'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- void hb_buffer_clear_contents(hb_buffer_t*) -->
    <function-decl name='hb_buffer_clear_contents' mangled-name='hb_buffer_clear_contents' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_clear_contents' hash='bcf3460e7eb0242a'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_bool_t hb_buffer_pre_allocate(hb_buffer_t*, unsigned int) -->
    <function-decl name='hb_buffer_pre_allocate' mangled-name='hb_buffer_pre_allocate' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_pre_allocate' hash='48995bda6cb5029f'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-decl>
    <!-- hb_bool_t hb_buffer_allocation_successful(hb_buffer_t*) -->
    <function-decl name='hb_buffer_allocation_successful' mangled-name='hb_buffer_allocation_successful' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_allocation_successful' hash='541498b2fbea2960'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1144' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-decl>
    <!-- void hb_buffer_add(hb_buffer_t*, hb_codepoint_t, unsigned int) -->
    <function-decl name='hb_buffer_add' mangled-name='hb_buffer_add' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add' hash='8c6e68b8eb6a94a8'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1160' column='1'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1161' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1162' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_bool_t hb_buffer_set_length(hb_buffer_t*, unsigned int) -->
    <function-decl name='hb_buffer_set_length' mangled-name='hb_buffer_set_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_set_length' hash='48995bda6cb5029f'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1128' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-decl>
    <!-- unsigned int hb_buffer_get_length(hb_buffer_t*) -->
    <function-decl name='hb_buffer_get_length' mangled-name='hb_buffer_get_length' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_length' hash='5736f53ea24415fa'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1219' column='1'/>
      <!-- unsigned int -->
      <return type-id='type-id-18'/>
    </function-decl>
    <!-- hb_glyph_info_t* hb_buffer_get_glyph_infos(hb_buffer_t*, unsigned int*) -->
    <function-decl name='hb_buffer_get_glyph_infos' mangled-name='hb_buffer_get_glyph_infos' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_glyph_infos' hash='46567f9a9284cb1e'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1237' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-66' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1238' column='1'/>
      <!-- hb_glyph_info_t* -->
      <return type-id='type-id-93'/>
    </function-decl>
    <!-- hb_glyph_position_t* hb_buffer_get_glyph_positions(hb_buffer_t*, unsigned int*) -->
    <function-decl name='hb_buffer_get_glyph_positions' mangled-name='hb_buffer_get_glyph_positions' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_get_glyph_positions' hash='1a52270f2ed9e314'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1259' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-66' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1260' column='1'/>
      <!-- hb_glyph_position_t* -->
      <return type-id='type-id-94'/>
    </function-decl>
    <!-- void hb_buffer_reverse(hb_buffer_t*) -->
    <function-decl name='hb_buffer_reverse' mangled-name='hb_buffer_reverse' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reverse' hash='bcf3460e7eb0242a'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- void hb_buffer_reverse_clusters(hb_buffer_t*) -->
    <function-decl name='hb_buffer_reverse_clusters' mangled-name='hb_buffer_reverse_clusters' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_reverse_clusters' hash='bcf3460e7eb0242a'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- void hb_buffer_guess_segment_properties(hb_buffer_t*) -->
    <function-decl name='hb_buffer_guess_segment_properties' mangled-name='hb_buffer_guess_segment_properties' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_guess_segment_properties' hash='bcf3460e7eb0242a'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- void hb_buffer_add_utf8(hb_buffer_t*, const char*, int, unsigned int, int) -->
    <function-decl name='hb_buffer_add_utf8' mangled-name='hb_buffer_add_utf8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf8' hash='662acfda4d5ae5bd'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1413' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-17' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1414' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1415' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1416' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1417' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- void hb_buffer_add_utf16(hb_buffer_t*, const uint16_t*, int, unsigned int, int) -->
    <function-decl name='hb_buffer_add_utf16' mangled-name='hb_buffer_add_utf16' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf16' hash='41ce5bd6ff9fa7c5'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1435' column='1'/>
      <!-- parameter of type 'const uint16_t*' -->
      <parameter type-id='type-id-178' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1436' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1437' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1438' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1439' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- void hb_buffer_add_utf32(hb_buffer_t*, const uint32_t*, int, unsigned int, int) -->
    <function-decl name='hb_buffer_add_utf32' mangled-name='hb_buffer_add_utf32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_utf32' hash='6cb00caec71a2eae'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1457' column='1'/>
      <!-- parameter of type 'const uint32_t*' -->
      <parameter type-id='type-id-180' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1458' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1459' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1460' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1461' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- void hb_buffer_add_codepoints(hb_buffer_t*, const hb_codepoint_t*, int, unsigned int, int) -->
    <function-decl name='hb_buffer_add_codepoints' mangled-name='hb_buffer_add_codepoints' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_add_codepoints' hash='16212a31174d3518'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1479' column='1'/>
      <!-- parameter of type 'const hb_codepoint_t*' -->
      <parameter type-id='type-id-145' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1480' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1481' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1482' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1483' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- void hb_buffer_normalize_glyphs(hb_buffer_t*) -->
    <function-decl name='hb_buffer_normalize_glyphs' mangled-name='hb_buffer_normalize_glyphs' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_buffer_normalize_glyphs' hash='bcf3460e7eb0242a'>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-buffer.cc' line='1280' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hb-common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- char[1] -->
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='type-id-186'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-187'/>
    </array-type-def>
    <!-- const char[1] -->
    <array-type-def dimensions='1' type-id='type-id-39' size-in-bits='8' hash='dfb4f88ba235407c' id='type-id-171'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-187'/>
    </array-type-def>
    <!-- struct hb_language_item_t -->
    <class-decl name='hb_language_item_t' is-struct='yes' visibility='default' size-in-bits='128' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='212' column='1' hash='4636bbec1b460751' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_language_item_t* hb_language_item_t::next -->
        <var-decl name='next' type-id='type-id-189' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_language_t hb_language_item_t::lang -->
        <var-decl name='lang' type-id='type-id-104' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='215' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef uint32_t hb_tag_t -->
    <typedef-decl name='hb_tag_t' type-id='type-id-99' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.h' line='91' column='1' hash='e66b43f97c38e87a' id='type-id-190'/>
    <!-- const hb_language_item_t -->
    <qualified-type-def type-id='type-id-188' const='yes' hash='30049fc5bf45e1fc' id='type-id-191'/>
    <!-- const hb_language_item_t* -->
    <pointer-type-def type-id='type-id-191' size-in-bits='64' hash='3de90a14de7df642' id='type-id-192'/>
    <!-- const hb_language_item_t* const -->
    <qualified-type-def type-id='type-id-192' const='yes' hash='73191568f187b541' id='type-id-193'/>
    <!-- const hb_user_data_array_t::hb_user_data_item_t* const -->
    <qualified-type-def type-id='type-id-51' const='yes' hash='ed102b24a373e598' id='type-id-194'/>
    <!-- hb_language_item_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-188' size-in-bits='64' hash='4ab2bac0d7fc8633' id='type-id-195'/>
    <!-- hb_language_item_t* -->
    <pointer-type-def type-id='type-id-188' size-in-bits='64' hash='2985a784e99d060c' id='type-id-189'/>
    <!-- hb_language_item_t* const -->
    <qualified-type-def type-id='type-id-189' const='yes' hash='2aad5e50ade30d52' id='type-id-196'/>
    <!-- hb_tag_t hb_tag_from_string(const char*, int) -->
    <function-decl name='hb_tag_from_string' mangled-name='hb_tag_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_tag_from_string' hash='b2e37f487eba6d4b'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-17' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='70' column='1'/>
      <!-- typedef hb_tag_t -->
      <return type-id='type-id-190'/>
    </function-decl>
    <!-- void hb_tag_to_string(hb_tag_t, char*) -->
    <function-decl name='hb_tag_to_string' mangled-name='hb_tag_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_tag_to_string' hash='5877206f952a016f'>
      <!-- parameter of type 'typedef hb_tag_t' -->
      <parameter type-id='type-id-190' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-38' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='98' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_direction_t hb_direction_from_string(const char*, int) -->
    <function-decl name='hb_direction_from_string' mangled-name='hb_direction_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_direction_from_string' hash='f73eeaeba53ea8b5'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-17' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='128' column='1'/>
      <!-- enum hb_direction_t -->
      <return type-id='type-id-75'/>
    </function-decl>
    <!-- const char* hb_direction_to_string(hb_direction_t) -->
    <function-decl name='hb_direction_to_string' mangled-name='hb_direction_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_direction_to_string' hash='3856de404e9592d7'>
      <!-- parameter of type 'enum hb_direction_t' -->
      <parameter type-id='type-id-75' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='155' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- hb_language_t hb_language_from_string(const char*, int) -->
    <function-decl name='hb_language_from_string' mangled-name='hb_language_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_from_string' hash='4c00ce573977a290'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-17' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='293' column='1'/>
      <!-- typedef hb_language_t -->
      <return type-id='type-id-104'/>
    </function-decl>
    <!-- const char* hb_language_to_string(hb_language_t) -->
    <function-decl name='hb_language_to_string' mangled-name='hb_language_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_to_string' hash='a4c8107dab1ed367'>
      <!-- parameter of type 'typedef hb_language_t' -->
      <parameter type-id='type-id-104' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='325' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- hb_language_t hb_language_get_default() -->
    <function-decl name='hb_language_get_default' mangled-name='hb_language_get_default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_language_get_default' hash='fed169eac73c5535'>
      <!-- typedef hb_language_t -->
      <return type-id='type-id-104'/>
    </function-decl>
    <!-- hb_script_t hb_script_from_iso15924_tag(hb_tag_t) -->
    <function-decl name='hb_script_from_iso15924_tag' mangled-name='hb_script_from_iso15924_tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_from_iso15924_tag' hash='4bbaa5d52cdaffb0'>
      <!-- parameter of type 'typedef hb_tag_t' -->
      <parameter type-id='type-id-190' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='368' column='1'/>
      <!-- enum hb_script_t -->
      <return type-id='type-id-76'/>
    </function-decl>
    <!-- hb_script_t hb_script_from_string(const char*, int) -->
    <function-decl name='hb_script_from_string' mangled-name='hb_script_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_from_string' hash='dc8226cfa433dca5'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-17' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-11' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='413' column='1'/>
      <!-- enum hb_script_t -->
      <return type-id='type-id-76'/>
    </function-decl>
    <!-- hb_tag_t hb_script_to_iso15924_tag(hb_script_t) -->
    <function-decl name='hb_script_to_iso15924_tag' mangled-name='hb_script_to_iso15924_tag' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_to_iso15924_tag' hash='cf97d9f5606764ea'>
      <!-- parameter of type 'enum hb_script_t' -->
      <parameter type-id='type-id-76' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='429' column='1'/>
      <!-- typedef hb_tag_t -->
      <return type-id='type-id-190'/>
    </function-decl>
    <!-- hb_direction_t hb_script_get_horizontal_direction(hb_script_t) -->
    <function-decl name='hb_script_get_horizontal_direction' mangled-name='hb_script_get_horizontal_direction' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_script_get_horizontal_direction' hash='c712a21b6cb831c2'>
      <!-- parameter of type 'enum hb_script_t' -->
      <parameter type-id='type-id-76' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='445' column='1'/>
      <!-- enum hb_direction_t -->
      <return type-id='type-id-75'/>
    </function-decl>
    <!-- void hb_version(unsigned int*, unsigned int*, unsigned int*) -->
    <function-decl name='hb_version' mangled-name='hb_version' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version' hash='741908f7a6761f36'>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-66' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='547' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-66' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='548' column='1'/>
      <!-- parameter of type 'unsigned int*' -->
      <parameter type-id='type-id-66' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='549' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- const char* hb_version_string() -->
    <function-decl name='hb_version_string' mangled-name='hb_version_string' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version_string' hash='53885bde0aa65efe'>
      <!-- const char* -->
      <return type-id='type-id-17'/>
    </function-decl>
    <!-- hb_bool_t hb_version_atleast(unsigned int, unsigned int, unsigned int) -->
    <function-decl name='hb_version_atleast' mangled-name='hb_version_atleast' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_version_atleast' hash='9b5e3cc521d97890'>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='584' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='585' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-common.cc' line='586' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hb-face.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >[1] -->
    <array-type-def dimensions='1' type-id='type-id-197' size-in-bits='32' hash='973f68c4506f4fbd' id='type-id-198'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-187'/>
    </array-type-def>
    <!-- OT::TableRecord[1] -->
    <array-type-def dimensions='1' type-id='type-id-199' size-in-bits='128' hash='110f124f698b4d4e' id='type-id-200'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-187'/>
    </array-type-def>
    <!-- struct hb_auto_trace_t<0, bool> -->
    <class-decl name='hb_auto_trace_t&lt;0, bool&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-private.hh' line='749' column='1' hash='25cb230d0a2f6532' id='type-id-201'/>
    <!-- struct hb_face_t -->
    <class-decl name='hb_face_t' is-struct='yes' visibility='default' size-in-bits='1472' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='43' column='1' hash='beb9dc4279cf089a' id='type-id-202'>
      <member-type access='public'>
        <!-- struct hb_face_t::plan_node_t -->
        <class-decl name='plan_node_t' is-struct='yes' visibility='default' size-in-bits='128' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='59' column='1' hash='5e8c43e01cac4739' id='type-id-203'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_shape_plan_t* hb_face_t::plan_node_t::shape_plan -->
            <var-decl name='shape_plan' type-id='type-id-204' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='60' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_face_t::plan_node_t* hb_face_t::plan_node_t::next -->
            <var-decl name='next' type-id='type-id-205' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='61' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_face_t::header -->
        <var-decl name='header' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_bool_t hb_face_t::immutable -->
        <var-decl name='immutable' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- hb_reference_table_func_t hb_face_t::reference_table_func -->
        <var-decl name='reference_table_func' type-id='type-id-206' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- void* hb_face_t::user_data -->
        <var-decl name='user_data' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- hb_destroy_func_t hb_face_t::destroy -->
        <var-decl name='destroy' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- unsigned int hb_face_t::index -->
        <var-decl name='index' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <!-- unsigned int hb_face_t::upem -->
        <var-decl name='upem' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- unsigned int hb_face_t::num_glyphs -->
        <var-decl name='num_glyphs' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- hb_shaper_data_t hb_face_t::shaper_data -->
        <var-decl name='shaper_data' type-id='type-id-170' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- hb_face_t::plan_node_t* hb_face_t::shape_plans -->
        <var-decl name='shape_plans' type-id='type-id-205' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face-private.hh' line='62' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_feature_t -->
    <class-decl name='hb_feature_t' is-struct='yes' visibility='default' size-in-bits='128' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='43' column='1' hash='cba6d8ec4c5a8fd4' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_tag_t hb_feature_t::tag -->
        <var-decl name='tag' type-id='type-id-190' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- uint32_t hb_feature_t::value -->
        <var-decl name='value' type-id='type-id-99' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned int hb_feature_t::start -->
        <var-decl name='start' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- unsigned int hb_feature_t::end -->
        <var-decl name='end' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_font_funcs_t -->
    <class-decl name='hb_font_funcs_t' is-struct='yes' visibility='default' size-in-bits='3072' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='58' column='1' hash='ed12f2842b860250' id='type-id-208'>
      <member-type access='public'>
        <!-- struct {hb_destroy_func_t glyph; hb_destroy_func_t glyph_h_advance; hb_destroy_func_t glyph_v_advance; hb_destroy_func_t glyph_h_origin; hb_destroy_func_t glyph_v_origin; hb_destroy_func_t glyph_h_kerning; hb_destroy_func_t glyph_v_kerning; hb_destroy_func_t glyph_extents; hb_destroy_func_t glyph_contour_point; hb_destroy_func_t glyph_name; hb_destroy_func_t glyph_from_name;} -->
        <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='704' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='78' column='1' hash='ae7a4b981da9dbc4#4' id='type-id-209'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_destroy_func_t glyph -->
            <var-decl name='glyph' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_destroy_func_t glyph_h_advance -->
            <var-decl name='glyph_h_advance' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_destroy_func_t glyph_v_advance -->
            <var-decl name='glyph_v_advance' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- hb_destroy_func_t glyph_h_origin -->
            <var-decl name='glyph_h_origin' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- hb_destroy_func_t glyph_v_origin -->
            <var-decl name='glyph_v_origin' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- hb_destroy_func_t glyph_h_kerning -->
            <var-decl name='glyph_h_kerning' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- hb_destroy_func_t glyph_v_kerning -->
            <var-decl name='glyph_v_kerning' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- hb_destroy_func_t glyph_extents -->
            <var-decl name='glyph_extents' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <!-- hb_destroy_func_t glyph_contour_point -->
            <var-decl name='glyph_contour_point' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <!-- hb_destroy_func_t glyph_name -->
            <var-decl name='glyph_name' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <!-- hb_destroy_func_t glyph_from_name -->
            <var-decl name='glyph_from_name' type-id='type-id-20' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='80' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <!-- struct {hb_font_get_glyph_func_t glyph; hb_font_get_glyph_h_advance_func_t glyph_h_advance; hb_font_get_glyph_v_advance_func_t glyph_v_advance; hb_font_get_glyph_h_origin_func_t glyph_h_origin; hb_font_get_glyph_v_origin_func_t glyph_v_origin; hb_font_get_glyph_h_kerning_func_t glyph_h_kerning; hb_font_get_glyph_v_kerning_func_t glyph_v_kerning; hb_font_get_glyph_extents_func_t glyph_extents; hb_font_get_glyph_contour_point_func_t glyph_contour_point; hb_font_get_glyph_name_func_t glyph_name; hb_font_get_glyph_from_name_func_t glyph_from_name;} -->
        <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='704' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='66' column='1' hash='ae7a4b981da9dbc4#5' id='type-id-210'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- hb_font_get_glyph_func_t glyph -->
            <var-decl name='glyph' type-id='type-id-211' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- hb_font_get_glyph_h_advance_func_t glyph_h_advance -->
            <var-decl name='glyph_h_advance' type-id='type-id-212' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- hb_font_get_glyph_v_advance_func_t glyph_v_advance -->
            <var-decl name='glyph_v_advance' type-id='type-id-213' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- hb_font_get_glyph_h_origin_func_t glyph_h_origin -->
            <var-decl name='glyph_h_origin' type-id='type-id-214' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- hb_font_get_glyph_v_origin_func_t glyph_v_origin -->
            <var-decl name='glyph_v_origin' type-id='type-id-215' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- hb_font_get_glyph_h_kerning_func_t glyph_h_kerning -->
            <var-decl name='glyph_h_kerning' type-id='type-id-216' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- hb_font_get_glyph_v_kerning_func_t glyph_v_kerning -->
            <var-decl name='glyph_v_kerning' type-id='type-id-217' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- hb_font_get_glyph_extents_func_t glyph_extents -->
            <var-decl name='glyph_extents' type-id='type-id-218' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <!-- hb_font_get_glyph_contour_point_func_t glyph_contour_point -->
            <var-decl name='glyph_contour_point' type-id='type-id-219' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <!-- hb_font_get_glyph_name_func_t glyph_name -->
            <var-decl name='glyph_name' type-id='type-id-220' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <!-- hb_font_get_glyph_from_name_func_t glyph_from_name -->
            <var-decl name='glyph_from_name' type-id='type-id-221' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='68' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <!-- struct {void* glyph; void* glyph_h_advance; void* glyph_v_advance; void* glyph_h_origin; void* glyph_v_origin; void* glyph_h_kerning; void* glyph_v_kerning; void* glyph_extents; void* glyph_contour_point; void* glyph_name; void* glyph_from_name;} -->
        <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='704' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='72' column='1' hash='3e9c86b97540ae32#8' id='type-id-222'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- void* glyph -->
            <var-decl name='glyph' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- void* glyph_h_advance -->
            <var-decl name='glyph_h_advance' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- void* glyph_v_advance -->
            <var-decl name='glyph_v_advance' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- void* glyph_h_origin -->
            <var-decl name='glyph_h_origin' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- void* glyph_v_origin -->
            <var-decl name='glyph_v_origin' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <!-- void* glyph_h_kerning -->
            <var-decl name='glyph_h_kerning' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='384'>
            <!-- void* glyph_v_kerning -->
            <var-decl name='glyph_v_kerning' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='448'>
            <!-- void* glyph_extents -->
            <var-decl name='glyph_extents' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='512'>
            <!-- void* glyph_contour_point -->
            <var-decl name='glyph_contour_point' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='576'>
            <!-- void* glyph_name -->
            <var-decl name='glyph_name' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='640'>
            <!-- void* glyph_from_name -->
            <var-decl name='glyph_from_name' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='74' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_font_funcs_t::header -->
        <var-decl name='header' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_bool_t hb_font_funcs_t::immutable -->
        <var-decl name='immutable' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- struct {hb_font_get_glyph_func_t glyph; hb_font_get_glyph_h_advance_func_t glyph_h_advance; hb_font_get_glyph_v_advance_func_t glyph_v_advance; hb_font_get_glyph_h_origin_func_t glyph_h_origin; hb_font_get_glyph_v_origin_func_t glyph_v_origin; hb_font_get_glyph_h_kerning_func_t glyph_h_kerning; hb_font_get_glyph_v_kerning_func_t glyph_v_kerning; hb_font_get_glyph_extents_func_t glyph_extents; hb_font_get_glyph_contour_point_func_t glyph_contour_point; hb_font_get_glyph_name_func_t glyph_name; hb_font_get_glyph_from_name_func_t glyph_from_name;} hb_font_funcs_t::get -->
        <var-decl name='get' type-id='type-id-210' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <!-- struct {void* glyph; void* glyph_h_advance; void* glyph_v_advance; void* glyph_h_origin; void* glyph_v_origin; void* glyph_h_kerning; void* glyph_v_kerning; void* glyph_extents; void* glyph_contour_point; void* glyph_name; void* glyph_from_name;} hb_font_funcs_t::user_data -->
        <var-decl name='user_data' type-id='type-id-222' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <!-- struct {hb_destroy_func_t glyph; hb_destroy_func_t glyph_h_advance; hb_destroy_func_t glyph_v_advance; hb_destroy_func_t glyph_h_origin; hb_destroy_func_t glyph_v_origin; hb_destroy_func_t glyph_h_kerning; hb_destroy_func_t glyph_v_kerning; hb_destroy_func_t glyph_extents; hb_destroy_func_t glyph_contour_point; hb_destroy_func_t glyph_name; hb_destroy_func_t glyph_from_name;} hb_font_funcs_t::destroy -->
        <var-decl name='destroy' type-id='type-id-209' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font-private.hh' line='82' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_glyph_extents_t -->
    <class-decl name='hb_glyph_extents_t' is-struct='yes' visibility='default' size-in-bits='128' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='84' column='1' hash='4d84b536bc7caefc' id='type-id-223'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_position_t hb_glyph_extents_t::x_bearing -->
        <var-decl name='x_bearing' type-id='type-id-102' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- hb_position_t hb_glyph_extents_t::y_bearing -->
        <var-decl name='y_bearing' type-id='type-id-102' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- hb_position_t hb_glyph_extents_t::width -->
        <var-decl name='width' type-id='type-id-102' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- hb_position_t hb_glyph_extents_t::height -->
        <var-decl name='height' type-id='type-id-102' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_shape_plan_t -->
    <class-decl name='hb_shape_plan_t' is-struct='yes' visibility='default' size-in-bits='1664' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='36' column='1' hash='1770a0176b296834' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- hb_object_header_t hb_shape_plan_t::header -->
        <var-decl name='header' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- hb_bool_t hb_shape_plan_t::default_shaper_list -->
        <var-decl name='default_shaper_list' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- hb_face_t* hb_shape_plan_t::face_unsafe -->
        <var-decl name='face_unsafe' type-id='type-id-168' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- hb_segment_properties_t hb_shape_plan_t::props -->
        <var-decl name='props' type-id='type-id-92' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- hb_shape_func_t* hb_shape_plan_t::shaper_func -->
        <var-decl name='shaper_func' type-id='type-id-225' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- const char* hb_shape_plan_t::shaper_name -->
        <var-decl name='shaper_name' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- hb_feature_t* hb_shape_plan_t::user_features -->
        <var-decl name='user_features' type-id='type-id-226' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <!-- unsigned int hb_shape_plan_t::num_user_features -->
        <var-decl name='num_user_features' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <!-- hb_shaper_data_t hb_shape_plan_t::shaper_data -->
        <var-decl name='shaper_data' type-id='type-id-170' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan-private.hh' line='50' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct hb_shaper_data_t -->
    <class-decl name='hb_shaper_data_t' is-struct='yes' visibility='default' size-in-bits='128' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-private.hh' line='53' column='1' hash='e5ee13cb42d8922a' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* hb_shaper_data_t::ot -->
        <var-decl name='ot' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-list.hh' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* hb_shaper_data_t::fallback -->
        <var-decl name='fallback' type-id='type-id-19' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-list.hh' line='54' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef hb_face_t hb_face_t -->
    <typedef-decl name='hb_face_t' type-id='type-id-202' size-in-bits='1472' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.h' line='44' column='1' id='type-id-227'/>
    <!-- typedef hb_feature_t hb_feature_t -->
    <typedef-decl name='hb_feature_t' type-id='type-id-207' size-in-bits='128' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape.h' line='48' column='1' id='type-id-228'/>
    <!-- typedef hb_font_funcs_t hb_font_funcs_t -->
    <typedef-decl name='hb_font_funcs_t' type-id='type-id-208' size-in-bits='3072' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='47' column='1' id='type-id-229'/>
    <!-- typedef hb_position_t (*)(hb_font_t*, void*, hb_codepoint_t, void*) hb_font_get_glyph_advance_func_t -->
    <typedef-decl name='hb_font_get_glyph_advance_func_t' type-id='type-id-230' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='102' column='1' hash='fd7a63c0c6c822c4' id='type-id-231'/>
    <!-- typedef hb_bool_t (*)(hb_font_t*, void*, hb_codepoint_t, unsigned int, hb_position_t*, hb_position_t*, void*) hb_font_get_glyph_contour_point_func_t -->
    <typedef-decl name='hb_font_get_glyph_contour_point_func_t' type-id='type-id-232' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='127' column='1' hash='fd7a63c0c6c822c4' id='type-id-219'/>
    <!-- typedef hb_bool_t (*)(hb_font_t*, void*, hb_codepoint_t, hb_glyph_extents_t*, void*) hb_font_get_glyph_extents_func_t -->
    <typedef-decl name='hb_font_get_glyph_extents_func_t' type-id='type-id-233' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='123' column='1' hash='fd7a63c0c6c822c4' id='type-id-218'/>
    <!-- typedef hb_bool_t (*)(hb_font_t*, void*, const char*, int, hb_codepoint_t*, void*) hb_font_get_glyph_from_name_func_t -->
    <typedef-decl name='hb_font_get_glyph_from_name_func_t' type-id='type-id-234' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='137' column='1' hash='fd7a63c0c6c822c4' id='type-id-221'/>
    <!-- typedef hb_bool_t (*)(hb_font_t*, void*, hb_codepoint_t, hb_codepoint_t, hb_codepoint_t*, void*) hb_font_get_glyph_func_t -->
    <typedef-decl name='hb_font_get_glyph_func_t' type-id='type-id-235' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='97' column='1' hash='fd7a63c0c6c822c4' id='type-id-211'/>
    <!-- typedef hb_font_get_glyph_advance_func_t hb_font_get_glyph_h_advance_func_t -->
    <typedef-decl name='hb_font_get_glyph_h_advance_func_t' type-id='type-id-231' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='103' column='1' hash='fd7a63c0c6c822c4' id='type-id-212'/>
    <!-- typedef hb_font_get_glyph_kerning_func_t hb_font_get_glyph_h_kerning_func_t -->
    <typedef-decl name='hb_font_get_glyph_h_kerning_func_t' type-id='type-id-236' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='116' column='1' hash='fd7a63c0c6c822c4' id='type-id-216'/>
    <!-- typedef hb_font_get_glyph_origin_func_t hb_font_get_glyph_h_origin_func_t -->
    <typedef-decl name='hb_font_get_glyph_h_origin_func_t' type-id='type-id-237' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='110' column='1' hash='fd7a63c0c6c822c4' id='type-id-214'/>
    <!-- typedef hb_position_t (*)(hb_font_t*, void*, hb_codepoint_t, hb_codepoint_t, void*) hb_font_get_glyph_kerning_func_t -->
    <typedef-decl name='hb_font_get_glyph_kerning_func_t' type-id='type-id-238' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='115' column='1' hash='fd7a63c0c6c822c4' id='type-id-236'/>
    <!-- typedef hb_bool_t (*)(hb_font_t*, void*, hb_codepoint_t, char*, unsigned int, void*) hb_font_get_glyph_name_func_t -->
    <typedef-decl name='hb_font_get_glyph_name_func_t' type-id='type-id-239' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='133' column='1' hash='fd7a63c0c6c822c4' id='type-id-220'/>
    <!-- typedef hb_bool_t (*)(hb_font_t*, void*, hb_codepoint_t, hb_position_t*, hb_position_t*, void*) hb_font_get_glyph_origin_func_t -->
    <typedef-decl name='hb_font_get_glyph_origin_func_t' type-id='type-id-240' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='109' column='1' hash='fd7a63c0c6c822c4' id='type-id-237'/>
    <!-- typedef hb_font_get_glyph_advance_func_t hb_font_get_glyph_v_advance_func_t -->
    <typedef-decl name='hb_font_get_glyph_v_advance_func_t' type-id='type-id-231' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='104' column='1' hash='fd7a63c0c6c822c4' id='type-id-213'/>
    <!-- typedef hb_font_get_glyph_kerning_func_t hb_font_get_glyph_v_kerning_func_t -->
    <typedef-decl name='hb_font_get_glyph_v_kerning_func_t' type-id='type-id-236' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='117' column='1' hash='fd7a63c0c6c822c4' id='type-id-217'/>
    <!-- typedef hb_font_get_glyph_origin_func_t hb_font_get_glyph_v_origin_func_t -->
    <typedef-decl name='hb_font_get_glyph_v_origin_func_t' type-id='type-id-237' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='111' column='1' hash='fd7a63c0c6c822c4' id='type-id-215'/>
    <!-- typedef hb_glyph_extents_t hb_glyph_extents_t -->
    <typedef-decl name='hb_glyph_extents_t' type-id='type-id-223' size-in-bits='128' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.h' line='89' column='1' id='type-id-241'/>
    <!-- typedef hb_blob_t* (*)(hb_face_t*, hb_tag_t, void*) hb_reference_table_func_t -->
    <typedef-decl name='hb_reference_table_func_t' type-id='type-id-242' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.h' line='50' column='1' hash='fd7a63c0c6c822c4' id='type-id-206'/>
    <!-- typedef hb_bool_t (hb_shape_plan_t*, hb_font_t*, hb_buffer_t*, const hb_feature_t*, unsigned int) hb_shape_func_t -->
    <typedef-decl name='hb_shape_func_t' type-id='type-id-243' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shaper-private.hh' line='36' column='1' id='type-id-244'/>
    <!-- typedef hb_shape_plan_t hb_shape_plan_t -->
    <typedef-decl name='hb_shape_plan_t' type-id='type-id-224' size-in-bits='1664' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-shape-plan.h' line='39' column='1' id='type-id-245'/>
    <!-- uint8_t[2] -->
    <array-type-def dimensions='1' type-id='type-id-138' size-in-bits='16' hash='92399eb84731c3e2' id='type-id-246'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-10'/>
    </array-type-def>
    <!-- OT::ArrayOf<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >, OT::IntType<unsigned int, 4u> >* -->
    <pointer-type-def type-id='type-id-247' size-in-bits='64' hash='beab87b634e82cb5' id='type-id-248'/>
    <!-- OT::ArrayOf<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >, OT::IntType<unsigned int, 4u> >* const -->
    <qualified-type-def type-id='type-id-248' const='yes' hash='1ca5bc47ca5032b0' id='type-id-249'/>
    <!-- OT::BEInt<int, 4>* -->
    <pointer-type-def type-id='type-id-250' size-in-bits='64' hash='a0c86296991cce90' id='type-id-251'/>
    <!-- OT::BEInt<short int, 2>* -->
    <pointer-type-def type-id='type-id-252' size-in-bits='64' hash='dc4078ec28922f1b' id='type-id-253'/>
    <!-- OT::BEInt<short unsigned int, 2>* -->
    <pointer-type-def type-id='type-id-254' size-in-bits='64' hash='06f3a97dd00e8d19' id='type-id-255'/>
    <!-- OT::BEInt<unsigned int, 4>* -->
    <pointer-type-def type-id='type-id-256' size-in-bits='64' hash='ed53b001eec13226' id='type-id-257'/>
    <!-- OT::BEInt<unsigned int, 4>* const -->
    <qualified-type-def type-id='type-id-257' const='yes' hash='3a58f87e7fc5576e' id='type-id-258'/>
    <!-- OT::CheckSum* -->
    <pointer-type-def type-id='type-id-259' size-in-bits='64' hash='4e4eb46c93573a19' id='type-id-260'/>
    <!-- OT::FixedVersion* -->
    <pointer-type-def type-id='type-id-261' size-in-bits='64' hash='1a1bd8868386f170' id='type-id-262'/>
    <!-- OT::FixedVersion* const -->
    <qualified-type-def type-id='type-id-262' const='yes' hash='8e2bd3e253daf177' id='type-id-263'/>
    <!-- OT::IntType<int, 4u>* -->
    <pointer-type-def type-id='type-id-264' size-in-bits='64' hash='3c43cbebf4188dd1' id='type-id-265'/>
    <!-- OT::IntType<short int, 2u>* -->
    <pointer-type-def type-id='type-id-266' size-in-bits='64' hash='fae0088c6612401f' id='type-id-267'/>
    <!-- OT::IntType<short unsigned int, 2u>* -->
    <pointer-type-def type-id='type-id-268' size-in-bits='64' hash='9bf0b15c0600b95a' id='type-id-269'/>
    <!-- OT::IntType<unsigned int, 4u>* -->
    <pointer-type-def type-id='type-id-270' size-in-bits='64' hash='25be86fbc7228193' id='type-id-271'/>
    <!-- OT::IntType<unsigned int, 4u>* const -->
    <qualified-type-def type-id='type-id-271' const='yes' hash='cc9692cd22a12d2d' id='type-id-272'/>
    <!-- OT::LONGDATETIME* -->
    <pointer-type-def type-id='type-id-273' size-in-bits='64' hash='6ac6e34cfb084b49' id='type-id-274'/>
    <!-- OT::OffsetTable& -->
    <reference-type-def kind='lvalue' type-id='type-id-275' size-in-bits='64' hash='5a13950bb92542f9' id='type-id-276'/>
    <!-- OT::OffsetTable* -->
    <pointer-type-def type-id='type-id-275' size-in-bits='64' hash='674789176574692f' id='type-id-277'/>
    <!-- OT::OffsetTable* const -->
    <qualified-type-def type-id='type-id-277' const='yes' hash='4610457500d20544' id='type-id-278'/>
    <!-- OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >& -->
    <reference-type-def kind='lvalue' type-id='type-id-197' size-in-bits='64' hash='7aef96c0da2ca1cd' id='type-id-279'/>
    <!-- OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >* -->
    <pointer-type-def type-id='type-id-197' size-in-bits='64' hash='20b5f200741ebf0b' id='type-id-280'/>
    <!-- OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >* const -->
    <qualified-type-def type-id='type-id-280' const='yes' hash='cfa88c3769a562ec' id='type-id-281'/>
    <!-- OT::OpenTypeFontFile* -->
    <pointer-type-def type-id='type-id-282' size-in-bits='64' hash='b54d778c20fcdc3a' id='type-id-283'/>
    <!-- OT::OpenTypeFontFile* const -->
    <qualified-type-def type-id='type-id-283' const='yes' hash='091e30e1fdd94cf4' id='type-id-284'/>
    <!-- OT::TTCHeader* -->
    <pointer-type-def type-id='type-id-285' size-in-bits='64' hash='8ae8850296de7080' id='type-id-286'/>
    <!-- OT::TTCHeader* const -->
    <qualified-type-def type-id='type-id-286' const='yes' hash='acc8f7461dd9d283' id='type-id-287'/>
    <!-- OT::TTCHeaderVersion1* -->
    <pointer-type-def type-id='type-id-288' size-in-bits='64' hash='4176d78d9bdf30f3' id='type-id-289'/>
    <!-- OT::TTCHeaderVersion1* const -->
    <qualified-type-def type-id='type-id-289' const='yes' hash='bbfb3421fee1328c' id='type-id-290'/>
    <!-- OT::TableRecord* -->
    <pointer-type-def type-id='type-id-199' size-in-bits='64' hash='9b5402923a2a9c59' id='type-id-291'/>
    <!-- OT::Tag* -->
    <pointer-type-def type-id='type-id-292' size-in-bits='64' hash='5e903d57fe3ca94b' id='type-id-293'/>
    <!-- OT::hb_sanitize_context_t* -->
    <pointer-type-def type-id='type-id-294' size-in-bits='64' hash='935bae380ff9de50' id='type-id-295'/>
    <!-- OT::hb_sanitize_context_t* const -->
    <qualified-type-def type-id='type-id-295' const='yes' hash='aab7df06695d5840' id='type-id-296'/>
    <!-- OT::hb_serialize_context_t* -->
    <pointer-type-def type-id='type-id-297' size-in-bits='64' hash='f6cf9e578ae022ea' id='type-id-298'/>
    <!-- OT::head* -->
    <pointer-type-def type-id='type-id-299' size-in-bits='64' hash='65e8d74bb028285e' id='type-id-300'/>
    <!-- OT::head* const -->
    <qualified-type-def type-id='type-id-300' const='yes' hash='f1184d71cee03217' id='type-id-301'/>
    <!-- OT::maxp* -->
    <pointer-type-def type-id='type-id-302' size-in-bits='64' hash='f3650a386af51ae9' id='type-id-303'/>
    <!-- OT::maxp* const -->
    <qualified-type-def type-id='type-id-303' const='yes' hash='a0caf0b843080e8d' id='type-id-304'/>
    <!-- const OT::ArrayOf<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >, OT::IntType<unsigned int, 4u> > -->
    <qualified-type-def type-id='type-id-247' const='yes' hash='150b253e39582bd7' id='type-id-305'/>
    <!-- const OT::ArrayOf<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >, OT::IntType<unsigned int, 4u> >* -->
    <pointer-type-def type-id='type-id-305' size-in-bits='64' hash='7fa4e7febdc08e36' id='type-id-306'/>
    <!-- const OT::ArrayOf<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >, OT::IntType<unsigned int, 4u> >* const -->
    <qualified-type-def type-id='type-id-306' const='yes' hash='7219f821f1965c77' id='type-id-307'/>
    <!-- const OT::BEInt<int, 4> -->
    <qualified-type-def type-id='type-id-250' const='yes' hash='13eb551bd778140e' id='type-id-308'/>
    <!-- const OT::BEInt<int, 4>& -->
    <reference-type-def kind='lvalue' type-id='type-id-308' size-in-bits='64' hash='1006e978ce83593f' id='type-id-309'/>
    <!-- const OT::BEInt<int, 4>* -->
    <pointer-type-def type-id='type-id-308' size-in-bits='64' hash='276d827b593bf642' id='type-id-310'/>
    <!-- const OT::BEInt<short int, 2> -->
    <qualified-type-def type-id='type-id-252' const='yes' hash='1554cb9ec1d1680c' id='type-id-311'/>
    <!-- const OT::BEInt<short int, 2>& -->
    <reference-type-def kind='lvalue' type-id='type-id-311' size-in-bits='64' hash='422109c6cddf63c4' id='type-id-312'/>
    <!-- const OT::BEInt<short int, 2>* -->
    <pointer-type-def type-id='type-id-311' size-in-bits='64' hash='10f84bbc9254ca9e' id='type-id-313'/>
    <!-- const OT::BEInt<short unsigned int, 2> -->
    <qualified-type-def type-id='type-id-254' const='yes' hash='71952bf4c3012c88' id='type-id-314'/>
    <!-- const OT::BEInt<short unsigned int, 2>& -->
    <reference-type-def kind='lvalue' type-id='type-id-314' size-in-bits='64' hash='6d83d42008d86cee' id='type-id-315'/>
    <!-- const OT::BEInt<short unsigned int, 2>* -->
    <pointer-type-def type-id='type-id-314' size-in-bits='64' hash='ae9e3009672a0aed' id='type-id-316'/>
    <!-- const OT::BEInt<short unsigned int, 2>* const -->
    <qualified-type-def type-id='type-id-316' const='yes' hash='1a0aa5dbc154d644' id='type-id-317'/>
    <!-- const OT::BEInt<unsigned int, 4> -->
    <qualified-type-def type-id='type-id-256' const='yes' hash='f654dcb6fc36cbbc' id='type-id-318'/>
    <!-- const OT::BEInt<unsigned int, 4>& -->
    <reference-type-def kind='lvalue' type-id='type-id-318' size-in-bits='64' hash='f56c39655ce746f5' id='type-id-319'/>
    <!-- const OT::BEInt<unsigned int, 4>* -->
    <pointer-type-def type-id='type-id-318' size-in-bits='64' hash='dda2307757a4acdc' id='type-id-320'/>
    <!-- const OT::BEInt<unsigned int, 4>* const -->
    <qualified-type-def type-id='type-id-320' const='yes' hash='ea1e2b1295966553' id='type-id-321'/>
    <!-- const OT::CheckSum -->
    <qualified-type-def type-id='type-id-259' const='yes' hash='f2490f1c1b7d6de7' id='type-id-322'/>
    <!-- const OT::CheckSum* -->
    <pointer-type-def type-id='type-id-322' size-in-bits='64' hash='f4edf7cb9be95f18' id='type-id-323'/>
    <!-- const OT::FixedVersion -->
    <qualified-type-def type-id='type-id-261' const='yes' hash='fd2abe13dbaeb90c' id='type-id-324'/>
    <!-- const OT::FixedVersion* -->
    <pointer-type-def type-id='type-id-324' size-in-bits='64' hash='f743075e678f8a1d' id='type-id-325'/>
    <!-- const OT::IntType<int, 4u> -->
    <qualified-type-def type-id='type-id-264' const='yes' hash='d0d25562702acdce' id='type-id-326'/>
    <!-- const OT::IntType<int, 4u>& -->
    <reference-type-def kind='lvalue' type-id='type-id-326' size-in-bits='64' hash='c2758cb73a18fb6e' id='type-id-327'/>
    <!-- const OT::IntType<int, 4u>* -->
    <pointer-type-def type-id='type-id-326' size-in-bits='64' hash='5d3933e23ccb2e34' id='type-id-328'/>
    <!-- const OT::IntType<short int, 2u> -->
    <qualified-type-def type-id='type-id-266' const='yes' hash='b2e59f86f2ddffdb' id='type-id-329'/>
    <!-- const OT::IntType<short int, 2u>& -->
    <reference-type-def kind='lvalue' type-id='type-id-329' size-in-bits='64' hash='9e0cbd61b7519b87' id='type-id-330'/>
    <!-- const OT::IntType<short int, 2u>* -->
    <pointer-type-def type-id='type-id-329' size-in-bits='64' hash='f6c13bcb98b4df99' id='type-id-331'/>
    <!-- const OT::IntType<short unsigned int, 2u> -->
    <qualified-type-def type-id='type-id-268' const='yes' hash='ae090afacd6255e5' id='type-id-332'/>
    <!-- const OT::IntType<short unsigned int, 2u>& -->
    <reference-type-def kind='lvalue' type-id='type-id-332' size-in-bits='64' hash='b90ff26e3c5d4fd9' id='type-id-333'/>
    <!-- const OT::IntType<short unsigned int, 2u>* -->
    <pointer-type-def type-id='type-id-332' size-in-bits='64' hash='4747bbdb2e4b4c35' id='type-id-334'/>
    <!-- const OT::IntType<short unsigned int, 2u>* const -->
    <qualified-type-def type-id='type-id-334' const='yes' hash='0f3c4642e2d63436' id='type-id-335'/>
    <!-- const OT::IntType<unsigned int, 4u> -->
    <qualified-type-def type-id='type-id-270' const='yes' hash='b043c730d5040a64' id='type-id-336'/>
    <!-- const OT::IntType<unsigned int, 4u>& -->
    <reference-type-def kind='lvalue' type-id='type-id-336' size-in-bits='64' hash='81602ca9b98b3740' id='type-id-337'/>
    <!-- const OT::IntType<unsigned int, 4u>* -->
    <pointer-type-def type-id='type-id-336' size-in-bits='64' hash='bb21ce04787ff653' id='type-id-338'/>
    <!-- const OT::IntType<unsigned int, 4u>* const -->
    <qualified-type-def type-id='type-id-338' const='yes' hash='e309b6acc224d654' id='type-id-339'/>
    <!-- const OT::LONGDATETIME -->
    <qualified-type-def type-id='type-id-273' const='yes' hash='0299e7886a8e4b83' id='type-id-340'/>
    <!-- const OT::LONGDATETIME* -->
    <pointer-type-def type-id='type-id-340' size-in-bits='64' hash='930a8b7dfa51c7ec' id='type-id-341'/>
    <!-- const OT::Offset<OT::IntType<unsigned int, 4u> > -->
    <qualified-type-def type-id='type-id-342' const='yes' hash='e4a399c22c8bc809' id='type-id-343'/>
    <!-- const OT::Offset<OT::IntType<unsigned int, 4u> >* -->
    <pointer-type-def type-id='type-id-343' size-in-bits='64' hash='7864f422affbf2cb' id='type-id-344'/>
    <!-- const OT::OffsetTable -->
    <qualified-type-def type-id='type-id-275' const='yes' hash='e449e1c9cdc68ac9' id='type-id-345'/>
    <!-- const OT::OffsetTable& -->
    <reference-type-def kind='lvalue' type-id='type-id-345' size-in-bits='64' hash='8a523c1198beda9e' id='type-id-346'/>
    <!-- const OT::OffsetTable* -->
    <pointer-type-def type-id='type-id-345' size-in-bits='64' hash='ef552277b5d32381' id='type-id-347'/>
    <!-- const OT::OffsetTable* const -->
    <qualified-type-def type-id='type-id-347' const='yes' hash='744b84d07f45b21f' id='type-id-348'/>
    <!-- const OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> > -->
    <qualified-type-def type-id='type-id-197' const='yes' hash='cbc9d7457d6adf81' id='type-id-349'/>
    <!-- const OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >& -->
    <reference-type-def kind='lvalue' type-id='type-id-349' size-in-bits='64' hash='31a5506e4218ddfb' id='type-id-350'/>
    <!-- const OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >* -->
    <pointer-type-def type-id='type-id-349' size-in-bits='64' hash='8c4c33e68952d46a' id='type-id-351'/>
    <!-- const OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >* const -->
    <qualified-type-def type-id='type-id-351' const='yes' hash='b989e8ed3974d714' id='type-id-352'/>
    <!-- const OT::OpenTypeFontFace -->
    <qualified-type-def type-id='type-id-353' const='yes' hash='32c7d1142b587188' id='type-id-354'/>
    <!-- const OT::OpenTypeFontFace& -->
    <reference-type-def kind='lvalue' type-id='type-id-354' size-in-bits='64' hash='000b736141a5bd53' id='type-id-355'/>
    <!-- const OT::OpenTypeFontFile -->
    <qualified-type-def type-id='type-id-282' const='yes' hash='10fcb9fd916e672b' id='type-id-356'/>
    <!-- const OT::OpenTypeFontFile* -->
    <pointer-type-def type-id='type-id-356' size-in-bits='64' hash='1d4d28f4e066a5ca' id='type-id-357'/>
    <!-- const OT::OpenTypeFontFile* const -->
    <qualified-type-def type-id='type-id-357' const='yes' hash='f6de3f6ed0419b01' id='type-id-358'/>
    <!-- const OT::TTCHeader -->
    <qualified-type-def type-id='type-id-285' const='yes' hash='7a999f3e284a3e58' id='type-id-359'/>
    <!-- const OT::TTCHeader* -->
    <pointer-type-def type-id='type-id-359' size-in-bits='64' hash='fb3f16ffd099d047' id='type-id-360'/>
    <!-- const OT::TTCHeader* const -->
    <qualified-type-def type-id='type-id-360' const='yes' hash='208a0835a75ded08' id='type-id-361'/>
    <!-- const OT::TTCHeaderVersion1 -->
    <qualified-type-def type-id='type-id-288' const='yes' hash='c03403ebb7c0da03' id='type-id-362'/>
    <!-- const OT::TTCHeaderVersion1* -->
    <pointer-type-def type-id='type-id-362' size-in-bits='64' hash='384abb2c671d8694' id='type-id-363'/>
    <!-- const OT::TTCHeaderVersion1* const -->
    <qualified-type-def type-id='type-id-363' const='yes' hash='b8751ccd32563331' id='type-id-364'/>
    <!-- const OT::TableRecord -->
    <qualified-type-def type-id='type-id-199' const='yes' hash='bf6bc7f18095a754' id='type-id-365'/>
    <!-- const OT::TableRecord& -->
    <reference-type-def kind='lvalue' type-id='type-id-365' size-in-bits='64' hash='433f5f9880917864' id='type-id-366'/>
    <!-- const OT::TableRecord* -->
    <pointer-type-def type-id='type-id-365' size-in-bits='64' hash='38a5bacbafb98f36' id='type-id-367'/>
    <!-- const OT::Tag -->
    <qualified-type-def type-id='type-id-292' const='yes' hash='3079cf6a01c2a263' id='type-id-368'/>
    <!-- const OT::Tag* -->
    <pointer-type-def type-id='type-id-368' size-in-bits='64' hash='902ceae8f77b275d' id='type-id-369'/>
    <!-- const OT::ULONG -->
    <qualified-type-def type-id='type-id-370' const='yes' hash='8df401e175c7878e' id='type-id-371'/>
    <!-- const OT::ULONG* -->
    <pointer-type-def type-id='type-id-371' size-in-bits='64' hash='95d9aed748fff56b' id='type-id-372'/>
    <!-- const OT::hb_sanitize_context_t -->
    <qualified-type-def type-id='type-id-294' const='yes' hash='9721852afd438bb6' id='type-id-373'/>
    <!-- const OT::hb_sanitize_context_t* -->
    <pointer-type-def type-id='type-id-373' size-in-bits='64' hash='c811d4257322032e' id='type-id-374'/>
    <!-- const OT::hb_sanitize_context_t* const -->
    <qualified-type-def type-id='type-id-374' const='yes' hash='04142ffecb19149d' id='type-id-375'/>
    <!-- const OT::head -->
    <qualified-type-def type-id='type-id-299' const='yes' hash='eb64735d4b9f3e25' id='type-id-376'/>
    <!-- const OT::head* -->
    <pointer-type-def type-id='type-id-376' size-in-bits='64' hash='a49828ad13049a26' id='type-id-377'/>
    <!-- const OT::head* const -->
    <qualified-type-def type-id='type-id-377' const='yes' hash='1661b95d3c06b465' id='type-id-378'/>
    <!-- const OT::maxp -->
    <qualified-type-def type-id='type-id-302' const='yes' hash='11530db8f9108678' id='type-id-379'/>
    <!-- const OT::maxp* -->
    <pointer-type-def type-id='type-id-379' size-in-bits='64' hash='dd08c3c5696bb314' id='type-id-380'/>
    <!-- const OT::maxp* const -->
    <qualified-type-def type-id='type-id-380' const='yes' hash='18fb820c88cb2e7c' id='type-id-381'/>
    <!-- const hb_face_t -->
    <qualified-type-def type-id='type-id-202' const='yes' hash='8f394b0d2a207fc5' id='type-id-382'/>
    <!-- const hb_face_t* -->
    <pointer-type-def type-id='type-id-382' size-in-bits='64' hash='d5cb5950ae24137c' id='type-id-383'/>
    <!-- const hb_face_t* const -->
    <qualified-type-def type-id='type-id-383' const='yes' hash='f90134c687e0727b' id='type-id-384'/>
    <!-- const hb_feature_t -->
    <qualified-type-def type-id='type-id-228' const='yes' hash='79a6c9837767876b' id='type-id-385'/>
    <!-- const hb_feature_t* -->
    <pointer-type-def type-id='type-id-385' size-in-bits='64' hash='d4ae955bc28cb8ad' id='type-id-386'/>
    <!-- const hb_font_funcs_t -->
    <qualified-type-def type-id='type-id-208' const='yes' hash='fa297fbcfc9315b3' id='type-id-387'/>
    <!-- const hb_font_funcs_t* -->
    <pointer-type-def type-id='type-id-387' size-in-bits='64' hash='955c0bf0ecad5b0b' id='type-id-388'/>
    <!-- const hb_font_t -->
    <qualified-type-def type-id='type-id-119' const='yes' hash='96b3c91b9487a2f3' id='type-id-389'/>
    <!-- const hb_font_t* -->
    <pointer-type-def type-id='type-id-389' size-in-bits='64' hash='fc96ebbcd25fa313' id='type-id-390'/>
    <!-- const hb_shape_plan_t -->
    <qualified-type-def type-id='type-id-224' const='yes' hash='c1f9536b0e83fd3e' id='type-id-391'/>
    <!-- const hb_shape_plan_t* -->
    <pointer-type-def type-id='type-id-391' size-in-bits='64' hash='d9634298072e9a12' id='type-id-392'/>
    <!-- const int -->
    <qualified-type-def type-id='type-id-11' const='yes' hash='8cef8df4b6728924' id='type-id-393'/>
    <!-- const int& -->
    <reference-type-def kind='lvalue' type-id='type-id-393' size-in-bits='64' hash='5bb43a8603322674' id='type-id-394'/>
    <!-- hb_auto_trace_t<0, bool>* -->
    <pointer-type-def type-id='type-id-201' size-in-bits='64' hash='059da2a19a65b261' id='type-id-395'/>
    <!-- hb_auto_trace_t<0, bool>* const -->
    <qualified-type-def type-id='type-id-395' const='yes' hash='e66ae46c4c8e9759' id='type-id-396'/>
    <!-- hb_blob_t* (*)(hb_face_t*, hb_tag_t, void*) -->
    <pointer-type-def type-id='type-id-397' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-242'/>
    <!-- hb_bool_t (*)(hb_font_t*, void*, const char*, int, hb_codepoint_t*, void*) -->
    <pointer-type-def type-id='type-id-398' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-234'/>
    <!-- hb_bool_t (*)(hb_font_t*, void*, hb_codepoint_t, char*, unsigned int, void*) -->
    <pointer-type-def type-id='type-id-399' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-239'/>
    <!-- hb_bool_t (*)(hb_font_t*, void*, hb_codepoint_t, hb_codepoint_t, hb_codepoint_t*, void*) -->
    <pointer-type-def type-id='type-id-400' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-235'/>
    <!-- hb_bool_t (*)(hb_font_t*, void*, hb_codepoint_t, hb_glyph_extents_t*, void*) -->
    <pointer-type-def type-id='type-id-401' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-233'/>
    <!-- hb_bool_t (*)(hb_font_t*, void*, hb_codepoint_t, hb_position_t*, hb_position_t*, void*) -->
    <pointer-type-def type-id='type-id-402' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-240'/>
    <!-- hb_bool_t (*)(hb_font_t*, void*, hb_codepoint_t, unsigned int, hb_position_t*, hb_position_t*, void*) -->
    <pointer-type-def type-id='type-id-403' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-232'/>
    <!-- hb_face_t* -->
    <pointer-type-def type-id='type-id-227' size-in-bits='64' hash='573f5bb9002882eb' id='type-id-168'/>
    <!-- hb_face_t::plan_node_t* -->
    <pointer-type-def type-id='type-id-203' size-in-bits='64' hash='075e59c7622e8f53' id='type-id-205'/>
    <!-- hb_feature_t* -->
    <pointer-type-def type-id='type-id-228' size-in-bits='64' hash='dfc81d0ae6d3e677' id='type-id-226'/>
    <!-- hb_font_funcs_t* -->
    <pointer-type-def type-id='type-id-229' size-in-bits='64' hash='36ff8efc4e925798' id='type-id-169'/>
    <!-- hb_font_t* -->
    <pointer-type-def type-id='type-id-119' size-in-bits='64' hash='34a0b9bb2e195ba5' id='type-id-167'/>
    <!-- hb_glyph_extents_t* -->
    <pointer-type-def type-id='type-id-241' size-in-bits='64' hash='11cedc070a68abf1' id='type-id-404'/>
    <!-- hb_position_t (*)(hb_font_t*, void*, hb_codepoint_t, hb_codepoint_t, void*) -->
    <pointer-type-def type-id='type-id-405' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-238'/>
    <!-- hb_position_t (*)(hb_font_t*, void*, hb_codepoint_t, void*) -->
    <pointer-type-def type-id='type-id-406' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-230'/>
    <!-- hb_position_t* -->
    <pointer-type-def type-id='type-id-102' size-in-bits='64' hash='2c300fc05fdc1740' id='type-id-407'/>
    <!-- hb_shape_func_t* -->
    <pointer-type-def type-id='type-id-244' size-in-bits='64' hash='94df000db41179a9' id='type-id-225'/>
    <!-- hb_shape_plan_t* -->
    <pointer-type-def type-id='type-id-245' size-in-bits='64' hash='99e88b1d26d1f127' id='type-id-204'/>
    <reference-type-def kind='lvalue' type-id='type-id-408' size-in-bits='64' id='type-id-409'/>
    <!-- hb_face_t* hb_face_create_for_tables(hb_reference_table_func_t, void*, hb_destroy_func_t) -->
    <function-decl name='hb_face_create_for_tables' mangled-name='hb_face_create_for_tables' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_create_for_tables' hash='4dcccb1f897f8323'>
      <!-- parameter of type 'typedef hb_reference_table_func_t' -->
      <parameter type-id='type-id-206' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='83' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='84' column='1'/>
      <!-- parameter of type 'typedef hb_destroy_func_t' -->
      <parameter type-id='type-id-20' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='85' column='1'/>
      <!-- hb_face_t* -->
      <return type-id='type-id-168'/>
    </function-decl>
    <!-- hb_face_t* hb_face_create(hb_blob_t*, unsigned int) -->
    <function-decl name='hb_face_create' mangled-name='hb_face_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_create' hash='98d779437f7f7e74'>
      <!-- parameter of type 'hb_blob_t*' -->
      <parameter type-id='type-id-52' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='163' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='164' column='1'/>
      <!-- hb_face_t* -->
      <return type-id='type-id-168'/>
    </function-decl>
    <!-- hb_face_t* hb_face_get_empty() -->
    <function-decl name='hb_face_get_empty' mangled-name='hb_face_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_empty' hash='5b71e44cd44f54bd'>
      <!-- hb_face_t* -->
      <return type-id='type-id-168'/>
    </function-decl>
    <!-- hb_face_t* hb_face_reference(hb_face_t*) -->
    <function-decl name='hb_face_reference' mangled-name='hb_face_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_reference' hash='4135f613fbfa60d8'>
      <!-- parameter of type 'hb_face_t*' -->
      <parameter type-id='type-id-168' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='212' column='1'/>
      <!-- hb_face_t* -->
      <return type-id='type-id-168'/>
    </function-decl>
    <!-- void hb_face_destroy(hb_face_t*) -->
    <function-decl name='hb_face_destroy' mangled-name='hb_face_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_destroy' hash='5b71e44cd44f54bd'>
      <!-- parameter of type 'hb_face_t*' -->
      <parameter type-id='type-id-168' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='299' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_bool_t hb_face_set_user_data(hb_face_t*, hb_user_data_key_t*, void*, hb_destroy_func_t, hb_bool_t) -->
    <function-decl name='hb_face_set_user_data' mangled-name='hb_face_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_user_data' hash='49049ee7cfd44a2f'>
      <!-- parameter of type 'hb_face_t*' -->
      <parameter type-id='type-id-168' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='263' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='type-id-29' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='264' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='265' column='1'/>
      <!-- parameter of type 'typedef hb_destroy_func_t' -->
      <parameter type-id='type-id-20' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='266' column='1'/>
      <!-- parameter of type 'typedef hb_bool_t' -->
      <parameter type-id='type-id-33' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='267' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-decl>
    <!-- void* hb_face_get_user_data(hb_face_t*, hb_user_data_key_t*) -->
    <function-decl name='hb_face_get_user_data' mangled-name='hb_face_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_user_data' hash='a8df0c849db0d536'>
      <!-- parameter of type 'hb_face_t*' -->
      <parameter type-id='type-id-168' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='284' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='type-id-29' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='285' column='1'/>
      <!-- void* -->
      <return type-id='type-id-19'/>
    </function-decl>
    <!-- void hb_face_make_immutable(hb_face_t*) -->
    <function-decl name='hb_face_make_immutable' mangled-name='hb_face_make_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_make_immutable' hash='5b71e44cd44f54bd'>
      <!-- parameter of type 'hb_face_t*' -->
      <parameter type-id='type-id-168' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='299' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_bool_t hb_face_is_immutable(hb_face_t*) -->
    <function-decl name='hb_face_is_immutable' mangled-name='hb_face_is_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_is_immutable' hash='82e6760622ff4119'>
      <!-- parameter of type 'hb_face_t*' -->
      <parameter type-id='type-id-168' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='318' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-decl>
    <!-- hb_blob_t* hb_face_reference_table(hb_face_t*, hb_tag_t) -->
    <function-decl name='hb_face_reference_table' mangled-name='hb_face_reference_table' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_reference_table' hash='de33efc04dfdcfc0'>
      <!-- parameter of type 'hb_face_t*' -->
      <parameter type-id='type-id-168' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='336' column='1'/>
      <!-- parameter of type 'typedef hb_tag_t' -->
      <parameter type-id='type-id-190' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='337' column='1'/>
      <!-- hb_blob_t* -->
      <return type-id='type-id-52'/>
    </function-decl>
    <!-- hb_blob_t* hb_face_reference_blob(hb_face_t*) -->
    <function-decl name='hb_face_reference_blob' mangled-name='hb_face_reference_blob' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_reference_blob' hash='62bde539c6339377'>
      <!-- parameter of type 'hb_face_t*' -->
      <parameter type-id='type-id-168' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='353' column='1'/>
      <!-- hb_blob_t* -->
      <return type-id='type-id-52'/>
    </function-decl>
    <!-- void hb_face_set_index(hb_face_t*, unsigned int) -->
    <function-decl name='hb_face_set_index' mangled-name='hb_face_set_index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_index' hash='d108c816db11124a'>
      <!-- parameter of type 'hb_face_t*' -->
      <parameter type-id='type-id-168' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='368' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='369' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- unsigned int hb_face_get_index(hb_face_t*) -->
    <function-decl name='hb_face_get_index' mangled-name='hb_face_get_index' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_index' hash='3b28f763760069f0'>
      <!-- parameter of type 'hb_face_t*' -->
      <parameter type-id='type-id-168' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='388' column='1'/>
      <!-- unsigned int -->
      <return type-id='type-id-18'/>
    </function-decl>
    <!-- void hb_face_set_upem(hb_face_t*, unsigned int) -->
    <function-decl name='hb_face_set_upem' mangled-name='hb_face_set_upem' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_upem' hash='d108c816db11124a'>
      <!-- parameter of type 'hb_face_t*' -->
      <parameter type-id='type-id-168' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='368' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='369' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- unsigned int hb_face_get_upem(hb_face_t*) -->
    <function-decl name='hb_face_get_upem' mangled-name='hb_face_get_upem' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_upem' hash='3b28f763760069f0'>
      <!-- parameter of type 'hb_face_t*' -->
      <parameter type-id='type-id-168' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='388' column='1'/>
      <!-- unsigned int -->
      <return type-id='type-id-18'/>
    </function-decl>
    <!-- void hb_face_set_glyph_count(hb_face_t*, unsigned int) -->
    <function-decl name='hb_face_set_glyph_count' mangled-name='hb_face_set_glyph_count' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_set_glyph_count' hash='d108c816db11124a'>
      <!-- parameter of type 'hb_face_t*' -->
      <parameter type-id='type-id-168' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='368' column='1'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='369' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- unsigned int hb_face_get_glyph_count(hb_face_t*) -->
    <function-decl name='hb_face_get_glyph_count' mangled-name='hb_face_get_glyph_count' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_face_get_glyph_count' hash='3b28f763760069f0'>
      <!-- parameter of type 'hb_face_t*' -->
      <parameter type-id='type-id-168' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-face.cc' line='388' column='1'/>
      <!-- unsigned int -->
      <return type-id='type-id-18'/>
    </function-decl>
    <!-- namespace OT -->
    <namespace-decl name='OT'>
      <!-- struct OT::ArrayOf<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >, OT::IntType<unsigned int, 4u> > -->
      <class-decl name='ArrayOf&lt;OT::OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt;, OT::IntType&lt;unsigned int, 4u&gt; &gt;' is-struct='yes' visibility='default' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='793' column='1' hash='d257101b5876b536' id='type-id-247'>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- OT::IntType<unsigned int, 4u> OT::ArrayOf<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >, OT::IntType<unsigned int, 4u> >::len -->
          <var-decl name='len' type-id='type-id-270' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='892' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <!-- OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> > OT::ArrayOf<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >, OT::IntType<unsigned int, 4u> >::array[1] -->
          <var-decl name='array' type-id='type-id-198' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='893' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::BEInt<int, 4> -->
      <class-decl name='BEInt&lt;int, 4&gt;' is-struct='yes' visibility='default' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='532' column='1' hash='b68ecb01bcd56d4e' id='type-id-250'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- uint8_t OT::BEInt<int, 4>::v[4] -->
          <var-decl name='v' type-id='type-id-140' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='607' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::BEInt<short int, 2> -->
      <class-decl name='BEInt&lt;short int, 2&gt;' is-struct='yes' visibility='default' size-in-bits='16' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='532' column='1' hash='78170ecaac49199b#2' id='type-id-252'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- uint8_t OT::BEInt<short int, 2>::v[2] -->
          <var-decl name='v' type-id='type-id-246' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='554' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::BEInt<short unsigned int, 2> -->
      <class-decl name='BEInt&lt;short unsigned int, 2&gt;' is-struct='yes' visibility='default' size-in-bits='16' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='532' column='1' hash='3a1a6e95b16ab553#2' id='type-id-254'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- uint8_t OT::BEInt<short unsigned int, 2>::v[2] -->
          <var-decl name='v' type-id='type-id-246' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='554' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::BEInt<unsigned int, 4> -->
      <class-decl name='BEInt&lt;unsigned int, 4&gt;' is-struct='yes' visibility='default' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='532' column='1' hash='b83f7ff8452b672d#2' id='type-id-256'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- uint8_t OT::BEInt<unsigned int, 4>::v[4] -->
          <var-decl name='v' type-id='type-id-140' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='607' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::CheckSum -->
      <class-decl name='CheckSum' is-struct='yes' visibility='default' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='692' column='1' hash='a4369b21f7d50961' id='type-id-259'>
        <!-- struct OT::IntType<unsigned int, 4u> -->
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-270'/>
      </class-decl>
      <!-- struct OT::FixedVersion -->
      <class-decl name='FixedVersion' is-struct='yes' visibility='default' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='718' column='1' hash='52bdc5597cbfb123#2' id='type-id-261'>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- OT::USHORT OT::FixedVersion::major -->
          <var-decl name='major' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='726' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <!-- OT::USHORT OT::FixedVersion::minor -->
          <var-decl name='minor' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='727' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::IntType<int, 4u> -->
      <class-decl name='IntType&lt;int, 4u&gt;' is-struct='yes' visibility='default' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='613' column='1' hash='086f414747d5fe18' id='type-id-264'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <!-- OT::BEInt<int, 4> OT::IntType<int, 4u>::v -->
          <var-decl name='v' type-id='type-id-250' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='626' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::IntType<short int, 2u> -->
      <class-decl name='IntType&lt;short int, 2u&gt;' is-struct='yes' visibility='default' size-in-bits='16' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='613' column='1' hash='c053e8d4c58fc504#2' id='type-id-266'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <!-- OT::BEInt<short int, 2> OT::IntType<short int, 2u>::v -->
          <var-decl name='v' type-id='type-id-252' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='626' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::IntType<short unsigned int, 2u> -->
      <class-decl name='IntType&lt;short unsigned int, 2u&gt;' is-struct='yes' visibility='default' size-in-bits='16' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='613' column='1' hash='4c5643026553be98#2' id='type-id-268'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <!-- OT::BEInt<short unsigned int, 2> OT::IntType<short unsigned int, 2u>::v -->
          <var-decl name='v' type-id='type-id-254' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='626' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::IntType<unsigned int, 4u> -->
      <class-decl name='IntType&lt;unsigned int, 4u&gt;' is-struct='yes' visibility='default' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='613' column='1' hash='73f67536fc7fab20#2' id='type-id-270'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <!-- OT::BEInt<unsigned int, 4> OT::IntType<unsigned int, 4u>::v -->
          <var-decl name='v' type-id='type-id-256' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='626' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::LONGDATETIME -->
      <class-decl name='LONGDATETIME' is-struct='yes' visibility='default' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='647' column='1' hash='4dcf3a3f444002d1' id='type-id-273'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <!-- OT::LONG OT::LONGDATETIME::major -->
          <var-decl name='major' type-id='type-id-411' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='653' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <!-- OT::ULONG OT::LONGDATETIME::minor -->
          <var-decl name='minor' type-id='type-id-370' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='654' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::Offset<OT::IntType<unsigned int, 4u> > -->
      <class-decl name='Offset&lt;OT::IntType&lt;unsigned int, 4u&gt; &gt;' is-struct='yes' visibility='default' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='683' column='1' hash='04f923f0c4da851d' id='type-id-342'>
        <!-- struct OT::IntType<unsigned int, 4u> -->
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-270'/>
      </class-decl>
      <!-- struct OT::OffsetTable -->
      <class-decl name='OffsetTable' is-struct='yes' visibility='default' size-in-bits='224' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='71' column='1' hash='496a2b296527be35' id='type-id-275'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <!-- OT::Tag OT::OffsetTable::sfnt_version -->
          <var-decl name='sfnt_version' type-id='type-id-292' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='111' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <!-- OT::USHORT OT::OffsetTable::numTables -->
          <var-decl name='numTables' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='112' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='48'>
          <!-- OT::USHORT OT::OffsetTable::searchRangeZ -->
          <var-decl name='searchRangeZ' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='113' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <!-- OT::USHORT OT::OffsetTable::entrySelectorZ -->
          <var-decl name='entrySelectorZ' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='114' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='80'>
          <!-- OT::USHORT OT::OffsetTable::rangeShiftZ -->
          <var-decl name='rangeShiftZ' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='115' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='96'>
          <!-- OT::TableRecord OT::OffsetTable::tables[1] -->
          <var-decl name='tables' type-id='type-id-200' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='116' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> > -->
      <class-decl name='OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt;' is-struct='yes' visibility='default' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='741' column='1' hash='d8bb6235951592c4' id='type-id-197'>
        <!-- struct OT::Offset<OT::IntType<unsigned int, 4u> > -->
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-342'/>
      </class-decl>
      <!-- struct OT::OpenTypeFontFile -->
      <class-decl name='OpenTypeFontFile' is-struct='yes' visibility='default' size-in-bits='224' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='199' column='1' hash='2ca9643004a80beb' id='type-id-282'>
        <member-type access='protected'>
          <!-- union {OT::Tag tag; OT::OpenTypeFontFace fontFace; OT::TTCHeader ttcHeader;} -->
          <union-decl name='__anonymous_union__' visibility='default' size-in-bits='224' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='250' column='1' hash='be6e6099bfedf2b4#3' id='type-id-412'>
            <data-member access='public'>
              <!-- OT::Tag tag -->
              <var-decl name='tag' type-id='type-id-292' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='251' column='1'/>
            </data-member>
            <data-member access='public'>
              <!-- OT::OpenTypeFontFace fontFace -->
              <var-decl name='fontFace' type-id='type-id-353' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='252' column='1'/>
            </data-member>
            <data-member access='public'>
              <!-- OT::TTCHeader ttcHeader -->
              <var-decl name='ttcHeader' type-id='type-id-285' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='253' column='1'/>
            </data-member>
          </union-decl>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <!-- union {OT::Tag tag; OT::OpenTypeFontFace fontFace; OT::TTCHeader ttcHeader;} OT::OpenTypeFontFile::u -->
          <var-decl name='u' type-id='type-id-412' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='254' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::Sanitizer<OT::OpenTypeFontFile> -->
      <class-decl name='Sanitizer&lt;OT::OpenTypeFontFile&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='292' column='1' hash='1d17855325f55ce1' id='type-id-413'/>
      <!-- struct OT::Sanitizer<OT::head> -->
      <class-decl name='Sanitizer&lt;OT::head&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='292' column='1' hash='5038790837af4bda' id='type-id-414'/>
      <!-- struct OT::Sanitizer<OT::maxp> -->
      <class-decl name='Sanitizer&lt;OT::maxp&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='292' column='1' hash='122699f27ba02751' id='type-id-415'/>
      <!-- struct OT::TTCHeader -->
      <class-decl name='TTCHeader' is-struct='yes' visibility='default' size-in-bits='128' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='150' column='1' hash='b9cb92793ad27fff' id='type-id-285'>
        <member-type access='protected'>
          <!-- union {struct {OT::Tag ttcTag; OT::FixedVersion version;} header; OT::TTCHeaderVersion1 version1;} -->
          <union-decl name='__anonymous_union__' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='183' column='1' hash='5be3de43160b65aa#24' id='type-id-416'>
            <member-type access='public'>
              <!-- struct {OT::Tag ttcTag; OT::FixedVersion version;} -->
              <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='184' column='1' hash='12fb3467496afac0' id='type-id-417'>
                <data-member access='public' layout-offset-in-bits='0'>
                  <!-- OT::Tag ttcTag -->
                  <var-decl name='ttcTag' type-id='type-id-292' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='185' column='1'/>
                </data-member>
                <data-member access='public' layout-offset-in-bits='32'>
                  <!-- OT::FixedVersion version -->
                  <var-decl name='version' type-id='type-id-261' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='186' column='1'/>
                </data-member>
              </class-decl>
            </member-type>
            <data-member access='public'>
              <!-- struct {OT::Tag ttcTag; OT::FixedVersion version;} header -->
              <var-decl name='header' type-id='type-id-417' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='188' column='1'/>
            </data-member>
            <data-member access='public'>
              <!-- OT::TTCHeaderVersion1 version1 -->
              <var-decl name='version1' type-id='type-id-288' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='189' column='1'/>
            </data-member>
          </union-decl>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <!-- union {struct {OT::Tag ttcTag; OT::FixedVersion version;} header; OT::TTCHeaderVersion1 version1;} OT::TTCHeader::u -->
          <var-decl name='u' type-id='type-id-416' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='190' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::TTCHeaderVersion1 -->
      <class-decl name='TTCHeaderVersion1' is-struct='yes' visibility='default' size-in-bits='128' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='127' column='1' hash='794890c60f261dcd' id='type-id-288'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <!-- OT::Tag OT::TTCHeaderVersion1::ttcTag -->
          <var-decl name='ttcTag' type-id='type-id-292' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='139' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <!-- OT::FixedVersion OT::TTCHeaderVersion1::version -->
          <var-decl name='version' type-id='type-id-261' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='140' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <!-- OT::ArrayOf<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> >, OT::IntType<unsigned int, 4u> > OT::TTCHeaderVersion1::table -->
          <var-decl name='table' type-id='type-id-247' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='143' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::TableRecord -->
      <class-decl name='TableRecord' is-struct='yes' visibility='default' size-in-bits='128' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='55' column='1' hash='7d60617c61e89425' id='type-id-199'>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- OT::Tag OT::TableRecord::tag -->
          <var-decl name='tag' type-id='type-id-292' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='61' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <!-- OT::CheckSum OT::TableRecord::checkSum -->
          <var-decl name='checkSum' type-id='type-id-259' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='62' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- OT::ULONG OT::TableRecord::offset -->
          <var-decl name='offset' type-id='type-id-370' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='63' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <!-- OT::ULONG OT::TableRecord::length -->
          <var-decl name='length' type-id='type-id-370' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='65' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::Tag -->
      <class-decl name='Tag' is-struct='yes' visibility='default' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='662' column='1' hash='06bae466bba616c4#2' id='type-id-292'>
        <!-- struct OT::IntType<unsigned int, 4u> -->
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-270'/>
      </class-decl>
      <!-- struct OT::hb_sanitize_context_t -->
      <class-decl name='hb_sanitize_context_t' is-struct='yes' visibility='default' size-in-bits='320' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='178' column='1' hash='01f1fc075ddec113#2' id='type-id-294'>
        <member-type access='public'>
          <!-- typedef bool OT::hb_sanitize_context_t::return_t -->
          <typedef-decl name='return_t' type-id='type-id-1' size-in-bits='8' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='181' column='1' hash='5ba96bb22f4237fb' id='type-id-418'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- unsigned int OT::hb_sanitize_context_t::debug_depth -->
          <var-decl name='debug_depth' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='280' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- const char* OT::hb_sanitize_context_t::start -->
          <var-decl name='start' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='281' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <!-- const char* OT::hb_sanitize_context_t::end -->
          <var-decl name='end' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='281' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <!-- bool OT::hb_sanitize_context_t::writable -->
          <var-decl name='writable' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='282' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <!-- unsigned int OT::hb_sanitize_context_t::edit_count -->
          <var-decl name='edit_count' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='283' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <!-- hb_blob_t* OT::hb_sanitize_context_t::blob -->
          <var-decl name='blob' type-id='type-id-52' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='284' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::hb_serialize_context_t -->
      <class-decl name='hb_serialize_context_t' is-struct='yes' visibility='default' size-in-bits='320' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='377' column='1' hash='e2be6419ef024c63#2' id='type-id-297'>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- unsigned int OT::hb_serialize_context_t::debug_depth -->
          <var-decl name='debug_depth' type-id='type-id-18' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='480' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- char* OT::hb_serialize_context_t::start -->
          <var-decl name='start' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <!-- char* OT::hb_serialize_context_t::end -->
          <var-decl name='end' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <!-- char* OT::hb_serialize_context_t::head -->
          <var-decl name='head' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <!-- bool OT::hb_serialize_context_t::ran_out_of_room -->
          <var-decl name='ran_out_of_room' type-id='type-id-1' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='482' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::head -->
      <class-decl name='head' is-struct='yes' visibility='default' size-in-bits='432' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='45' column='1' hash='f480506d21babad3' id='type-id-299'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <!-- OT::FixedVersion OT::head::version -->
          <var-decl name='version' type-id='type-id-261' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='60' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <!-- OT::FixedVersion OT::head::fontRevision -->
          <var-decl name='fontRevision' type-id='type-id-261' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='62' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <!-- OT::ULONG OT::head::checkSumAdjustment -->
          <var-decl name='checkSumAdjustment' type-id='type-id-370' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='63' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='96'>
          <!-- OT::ULONG OT::head::magicNumber -->
          <var-decl name='magicNumber' type-id='type-id-370' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='66' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='128'>
          <!-- OT::USHORT OT::head::flags -->
          <var-decl name='flags' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='67' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='144'>
          <!-- OT::USHORT OT::head::unitsPerEm -->
          <var-decl name='unitsPerEm' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='113' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='160'>
          <!-- OT::LONGDATETIME OT::head::created -->
          <var-decl name='created' type-id='type-id-273' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='116' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='224'>
          <!-- OT::LONGDATETIME OT::head::modified -->
          <var-decl name='modified' type-id='type-id-273' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='118' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='288'>
          <!-- OT::SHORT OT::head::xMin -->
          <var-decl name='xMin' type-id='type-id-419' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='120' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='304'>
          <!-- OT::SHORT OT::head::yMin -->
          <var-decl name='yMin' type-id='type-id-419' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='121' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='320'>
          <!-- OT::SHORT OT::head::xMax -->
          <var-decl name='xMax' type-id='type-id-419' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='122' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='336'>
          <!-- OT::SHORT OT::head::yMax -->
          <var-decl name='yMax' type-id='type-id-419' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='123' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='352'>
          <!-- OT::USHORT OT::head::macStyle -->
          <var-decl name='macStyle' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='124' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='368'>
          <!-- OT::USHORT OT::head::lowestRecPPEM -->
          <var-decl name='lowestRecPPEM' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='132' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='384'>
          <!-- OT::SHORT OT::head::fontDirectionHint -->
          <var-decl name='fontDirectionHint' type-id='type-id-419' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='133' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='400'>
          <!-- OT::SHORT OT::head::indexToLocFormat -->
          <var-decl name='indexToLocFormat' type-id='type-id-419' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='139' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='416'>
          <!-- OT::SHORT OT::head::glyphDataFormat -->
          <var-decl name='glyphDataFormat' type-id='type-id-419' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-head-table.hh' line='140' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct OT::maxp -->
      <class-decl name='maxp' is-struct='yes' visibility='default' size-in-bits='48' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='43' column='1' hash='6d5aeb9b06a6d86c' id='type-id-302'>
        <data-member access='protected' layout-offset-in-bits='0'>
          <!-- OT::FixedVersion OT::maxp::version -->
          <var-decl name='version' type-id='type-id-261' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='58' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='32'>
          <!-- OT::USHORT OT::maxp::numGlyphs -->
          <var-decl name='numGlyphs' type-id='type-id-410' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-ot-maxp-table.hh' line='60' column='1'/>
        </data-member>
      </class-decl>
      <!-- typedef OT::IntType<int, 4u> OT::LONG -->
      <typedef-decl name='LONG' type-id='type-id-264' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='635' column='1' id='type-id-411'/>
      <!-- typedef OT::OffsetTable OT::OpenTypeFontFace -->
      <typedef-decl name='OpenTypeFontFace' type-id='type-id-275' size-in-bits='224' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-file-private.hh' line='119' column='1' id='type-id-353'/>
      <!-- typedef OT::IntType<short int, 2u> OT::SHORT -->
      <typedef-decl name='SHORT' type-id='type-id-266' size-in-bits='16' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='633' column='1' id='type-id-419'/>
      <!-- typedef OT::IntType<unsigned int, 4u> OT::ULONG -->
      <typedef-decl name='ULONG' type-id='type-id-270' size-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='634' column='1' id='type-id-370'/>
      <!-- typedef OT::IntType<short unsigned int, 2u> OT::USHORT -->
      <typedef-decl name='USHORT' type-id='type-id-268' size-in-bits='16' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-open-type-private.hh' line='632' column='1' id='type-id-410'/>
      <!-- struct OT::Supplier<OT::OffsetTo<OT::OffsetTable, OT::IntType<unsigned int, 4u> > > -->
      <class-decl name='Supplier&lt;OT::OffsetTo&lt;OT::OffsetTable, OT::IntType&lt;unsigned int, 4u&gt; &gt; &gt;' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-408'/>
    </namespace-decl>
    <!-- variadic parameter type -->
    <type-decl name='variadic parameter type' id='type-id-420'/>
    <!-- hb_blob_t* (hb_face_t*, hb_tag_t, void*) -->
    <function-type size-in-bits='64' hash='de33efc04dfdcfc0' id='type-id-397'>
      <!-- parameter of type 'hb_face_t*' -->
      <parameter type-id='type-id-168'/>
      <!-- parameter of type 'typedef hb_tag_t' -->
      <parameter type-id='type-id-190'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- hb_blob_t* -->
      <return type-id='type-id-52'/>
    </function-type>
    <!-- hb_bool_t (hb_font_t*, void*, const char*, int, hb_codepoint_t*, void*) -->
    <function-type size-in-bits='64' hash='46ea42e9cf9f3b05' id='type-id-398'>
      <!-- parameter of type 'hb_font_t*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-17'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-11'/>
      <!-- parameter of type 'hb_codepoint_t*' -->
      <parameter type-id='type-id-158'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-type>
    <!-- hb_bool_t (hb_font_t*, void*, hb_codepoint_t, char*, unsigned int, void*) -->
    <function-type size-in-bits='64' hash='e2b7276dd23071f4' id='type-id-399'>
      <!-- parameter of type 'hb_font_t*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-38'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-type>
    <!-- hb_bool_t (hb_font_t*, void*, hb_codepoint_t, hb_codepoint_t, hb_codepoint_t*, void*) -->
    <function-type size-in-bits='64' hash='cb552453be9f4c68' id='type-id-400'>
      <!-- parameter of type 'hb_font_t*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'hb_codepoint_t*' -->
      <parameter type-id='type-id-158'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-type>
    <!-- hb_bool_t (hb_font_t*, void*, hb_codepoint_t, hb_glyph_extents_t*, void*) -->
    <function-type size-in-bits='64' hash='f98562ea21872f4e' id='type-id-401'>
      <!-- parameter of type 'hb_font_t*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'hb_glyph_extents_t*' -->
      <parameter type-id='type-id-404'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-type>
    <!-- hb_bool_t (hb_font_t*, void*, hb_codepoint_t, hb_position_t*, hb_position_t*, void*) -->
    <function-type size-in-bits='64' hash='01c2280b09bd2de5' id='type-id-402'>
      <!-- parameter of type 'hb_font_t*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'hb_position_t*' -->
      <parameter type-id='type-id-407'/>
      <!-- parameter of type 'hb_position_t*' -->
      <parameter type-id='type-id-407'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-type>
    <!-- hb_bool_t (hb_font_t*, void*, hb_codepoint_t, unsigned int, hb_position_t*, hb_position_t*, void*) -->
    <function-type size-in-bits='64' hash='adc694e8cbaad794' id='type-id-403'>
      <!-- parameter of type 'hb_font_t*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18'/>
      <!-- parameter of type 'hb_position_t*' -->
      <parameter type-id='type-id-407'/>
      <!-- parameter of type 'hb_position_t*' -->
      <parameter type-id='type-id-407'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-type>
    <!-- hb_bool_t (hb_shape_plan_t*, hb_font_t*, hb_buffer_t*, const hb_feature_t*, unsigned int) -->
    <function-type size-in-bits='64' hash='160328095ac8d8c5' id='type-id-243'>
      <!-- parameter of type 'hb_shape_plan_t*' -->
      <parameter type-id='type-id-204'/>
      <!-- parameter of type 'hb_font_t*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'hb_buffer_t*' -->
      <parameter type-id='type-id-155'/>
      <!-- parameter of type 'const hb_feature_t*' -->
      <parameter type-id='type-id-386'/>
      <!-- parameter of type 'unsigned int' -->
      <parameter type-id='type-id-18'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-type>
    <!-- hb_position_t (hb_font_t*, void*, hb_codepoint_t, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' hash='75336aad0cf55ddd' id='type-id-405'>
      <!-- parameter of type 'hb_font_t*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- typedef hb_position_t -->
      <return type-id='type-id-102'/>
    </function-type>
    <!-- hb_position_t (hb_font_t*, void*, hb_codepoint_t, void*) -->
    <function-type size-in-bits='64' hash='cd0f4e1984d8cf98' id='type-id-406'>
      <!-- parameter of type 'hb_font_t*' -->
      <parameter type-id='type-id-159'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- parameter of type 'typedef hb_codepoint_t' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19'/>
      <!-- typedef hb_position_t -->
      <return type-id='type-id-102'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hb-fallback-shape.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='hb-font.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src' language='LANG_C_plus_plus'>
    <!-- hb_font_t* const -->
    <qualified-type-def type-id='type-id-167' const='yes' hash='fc95e671879f71bc' id='type-id-421'/>
    <!-- int* -->
    <pointer-type-def type-id='type-id-11' size-in-bits='64' hash='3fd83b2c14ae2f2f' id='type-id-422'/>
    <!-- hb_font_funcs_t* hb_font_funcs_create() -->
    <function-decl name='hb_font_funcs_create' mangled-name='hb_font_funcs_create' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_create' hash='4e33e703df99fb62'>
      <!-- hb_font_funcs_t* -->
      <return type-id='type-id-169'/>
    </function-decl>
    <!-- hb_font_funcs_t* hb_font_funcs_get_empty() -->
    <function-decl name='hb_font_funcs_get_empty' mangled-name='hb_font_funcs_get_empty' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_get_empty' hash='4e33e703df99fb62'>
      <!-- hb_font_funcs_t* -->
      <return type-id='type-id-169'/>
    </function-decl>
    <!-- hb_font_funcs_t* hb_font_funcs_reference(hb_font_funcs_t*) -->
    <function-decl name='hb_font_funcs_reference' mangled-name='hb_font_funcs_reference' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_reference' hash='3be204c79c347084'>
      <!-- parameter of type 'hb_font_funcs_t*' -->
      <parameter type-id='type-id-169' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='280' column='1'/>
      <!-- hb_font_funcs_t* -->
      <return type-id='type-id-169'/>
    </function-decl>
    <!-- void hb_font_funcs_destroy(hb_font_funcs_t*) -->
    <function-decl name='hb_font_funcs_destroy' mangled-name='hb_font_funcs_destroy' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_destroy' hash='4e33e703df99fb62'>
      <!-- parameter of type 'hb_font_funcs_t*' -->
      <parameter type-id='type-id-169' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='358' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_bool_t hb_font_funcs_set_user_data(hb_font_funcs_t*, hb_user_data_key_t*, void*, hb_destroy_func_t, hb_bool_t) -->
    <function-decl name='hb_font_funcs_set_user_data' mangled-name='hb_font_funcs_set_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_user_data' hash='1709811fe010c246'>
      <!-- parameter of type 'hb_font_funcs_t*' -->
      <parameter type-id='type-id-169' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='321' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='type-id-29' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='322' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='323' column='1'/>
      <!-- parameter of type 'typedef hb_destroy_func_t' -->
      <parameter type-id='type-id-20' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='324' column='1'/>
      <!-- parameter of type 'typedef hb_bool_t' -->
      <parameter type-id='type-id-33' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='325' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-decl>
    <!-- void* hb_font_funcs_get_user_data(hb_font_funcs_t*, hb_user_data_key_t*) -->
    <function-decl name='hb_font_funcs_get_user_data' mangled-name='hb_font_funcs_get_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_get_user_data' hash='28458d9621484e02'>
      <!-- parameter of type 'hb_font_funcs_t*' -->
      <parameter type-id='type-id-169' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='342' column='1'/>
      <!-- parameter of type 'hb_user_data_key_t*' -->
      <parameter type-id='type-id-29' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='343' column='1'/>
      <!-- void* -->
      <return type-id='type-id-19'/>
    </function-decl>
    <!-- void hb_font_funcs_make_immutable(hb_font_funcs_t*) -->
    <function-decl name='hb_font_funcs_make_immutable' mangled-name='hb_font_funcs_make_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_make_immutable' hash='4e33e703df99fb62'>
      <!-- parameter of type 'hb_font_funcs_t*' -->
      <parameter type-id='type-id-169' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='358' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- hb_bool_t hb_font_funcs_is_immutable(hb_font_funcs_t*) -->
    <function-decl name='hb_font_funcs_is_immutable' mangled-name='hb_font_funcs_is_immutable' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_is_immutable' hash='582bd570ec757768'>
      <!-- parameter of type 'hb_font_funcs_t*' -->
      <parameter type-id='type-id-169' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='377' column='1'/>
      <!-- typedef hb_bool_t -->
      <return type-id='type-id-33'/>
    </function-decl>
    <!-- void hb_font_funcs_set_glyph_contour_point_func(hb_font_funcs_t*, hb_font_get_glyph_contour_point_func_t, void*, hb_destroy_func_t) -->
    <function-decl name='hb_font_funcs_set_glyph_contour_point_func' mangled-name='hb_font_funcs_set_glyph_contour_point_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_glyph_contour_point_func' hash='96ea0849cd04a2b5'>
      <!-- parameter of type 'hb_font_funcs_t*' -->
      <parameter type-id='type-id-169' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <!-- parameter of type 'typedef hb_font_get_glyph_contour_point_func_t' -->
      <parameter type-id='type-id-219' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <!-- parameter of type 'typedef hb_destroy_func_t' -->
      <parameter type-id='type-id-20' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- void hb_font_funcs_set_glyph_extents_func(hb_font_funcs_t*, hb_font_get_glyph_extents_func_t, void*, hb_destroy_func_t) -->
    <function-decl name='hb_font_funcs_set_glyph_extents_func' mangled-name='hb_font_funcs_set_glyph_extents_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_glyph_extents_func' hash='96ea0849cd04a2b5'>
      <!-- parameter of type 'hb_font_funcs_t*' -->
      <parameter type-id='type-id-169' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <!-- parameter of type 'typedef hb_font_get_glyph_extents_func_t' -->
      <parameter type-id='type-id-218' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <!-- parameter of type 'typedef hb_destroy_func_t' -->
      <parameter type-id='type-id-20' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <!-- void -->
      <return type-id='type-id-68'/>
    </function-decl>
    <!-- void hb_font_funcs_set_glyph_from_name_func(hb_font_funcs_t*, hb_font_get_glyph_from_name_func_t, void*, hb_destroy_func_t) -->
    <function-decl name='hb_font_funcs_set_glyph_from_name_func' mangled-name='hb_font_funcs_set_glyph_from_name_func' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='hb_font_funcs_set_glyph_from_name_func' hash='96ea0849cd04a2b5'>
      <!-- parameter of type 'hb_font_funcs_t*' -->
      <parameter type-id='type-id-169' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <!-- parameter of type 'typedef hb_font_get_glyph_from_name_func_t' -->
      <parameter type-id='type-id-221' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-19' filepath='/tmp/legendre/spack-stage/spack-stage-04g73E/harfbuzz-0.9.37/src/hb-font.cc' line='411' column='1'/>
