<abi-corpus version='2.4' soname='libtcmalloc_and_profiler.so.4'>
  <elf-needed>
    <dependency name='libunwind.so.8'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- GetHeapProfile -->
    <elf-symbol name='GetHeapProfile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- HeapProfilerDump -->
    <elf-symbol name='HeapProfilerDump' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- HeapProfilerStart -->
    <elf-symbol name='HeapProfilerStart' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- HeapProfilerStop -->
    <elf-symbol name='HeapProfilerStop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- IsHeapProfilerRunning -->
    <elf-symbol name='IsHeapProfilerRunning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- MallocExtension_GetAllocatedSize -->
    <elf-symbol name='MallocExtension_GetAllocatedSize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- MallocExtension_GetEstimatedAllocatedSize -->

    <elf-symbol name='_ZTV19DefaultSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- vtable for HugetlbSysAllocator -->
    <elf-symbol name='_ZTV19HugetlbSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- vtable for TCMallocImplementation -->
    <elf-symbol name='_ZTV22TCMallocImplementation' size='232' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- TCMallocImplementation::GetFreeListSizes(std::vector<MallocExtension::FreeListInfo, std::allocator<MallocExtension::FreeListInfo> >*)::kPageHeapType -->
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE13kPageHeapType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- TCMallocImplementation::GetFreeListSizes(std::vector<MallocExtension::FreeListInfo, std::allocator<MallocExtension::FreeListInfo> >*)::kLargeSpanType -->
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE14kLargeSpanType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- TCMallocImplementation::GetFreeListSizes(std::vector<MallocExtension::FreeListInfo, std::allocator<MallocExtension::FreeListInfo> >*)::kThreadCacheType -->
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE16kThreadCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- TCMallocImplementation::GetFreeListSizes(std::vector<MallocExtension::FreeListInfo, std::allocator<MallocExtension::FreeListInfo> >*)::kCentralCacheType -->
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE17kCentralCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- TCMallocImplementation::GetFreeListSizes(std::vector<MallocExtension::FreeListInfo, std::allocator<MallocExtension::FreeListInfo> >*)::kTransferCacheType -->
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE18kTransferCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- TCMallocImplementation::GetFreeListSizes(std::vector<MallocExtension::FreeListInfo, std::allocator<MallocExtension::FreeListInfo> >*)::kPageHeapUnmappedType -->
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE21kPageHeapUnmappedType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- TCMallocImplementation::GetFreeListSizes(std::vector<MallocExtension::FreeListInfo, std::allocator<MallocExtension::FreeListInfo> >*)::kLargeUnmappedSpanType -->
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE22kLargeUnmappedSpanType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __free_hook -->
    <elf-symbol name='__free_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __malloc_hook -->
    <elf-symbol name='__malloc_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __memalign_hook -->
    <elf-symbol name='__memalign_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __realloc_hook -->
    <elf-symbol name='__realloc_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- heap_leak_checker_bcad_variable -->
    <elf-symbol name='heap_leak_checker_bcad_variable' size='1' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- sys_alloc -->
    <elf-symbol name='sys_alloc' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/base/atomicops-internals-x86.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/dynamic_annotations.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C89'>
    <!-- int RunningOnValgrind() -->
    <function-decl name='RunningOnValgrind' mangled-name='RunningOnValgrind' filepath='src/base/dynamic_annotations.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='RunningOnValgrind' hash='388da3fa973fde78'>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-decl>
    <!-- double ValgrindSlowdown() -->
    <function-decl name='ValgrindSlowdown' mangled-name='ValgrindSlowdown' filepath='src/base/dynamic_annotations.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ValgrindSlowdown' hash='14e245f4052d89de'>
      <!-- double -->
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/elf_mem_image.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- struct Elf64_Ehdr -->
    <class-decl name='Elf64_Ehdr' is-struct='yes' visibility='default' size-in-bits='512' filepath='/usr/include/elf.h' line='88' column='1' hash='b8444b3606110e44' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned char Elf64_Ehdr::e_ident[16] -->
        <var-decl name='e_ident' type-id='type-id-4' visibility='default' filepath='/usr/include/elf.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- Elf64_Half Elf64_Ehdr::e_type -->
        <var-decl name='e_type' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <!-- Elf64_Half Elf64_Ehdr::e_machine -->
        <var-decl name='e_machine' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- Elf64_Word Elf64_Ehdr::e_version -->
        <var-decl name='e_version' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- Elf64_Addr Elf64_Ehdr::e_entry -->
        <var-decl name='e_entry' type-id='type-id-7' visibility='default' filepath='/usr/include/elf.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- Elf64_Off Elf64_Ehdr::e_phoff -->
        <var-decl name='e_phoff' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- Elf64_Off Elf64_Ehdr::e_shoff -->
        <var-decl name='e_shoff' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- Elf64_Word Elf64_Ehdr::e_flags -->
        <var-decl name='e_flags' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <!-- Elf64_Half Elf64_Ehdr::e_ehsize -->
        <var-decl name='e_ehsize' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <!-- Elf64_Half Elf64_Ehdr::e_phentsize -->
        <var-decl name='e_phentsize' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- Elf64_Half Elf64_Ehdr::e_phnum -->
        <var-decl name='e_phnum' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <!-- Elf64_Half Elf64_Ehdr::e_shentsize -->
        <var-decl name='e_shentsize' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <!-- Elf64_Half Elf64_Ehdr::e_shnum -->
        <var-decl name='e_shnum' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='496'>
        <!-- Elf64_Half Elf64_Ehdr::e_shstrndx -->
        <var-decl name='e_shstrndx' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct Elf64_Phdr -->
    <class-decl name='Elf64_Phdr' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/include/elf.h' line='551' column='1' hash='4b4898b4e81729f5' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Elf64_Word Elf64_Phdr::p_type -->
        <var-decl name='p_type' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- Elf64_Word Elf64_Phdr::p_flags -->
        <var-decl name='p_flags' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- Elf64_Off Elf64_Phdr::p_offset -->
        <var-decl name='p_offset' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- Elf64_Addr Elf64_Phdr::p_vaddr -->
        <var-decl name='p_vaddr' type-id='type-id-7' visibility='default' filepath='/usr/include/elf.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- Elf64_Addr Elf64_Phdr::p_paddr -->
        <var-decl name='p_paddr' type-id='type-id-7' visibility='default' filepath='/usr/include/elf.h' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- Elf64_Xword Elf64_Phdr::p_filesz -->
        <var-decl name='p_filesz' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- Elf64_Xword Elf64_Phdr::p_memsz -->
        <var-decl name='p_memsz' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- Elf64_Xword Elf64_Phdr::p_align -->
        <var-decl name='p_align' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='559' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct Elf64_Sym -->
    <class-decl name='Elf64_Sym' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/elf.h' line='389' column='1' hash='59d1917446b00c8f' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Elf64_Word Elf64_Sym::st_name -->
        <var-decl name='st_name' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned char Elf64_Sym::st_info -->
        <var-decl name='st_info' type-id='type-id-12' visibility='default' filepath='/usr/include/elf.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <!-- unsigned char Elf64_Sym::st_other -->
        <var-decl name='st_other' type-id='type-id-12' visibility='default' filepath='/usr/include/elf.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <!-- Elf64_Section Elf64_Sym::st_shndx -->
        <var-decl name='st_shndx' type-id='type-id-13' visibility='default' filepath='/usr/include/elf.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- Elf64_Addr Elf64_Sym::st_value -->
        <var-decl name='st_value' type-id='type-id-7' visibility='default' filepath='/usr/include/elf.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- Elf64_Xword Elf64_Sym::st_size -->
        <var-decl name='st_size' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='395' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct Elf64_Verdaux -->
    <class-decl name='Elf64_Verdaux' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/include/elf.h' line='849' column='1' hash='df0b1edc7130741e' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Elf64_Word Elf64_Verdaux::vda_name -->
        <var-decl name='vda_name' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='850' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- Elf64_Word Elf64_Verdaux::vda_next -->
        <var-decl name='vda_next' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='851' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct Elf64_Verdef -->
    <class-decl name='Elf64_Verdef' is-struct='yes' visibility='default' size-in-bits='160' filepath='/usr/include/elf.h' line='812' column='1' hash='77561b1a99135bd1' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Elf64_Half Elf64_Verdef::vd_version -->
        <var-decl name='vd_version' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <!-- Elf64_Half Elf64_Verdef::vd_flags -->
        <var-decl name='vd_flags' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- Elf64_Half Elf64_Verdef::vd_ndx -->
        <var-decl name='vd_ndx' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <!-- Elf64_Half Elf64_Verdef::vd_cnt -->
        <var-decl name='vd_cnt' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- Elf64_Word Elf64_Verdef::vd_hash -->
        <var-decl name='vd_hash' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- Elf64_Word Elf64_Verdef::vd_aux -->
        <var-decl name='vd_aux' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='818' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- Elf64_Word Elf64_Verdef::vd_next -->
        <var-decl name='vd_next' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='819' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef uint64_t Elf64_Addr -->
    <typedef-decl name='Elf64_Addr' type-id='type-id-16' size-in-bits='64' filepath='/usr/include/elf.h' line='50' column='1' hash='8fdc5eea2983a729' id='type-id-7'/>
    <!-- typedef uint16_t Elf64_Half -->
    <typedef-decl name='Elf64_Half' type-id='type-id-17' size-in-bits='16' filepath='/usr/include/elf.h' line='34' column='1' hash='d7723bb93a30b11d' id='type-id-5'/>
    <!-- typedef uint64_t Elf64_Off -->
    <typedef-decl name='Elf64_Off' type-id='type-id-16' size-in-bits='64' filepath='/usr/include/elf.h' line='54' column='1' hash='8fdc5eea2983a729' id='type-id-8'/>
    <!-- typedef uint16_t Elf64_Section -->
    <typedef-decl name='Elf64_Section' type-id='type-id-17' size-in-bits='16' filepath='/usr/include/elf.h' line='58' column='1' hash='d7723bb93a30b11d' id='type-id-13'/>
    <!-- typedef Elf64_Half Elf64_Versym -->
    <typedef-decl name='Elf64_Versym' type-id='type-id-5' size-in-bits='16' filepath='/usr/include/elf.h' line='62' column='1' hash='d7723bb93a30b11d' id='type-id-18'/>
    <!-- typedef uint32_t Elf64_Word -->
    <typedef-decl name='Elf64_Word' type-id='type-id-19' size-in-bits='32' filepath='/usr/include/elf.h' line='39' column='1' hash='e66b43f97c38e87a' id='type-id-6'/>
    <!-- typedef uint64_t Elf64_Xword -->
    <typedef-decl name='Elf64_Xword' type-id='type-id-16' size-in-bits='64' filepath='/usr/include/elf.h' line='45' column='1' hash='8fdc5eea2983a729' id='type-id-10'/>
    <!-- typedef unsigned short int uint16_t -->
    <typedef-decl name='uint16_t' type-id='type-id-20' size-in-bits='16' filepath='/usr/include/stdint.h' line='50' column='1' hash='d7723bb93a30b11d' id='type-id-17'/>
    <!-- unsigned char[16] -->
    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='128' hash='db96c40792853cfe' id='type-id-4'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-22'/>
    </array-type-def>
    <!-- base::ElfMemImage* -->
    <pointer-type-def type-id='type-id-23' size-in-bits='64' hash='1e56033bc929c937' id='type-id-24'/>
    <!-- base::ElfMemImage* const -->
    <qualified-type-def type-id='type-id-24' const='yes' hash='f1b7844269f07355' id='type-id-25'/>
    <!-- base::ElfMemImage::SymbolInfo* -->
    <pointer-type-def type-id='type-id-26' size-in-bits='64' hash='c661d6d612749156' id='type-id-27'/>
    <!-- base::ElfMemImage::SymbolIterator& -->
    <reference-type-def kind='lvalue' type-id='type-id-28' size-in-bits='64' hash='8b6e5057d6b5677d' id='type-id-29'/>
    <!-- base::ElfMemImage::SymbolIterator* -->
    <pointer-type-def type-id='type-id-28' size-in-bits='64' hash='635526182f95463f' id='type-id-30'/>
    <!-- base::ElfMemImage::SymbolIterator* const -->
    <qualified-type-def type-id='type-id-30' const='yes' hash='186b418ac290dd1e' id='type-id-31'/>
    <!-- const Elf64_Ehdr -->
    <qualified-type-def type-id='type-id-3' const='yes' hash='14748f303e55779d' id='type-id-32'/>
    <!-- const Elf64_Ehdr* -->
    <pointer-type-def type-id='type-id-32' size-in-bits='64' hash='59489a54900ba47f' id='type-id-33'/>
    <!-- const Elf64_Phdr -->
    <qualified-type-def type-id='type-id-9' const='yes' hash='51611f98abc3863c' id='type-id-34'/>
    <!-- const Elf64_Phdr* -->
    <pointer-type-def type-id='type-id-34' size-in-bits='64' hash='d7f46a025d7f7c6d' id='type-id-35'/>
    <!-- const Elf64_Sym -->
    <qualified-type-def type-id='type-id-11' const='yes' hash='f86c8f4238204abd' id='type-id-36'/>
    <!-- const Elf64_Sym* -->
    <pointer-type-def type-id='type-id-36' size-in-bits='64' hash='bb500a4acf88d8ae' id='type-id-37'/>
    <!-- const Elf64_Verdaux -->
    <qualified-type-def type-id='type-id-14' const='yes' hash='3122248828a85ad6' id='type-id-38'/>
    <!-- const Elf64_Verdaux* -->
    <pointer-type-def type-id='type-id-38' size-in-bits='64' hash='a8ce44e51dd263b5' id='type-id-39'/>
    <!-- const Elf64_Verdef -->
    <qualified-type-def type-id='type-id-15' const='yes' hash='9213bfaf32811abc' id='type-id-40'/>
    <!-- const Elf64_Verdef* -->
    <pointer-type-def type-id='type-id-40' size-in-bits='64' hash='0b792ee854dc0a3d' id='type-id-41'/>
    <!-- const Elf64_Versym -->
    <qualified-type-def type-id='type-id-18' const='yes' hash='6b03cd1b2e9f59d2' id='type-id-42'/>
    <!-- const Elf64_Versym* -->
    <pointer-type-def type-id='type-id-42' size-in-bits='64' hash='f7c6974d4513ad7a' id='type-id-43'/>
    <!-- const Elf64_Word -->
    <qualified-type-def type-id='type-id-6' const='yes' hash='c64c1cc1c357abd4' id='type-id-44'/>
    <!-- const Elf64_Word* -->
    <pointer-type-def type-id='type-id-44' size-in-bits='64' hash='dac049f837fbb92d' id='type-id-45'/>
    <!-- const base::ElfMemImage -->
    <qualified-type-def type-id='type-id-23' const='yes' hash='27cfb399ca2a9740' id='type-id-46'/>
    <!-- const base::ElfMemImage* -->
    <pointer-type-def type-id='type-id-46' size-in-bits='64' hash='289d86e4e6d3ba90' id='type-id-47'/>
    <!-- const base::ElfMemImage* const -->
    <qualified-type-def type-id='type-id-47' const='yes' hash='5f483868ab6482f6' id='type-id-48'/>
    <!-- const base::ElfMemImage::SymbolInfo -->
    <qualified-type-def type-id='type-id-26' const='yes' hash='582c37401cca44e8' id='type-id-49'/>
    <!-- const base::ElfMemImage::SymbolInfo& -->
    <reference-type-def kind='lvalue' type-id='type-id-49' size-in-bits='64' hash='2019f0f21fb97678' id='type-id-50'/>
    <!-- const base::ElfMemImage::SymbolInfo* -->
    <pointer-type-def type-id='type-id-49' size-in-bits='64' hash='5f8c35f8fe44aeea' id='type-id-51'/>
    <!-- const base::ElfMemImage::SymbolIterator -->
    <qualified-type-def type-id='type-id-28' const='yes' hash='6b9dbc64c2dabfef' id='type-id-52'/>
    <!-- const base::ElfMemImage::SymbolIterator& -->
    <reference-type-def kind='lvalue' type-id='type-id-52' size-in-bits='64' hash='0251d0dc239aaf4e' id='type-id-53'/>
    <!-- const base::ElfMemImage::SymbolIterator* -->
    <pointer-type-def type-id='type-id-52' size-in-bits='64' hash='4042f591ef3d8b00' id='type-id-54'/>
    <!-- const base::ElfMemImage::SymbolIterator* const -->
    <qualified-type-def type-id='type-id-54' const='yes' hash='37778b6ac0e06145' id='type-id-55'/>
    <!-- void* const -->
    <qualified-type-def type-id='type-id-56' const='yes' id='type-id-57'/>
    <!-- namespace base -->
    <namespace-decl name='base'>
      <!-- class base::ElfMemImage -->
      <class-decl name='ElfMemImage' visibility='default' size-in-bits='576' filepath='./src/base/elf_mem_image.h' line='56' column='1' hash='434e64cbebe51257#2' id='type-id-23'>
        <member-type access='private'>
          <!-- class base::ElfMemImage::SymbolIterator -->
          <class-decl name='SymbolIterator' visibility='default' size-in-bits='384' filepath='./src/base/elf_mem_image.h' line='73' column='1' hash='be3efe276e58a8dd' id='type-id-28'>
            <data-member access='private' layout-offset-in-bits='0'>
              <!-- base::ElfMemImage::SymbolInfo base::ElfMemImage::SymbolIterator::info_ -->
              <var-decl name='info_' type-id='type-id-26' visibility='default' filepath='./src/base/elf_mem_image.h' line='84' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='256'>
              <!-- int base::ElfMemImage::SymbolIterator::index_ -->
              <var-decl name='index_' type-id='type-id-1' visibility='default' filepath='./src/base/elf_mem_image.h' line='85' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='320'>
              <!-- void* const base::ElfMemImage::SymbolIterator::image_ -->
              <var-decl name='image_' type-id='type-id-57' visibility='default' filepath='./src/base/elf_mem_image.h' line='86' column='1'/>
            </data-member>
            <member-function access='private' constructor='yes'>
              <!-- base::ElfMemImage::SymbolIterator::SymbolIterator(void* const, int) -->
              <function-decl name='SymbolIterator' mangled-name='_ZN4base11ElfMemImage14SymbolIteratorC2EPKvi' filepath='src/base/elf_mem_image.cc' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIteratorC2EPKvi' hash='388da3fa973fde78'>
                <!-- implicit parameter of type 'base::ElfMemImage::SymbolIterator*' -->
                <parameter type-id='type-id-30' is-artificial='yes'/>
                <!-- parameter of type 'void* const' -->
                <parameter type-id='type-id-57' filepath='src/base/elf_mem_image.cc' line='358' column='1'/>
                <!-- parameter of type 'int' -->
                <parameter type-id='type-id-1' filepath='src/base/elf_mem_image.cc' line='358' column='1'/>
                <!-- void -->
                <return type-id='type-id-58'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <!-- const base::ElfMemImage::SymbolInfo* base::ElfMemImage::SymbolIterator::operator&#45;>() -->
              <function-decl name='operator-&gt;' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratorptEv' filepath='src/base/elf_mem_image.cc' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratorptEv' hash='e9a84514e205fbc5'>
                <!-- implicit parameter of type 'const base::ElfMemImage::SymbolIterator*' -->
                <parameter type-id='type-id-54' is-artificial='yes'/>
                <!-- const base::ElfMemImage::SymbolInfo* -->
                <return type-id='type-id-51'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <!-- const base::ElfMemImage::SymbolInfo& base::ElfMemImage::SymbolIterator::operator*() -->
              <function-decl name='operator*' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratordeEv' filepath='src/base/elf_mem_image.cc' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratordeEv' hash='47bdb57ada052f30'>
                <!-- implicit parameter of type 'const base::ElfMemImage::SymbolIterator*' -->
                <parameter type-id='type-id-54' is-artificial='yes'/>
                <!-- const base::ElfMemImage::SymbolInfo& -->
                <return type-id='type-id-50'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <!-- bool base::ElfMemImage::SymbolIterator::operator==(const base::ElfMemImage::SymbolIterator&) -->
              <function-decl name='operator==' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratoreqERKS1_' filepath='src/base/elf_mem_image.cc' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratoreqERKS1_' hash='c1dcd64da70beccd'>
                <!-- implicit parameter of type 'const base::ElfMemImage::SymbolIterator*' -->
                <parameter type-id='type-id-54' is-artificial='yes'/>
                <!-- parameter of type 'const base::ElfMemImage::SymbolIterator&' -->
                <parameter type-id='type-id-53'/>
                <!-- bool -->
                <return type-id='type-id-59'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <!-- bool base::ElfMemImage::SymbolIterator::operator!=(const base::ElfMemImage::SymbolIterator&) -->
              <function-decl name='operator!=' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratorneERKS1_' filepath='src/base/elf_mem_image.cc' line='374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratorneERKS1_' hash='c1dcd64da70beccd'>
                <!-- implicit parameter of type 'const base::ElfMemImage::SymbolIterator*' -->
                <parameter type-id='type-id-54' is-artificial='yes'/>
                <!-- parameter of type 'const base::ElfMemImage::SymbolIterator&' -->
                <parameter type-id='type-id-53'/>
                <!-- bool -->
                <return type-id='type-id-59'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <!-- void base::ElfMemImage::SymbolIterator::Update(int) -->
              <function-decl name='Update' mangled-name='_ZN4base11ElfMemImage14SymbolIterator6UpdateEi' filepath='src/base/elf_mem_image.cc' line='393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIterator6UpdateEi' hash='388da3fa973fde78'>
                <!-- implicit parameter of type 'base::ElfMemImage::SymbolIterator*' -->
                <parameter type-id='type-id-30' is-artificial='yes'/>
                <!-- parameter of type 'int' -->
                <parameter type-id='type-id-1'/>
                <!-- void -->
                <return type-id='type-id-58'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <!-- base::ElfMemImage::SymbolIterator& base::ElfMemImage::SymbolIterator::operator++() -->
              <function-decl name='operator++' mangled-name='_ZN4base11ElfMemImage14SymbolIteratorppEv' filepath='src/base/elf_mem_image.cc' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIteratorppEv' hash='62b99d6f5f9ef80a'>
                <!-- implicit parameter of type 'base::ElfMemImage::SymbolIterator*' -->
                <parameter type-id='type-id-30' is-artificial='yes'/>
                <!-- base::ElfMemImage::SymbolIterator& -->
                <return type-id='type-id-29'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <!-- struct base::ElfMemImage::SymbolInfo -->
          <class-decl name='SymbolInfo' is-struct='yes' visibility='default' size-in-bits='256' filepath='./src/base/elf_mem_image.h' line='64' column='1' hash='188c20ff50814f74' id='type-id-26'>
            <data-member access='public' layout-offset-in-bits='0'>
              <!-- const char* base::ElfMemImage::SymbolInfo::name -->
              <var-decl name='name' type-id='type-id-60' visibility='default' filepath='./src/base/elf_mem_image.h' line='65' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <!-- const char* base::ElfMemImage::SymbolInfo::version -->
              <var-decl name='version' type-id='type-id-60' visibility='default' filepath='./src/base/elf_mem_image.h' line='66' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <!-- void* base::ElfMemImage::SymbolInfo::address -->
              <var-decl name='address' type-id='type-id-56' visibility='default' filepath='./src/base/elf_mem_image.h' line='68' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <!-- const Elf64_Sym* base::ElfMemImage::SymbolInfo::symbol -->
              <var-decl name='symbol' type-id='type-id-37' visibility='default' filepath='./src/base/elf_mem_image.h' line='69' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <!-- static void* const base::ElfMemImage::kInvalidBase -->
          <var-decl name='kInvalidBase' type-id='type-id-57' mangled-name='_ZN4base11ElfMemImage12kInvalidBaseE' visibility='default' filepath='src/base/elf_mem_image.cc' line='111' column='1' elf-symbol-id='_ZN4base11ElfMemImage12kInvalidBaseE'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- const Elf64_Ehdr* base::ElfMemImage::ehdr_ -->
          <var-decl name='ehdr_' type-id='type-id-33' visibility='default' filepath='./src/base/elf_mem_image.h' line='120' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- const Elf64_Sym* base::ElfMemImage::dynsym_ -->
          <var-decl name='dynsym_' type-id='type-id-37' visibility='default' filepath='./src/base/elf_mem_image.h' line='121' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- const Elf64_Versym* base::ElfMemImage::versym_ -->
          <var-decl name='versym_' type-id='type-id-43' visibility='default' filepath='./src/base/elf_mem_image.h' line='122' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <!-- const Elf64_Verdef* base::ElfMemImage::verdef_ -->
          <var-decl name='verdef_' type-id='type-id-41' visibility='default' filepath='./src/base/elf_mem_image.h' line='123' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <!-- const Elf64_Word* base::ElfMemImage::hash_ -->
          <var-decl name='hash_' type-id='type-id-45' visibility='default' filepath='./src/base/elf_mem_image.h' line='124' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='320'>
          <!-- const char* base::ElfMemImage::dynstr_ -->
          <var-decl name='dynstr_' type-id='type-id-60' visibility='default' filepath='./src/base/elf_mem_image.h' line='125' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='384'>
          <!-- size_t base::ElfMemImage::strsize_ -->
          <var-decl name='strsize_' type-id='type-id-61' visibility='default' filepath='./src/base/elf_mem_image.h' line='126' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='448'>
          <!-- size_t base::ElfMemImage::verdefnum_ -->
          <var-decl name='verdefnum_' type-id='type-id-61' visibility='default' filepath='./src/base/elf_mem_image.h' line='127' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='512'>
          <!-- Elf64_Addr base::ElfMemImage::link_base_ -->
          <var-decl name='link_base_' type-id='type-id-7' visibility='default' filepath='./src/base/elf_mem_image.h' line='128' column='1'/>
        </data-member>
        <member-function access='private'>
          <!-- int base::ElfMemImage::GetNumSymbols() -->
          <function-decl name='GetNumSymbols' mangled-name='_ZNK4base11ElfMemImage13GetNumSymbolsEv' filepath='src/base/elf_mem_image.cc' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage13GetNumSymbolsEv' hash='388da3fa973fde78'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- int -->
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const Elf64_Verdaux* base::ElfMemImage::GetVerdefAux(const Elf64_Verdef*) -->
          <function-decl name='GetVerdefAux' mangled-name='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef' filepath='src/base/elf_mem_image.cc' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef' hash='19f69f6f7c219776'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'const Elf64_Verdef*' -->
            <parameter type-id='type-id-41'/>
            <!-- const Elf64_Verdaux* -->
            <return type-id='type-id-39'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- base::ElfMemImage::SymbolIterator base::ElfMemImage::end() -->
          <function-decl name='end' mangled-name='_ZNK4base11ElfMemImage3endEv' filepath='src/base/elf_mem_image.cc' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage3endEv' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- class base::ElfMemImage::SymbolIterator -->
            <return type-id='type-id-28'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const char* base::ElfMemImage::GetVerstr(Elf64_Word) -->
          <function-decl name='GetVerstr' mangled-name='_ZNK4base11ElfMemImage9GetVerstrEj' filepath='src/base/elf_mem_image.cc' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerstrEj' hash='cf5212e813271279'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'typedef Elf64_Word' -->
            <parameter type-id='type-id-6'/>
            <!-- const char* -->
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const Elf64_Verdef* base::ElfMemImage::GetVerdef(int) -->
          <function-decl name='GetVerdef' mangled-name='_ZNK4base11ElfMemImage9GetVerdefEi' filepath='src/base/elf_mem_image.cc' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerdefEi' hash='c6a2702b6944e5b2'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- const Elf64_Verdef* -->
            <return type-id='type-id-41'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void* base::ElfMemImage::GetSymAddr(const Elf64_Sym*) -->
          <function-decl name='GetSymAddr' mangled-name='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym' filepath='src/base/elf_mem_image.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym' hash='2685c9e30f0e9c0a'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'const Elf64_Sym*' -->
            <parameter type-id='type-id-37'/>
            <!-- void* -->
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const char* base::ElfMemImage::GetDynstr(Elf64_Word) -->
          <function-decl name='GetDynstr' mangled-name='_ZNK4base11ElfMemImage9GetDynstrEj' filepath='src/base/elf_mem_image.cc' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynstrEj' hash='cf5212e813271279'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'typedef Elf64_Word' -->
            <parameter type-id='type-id-6'/>
            <!-- const char* -->
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const Elf64_Phdr* base::ElfMemImage::GetPhdr(int) -->
          <function-decl name='GetPhdr' mangled-name='_ZNK4base11ElfMemImage7GetPhdrEi' filepath='src/base/elf_mem_image.cc' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage7GetPhdrEi' hash='347de63754287c77'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- const Elf64_Phdr* -->
            <return type-id='type-id-35'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void base::ElfMemImage::Init(void*) -->
          <function-decl name='Init' mangled-name='_ZN4base11ElfMemImage4InitEPKv' filepath='src/base/elf_mem_image.cc' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage4InitEPKv' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type 'base::ElfMemImage*' -->
            <parameter type-id='type-id-24' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-56'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <!-- base::ElfMemImage::ElfMemImage(void*) -->
          <function-decl name='ElfMemImage' mangled-name='_ZN4base11ElfMemImageC1EPKv' filepath='src/base/elf_mem_image.cc' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImageC1EPKv' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type 'base::ElfMemImage*' -->
            <parameter type-id='type-id-24' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-56'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const Elf64_Versym* base::ElfMemImage::GetVersym(int) -->
          <function-decl name='GetVersym' mangled-name='_ZNK4base11ElfMemImage9GetVersymEi' filepath='src/base/elf_mem_image.cc' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVersymEi' hash='ad58fd7867afcd7f'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- const Elf64_Versym* -->
            <return type-id='type-id-43'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const Elf64_Sym* base::ElfMemImage::GetDynsym(int) -->
          <function-decl name='GetDynsym' mangled-name='_ZNK4base11ElfMemImage9GetDynsymEi' filepath='src/base/elf_mem_image.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynsymEi' hash='3f9d161fff24d853'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- const Elf64_Sym* -->
            <return type-id='type-id-37'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- base::ElfMemImage::SymbolIterator base::ElfMemImage::begin() -->
          <function-decl name='begin' mangled-name='_ZNK4base11ElfMemImage5beginEv' filepath='src/base/elf_mem_image.cc' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage5beginEv' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- class base::ElfMemImage::SymbolIterator -->
            <return type-id='type-id-28'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool base::ElfMemImage::LookupSymbolByAddress(void*, base::ElfMemImage::SymbolInfo*) -->
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE' filepath='src/base/elf_mem_image.cc' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE' hash='b897a0ddbd63cce5'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-56'/>
            <!-- parameter of type 'base::ElfMemImage::SymbolInfo*' -->
            <parameter type-id='type-id-27'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool base::ElfMemImage::LookupSymbol(const char*, const char*, int, base::ElfMemImage::SymbolInfo*) -->
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE' filepath='src/base/elf_mem_image.cc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE' hash='d055b32b0e2d828c'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'const char*' -->
            <parameter type-id='type-id-60'/>
            <!-- parameter of type 'const char*' -->
            <parameter type-id='type-id-60'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- parameter of type 'base::ElfMemImage::SymbolInfo*' -->
            <parameter type-id='type-id-27'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <!-- base::ElfMemImage::SymbolIterator (base::ElfMemImage::*) () -->
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-62'>
      <!-- implicit parameter of type 'const base::ElfMemImage*' -->
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <!-- class base::ElfMemImage::SymbolIterator -->
      <return type-id='type-id-28'/>
    </function-type>
    <!-- bool (base::ElfMemImage::*) (const char*, const char*, int, base::ElfMemImage::SymbolInfo*) -->
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='d055b32b0e2d828c' id='type-id-63'>
      <!-- implicit parameter of type 'const base::ElfMemImage*' -->
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-60'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-60'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- parameter of type 'base::ElfMemImage::SymbolInfo*' -->
      <parameter type-id='type-id-27'/>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- bool (base::ElfMemImage::*) (void*, base::ElfMemImage::SymbolInfo*) -->
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='b897a0ddbd63cce5' id='type-id-64'>
      <!-- implicit parameter of type 'const base::ElfMemImage*' -->
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-56'/>
      <!-- parameter of type 'base::ElfMemImage::SymbolInfo*' -->
      <parameter type-id='type-id-27'/>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- const Elf64_Phdr* (base::ElfMemImage::*) (int) -->
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='347de63754287c77' id='type-id-65'>
      <!-- implicit parameter of type 'const base::ElfMemImage*' -->
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- const Elf64_Phdr* -->
      <return type-id='type-id-35'/>
    </function-type>
    <!-- const Elf64_Sym* (base::ElfMemImage::*) (int) -->
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='3f9d161fff24d853' id='type-id-66'>
      <!-- implicit parameter of type 'const base::ElfMemImage*' -->
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- const Elf64_Sym* -->
      <return type-id='type-id-37'/>
    </function-type>
    <!-- const Elf64_Verdaux* (base::ElfMemImage::*) (const Elf64_Verdef*) -->
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='19f69f6f7c219776' id='type-id-67'>
      <!-- implicit parameter of type 'const base::ElfMemImage*' -->
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <!-- parameter of type 'const Elf64_Verdef*' -->
      <parameter type-id='type-id-41'/>
      <!-- const Elf64_Verdaux* -->
      <return type-id='type-id-39'/>
    </function-type>
    <!-- const Elf64_Verdef* (base::ElfMemImage::*) (int) -->
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='c6a2702b6944e5b2' id='type-id-68'>
      <!-- implicit parameter of type 'const base::ElfMemImage*' -->
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- const Elf64_Verdef* -->
      <return type-id='type-id-41'/>
    </function-type>
    <!-- const Elf64_Versym* (base::ElfMemImage::*) (int) -->
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='ad58fd7867afcd7f' id='type-id-69'>
      <!-- implicit parameter of type 'const base::ElfMemImage*' -->
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- const Elf64_Versym* -->
      <return type-id='type-id-43'/>
    </function-type>
    <!-- const char* (base::ElfMemImage::*) (Elf64_Word) -->
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='cf5212e813271279' id='type-id-70'>
      <!-- implicit parameter of type 'const base::ElfMemImage*' -->
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <!-- parameter of type 'typedef Elf64_Word' -->
      <parameter type-id='type-id-6'/>
      <!-- const char* -->
      <return type-id='type-id-60'/>
    </function-type>
    <!-- int (base::ElfMemImage::*) () -->
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='388da3fa973fde78' id='type-id-71'>
      <!-- implicit parameter of type 'const base::ElfMemImage*' -->
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-type>
    <!-- void (base::ElfMemImage::*) (void*) -->
    <function-type method-class-id='type-id-23' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-72'>
      <!-- implicit parameter of type 'base::ElfMemImage*' -->
      <parameter type-id='type-id-24' is-artificial='yes'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-56'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void* (base::ElfMemImage::*) (const Elf64_Sym*) -->
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='2685c9e30f0e9c0a' id='type-id-73'>
      <!-- implicit parameter of type 'const base::ElfMemImage*' -->
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <!-- parameter of type 'const Elf64_Sym*' -->
      <parameter type-id='type-id-37'/>
      <!-- void* -->
      <return type-id='type-id-56'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/linuxthreads.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- typedef int (*)(void*, int, pid_t*, typedef __va_list_tag __va_list_tag*) ListAllProcessThreadsCallBack -->
    <typedef-decl name='ListAllProcessThreadsCallBack' type-id='type-id-74' size-in-bits='64' filepath='./src/base/thread_lister.h' line='48' column='1' hash='fd7a63c0c6c822c4' id='type-id-75'/>
    <!-- typedef int __pid_t -->
    <typedef-decl name='__pid_t' type-id='type-id-1' size-in-bits='32' filepath='/usr/include/bits/types.h' line='143' column='1' hash='09d17c08f594edc7' id='type-id-76'/>
    <!-- typedef __pid_t pid_t -->
    <typedef-decl name='pid_t' type-id='type-id-76' size-in-bits='32' filepath='/usr/include/sched.h' line='37' column='1' hash='09d17c08f594edc7' id='type-id-77'/>
    <!-- int (*)(void*, int, pid_t*, typedef __va_list_tag __va_list_tag*) -->
    <pointer-type-def type-id='type-id-78' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-74'/>
    <!-- pid_t* -->
    <pointer-type-def type-id='type-id-77' size-in-bits='64' hash='7e9a76962b5dc492' id='type-id-79'/>
    <!-- int TCMalloc_ListAllProcessThreads(void*, ListAllProcessThreadsCallBack, ...) -->
    <function-decl name='TCMalloc_ListAllProcessThreads' mangled-name='TCMalloc_ListAllProcessThreads' filepath='src/base/linuxthreads.cc' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMalloc_ListAllProcessThreads' hash='a7f99494147764a8'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-56' filepath='src/base/linuxthreads.cc' line='551' column='1'/>
      <!-- parameter of type 'typedef ListAllProcessThreadsCallBack' -->
      <parameter type-id='type-id-75' filepath='src/base/linuxthreads.cc' line='552' column='1'/>
      <parameter is-variadic='yes'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-decl>
    <!-- int TCMalloc_ResumeAllProcessThreads(int, pid_t*) -->
    <function-decl name='TCMalloc_ResumeAllProcessThreads' mangled-name='TCMalloc_ResumeAllProcessThreads' filepath='src/base/linuxthreads.cc' line='696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMalloc_ResumeAllProcessThreads' hash='44a39430792b90b1'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1' filepath='src/base/linuxthreads.cc' line='696' column='1'/>
      <!-- parameter of type 'pid_t*' -->
      <parameter type-id='type-id-79' filepath='src/base/linuxthreads.cc' line='696' column='1'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-decl>
    <!-- int (void*, int, pid_t*, typedef __va_list_tag __va_list_tag*) -->
    <function-type size-in-bits='64' hash='60f7fa789d54ab1c' id='type-id-78'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-56'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- parameter of type 'pid_t*' -->
      <parameter type-id='type-id-79'/>
      <!-- parameter of type 'typedef __va_list_tag __va_list_tag*' -->
      <parameter type-id='type-id-80'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/logging.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- namespace FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead -->
    <namespace-decl name='FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead'>
      <!-- int32 FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead::FLAGS_verbose -->
      <var-decl name='FLAGS_verbose' type-id='type-id-81' mangled-name='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead13FLAGS_verboseE' visibility='default' filepath='src/base/logging.cc' line='38' column='1' elf-symbol-id='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead13FLAGS_verboseE'/>
      <!-- char FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead::FLAGS_noverbose -->
      <var-decl name='FLAGS_noverbose' type-id='type-id-82' mangled-name='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead15FLAGS_noverboseE' visibility='default' filepath='src/base/logging.cc' line='40' column='1' elf-symbol-id='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead15FLAGS_noverboseE'/>
    </namespace-decl>
    <!-- RawFD RawOpenForWriting(const char*) -->
    <function-decl name='RawOpenForWriting' mangled-name='_Z17RawOpenForWritingPKc' filepath='src/base/logging.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17RawOpenForWritingPKc' hash='e9ea91a7eab8302c'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-60' filepath='src/base/logging.cc' line='90' column='1'/>
      <!-- typedef RawFD -->
      <return type-id='type-id-83'/>
    </function-decl>
    <!-- void RawWrite(RawFD, const char*, size_t) -->
    <function-decl name='RawWrite' mangled-name='_Z8RawWriteiPKcm' filepath='src/base/logging.cc' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8RawWriteiPKcm' hash='e1f9b6b88b6e9119'>
      <!-- parameter of type 'typedef RawFD' -->
      <parameter type-id='type-id-83' filepath='src/base/logging.cc' line='94' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-60' filepath='src/base/logging.cc' line='94' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-61' filepath='src/base/logging.cc' line='94' column='1'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-decl>
    <!-- void RawClose(RawFD) -->
    <function-decl name='RawClose' mangled-name='_Z8RawClosei' filepath='src/base/logging.cc' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8RawClosei' hash='388da3fa973fde78'>
      <!-- parameter of type 'typedef RawFD' -->
      <parameter type-id='type-id-83' filepath='src/base/logging.cc' line='104' column='1'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/low_level_alloc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- low_level_alloc_internal::AllocList*[30] -->
    <array-type-def dimensions='1' type-id='type-id-84' size-in-bits='1920' hash='cb2d83dd86b161f3' id='type-id-85'>
      <!-- <anonymous range>[30] -->
      <subrange length='30' lower-bound='0' upper-bound='29' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='cbb4475e64ad0d01' id='type-id-86'/>
    </array-type-def>
    <!-- LowLevelAlloc::Arena* const -->
    <qualified-type-def type-id='type-id-87' const='yes' hash='df5c356d651669e3' id='type-id-88'/>
    <!-- low_level_alloc_internal::AllocList* -->
    <pointer-type-def type-id='type-id-89' size-in-bits='64' hash='a5d279e9377417e1' id='type-id-84'/>
    <!-- namespace base -->
    <namespace-decl name='base'>
      <!-- namespace base::subtle -->
      <namespace-decl name='subtle'>
        <!-- typedef int64_t base::subtle::Atomic64 -->
        <typedef-decl name='Atomic64' type-id='type-id-90' size-in-bits='64' filepath='./src/base/atomicops-internals-x86.h' line='70' column='1' hash='b119fe0931d2ee10' id='type-id-91'/>
      </namespace-decl>
      <!-- enum base::LinkerInitialized -->
      <enum-decl name='LinkerInitialized' size-in-bits='32' alignment-in-bits='32' filepath='./src/base/basictypes.h' line='381' column='1' hash='104662f2c242e63e' id='type-id-92'>
        <underlying-type type-id='type-id-93'/>
        <enumerator name='LINKER_INITIALIZED' value='0'/>
      </enum-decl>
      <!-- namespace base::internal -->
      <namespace-decl name='internal'>
        <!-- struct base::internal::HookList<void (*)(const void*)> -->
        <class-decl name='HookList&lt;void (*)(const void*)&gt;' is-struct='yes' visibility='default' hash='799b4a13de4db312' id='type-id-94'/>
        <!-- struct base::internal::HookList<void (*)(const void*, size_t)> -->
        <class-decl name='HookList&lt;void (*)(const void*, size_t)&gt;' is-struct='yes' visibility='default' hash='83f25c96216ff315' id='type-id-95'>
          <member-function access='public'>
            <!-- void (*)(void*, size_t) base::internal::HookList<void (*)(const void*, size_t)>::GetSingular() -->
            <function-decl name='GetSingular' mangled-name='_ZNK4base8internal8HookListIPFvPKvmEE11GetSingularEv' filepath='src/malloc_hook-inl.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base8internal8HookListIPFvPKvmEE11GetSingularEv' hash='5695f5ce05a4c55f'>
              <!-- implicit parameter of type 'const base::internal::HookList<void (*)(const void*, size_t)>*' -->
              <parameter type-id='type-id-96' is-artificial='yes'/>
              <!-- void (*)(void*, size_t) -->
              <return type-id='type-id-97'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <!-- bool base::internal::HookList<void (*)(const void*, size_t)>::empty() -->
            <function-decl name='empty' mangled-name='_ZNK4base8internal8HookListIPFvPKvmEE5emptyEv' filepath='src/malloc_hook-inl.h' line='80' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base8internal8HookListIPFvPKvmEE5emptyEv' hash='c7c710e908194b91'>
              <!-- implicit parameter of type 'const base::internal::HookList<void (*)(const void*, size_t)>*' -->
              <parameter type-id='type-id-96' is-artificial='yes'/>
              <!-- bool -->
              <return type-id='type-id-59'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <!-- void base::internal::HookList<void (*)(const void*, size_t)>::FixupPrivEndLocked() -->
            <function-decl name='FixupPrivEndLocked' mangled-name='_ZN4base8internal8HookListIPFvPKvmEE18FixupPrivEndLockedEv' filepath='src/malloc_hook-inl.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal8HookListIPFvPKvmEE18FixupPrivEndLockedEv' hash='7f32ffea222edbe7'>
              <!-- implicit parameter of type 'base::internal::HookList<void (*)(const void*, size_t)>*' -->
              <parameter type-id='type-id-98' is-artificial='yes'/>
              <!-- void -->
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <!-- int base::internal::HookList<void (*)(const void*, size_t)>::Traverse(void (*)(void*, size_t)*, int) -->
            <function-decl name='Traverse' mangled-name='_ZNK4base8internal8HookListIPFvPKvmEE8TraverseEPS5_i' filepath='src/malloc_hook-inl.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base8internal8HookListIPFvPKvmEE8TraverseEPS5_i' hash='22c907d6003d7682'>
              <!-- implicit parameter of type 'const base::internal::HookList<void (*)(const void*, size_t)>*' -->
              <parameter type-id='type-id-96' is-artificial='yes'/>
              <!-- parameter of type 'void (*)(void*, size_t)*' -->
              <parameter type-id='type-id-99'/>
              <!-- parameter of type 'int' -->
              <parameter type-id='type-id-1'/>
              <!-- int -->
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <!-- void (*)(void*, size_t) base::internal::HookList<void (*)(const void*, size_t)>::ExchangeSingular(void (*)(void*, size_t)) -->
            <function-decl name='ExchangeSingular' mangled-name='_ZN4base8internal8HookListIPFvPKvmEE16ExchangeSingularES5_' filepath='src/malloc_hook-inl.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal8HookListIPFvPKvmEE16ExchangeSingularES5_' hash='e7946129631a25a2'>
              <!-- implicit parameter of type 'base::internal::HookList<void (*)(const void*, size_t)>*' -->
              <parameter type-id='type-id-98' is-artificial='yes'/>
              <!-- parameter of type 'void (*)(void*, size_t)' -->
              <parameter type-id='type-id-97' filepath='src/malloc_hook-inl.h' line='90' column='1'/>
              <!-- void (*)(void*, size_t) -->
              <return type-id='type-id-97'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <!-- bool base::internal::HookList<void (*)(const void*, size_t)>::Remove(void (*)(void*, size_t)) -->
            <function-decl name='Remove' mangled-name='_ZN4base8internal8HookListIPFvPKvmEE6RemoveES5_' filepath='src/malloc_hook-inl.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal8HookListIPFvPKvmEE6RemoveES5_' hash='e698fbedb78e4cd2'>
              <!-- implicit parameter of type 'base::internal::HookList<void (*)(const void*, size_t)>*' -->
              <parameter type-id='type-id-98' is-artificial='yes'/>
              <!-- parameter of type 'void (*)(void*, size_t)' -->
              <parameter type-id='type-id-97' filepath='src/malloc_hook-inl.h' line='72' column='1'/>
              <!-- bool -->
              <return type-id='type-id-59'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <!-- bool base::internal::HookList<void (*)(const void*, size_t)>::Add(void (*)(void*, size_t)) -->
            <function-decl name='Add' mangled-name='_ZN4base8internal8HookListIPFvPKvmEE3AddES5_' filepath='src/malloc_hook-inl.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal8HookListIPFvPKvmEE3AddES5_' hash='e698fbedb78e4cd2'>
              <!-- implicit parameter of type 'base::internal::HookList<void (*)(const void*, size_t)>*' -->
              <parameter type-id='type-id-98' is-artificial='yes'/>
              <!-- parameter of type 'void (*)(void*, size_t)' -->
              <parameter type-id='type-id-97' filepath='src/malloc_hook-inl.h' line='72' column='1'/>
              <!-- bool -->
              <return type-id='type-id-59'/>
            </function-decl>
          </member-function>
        </class-decl>
      </namespace-decl>
    </namespace-decl>
    <!-- namespace low_level_alloc_internal -->
    <namespace-decl name='low_level_alloc_internal'>
      <!-- struct low_level_alloc_internal::AllocList -->
      <class-decl name='AllocList' is-struct='yes' visibility='default' size-in-bits='2240' filepath='src/base/low_level_alloc.cc' line='67' column='1' hash='9b4ed3506ee18546' id='type-id-89'>
        <member-type access='public'>
          <!-- struct low_level_alloc_internal::AllocList::Header -->
          <class-decl name='Header' is-struct='yes' visibility='default' size-in-bits='256' filepath='src/base/low_level_alloc.cc' line='68' column='1' hash='637c890e478d839a' id='type-id-100'>
            <data-member access='public' layout-offset-in-bits='0'>
              <!-- intptr_t low_level_alloc_internal::AllocList::Header::size -->
              <var-decl name='size' type-id='type-id-101' visibility='default' filepath='src/base/low_level_alloc.cc' line='69' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <!-- intptr_t low_level_alloc_internal::AllocList::Header::magic -->
              <var-decl name='magic' type-id='type-id-101' visibility='default' filepath='src/base/low_level_alloc.cc' line='71' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <!-- LowLevelAlloc::Arena* low_level_alloc_internal::AllocList::Header::arena -->
              <var-decl name='arena' type-id='type-id-87' visibility='default' filepath='src/base/low_level_alloc.cc' line='72' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <!-- void* low_level_alloc_internal::AllocList::Header::dummy_for_alignment -->
              <var-decl name='dummy_for_alignment' type-id='type-id-56' visibility='default' filepath='src/base/low_level_alloc.cc' line='73' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- low_level_alloc_internal::AllocList::Header low_level_alloc_internal::AllocList::header -->
          <var-decl name='header' type-id='type-id-100' visibility='default' filepath='src/base/low_level_alloc.cc' line='74' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <!-- int low_level_alloc_internal::AllocList::levels -->
          <var-decl name='levels' type-id='type-id-1' visibility='default' filepath='src/base/low_level_alloc.cc' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <!-- low_level_alloc_internal::AllocList* low_level_alloc_internal::AllocList::next[30] -->
          <var-decl name='next' type-id='type-id-85' visibility='default' filepath='src/base/low_level_alloc.cc' line='79' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <!-- Atomic32 (SpinLock::*) (int64, Atomic32*) -->
    <function-type method-class-id='type-id-102' size-in-bits='64' hash='745054de67770bc9' id='type-id-103'>
      <!-- implicit parameter of type 'SpinLock*' -->
      <parameter type-id='type-id-104' is-artificial='yes'/>
      <!-- parameter of type 'typedef int64' -->
      <parameter type-id='type-id-105'/>
      <!-- parameter of type 'Atomic32*' -->
      <parameter type-id='type-id-106'/>
      <!-- typedef Atomic32 -->
      <return type-id='type-id-107'/>
    </function-type>
    <!-- bool (base::internal::HookList<void (*)(const void*, size_t)>::*) () -->
    <function-type method-class-id='type-id-108' const='yes' size-in-bits='64' hash='c7c710e908194b91' id='type-id-109'>
      <!-- implicit parameter of type 'const base::internal::HookList<void (*)(const void*, size_t)>*' -->
      <parameter type-id='type-id-96' is-artificial='yes'/>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- bool (base::internal::HookList<void (*)(const void*, size_t)>::*) (void (*)(void*, size_t)) -->
    <function-type method-class-id='type-id-95' size-in-bits='64' hash='e698fbedb78e4cd2' id='type-id-110'>
      <!-- implicit parameter of type 'base::internal::HookList<void (*)(const void*, size_t)>*' -->
      <parameter type-id='type-id-98' is-artificial='yes'/>
      <!-- parameter of type 'void (*)(void*, size_t)' -->
      <parameter type-id='type-id-97' filepath='src/malloc_hook-inl.h' line='72' column='1'/>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- int (base::internal::HookList<void (*)(const void*, size_t)>::*) (void (*)(void*, size_t)*, int) -->
    <function-type method-class-id='type-id-108' const='yes' size-in-bits='64' hash='22c907d6003d7682' id='type-id-111'>
      <!-- implicit parameter of type 'const base::internal::HookList<void (*)(const void*, size_t)>*' -->
      <parameter type-id='type-id-96' is-artificial='yes'/>
      <!-- parameter of type 'void (*)(void*, size_t)*' -->
      <parameter type-id='type-id-99'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-type>
    <!-- void (*)(void*, size_t) (base::internal::HookList<void (*)(const void*, size_t)>::*) () -->
    <function-type method-class-id='type-id-108' const='yes' size-in-bits='64' hash='5695f5ce05a4c55f' id='type-id-112'>
      <!-- implicit parameter of type 'const base::internal::HookList<void (*)(const void*, size_t)>*' -->
      <parameter type-id='type-id-96' is-artificial='yes'/>
      <!-- void (*)(void*, size_t) -->
      <return type-id='type-id-97'/>
    </function-type>
    <!-- void (*)(void*, size_t) (base::internal::HookList<void (*)(const void*, size_t)>::*) (void (*)(void*, size_t)) -->
    <function-type method-class-id='type-id-95' size-in-bits='64' hash='e7946129631a25a2' id='type-id-113'>
      <!-- implicit parameter of type 'base::internal::HookList<void (*)(const void*, size_t)>*' -->
      <parameter type-id='type-id-98' is-artificial='yes'/>
      <!-- parameter of type 'void (*)(void*, size_t)' -->
      <parameter type-id='type-id-97' filepath='src/malloc_hook-inl.h' line='90' column='1'/>
      <!-- void (*)(void*, size_t) -->
      <return type-id='type-id-97'/>
    </function-type>
    <!-- void (SpinLock::*) () -->
    <function-type method-class-id='type-id-102' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-114'>
      <!-- implicit parameter of type 'SpinLock*' -->
      <parameter type-id='type-id-104' is-artificial='yes'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void (SpinLock::*) (uint64) -->
    <function-type method-class-id='type-id-102' size-in-bits='64' hash='e0055d99adb0e173' id='type-id-115'>
      <!-- implicit parameter of type 'SpinLock*' -->
      <parameter type-id='type-id-104' is-artificial='yes'/>
      <!-- parameter of type 'typedef uint64' -->
      <parameter type-id='type-id-116'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void (base::internal::HookList<void (*)(const void*, size_t)>::*) () -->
    <function-type method-class-id='type-id-95' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-117'>
      <!-- implicit parameter of type 'base::internal::HookList<void (*)(const void*, size_t)>*' -->
      <parameter type-id='type-id-98' is-artificial='yes'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/spinlock.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- struct CycleClock -->
    <class-decl name='CycleClock' is-struct='yes' visibility='default' size-in-bits='8' filepath='./src/base/cycleclock.h' line='79' column='1' hash='8e658f9e8bd44126' id='type-id-118'/>
    <!-- const base::LinkerInitialized -->
    <qualified-type-def type-id='type-id-92' const='yes' hash='e16a423e37712bec' id='type-id-119'/>
    <!-- namespace base -->
    <namespace-decl name='base'>
      <!-- void base::SubmitSpinLockProfileData(void*, int64) -->
      <function-decl name='SubmitSpinLockProfileData' mangled-name='_ZN4base25SubmitSpinLockProfileDataEPKvl' filepath='./src/base/synchronization_profiling.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base25SubmitSpinLockProfileDataEPKvl' hash='52c0efb08d2aa513'>
        <!-- parameter of type 'void*' -->
        <parameter type-id='type-id-56'/>
        <!-- parameter of type 'typedef int64' -->
        <parameter type-id='type-id-105'/>
        <!-- void -->
        <return type-id='type-id-58'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/spinlock_internal.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- const base::internal::SpinLockWaitTransition -->
    <qualified-type-def type-id='type-id-120' const='yes' hash='b69aa0c6c66bee67' id='type-id-121'/>
    <!-- const base::internal::SpinLockWaitTransition* -->
    <pointer-type-def type-id='type-id-121' size-in-bits='64' hash='90bbe97f9072e445' id='type-id-122'/>
    <!-- namespace base -->
    <namespace-decl name='base'>
      <!-- namespace base::subtle -->
      <namespace-decl name='subtle'>
      </namespace-decl>
      <!-- namespace base::internal -->
      <namespace-decl name='internal'>
        <!-- struct base::internal::SpinLockWaitTransition -->
        <class-decl name='SpinLockWaitTransition' is-struct='yes' visibility='default' size-in-bits='96' filepath='./src/base/spinlock_internal.h' line='48' column='1' hash='0f439893da072f3f' id='type-id-120'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- int32 base::internal::SpinLockWaitTransition::from -->
            <var-decl name='from' type-id='type-id-81' visibility='default' filepath='./src/base/spinlock_internal.h' line='49' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <!-- int32 base::internal::SpinLockWaitTransition::to -->
            <var-decl name='to' type-id='type-id-81' visibility='default' filepath='./src/base/spinlock_internal.h' line='50' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- bool base::internal::SpinLockWaitTransition::done -->
            <var-decl name='done' type-id='type-id-59' visibility='default' filepath='./src/base/spinlock_internal.h' line='51' column='1'/>
          </data-member>
        </class-decl>
        <!-- void base::internal::SpinLockDelay(volatile Atomic32*, int32, int) -->
        <function-decl name='SpinLockDelay' mangled-name='_ZN4base8internal13SpinLockDelayEPViii' filepath='./src/base/spinlock_linux-inl.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal13SpinLockDelayEPViii' hash='86a51dc692bbcbe6'>
          <!-- parameter of type 'volatile Atomic32*' -->
          <parameter type-id='type-id-123'/>
          <!-- parameter of type 'typedef int32' -->
          <parameter type-id='type-id-81'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
        <!-- void base::internal::SpinLockWake(volatile Atomic32*, bool) -->
        <function-decl name='SpinLockWake' mangled-name='_ZN4base8internal12SpinLockWakeEPVib' filepath='./src/base/spinlock_linux-inl.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal12SpinLockWakeEPVib' hash='768c83cd3690d2a7'>
          <!-- parameter of type 'volatile Atomic32*' -->
          <parameter type-id='type-id-123'/>
          <!-- parameter of type 'bool' -->
          <parameter type-id='type-id-59'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
        <!-- int32 base::internal::SpinLockWait(volatile Atomic32*, int, const base::internal::SpinLockWaitTransition*) -->
        <function-decl name='SpinLockWait' mangled-name='_ZN4base8internal12SpinLockWaitEPViiPKNS0_22SpinLockWaitTransitionE' filepath='src/base/spinlock_internal.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal12SpinLockWaitEPViiPKNS0_22SpinLockWaitTransitionE' hash='3742d95ddf1a386d'>
          <!-- parameter of type 'volatile Atomic32*' -->
          <parameter type-id='type-id-123'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'const base::internal::SpinLockWaitTransition*' -->
          <parameter type-id='type-id-122'/>
          <!-- typedef int32 -->
          <return type-id='type-id-81'/>
        </function-decl>
      </namespace-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/sysinfo.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- char[10] -->
    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='80' hash='17ea60b42da0606b' id='type-id-124'>
      <!-- <anonymous range>[10] -->
      <subrange length='10' lower-bound='0' upper-bound='9' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='4e72a2f569b234f4' id='type-id-125'/>
    </array-type-def>
    <!-- char[5120] -->
    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='40960' hash='ee8e4ce8c75a11f9' id='type-id-126'>
      <!-- <anonymous range>[5120] -->
      <subrange length='5120' lower-bound='0' upper-bound='5119' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='112cecc9134ba92d' id='type-id-127'/>
    </array-type-def>
    <!-- class ProcMapsIterator -->
    <class-decl name='ProcMapsIterator' visibility='default' size-in-bits='640' filepath='./src/base/sysinfo.h' line='102' column='1' hash='2264b5d7b5d030a4' id='type-id-128'>
      <member-type access='private'>
        <!-- struct ProcMapsIterator::Buffer -->
        <class-decl name='Buffer' is-struct='yes' visibility='default' size-in-bits='40960' filepath='./src/base/sysinfo.h' line='104' column='1' hash='0c3c920007ea2acf' id='type-id-129'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- char ProcMapsIterator::Buffer::buf_[5120] -->
            <var-decl name='buf_' type-id='type-id-126' visibility='default' filepath='./src/base/sysinfo.h' line='112' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- char* ProcMapsIterator::ibuf_ -->
        <var-decl name='ibuf_' type-id='type-id-130' visibility='default' filepath='./src/base/sysinfo.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- char* ProcMapsIterator::stext_ -->
        <var-decl name='stext_' type-id='type-id-130' visibility='default' filepath='./src/base/sysinfo.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- char* ProcMapsIterator::etext_ -->
        <var-decl name='etext_' type-id='type-id-130' visibility='default' filepath='./src/base/sysinfo.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <!-- char* ProcMapsIterator::nextline_ -->
        <var-decl name='nextline_' type-id='type-id-130' visibility='default' filepath='./src/base/sysinfo.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <!-- char* ProcMapsIterator::ebuf_ -->
        <var-decl name='ebuf_' type-id='type-id-130' visibility='default' filepath='./src/base/sysinfo.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <!-- int ProcMapsIterator::fd_ -->
        <var-decl name='fd_' type-id='type-id-1' visibility='default' filepath='./src/base/sysinfo.h' line='219' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <!-- pid_t ProcMapsIterator::pid_ -->
        <var-decl name='pid_' type-id='type-id-77' visibility='default' filepath='./src/base/sysinfo.h' line='221' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <!-- char ProcMapsIterator::flags_[10] -->
        <var-decl name='flags_' type-id='type-id-124' visibility='default' filepath='./src/base/sysinfo.h' line='222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <!-- ProcMapsIterator::Buffer* ProcMapsIterator::dynamic_buffer_ -->
        <var-decl name='dynamic_buffer_' type-id='type-id-131' visibility='default' filepath='./src/base/sysinfo.h' line='223' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <!-- bool ProcMapsIterator::using_maps_backing_ -->
        <var-decl name='using_maps_backing_' type-id='type-id-59' visibility='default' filepath='./src/base/sysinfo.h' line='224' column='1'/>
      </data-member>
      <member-function access='private'>
        <!-- bool ProcMapsIterator::Valid() -->
        <function-decl name='Valid' mangled-name='_ZNK16ProcMapsIterator5ValidEv' filepath='src/base/sysinfo.cc' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16ProcMapsIterator5ValidEv' hash='c7c710e908194b91'>
          <!-- implicit parameter of type 'const ProcMapsIterator*' -->
          <parameter type-id='type-id-132' is-artificial='yes'/>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- int ProcMapsIterator::FormatLine(int, uint64, uint64, const char*, uint64, int64, const char*, dev_t) -->
        <function-decl name='FormatLine' mangled-name='_ZN16ProcMapsIterator10FormatLineEPcimmPKcmlS2_m' filepath='src/base/sysinfo.cc' line='1084' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator10FormatLineEPcimmPKcmlS2_m' hash='5f991849cba2ccd3'>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-130'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'typedef uint64' -->
          <parameter type-id='type-id-116'/>
          <!-- parameter of type 'typedef uint64' -->
          <parameter type-id='type-id-116'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-60'/>
          <!-- parameter of type 'typedef uint64' -->
          <parameter type-id='type-id-116'/>
          <!-- parameter of type 'typedef int64' -->
          <parameter type-id='type-id-105'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-60'/>
          <!-- parameter of type 'typedef dev_t' -->
          <parameter type-id='type-id-133'/>
          <!-- int -->
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- ProcMapsIterator::~ProcMapsIterator() -->
        <function-decl name='~ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorD1Ev' filepath='src/base/sysinfo.cc' line='804' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorD1Ev' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'ProcMapsIterator*' -->
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void ProcMapsIterator::Init(pid_t, ProcMapsIterator::Buffer*, bool) -->
        <function-decl name='Init' mangled-name='_ZN16ProcMapsIterator4InitEiPNS_6BufferEb' filepath='src/base/sysinfo.cc' line='741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator4InitEiPNS_6BufferEb' hash='b9953348555036fa'>
          <!-- implicit parameter of type 'ProcMapsIterator*' -->
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <!-- parameter of type 'typedef pid_t' -->
          <parameter type-id='type-id-77'/>
          <!-- parameter of type 'ProcMapsIterator::Buffer*' -->
          <parameter type-id='type-id-131'/>
          <!-- parameter of type 'bool' -->
          <parameter type-id='type-id-59'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- ProcMapsIterator::ProcMapsIterator(pid_t, ProcMapsIterator::Buffer*, bool) -->
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC1EiPNS_6BufferEb' filepath='src/base/sysinfo.cc' line='736' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC1EiPNS_6BufferEb' hash='b9953348555036fa'>
          <!-- implicit parameter of type 'ProcMapsIterator*' -->
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <!-- parameter of type 'typedef pid_t' -->
          <parameter type-id='type-id-77'/>
          <!-- parameter of type 'ProcMapsIterator::Buffer*' -->
          <parameter type-id='type-id-131'/>
          <!-- parameter of type 'bool' -->
          <parameter type-id='type-id-59'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- ProcMapsIterator::ProcMapsIterator(pid_t, ProcMapsIterator::Buffer*) -->
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC2EiPNS_6BufferE' filepath='src/base/sysinfo.cc' line='732' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC2EiPNS_6BufferE' hash='401f52e7102feed6'>
          <!-- implicit parameter of type 'ProcMapsIterator*' -->
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <!-- parameter of type 'typedef pid_t' -->
          <parameter type-id='type-id-77'/>
          <!-- parameter of type 'ProcMapsIterator::Buffer*' -->
          <parameter type-id='type-id-131'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- ProcMapsIterator::ProcMapsIterator(pid_t) -->
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC1Ei' filepath='src/base/sysinfo.cc' line='728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC1Ei' hash='388da3fa973fde78'>
          <!-- implicit parameter of type 'ProcMapsIterator*' -->
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <!-- parameter of type 'typedef pid_t' -->
          <parameter type-id='type-id-77'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- bool ProcMapsIterator::NextExt(uint64*, uint64*, char**, uint64*, int64*, char**, uint64*, uint64*, uint64*, uint64*, dev_t*) -->
        <function-decl name='NextExt' mangled-name='_ZN16ProcMapsIterator7NextExtEPmS0_PPcS0_PlS2_S0_S0_S0_S0_S0_' filepath='src/base/sysinfo.cc' line='834' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator7NextExtEPmS0_PPcS0_PlS2_S0_S0_S0_S0_S0_' hash='4e2c5075ad0ec0c2'>
          <!-- implicit parameter of type 'ProcMapsIterator*' -->
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-135'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-135'/>
          <!-- parameter of type 'char**' -->
          <parameter type-id='type-id-136'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-135'/>
          <!-- parameter of type 'int64*' -->
          <parameter type-id='type-id-137'/>
          <!-- parameter of type 'char**' -->
          <parameter type-id='type-id-136'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-135'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-135'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-135'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-135'/>
          <!-- parameter of type 'dev_t*' -->
          <parameter type-id='type-id-138'/>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- bool ProcMapsIterator::Next(uint64*, uint64*, char**, uint64*, int64*, char**) -->
        <function-decl name='Next' mangled-name='_ZN16ProcMapsIterator4NextEPmS0_PPcS0_PlS2_' filepath='src/base/sysinfo.cc' line='825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator4NextEPmS0_PPcS0_PlS2_' hash='0028c0d0265f0714'>
          <!-- implicit parameter of type 'ProcMapsIterator*' -->
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-135'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-135'/>
          <!-- parameter of type 'char**' -->
          <parameter type-id='type-id-136'/>
          <!-- parameter of type 'uint64*' -->
          <parameter type-id='type-id-135'/>
          <!-- parameter of type 'int64*' -->
          <parameter type-id='type-id-137'/>
          <!-- parameter of type 'char**' -->
          <parameter type-id='type-id-136'/>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- typedef unsigned long int __dev_t -->
    <typedef-decl name='__dev_t' type-id='type-id-21' size-in-bits='64' filepath='/usr/include/bits/types.h' line='134' column='1' hash='8fdc5eea2983a729' id='type-id-139'/>
    <!-- typedef __dev_t dev_t -->
    <typedef-decl name='dev_t' type-id='type-id-139' size-in-bits='64' filepath='/usr/include/sys/types.h' line='61' column='1' hash='8fdc5eea2983a729' id='type-id-133'/>
    <!-- ProcMapsIterator* -->
    <pointer-type-def type-id='type-id-128' size-in-bits='64' hash='fa878a3e0f42a3c6' id='type-id-134'/>
    <!-- ProcMapsIterator* const -->
    <qualified-type-def type-id='type-id-134' const='yes' hash='748044580a31ee8f' id='type-id-140'/>
    <!-- ProcMapsIterator::Buffer* -->
    <pointer-type-def type-id='type-id-129' size-in-bits='64' hash='939b08df96ab7482' id='type-id-131'/>
    <!-- const ProcMapsIterator -->
    <qualified-type-def type-id='type-id-128' const='yes' hash='de70b760bfe42cff' id='type-id-141'/>
    <!-- const ProcMapsIterator* -->
    <pointer-type-def type-id='type-id-141' size-in-bits='64' hash='aeb89ef50ae9a806' id='type-id-132'/>
    <!-- const ProcMapsIterator* const -->
    <qualified-type-def type-id='type-id-132' const='yes' hash='357d93c544ca96b0' id='type-id-142'/>
    <!-- dev_t* -->
    <pointer-type-def type-id='type-id-133' size-in-bits='64' hash='312605a909e8eaa1' id='type-id-138'/>
    <!-- int64* -->
    <pointer-type-def type-id='type-id-105' size-in-bits='64' hash='a1b0a9faf3461c39' id='type-id-137'/>
    <!-- uint64* -->
    <pointer-type-def type-id='type-id-116' size-in-bits='64' hash='22112f95b58dbc67' id='type-id-135'/>
    <!-- namespace tcmalloc -->
    <namespace-decl name='tcmalloc'>
      <!-- int tcmalloc::FillProcSelfMaps(char*, int, bool*) -->
      <function-decl name='FillProcSelfMaps' mangled-name='_ZN8tcmalloc16FillProcSelfMapsEPciPb' filepath='src/base/sysinfo.cc' line='1111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16FillProcSelfMapsEPciPb' hash='acd61b69cd92cb8f'>
        <!-- parameter of type 'char*' -->
        <parameter type-id='type-id-130'/>
        <!-- parameter of type 'int' -->
        <parameter type-id='type-id-1'/>
        <!-- parameter of type 'bool*' -->
        <parameter type-id='type-id-143'/>
        <!-- int -->
        <return type-id='type-id-1'/>
      </function-decl>
      <!-- void tcmalloc::DumpProcSelfMaps(RawFD) -->
      <function-decl name='DumpProcSelfMaps' mangled-name='_ZN8tcmalloc16DumpProcSelfMapsEi' filepath='src/base/sysinfo.cc' line='1137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16DumpProcSelfMapsEi' hash='388da3fa973fde78'>
        <!-- parameter of type 'typedef RawFD' -->
        <parameter type-id='type-id-83' filepath='src/base/logging.cc' line='104' column='1'/>
        <!-- void -->
        <return type-id='type-id-58'/>
      </function-decl>
    </namespace-decl>
    <!-- const char* GetenvBeforeMain(const char*) -->
    <function-decl name='GetenvBeforeMain' mangled-name='_Z16GetenvBeforeMainPKc' filepath='src/base/sysinfo.cc' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16GetenvBeforeMainPKc' hash='3d5693612af11c46'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-60' filepath='src/base/sysinfo.cc' line='122' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-60'/>
    </function-decl>
    <!-- const char* TCMallocGetenvSafe(const char*) -->
    <function-decl name='TCMallocGetenvSafe' mangled-name='TCMallocGetenvSafe' filepath='src/base/sysinfo.cc' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMallocGetenvSafe' hash='3d5693612af11c46'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-60' filepath='src/base/sysinfo.cc' line='122' column='1'/>
      <!-- const char* -->
      <return type-id='type-id-60'/>
    </function-decl>
    <!-- bool GetUniquePathFromEnv(const char*, char*) -->
    <function-decl name='GetUniquePathFromEnv' mangled-name='_Z20GetUniquePathFromEnvPKcPc' filepath='src/base/sysinfo.cc' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20GetUniquePathFromEnvPKcPc' hash='4fcb66546067c0f3'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-60' filepath='src/base/sysinfo.cc' line='201' column='1'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-130' filepath='src/base/sysinfo.cc' line='201' column='1'/>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-decl>
    <!-- void SleepForMilliseconds(int) -->
    <function-decl name='SleepForMilliseconds' mangled-name='_Z20SleepForMillisecondsi' filepath='src/base/sysinfo.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20SleepForMillisecondsi' hash='388da3fa973fde78'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1' filepath='src/base/sysinfo.cc' line='226' column='1'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-decl>
    <!-- double CyclesPerSecond() -->
    <function-decl name='CyclesPerSecond' mangled-name='_Z15CyclesPerSecondv' filepath='src/base/sysinfo.cc' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15CyclesPerSecondv' hash='14e245f4052d89de'>
      <!-- double -->
      <return type-id='type-id-2'/>
    </function-decl>
    <!-- int NumCPUs() -->
    <function-decl name='NumCPUs' mangled-name='_Z7NumCPUsv' filepath='src/base/sysinfo.cc' line='505' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z7NumCPUsv' hash='388da3fa973fde78'>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-decl>
    <!-- bool HasPosixThreads() -->
    <function-decl name='HasPosixThreads' mangled-name='_Z15HasPosixThreadsv' filepath='src/base/sysinfo.cc' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15HasPosixThreadsv' hash='c7c710e908194b91'>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/vdso_support.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- base::VDSOInitHelper* -->
    <pointer-type-def type-id='type-id-144' size-in-bits='64' hash='eb484dfa270591eb' id='type-id-145'/>
    <!-- base::VDSOInitHelper* const -->
    <qualified-type-def type-id='type-id-145' const='yes' hash='b12b14a771f8c8b3' id='type-id-146'/>
    <!-- base::VDSOSupport* -->
    <pointer-type-def type-id='type-id-147' size-in-bits='64' hash='883a1fc17f881c67' id='type-id-148'/>
    <!-- base::VDSOSupport* const -->
    <qualified-type-def type-id='type-id-148' const='yes' hash='e6adfea1970106f3' id='type-id-149'/>
    <!-- base::VDSOSupport::SymbolInfo* -->
    <pointer-type-def type-id='type-id-150' size-in-bits='64' hash='c661d6d612749156' id='type-id-151'/>
    <!-- const base::VDSOSupport -->
    <qualified-type-def type-id='type-id-147' const='yes' hash='965e7306817a37f5' id='type-id-152'/>
    <!-- const base::VDSOSupport& -->
    <reference-type-def kind='lvalue' type-id='type-id-152' size-in-bits='64' hash='4c3b458300f87597' id='type-id-153'/>
    <!-- const base::VDSOSupport* -->
    <pointer-type-def type-id='type-id-152' size-in-bits='64' hash='0dd98154a5105c11' id='type-id-154'/>
    <!-- const base::VDSOSupport* const -->
    <qualified-type-def type-id='type-id-154' const='yes' hash='57eb484bf4b0b78d' id='type-id-155'/>
    <!-- namespace base -->
    <namespace-decl name='base'>
      <!-- class base::ElfMemImage -->
      <class-decl name='ElfMemImage' visibility='default' hash='4d05b0d78d698050' id='type-id-156'>
        <member-function access='private'>
          <!-- int base::ElfMemImage::GetNumSymbols() -->
          <function-decl name='GetNumSymbols' mangled-name='_ZNK4base11ElfMemImage13GetNumSymbolsEv' filepath='src/base/elf_mem_image.cc' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage13GetNumSymbolsEv' hash='388da3fa973fde78'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- int -->
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const Elf64_Verdaux* base::ElfMemImage::GetVerdefAux(const Elf64_Verdef*) -->
          <function-decl name='GetVerdefAux' mangled-name='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef' filepath='src/base/elf_mem_image.cc' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef' hash='19f69f6f7c219776'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'const Elf64_Verdef*' -->
            <parameter type-id='type-id-41'/>
            <!-- const Elf64_Verdaux* -->
            <return type-id='type-id-39'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- base::ElfMemImage::SymbolIterator base::ElfMemImage::end() -->
          <function-decl name='end' mangled-name='_ZNK4base11ElfMemImage3endEv' filepath='src/base/elf_mem_image.cc' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage3endEv' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- class base::ElfMemImage::SymbolIterator -->
            <return type-id='type-id-28'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const char* base::ElfMemImage::GetVerstr(Elf64_Word) -->
          <function-decl name='GetVerstr' mangled-name='_ZNK4base11ElfMemImage9GetVerstrEj' filepath='src/base/elf_mem_image.cc' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerstrEj' hash='cf5212e813271279'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'typedef Elf64_Word' -->
            <parameter type-id='type-id-6'/>
            <!-- const char* -->
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const Elf64_Verdef* base::ElfMemImage::GetVerdef(int) -->
          <function-decl name='GetVerdef' mangled-name='_ZNK4base11ElfMemImage9GetVerdefEi' filepath='src/base/elf_mem_image.cc' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerdefEi' hash='c6a2702b6944e5b2'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- const Elf64_Verdef* -->
            <return type-id='type-id-41'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void* base::ElfMemImage::GetSymAddr(const Elf64_Sym*) -->
          <function-decl name='GetSymAddr' mangled-name='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym' filepath='src/base/elf_mem_image.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym' hash='2685c9e30f0e9c0a'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'const Elf64_Sym*' -->
            <parameter type-id='type-id-37'/>
            <!-- void* -->
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const char* base::ElfMemImage::GetDynstr(Elf64_Word) -->
          <function-decl name='GetDynstr' mangled-name='_ZNK4base11ElfMemImage9GetDynstrEj' filepath='src/base/elf_mem_image.cc' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynstrEj' hash='cf5212e813271279'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'typedef Elf64_Word' -->
            <parameter type-id='type-id-6'/>
            <!-- const char* -->
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const Elf64_Phdr* base::ElfMemImage::GetPhdr(int) -->
          <function-decl name='GetPhdr' mangled-name='_ZNK4base11ElfMemImage7GetPhdrEi' filepath='src/base/elf_mem_image.cc' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage7GetPhdrEi' hash='347de63754287c77'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- const Elf64_Phdr* -->
            <return type-id='type-id-35'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void base::ElfMemImage::Init(void*) -->
          <function-decl name='Init' mangled-name='_ZN4base11ElfMemImage4InitEPKv' filepath='src/base/elf_mem_image.cc' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage4InitEPKv' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type 'base::ElfMemImage*' -->
            <parameter type-id='type-id-24' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-56'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <!-- base::ElfMemImage::ElfMemImage(void*) -->
          <function-decl name='ElfMemImage' mangled-name='_ZN4base11ElfMemImageC1EPKv' filepath='src/base/elf_mem_image.cc' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImageC1EPKv' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type 'base::ElfMemImage*' -->
            <parameter type-id='type-id-24' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-56'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const Elf64_Versym* base::ElfMemImage::GetVersym(int) -->
          <function-decl name='GetVersym' mangled-name='_ZNK4base11ElfMemImage9GetVersymEi' filepath='src/base/elf_mem_image.cc' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVersymEi' hash='ad58fd7867afcd7f'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- const Elf64_Versym* -->
            <return type-id='type-id-43'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- const Elf64_Sym* base::ElfMemImage::GetDynsym(int) -->
          <function-decl name='GetDynsym' mangled-name='_ZNK4base11ElfMemImage9GetDynsymEi' filepath='src/base/elf_mem_image.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynsymEi' hash='3f9d161fff24d853'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- const Elf64_Sym* -->
            <return type-id='type-id-37'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- base::ElfMemImage::SymbolIterator base::ElfMemImage::begin() -->
          <function-decl name='begin' mangled-name='_ZNK4base11ElfMemImage5beginEv' filepath='src/base/elf_mem_image.cc' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage5beginEv' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- class base::ElfMemImage::SymbolIterator -->
            <return type-id='type-id-28'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool base::ElfMemImage::LookupSymbolByAddress(void*, base::ElfMemImage::SymbolInfo*) -->
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE' filepath='src/base/elf_mem_image.cc' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE' hash='b897a0ddbd63cce5'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-56'/>
            <!-- parameter of type 'base::ElfMemImage::SymbolInfo*' -->
            <parameter type-id='type-id-27'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool base::ElfMemImage::LookupSymbol(const char*, const char*, int, base::ElfMemImage::SymbolInfo*) -->
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE' filepath='src/base/elf_mem_image.cc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE' hash='d055b32b0e2d828c'>
            <!-- implicit parameter of type 'const base::ElfMemImage*' -->
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <!-- parameter of type 'const char*' -->
            <parameter type-id='type-id-60'/>
            <!-- parameter of type 'const char*' -->
            <parameter type-id='type-id-60'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- parameter of type 'base::ElfMemImage::SymbolInfo*' -->
            <parameter type-id='type-id-27'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- class base::VDSOInitHelper -->
      <class-decl name='VDSOInitHelper' visibility='default' size-in-bits='8' filepath='src/base/vdso_support.cc' line='137' column='1' hash='6370393810069857' id='type-id-144'/>
      <!-- class base::VDSOSupport -->
      <class-decl name='VDSOSupport' visibility='default' size-in-bits='576' filepath='./src/base/vdso_support.h' line='72' column='1' hash='6860908f4e29291a' id='type-id-147'>
        <member-type access='private'>
          <!-- typedef base::ElfMemImage::SymbolInfo base::VDSOSupport::SymbolInfo -->
          <typedef-decl name='SymbolInfo' type-id='type-id-26' size-in-bits='256' filepath='./src/base/vdso_support.h' line='76' column='1' id='type-id-150'/>
        </member-type>
        <member-type access='private'>
          <!-- typedef base::ElfMemImage::SymbolIterator base::VDSOSupport::SymbolIterator -->
          <typedef-decl name='SymbolIterator' type-id='type-id-28' size-in-bits='384' filepath='./src/base/vdso_support.h' line='77' column='1' id='type-id-157'/>
        </member-type>
        <data-member access='public' static='yes'>
          <!-- static void* base::VDSOSupport::vdso_base_ -->
          <var-decl name='vdso_base_' type-id='type-id-56' mangled-name='_ZN4base11VDSOSupport10vdso_base_E' visibility='default' filepath='src/base/vdso_support.cc' line='59' column='1' elf-symbol-id='_ZN4base11VDSOSupport10vdso_base_E'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- base::ElfMemImage base::VDSOSupport::image_ -->
          <var-decl name='image_' type-id='type-id-23' visibility='default' filepath='./src/base/vdso_support.h' line='112' column='1'/>
        </data-member>
        <member-function access='private'>
          <!-- bool base::VDSOSupport::LookupSymbolByAddress(void*, base::VDSOSupport::SymbolInfo*) -->
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11VDSOSupport21LookupSymbolByAddressEPKvPNS_11ElfMemImage10SymbolInfoE' filepath='src/base/vdso_support.cc' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11VDSOSupport21LookupSymbolByAddressEPKvPNS_11ElfMemImage10SymbolInfoE' hash='b897a0ddbd63cce5'>
            <!-- implicit parameter of type 'const base::VDSOSupport*' -->
            <parameter type-id='type-id-154' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-56'/>
            <!-- parameter of type 'base::VDSOSupport::SymbolInfo*' -->
            <parameter type-id='type-id-151'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool base::VDSOSupport::LookupSymbol(const char*, const char*, int, base::VDSOSupport::SymbolInfo*) -->
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11VDSOSupport12LookupSymbolEPKcS2_iPNS_11ElfMemImage10SymbolInfoE' filepath='src/base/vdso_support.cc' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11VDSOSupport12LookupSymbolEPKcS2_iPNS_11ElfMemImage10SymbolInfoE' hash='d055b32b0e2d828c'>
            <!-- implicit parameter of type 'const base::VDSOSupport*' -->
            <parameter type-id='type-id-154' is-artificial='yes'/>
            <!-- parameter of type 'const char*' -->
            <parameter type-id='type-id-60'/>
            <!-- parameter of type 'const char*' -->
            <parameter type-id='type-id-60'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- parameter of type 'base::VDSOSupport::SymbolInfo*' -->
            <parameter type-id='type-id-151'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void* base::VDSOSupport::SetBase(void*) -->
          <function-decl name='SetBase' mangled-name='_ZN4base11VDSOSupport7SetBaseEPKv' filepath='src/base/vdso_support.cc' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupport7SetBaseEPKv' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type 'base::VDSOSupport*' -->
            <parameter type-id='type-id-148' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-56'/>
            <!-- void* -->
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <!-- void* base::VDSOSupport::Init() -->
          <function-decl name='Init' mangled-name='_ZN4base11VDSOSupport4InitEv' filepath='src/base/vdso_support.cc' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupport4InitEv' hash='7f32ffea222edbe7'>
            <!-- void* -->
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <!-- base::VDSOSupport::VDSOSupport() -->
          <function-decl name='VDSOSupport' mangled-name='_ZN4base11VDSOSupportC1Ev' filepath='src/base/vdso_support.cc' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupportC1Ev' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type 'base::VDSOSupport*' -->
            <parameter type-id='type-id-148' is-artificial='yes'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <!-- void (void) -->
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-158'>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/central_freelist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- const int& -->
    <reference-type-def kind='lvalue' type-id='type-id-159' size-in-bits='64' hash='5bb43a8603322674' id='type-id-160'/>
    <!-- const int32_t -->
    <qualified-type-def type-id='type-id-161' const='yes' hash='118d35f5174d8310' id='type-id-162'/>
    <!-- const int32_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-162' size-in-bits='64' hash='43aecb5732ecabb0' id='type-id-163'/>
    <!-- const tcmalloc::Span -->
    <qualified-type-def type-id='type-id-164' const='yes' hash='795ecde4916fdb90' id='type-id-165'/>
    <!-- const tcmalloc::Span* -->
    <pointer-type-def type-id='type-id-165' size-in-bits='64' hash='f1228bd9c4fd21bf' id='type-id-166'/>
    <!-- TCMalloc_PageMap3<35>::Node* -->
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-168'/>
    <!-- struct _IO_FILE -->
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='/usr/include/libio.h' line='271' column='1' hash='29dcdce3af7c2b79' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int _IO_FILE::_flags -->
        <var-decl name='_flags' type-id='type-id-1' visibility='default' filepath='/usr/include/libio.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- char* _IO_FILE::_IO_read_ptr -->
        <var-decl name='_IO_read_ptr' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- char* _IO_FILE::_IO_read_end -->
        <var-decl name='_IO_read_end' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- char* _IO_FILE::_IO_read_base -->
        <var-decl name='_IO_read_base' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- char* _IO_FILE::_IO_write_base -->
        <var-decl name='_IO_write_base' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- char* _IO_FILE::_IO_write_ptr -->
        <var-decl name='_IO_write_ptr' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- char* _IO_FILE::_IO_write_end -->
        <var-decl name='_IO_write_end' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- char* _IO_FILE::_IO_buf_base -->
        <var-decl name='_IO_buf_base' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- char* _IO_FILE::_IO_buf_end -->
        <var-decl name='_IO_buf_end' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- char* _IO_FILE::_IO_save_base -->
        <var-decl name='_IO_save_base' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- char* _IO_FILE::_IO_backup_base -->
        <var-decl name='_IO_backup_base' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- char* _IO_FILE::_IO_save_end -->
        <var-decl name='_IO_save_end' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- _IO_marker* _IO_FILE::_markers -->
        <var-decl name='_markers' type-id='type-id-170' visibility='default' filepath='/usr/include/libio.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- _IO_FILE* _IO_FILE::_chain -->
        <var-decl name='_chain' type-id='type-id-171' visibility='default' filepath='/usr/include/libio.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <!-- int _IO_FILE::_fileno -->
        <var-decl name='_fileno' type-id='type-id-1' visibility='default' filepath='/usr/include/libio.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <!-- int _IO_FILE::_flags2 -->
        <var-decl name='_flags2' type-id='type-id-1' visibility='default' filepath='/usr/include/libio.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <!-- __off_t _IO_FILE::_old_offset -->
        <var-decl name='_old_offset' type-id='type-id-172' visibility='default' filepath='/usr/include/libio.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- unsigned short int _IO_FILE::_cur_column -->
        <var-decl name='_cur_column' type-id='type-id-20' visibility='default' filepath='/usr/include/libio.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <!-- signed char _IO_FILE::_vtable_offset -->
        <var-decl name='_vtable_offset' type-id='type-id-173' visibility='default' filepath='/usr/include/libio.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <!-- char _IO_FILE::_shortbuf[1] -->
        <var-decl name='_shortbuf' type-id='type-id-174' visibility='default' filepath='/usr/include/libio.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- _IO_lock_t* _IO_FILE::_lock -->
        <var-decl name='_lock' type-id='type-id-175' visibility='default' filepath='/usr/include/libio.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- __off64_t _IO_FILE::_offset -->
        <var-decl name='_offset' type-id='type-id-176' visibility='default' filepath='/usr/include/libio.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- void* _IO_FILE::__pad1 -->
        <var-decl name='__pad1' type-id='type-id-56' visibility='default' filepath='/usr/include/libio.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <!-- void* _IO_FILE::__pad2 -->
        <var-decl name='__pad2' type-id='type-id-56' visibility='default' filepath='/usr/include/libio.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <!-- void* _IO_FILE::__pad3 -->
        <var-decl name='__pad3' type-id='type-id-56' visibility='default' filepath='/usr/include/libio.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <!-- void* _IO_FILE::__pad4 -->
        <var-decl name='__pad4' type-id='type-id-56' visibility='default' filepath='/usr/include/libio.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <!-- size_t _IO_FILE::__pad5 -->
        <var-decl name='__pad5' type-id='type-id-61' visibility='default' filepath='/usr/include/libio.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <!-- int _IO_FILE::_mode -->
        <var-decl name='_mode' type-id='type-id-1' visibility='default' filepath='/usr/include/libio.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <!-- char _IO_FILE::_unused2[20] -->
        <var-decl name='_unused2' type-id='type-id-177' visibility='default' filepath='/usr/include/libio.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <!-- namespace base -->
    <namespace-decl name='base'>
      <!-- struct base::MallocRange -->
      <class-decl name='MallocRange' is-struct='yes' visibility='default' hash='8f2fa3ce1ca054ae' id='type-id-178'>
      </class-decl>
    </namespace-decl>
    <!-- double strtod(const char*, char**) -->
    <function-decl name='strtod' filepath='/usr/include/stdlib.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64' hash='15d84328157dd688'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-60'/>
      <!-- parameter of type 'char**' -->
      <parameter type-id='type-id-136'/>
      <!-- double -->
      <return type-id='type-id-2'/>
    </function-decl>
    <!-- long int strtol(const char*, char**, int) -->
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64' hash='e745adec85b81cf6'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-60'/>
      <!-- parameter of type 'char**' -->
      <parameter type-id='type-id-136'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- long int -->
      <return type-id='type-id-179'/>
    </function-decl>
    <!-- long long int strtoll(const char*, char**, int) -->
    <function-decl name='strtoll' filepath='/usr/include/stdlib.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64' hash='24058e744113e8b7#2'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-60'/>
      <!-- parameter of type 'char**' -->
      <parameter type-id='type-id-136'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- long long int -->
      <return type-id='type-id-180'/>
    </function-decl>
    <!-- unsigned long long int strtoull(const char*, char**, int) -->
    <function-decl name='strtoull' filepath='/usr/include/stdlib.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64' hash='b5c0cb10fb089e0c#2'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-60'/>
      <!-- parameter of type 'char**' -->
      <parameter type-id='type-id-136'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- unsigned long long int -->
      <return type-id='type-id-181'/>
    </function-decl>
    <!-- int atoi(const char*) -->
    <function-decl name='atoi' filepath='/usr/include/stdlib.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64' hash='e9ea91a7eab8302c'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-60'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-decl>
    <!-- char* getenv(const char*) -->
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='567' column='1' visibility='default' binding='global' size-in-bits='64' hash='bac6a89264ba699c'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-60'/>
      <!-- char* -->
      <return type-id='type-id-130'/>
    </function-decl>
    <!-- namespace tcmalloc -->
    <namespace-decl name='tcmalloc'>
      <!-- class tcmalloc::CentralFreeList -->
      <class-decl name='CentralFreeList' visibility='default' hash='c085a61f676e6f8d' id='type-id-182'>
        <member-function access='private'>
          <!-- int tcmalloc::CentralFreeList::FetchFromOneSpans(int, void**, void**) -->
          <function-decl name='FetchFromOneSpans' mangled-name='_ZN8tcmalloc15CentralFreeList17FetchFromOneSpansEiPPvS2_' filepath='src/central_freelist.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList17FetchFromOneSpansEiPPvS2_' hash='05583901df42bd48'>
            <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- parameter of type 'void**' -->
            <parameter type-id='type-id-184'/>
            <!-- parameter of type 'void**' -->
            <parameter type-id='type-id-184'/>
            <!-- int -->
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void tcmalloc::CentralFreeList::Init(size_t) -->
          <function-decl name='Init' mangled-name='_ZN8tcmalloc15CentralFreeList4InitEm' filepath='src/central_freelist.cc' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList4InitEm' hash='e0055d99adb0e173'>
            <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <!-- parameter of type 'typedef size_t' -->
            <parameter type-id='type-id-61'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void tcmalloc::CentralFreeList::Populate() -->
          <function-decl name='Populate' mangled-name='_ZN8tcmalloc15CentralFreeList8PopulateEv' filepath='src/central_freelist.cc' line='321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList8PopulateEv' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- int tcmalloc::CentralFreeList::FetchFromOneSpansSafe(int, void**, void**) -->
          <function-decl name='FetchFromOneSpansSafe' mangled-name='_ZN8tcmalloc15CentralFreeList21FetchFromOneSpansSafeEiPPvS2_' filepath='src/central_freelist.cc' line='281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList21FetchFromOneSpansSafeEiPPvS2_' hash='05583901df42bd48'>
            <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- parameter of type 'void**' -->
            <parameter type-id='type-id-184'/>
            <!-- parameter of type 'void**' -->
            <parameter type-id='type-id-184'/>
            <!-- int -->
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- size_t tcmalloc::CentralFreeList::OverheadBytes() -->
          <function-decl name='OverheadBytes' mangled-name='_ZN8tcmalloc15CentralFreeList13OverheadBytesEv' filepath='src/central_freelist.cc' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList13OverheadBytesEv' hash='e0055d99adb0e173'>
            <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <!-- typedef size_t -->
            <return type-id='type-id-61'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- int tcmalloc::CentralFreeList::tc_length() -->
          <function-decl name='tc_length' mangled-name='_ZN8tcmalloc15CentralFreeList9tc_lengthEv' filepath='src/central_freelist.cc' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList9tc_lengthEv' hash='388da3fa973fde78'>
            <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <!-- int -->
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- int tcmalloc::CentralFreeList::RemoveRange(void**, void**, int) -->
          <function-decl name='RemoveRange' mangled-name='_ZN8tcmalloc15CentralFreeList11RemoveRangeEPPvS2_i' filepath='src/central_freelist.cc' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList11RemoveRangeEPPvS2_i' hash='14b2e307a32069c0'>
            <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <!-- parameter of type 'void**' -->
            <parameter type-id='type-id-184'/>
            <!-- parameter of type 'void**' -->
            <parameter type-id='type-id-184'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- int -->
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void tcmalloc::CentralFreeList::ReleaseToSpans(void*) -->
          <function-decl name='ReleaseToSpans' mangled-name='_ZN8tcmalloc15CentralFreeList14ReleaseToSpansEPv' filepath='src/central_freelist.cc' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList14ReleaseToSpansEPv' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-56'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void tcmalloc::CentralFreeList::ReleaseListToSpans(void*) -->
          <function-decl name='ReleaseListToSpans' mangled-name='_ZN8tcmalloc15CentralFreeList18ReleaseListToSpansEPv' filepath='src/central_freelist.cc' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList18ReleaseListToSpansEPv' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-56'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool tcmalloc::CentralFreeList::ShrinkCache(int, bool) -->
          <function-decl name='ShrinkCache' mangled-name='_ZN8tcmalloc15CentralFreeList11ShrinkCacheEib' filepath='src/central_freelist.cc' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList11ShrinkCacheEib' hash='6e5147834edeef47'>
            <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- parameter of type 'bool' -->
            <parameter type-id='type-id-59'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <!-- bool tcmalloc::CentralFreeList::EvictRandomSizeClass(bool) -->
          <function-decl name='EvictRandomSizeClass' mangled-name='_ZN8tcmalloc15CentralFreeList20EvictRandomSizeClassEib' filepath='src/central_freelist.cc' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList20EvictRandomSizeClassEib' hash='6e5147834edeef47#2'>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- parameter of type 'bool' -->
            <parameter type-id='type-id-59'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool tcmalloc::CentralFreeList::MakeCacheSpace() -->
          <function-decl name='MakeCacheSpace' mangled-name='_ZN8tcmalloc15CentralFreeList14MakeCacheSpaceEv' filepath='src/central_freelist.cc' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList14MakeCacheSpaceEv' hash='c7c710e908194b91'>
            <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void tcmalloc::CentralFreeList::InsertRange(void*, void*, int) -->
          <function-decl name='InsertRange' mangled-name='_ZN8tcmalloc15CentralFreeList11InsertRangeEPvS1_i' filepath='src/central_freelist.cc' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList11InsertRangeEPvS1_i' hash='388da3fa973fde78'>
            <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-56'/>
            <!-- parameter of type 'void*' -->
            <parameter type-id='type-id-56'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- class tcmalloc::CentralFreeListPadded -->
      <class-decl name='CentralFreeListPadded' visibility='default' hash='927adecee00cfb9c' id='type-id-185'/>
      <!-- class tcmalloc::PageHeap -->
      <class-decl name='PageHeap' visibility='default' hash='222c75e813625762' id='type-id-186'>
        <member-function access='private'>
          <!-- bool tcmalloc::PageHeap::MayMergeSpans(tcmalloc::Span*, tcmalloc::Span*) -->
          <function-decl name='MayMergeSpans' mangled-name='_ZN8tcmalloc8PageHeap13MayMergeSpansEPNS_4SpanES2_' filepath='src/page_heap.cc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap13MayMergeSpansEPNS_4SpanES2_' hash='37bb0ff623f303ce'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'tcmalloc::Span*' -->
            <parameter type-id='type-id-188'/>
            <!-- parameter of type 'tcmalloc::Span*' -->
            <parameter type-id='type-id-188'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void tcmalloc::PageHeap::RegisterSizeClass(tcmalloc::Span*, size_t) -->
          <function-decl name='RegisterSizeClass' mangled-name='_ZN8tcmalloc8PageHeap17RegisterSizeClassEPNS_4SpanEm' filepath='src/page_heap.cc' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap17RegisterSizeClassEPNS_4SpanEm' hash='ebab2e40fedd1db3'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'tcmalloc::Span*' -->
            <parameter type-id='type-id-188'/>
            <!-- parameter of type 'typedef size_t' -->
            <parameter type-id='type-id-61'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void tcmalloc::PageHeap::GetLargeSpanStats(tcmalloc::PageHeap::LargeSpanStats*) -->
          <function-decl name='GetLargeSpanStats' mangled-name='_ZN8tcmalloc8PageHeap17GetLargeSpanStatsEPNS0_14LargeSpanStatsE' filepath='src/page_heap.cc' line='537' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap17GetLargeSpanStatsEPNS0_14LargeSpanStatsE' hash='5287c32193a057e7'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'tcmalloc::PageHeap::LargeSpanStats*' -->
            <parameter type-id='type-id-189'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool tcmalloc::PageHeap::GetNextRange(PageID, base::MallocRange*) -->
          <function-decl name='GetNextRange' mangled-name='_ZN8tcmalloc8PageHeap12GetNextRangeEmPN4base11MallocRangeE' filepath='src/page_heap.cc' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap12GetNextRangeEmPN4base11MallocRangeE' hash='49299f0d79243915'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'typedef PageID' -->
            <parameter type-id='type-id-190'/>
            <!-- parameter of type 'base::MallocRange*' -->
            <parameter type-id='type-id-191'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool tcmalloc::PageHeap::Check() -->
          <function-decl name='Check' mangled-name='_ZN8tcmalloc8PageHeap5CheckEv' filepath='src/page_heap.cc' line='646' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap5CheckEv' hash='c7c710e908194b91'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool tcmalloc::PageHeap::CheckList(tcmalloc::Span*, Length, Length, int) -->
          <function-decl name='CheckList' mangled-name='_ZN8tcmalloc8PageHeap9CheckListEPNS_4SpanEmmi' filepath='src/page_heap.cc' line='663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap9CheckListEPNS_4SpanEmmi' hash='c0f70e7895fb5be5'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'tcmalloc::Span*' -->
            <parameter type-id='type-id-188'/>
            <!-- parameter of type 'typedef Length' -->
            <parameter type-id='type-id-192'/>
            <!-- parameter of type 'typedef Length' -->
            <parameter type-id='type-id-192'/>
            <!-- parameter of type 'int' -->
            <parameter type-id='type-id-1'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool tcmalloc::PageHeap::CheckExpensive() -->
          <function-decl name='CheckExpensive' mangled-name='_ZN8tcmalloc8PageHeap14CheckExpensiveEv' filepath='src/page_heap.cc' line='652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap14CheckExpensiveEv' hash='c7c710e908194b91'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- tcmalloc::Span* tcmalloc::PageHeap::Split(tcmalloc::Span*, Length) -->
          <function-decl name='Split' mangled-name='_ZN8tcmalloc8PageHeap5SplitEPNS_4SpanEm' filepath='src/page_heap.cc' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap5SplitEPNS_4SpanEm' hash='8a9780a59468e315'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'tcmalloc::Span*' -->
            <parameter type-id='type-id-188'/>
            <!-- parameter of type 'typedef Length' -->
            <parameter type-id='type-id-192'/>
            <!-- tcmalloc::Span* -->
            <return type-id='type-id-188'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void tcmalloc::PageHeap::GetSmallSpanStats(tcmalloc::PageHeap::SmallSpanStats*) -->
          <function-decl name='GetSmallSpanStats' mangled-name='_ZN8tcmalloc8PageHeap17GetSmallSpanStatsEPNS0_14SmallSpanStatsE' filepath='src/page_heap.cc' line='530' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap17GetSmallSpanStatsEPNS0_14SmallSpanStatsE' hash='988bbfba08aca7f1'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'tcmalloc::PageHeap::SmallSpanStats*' -->
            <parameter type-id='type-id-193'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void tcmalloc::PageHeap::RemoveFromFreeList(tcmalloc::Span*) -->
          <function-decl name='RemoveFromFreeList' mangled-name='_ZN8tcmalloc8PageHeap18RemoveFromFreeListEPNS_4SpanE' filepath='src/page_heap.cc' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap18RemoveFromFreeListEPNS_4SpanE' hash='e089691e785388d9'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'tcmalloc::Span*' -->
            <parameter type-id='type-id-188'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void tcmalloc::PageHeap::PrependToFreeList(tcmalloc::Span*) -->
          <function-decl name='PrependToFreeList' mangled-name='_ZN8tcmalloc8PageHeap17PrependToFreeListEPNS_4SpanE' filepath='src/page_heap.cc' line='403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap17PrependToFreeListEPNS_4SpanE' hash='e089691e785388d9'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'tcmalloc::Span*' -->
            <parameter type-id='type-id-188'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool tcmalloc::PageHeap::DecommitSpan(tcmalloc::Span*) -->
          <function-decl name='DecommitSpan' mangled-name='_ZN8tcmalloc8PageHeap12DecommitSpanEPNS_4SpanE' filepath='src/page_heap.cc' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap12DecommitSpanEPNS_4SpanE' hash='b836a24ffbd86a3b'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'tcmalloc::Span*' -->
            <parameter type-id='type-id-188'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void tcmalloc::PageHeap::MergeIntoFreeList(tcmalloc::Span*) -->
          <function-decl name='MergeIntoFreeList' mangled-name='_ZN8tcmalloc8PageHeap17MergeIntoFreeListEPNS_4SpanE' filepath='src/page_heap.cc' line='323' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap17MergeIntoFreeListEPNS_4SpanE' hash='e089691e785388d9'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'tcmalloc::Span*' -->
            <parameter type-id='type-id-188'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- Length tcmalloc::PageHeap::ReleaseLastNormalSpan(tcmalloc::PageHeap::SpanList*) -->
          <function-decl name='ReleaseLastNormalSpan' mangled-name='_ZN8tcmalloc8PageHeap21ReleaseLastNormalSpanEPNS0_8SpanListE' filepath='src/page_heap.cc' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap21ReleaseLastNormalSpanEPNS0_8SpanListE' hash='e0bb13d58b9d984f'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'tcmalloc::PageHeap::SpanList*' -->
            <parameter type-id='type-id-194'/>
            <!-- typedef Length -->
            <return type-id='type-id-192'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- Length tcmalloc::PageHeap::ReleaseAtLeastNPages(Length) -->
          <function-decl name='ReleaseAtLeastNPages' mangled-name='_ZN8tcmalloc8PageHeap20ReleaseAtLeastNPagesEm' filepath='src/page_heap.cc' line='471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap20ReleaseAtLeastNPagesEm' hash='91495cdf6321a116'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'typedef Length' -->
            <parameter type-id='type-id-192'/>
            <!-- typedef Length -->
            <return type-id='type-id-192'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool tcmalloc::PageHeap::EnsureLimit(Length, bool) -->
          <function-decl name='EnsureLimit' mangled-name='_ZN8tcmalloc8PageHeap11EnsureLimitEmb' filepath='src/page_heap.cc' line='494' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap11EnsureLimitEmb' hash='edf93e0e926f2972'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'typedef Length' -->
            <parameter type-id='type-id-192'/>
            <!-- parameter of type 'bool' -->
            <parameter type-id='type-id-59'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void tcmalloc::PageHeap::IncrementalScavenge(Length) -->
          <function-decl name='IncrementalScavenge' mangled-name='_ZN8tcmalloc8PageHeap19IncrementalScavengeEm' filepath='src/page_heap.cc' line='425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap19IncrementalScavengeEm' hash='e0055d99adb0e173'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'typedef Length' -->
            <parameter type-id='type-id-192'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void tcmalloc::PageHeap::Delete(tcmalloc::Span*) -->
          <function-decl name='Delete' mangled-name='_ZN8tcmalloc8PageHeap6DeleteEPNS_4SpanE' filepath='src/page_heap.cc' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap6DeleteEPNS_4SpanE' hash='e089691e785388d9'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'tcmalloc::Span*' -->
            <parameter type-id='type-id-188'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- bool tcmalloc::PageHeap::GrowHeap(Length) -->
          <function-decl name='GrowHeap' mangled-name='_ZN8tcmalloc8PageHeap8GrowHeapEm' filepath='src/page_heap.cc' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap8GrowHeapEm' hash='7e544b18f5e89a62'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'typedef Length' -->
            <parameter type-id='type-id-192'/>
            <!-- bool -->
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void tcmalloc::PageHeap::CommitSpan(tcmalloc::Span*) -->
          <function-decl name='CommitSpan' mangled-name='_ZN8tcmalloc8PageHeap10CommitSpanEPNS_4SpanE' filepath='src/page_heap.cc' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap10CommitSpanEPNS_4SpanE' hash='e089691e785388d9'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'tcmalloc::Span*' -->
            <parameter type-id='type-id-188'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- tcmalloc::Span* tcmalloc::PageHeap::Carve(tcmalloc::Span*, Length) -->
          <function-decl name='Carve' mangled-name='_ZN8tcmalloc8PageHeap5CarveEPNS_4SpanEm' filepath='src/page_heap.cc' line='256' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap5CarveEPNS_4SpanEm' hash='8a9780a59468e315'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'tcmalloc::Span*' -->
            <parameter type-id='type-id-188'/>
            <!-- parameter of type 'typedef Length' -->
            <parameter type-id='type-id-192'/>
            <!-- tcmalloc::Span* -->
            <return type-id='type-id-188'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- tcmalloc::Span* tcmalloc::PageHeap::AllocLarge(Length) -->
          <function-decl name='AllocLarge' mangled-name='_ZN8tcmalloc8PageHeap10AllocLargeEm' filepath='src/page_heap.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap10AllocLargeEm' hash='ebab2e40fedd1db3'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'typedef Length' -->
            <parameter type-id='type-id-192'/>
            <!-- tcmalloc::Span* -->
            <return type-id='type-id-188'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- tcmalloc::Span* tcmalloc::PageHeap::SearchFreeAndLargeLists(Length) -->
          <function-decl name='SearchFreeAndLargeLists' mangled-name='_ZN8tcmalloc8PageHeap23SearchFreeAndLargeListsEm' filepath='src/page_heap.cc' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap23SearchFreeAndLargeListsEm' hash='ebab2e40fedd1db3'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'typedef Length' -->
            <parameter type-id='type-id-192'/>
            <!-- tcmalloc::Span* -->
            <return type-id='type-id-188'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- tcmalloc::Span* tcmalloc::PageHeap::New(Length) -->
          <function-decl name='New' mangled-name='_ZN8tcmalloc8PageHeap3NewEm' filepath='src/page_heap.cc' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap3NewEm' hash='ebab2e40fedd1db3'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- parameter of type 'typedef Length' -->
            <parameter type-id='type-id-192'/>
            <!-- tcmalloc::Span* -->
            <return type-id='type-id-188'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <!-- tcmalloc::PageHeap::PageHeap() -->
          <function-decl name='PageHeap' mangled-name='_ZN8tcmalloc8PageHeapC1Ev' filepath='src/page_heap.cc' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeapC1Ev' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- class tcmalloc::Static -->
      <class-decl name='Static' visibility='default' hash='1bc5e1dbc1d1509d' id='type-id-195'>
        <member-function access='private' static='yes'>
          <!-- void tcmalloc::Static::InitStaticVars() -->
          <function-decl name='InitStaticVars' mangled-name='_ZN8tcmalloc6Static14InitStaticVarsEv' filepath='src/static_vars.cc' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc6Static14InitStaticVarsEv' hash='7f32ffea222edbe7'>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- struct tcmalloc::Span -->
      <class-decl name='Span' is-struct='yes' visibility='default' hash='9155200a80dda2bf' id='type-id-196'/>
      <!-- struct tcmalloc::StackTrace -->
      <class-decl name='StackTrace' is-struct='yes' visibility='default' hash='0ebb74cf73f54255' id='type-id-197'/>
      <!-- class tcmalloc::LogItem -->
      <class-decl name='LogItem' visibility='default' hash='c56129486804d69d' id='type-id-198'>
      </class-decl>
      <!-- class tcmalloc::PageHeapAllocator<tcmalloc::Span> -->
      <class-decl name='PageHeapAllocator&lt;tcmalloc::Span&gt;' visibility='default' size-in-bits='256' filepath='src/page_heap_allocator.h' line='47' column='1' hash='f6d6733aed128ac5' id='type-id-199'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- char* tcmalloc::PageHeapAllocator<tcmalloc::Span>::free_area_ -->
          <var-decl name='free_area_' type-id='type-id-130' visibility='default' filepath='src/page_heap_allocator.h' line='102' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- size_t tcmalloc::PageHeapAllocator<tcmalloc::Span>::free_avail_ -->
          <var-decl name='free_avail_' type-id='type-id-61' visibility='default' filepath='src/page_heap_allocator.h' line='103' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- void* tcmalloc::PageHeapAllocator<tcmalloc::Span>::free_list_ -->
          <var-decl name='free_list_' type-id='type-id-56' visibility='default' filepath='src/page_heap_allocator.h' line='106' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <!-- int tcmalloc::PageHeapAllocator<tcmalloc::Span>::inuse_ -->
          <var-decl name='inuse_' type-id='type-id-1' visibility='default' filepath='src/page_heap_allocator.h' line='109' column='1'/>
        </data-member>
      </class-decl>
      <!-- class tcmalloc::PageHeapAllocator<tcmalloc::StackTrace> -->
      <class-decl name='PageHeapAllocator&lt;tcmalloc::StackTrace&gt;' visibility='default' size-in-bits='256' filepath='src/page_heap_allocator.h' line='47' column='1' hash='45310e04242d15c6' id='type-id-200'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- char* tcmalloc::PageHeapAllocator<tcmalloc::StackTrace>::free_area_ -->
          <var-decl name='free_area_' type-id='type-id-130' visibility='default' filepath='src/page_heap_allocator.h' line='102' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- size_t tcmalloc::PageHeapAllocator<tcmalloc::StackTrace>::free_avail_ -->
          <var-decl name='free_avail_' type-id='type-id-61' visibility='default' filepath='src/page_heap_allocator.h' line='103' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- void* tcmalloc::PageHeapAllocator<tcmalloc::StackTrace>::free_list_ -->
          <var-decl name='free_list_' type-id='type-id-56' visibility='default' filepath='src/page_heap_allocator.h' line='106' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <!-- int tcmalloc::PageHeapAllocator<tcmalloc::StackTrace>::inuse_ -->
          <var-decl name='inuse_' type-id='type-id-1' visibility='default' filepath='src/page_heap_allocator.h' line='109' column='1'/>
        </data-member>
      </class-decl>
      <!-- class tcmalloc::PageHeapAllocator<tcmalloc::StackTraceTable::Bucket> -->
      <class-decl name='PageHeapAllocator&lt;tcmalloc::StackTraceTable::Bucket&gt;' visibility='default' size-in-bits='256' filepath='src/page_heap_allocator.h' line='47' column='1' hash='fe7c8d14e53f5993' id='type-id-201'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- char* tcmalloc::PageHeapAllocator<tcmalloc::StackTraceTable::Bucket>::free_area_ -->
          <var-decl name='free_area_' type-id='type-id-130' visibility='default' filepath='src/page_heap_allocator.h' line='102' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- size_t tcmalloc::PageHeapAllocator<tcmalloc::StackTraceTable::Bucket>::free_avail_ -->
          <var-decl name='free_avail_' type-id='type-id-61' visibility='default' filepath='src/page_heap_allocator.h' line='103' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- void* tcmalloc::PageHeapAllocator<tcmalloc::StackTraceTable::Bucket>::free_list_ -->
          <var-decl name='free_list_' type-id='type-id-56' visibility='default' filepath='src/page_heap_allocator.h' line='106' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <!-- int tcmalloc::PageHeapAllocator<tcmalloc::StackTraceTable::Bucket>::inuse_ -->
          <var-decl name='inuse_' type-id='type-id-1' visibility='default' filepath='src/page_heap_allocator.h' line='109' column='1'/>
        </data-member>
      </class-decl>
      <!-- class tcmalloc::SizeMap -->
      <class-decl name='SizeMap' visibility='default' hash='2dbf9d0b9da46da8' id='type-id-202'>
        <member-function access='private'>
          <!-- int tcmalloc::SizeMap::NumMoveSize(size_t) -->
          <function-decl name='NumMoveSize' mangled-name='_ZN8tcmalloc7SizeMap11NumMoveSizeEm' filepath='src/common.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc7SizeMap11NumMoveSizeEm' hash='b6a97d07f8261bc0'>
            <!-- implicit parameter of type 'tcmalloc::SizeMap*' -->
            <parameter type-id='type-id-203' is-artificial='yes'/>
            <!-- parameter of type 'typedef size_t' -->
            <parameter type-id='type-id-61'/>
            <!-- int -->
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <!-- void tcmalloc::SizeMap::Init() -->
          <function-decl name='Init' mangled-name='_ZN8tcmalloc7SizeMap4InitEv' filepath='src/common.cc' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc7SizeMap4InitEv' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type 'tcmalloc::SizeMap*' -->
            <parameter type-id='type-id-203' is-artificial='yes'/>
            <!-- void -->
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <!-- void (void*) -->
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-204'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-56'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void (void*, void*) -->
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-205'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-56'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-56'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void* (size_t) -->
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-206'>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-61'/>
      <!-- void* -->
      <return type-id='type-id-56'/>
    </function-type>
    <!-- Length (tcmalloc::PageHeap::*) (Length) -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='91495cdf6321a116' id='type-id-208'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- parameter of type 'typedef Length' -->
      <parameter type-id='type-id-192'/>
      <!-- typedef Length -->
      <return type-id='type-id-192'/>
    </function-type>
    <!-- Length (tcmalloc::PageHeap::*) (tcmalloc::PageHeap::SpanList*) -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='e0bb13d58b9d984f' id='type-id-209'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- parameter of type 'tcmalloc::PageHeap::SpanList*' -->
      <parameter type-id='type-id-194'/>
      <!-- typedef Length -->
      <return type-id='type-id-192'/>
    </function-type>
    <!-- bool (tcmalloc::CentralFreeList::*) () -->
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='c7c710e908194b91' id='type-id-211'>
      <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- bool (tcmalloc::CentralFreeList::*) (int, bool) -->
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='6e5147834edeef47' id='type-id-212'>
      <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- parameter of type 'bool' -->
      <parameter type-id='type-id-59'/>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- bool (tcmalloc::CentralFreeList::*) (int, bool) -->
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='6e5147834edeef47#2' id='type-id-213'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- parameter of type 'bool' -->
      <parameter type-id='type-id-59'/>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- bool (tcmalloc::PageHeap::*) () -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='c7c710e908194b91' id='type-id-214'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- bool (tcmalloc::PageHeap::*) (Length) -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='7e544b18f5e89a62' id='type-id-215'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- parameter of type 'typedef Length' -->
      <parameter type-id='type-id-192'/>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- bool (tcmalloc::PageHeap::*) (Length, bool) -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='edf93e0e926f2972' id='type-id-216'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- parameter of type 'typedef Length' -->
      <parameter type-id='type-id-192'/>
      <!-- parameter of type 'bool' -->
      <parameter type-id='type-id-59'/>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- bool (tcmalloc::PageHeap::*) (PageID, base::MallocRange*) -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='49299f0d79243915' id='type-id-217'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- parameter of type 'typedef PageID' -->
      <parameter type-id='type-id-190'/>
      <!-- parameter of type 'base::MallocRange*' -->
      <parameter type-id='type-id-191'/>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- bool (tcmalloc::PageHeap::*) (tcmalloc::Span*) -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='b836a24ffbd86a3b' id='type-id-218'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- parameter of type 'tcmalloc::Span*' -->
      <parameter type-id='type-id-188'/>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- bool (tcmalloc::PageHeap::*) (tcmalloc::Span*, Length, Length, int) -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='c0f70e7895fb5be5' id='type-id-219'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- parameter of type 'tcmalloc::Span*' -->
      <parameter type-id='type-id-188'/>
      <!-- parameter of type 'typedef Length' -->
      <parameter type-id='type-id-192'/>
      <!-- parameter of type 'typedef Length' -->
      <parameter type-id='type-id-192'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- bool (tcmalloc::PageHeap::*) (tcmalloc::Span*, tcmalloc::Span*) -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='37bb0ff623f303ce' id='type-id-220'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- parameter of type 'tcmalloc::Span*' -->
      <parameter type-id='type-id-188'/>
      <!-- parameter of type 'tcmalloc::Span*' -->
      <parameter type-id='type-id-188'/>
      <!-- bool -->
      <return type-id='type-id-59'/>
    </function-type>
    <!-- int (tcmalloc::CentralFreeList::*) () -->
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='388da3fa973fde78' id='type-id-221'>
      <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-type>
    <!-- int (tcmalloc::CentralFreeList::*) (int, void**, void**) -->
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='05583901df42bd48' id='type-id-222'>
      <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-184'/>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-184'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-type>
    <!-- int (tcmalloc::CentralFreeList::*) (void**, void**, int) -->
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='14b2e307a32069c0' id='type-id-223'>
      <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-184'/>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-184'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-type>
    <!-- int (tcmalloc::SizeMap::*) (size_t) -->
    <function-type method-class-id='type-id-224' size-in-bits='64' hash='b6a97d07f8261bc0' id='type-id-225'>
      <!-- implicit parameter of type 'tcmalloc::SizeMap*' -->
      <parameter type-id='type-id-203' is-artificial='yes'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-61'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-type>
    <!-- size_t (tcmalloc::CentralFreeList::*) () -->
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='e0055d99adb0e173' id='type-id-226'>
      <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <!-- typedef size_t -->
      <return type-id='type-id-61'/>
    </function-type>
    <!-- tcmalloc::Span* (tcmalloc::PageHeap::*) (Length) -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='ebab2e40fedd1db3' id='type-id-227'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- parameter of type 'typedef Length' -->
      <parameter type-id='type-id-192'/>
      <!-- tcmalloc::Span* -->
      <return type-id='type-id-188'/>
    </function-type>
    <!-- tcmalloc::Span* (tcmalloc::PageHeap::*) (tcmalloc::Span*, Length) -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='8a9780a59468e315' id='type-id-228'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- parameter of type 'tcmalloc::Span*' -->
      <parameter type-id='type-id-188'/>
      <!-- parameter of type 'typedef Length' -->
      <parameter type-id='type-id-192'/>
      <!-- tcmalloc::Span* -->
      <return type-id='type-id-188'/>
    </function-type>
    <!-- void (tcmalloc::CentralFreeList::*) () -->
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-229'>
      <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void (tcmalloc::CentralFreeList::*) (size_t) -->
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='e0055d99adb0e173' id='type-id-230'>
      <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-61'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void (tcmalloc::CentralFreeList::*) (void*) -->
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-231'>
      <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-56'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void (tcmalloc::CentralFreeList::*) (void*, void*, int) -->
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='388da3fa973fde78' id='type-id-232'>
      <!-- implicit parameter of type 'tcmalloc::CentralFreeList*' -->
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-56'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-56'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void (tcmalloc::PageHeap::*) () -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-233'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void (tcmalloc::PageHeap::*) (Length) -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='e0055d99adb0e173' id='type-id-234'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- parameter of type 'typedef Length' -->
      <parameter type-id='type-id-192'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void (tcmalloc::PageHeap::*) (tcmalloc::PageHeap::LargeSpanStats*) -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='5287c32193a057e7' id='type-id-235'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- parameter of type 'tcmalloc::PageHeap::LargeSpanStats*' -->
      <parameter type-id='type-id-189'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void (tcmalloc::PageHeap::*) (tcmalloc::PageHeap::SmallSpanStats*) -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='988bbfba08aca7f1' id='type-id-236'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- parameter of type 'tcmalloc::PageHeap::SmallSpanStats*' -->
      <parameter type-id='type-id-193'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void (tcmalloc::PageHeap::*) (tcmalloc::Span*) -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='e089691e785388d9' id='type-id-237'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- parameter of type 'tcmalloc::Span*' -->
      <parameter type-id='type-id-188'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void (tcmalloc::PageHeap::*) (tcmalloc::Span*, size_t) -->
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='ebab2e40fedd1db3' id='type-id-238'>
      <!-- implicit parameter of type 'tcmalloc::PageHeap*' -->
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <!-- parameter of type 'tcmalloc::Span*' -->
      <parameter type-id='type-id-188'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-61'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void (tcmalloc::SizeMap::*) () -->
    <function-type method-class-id='type-id-224' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-239'>
      <!-- implicit parameter of type 'tcmalloc::SizeMap*' -->
      <parameter type-id='type-id-203' is-artificial='yes'/>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
    <!-- void (tcmalloc::Static::*) (void) -->
    <function-type method-class-id='type-id-240' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-241'>
      <!-- void -->
      <return type-id='type-id-58'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- namespace base -->
    <namespace-decl name='base'>
    </namespace-decl>
    <!-- namespace tcmalloc -->
    <namespace-decl name='tcmalloc'>
      <!-- int tcmalloc::AlignmentForSize(size_t) -->
      <function-decl name='AlignmentForSize' mangled-name='_ZN8tcmalloc16AlignmentForSizeEm' filepath='src/common.cc' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16AlignmentForSizeEm' hash='b6a97d07f8261bc0'>
        <!-- parameter of type 'typedef size_t' -->
        <parameter type-id='type-id-61'/>
        <!-- int -->
        <return type-id='type-id-1'/>
      </function-decl>
      <!-- void* tcmalloc::MetaDataAlloc(size_t) -->
      <function-decl name='MetaDataAlloc' mangled-name='_ZN8tcmalloc13MetaDataAllocEm' filepath='src/common.cc' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc13MetaDataAllocEm' hash='e0055d99adb0e173'>
        <!-- parameter of type 'typedef size_t' -->
        <parameter type-id='type-id-61'/>
        <!-- void* -->
        <return type-id='type-id-56'/>
      </function-decl>
      <!-- uint64_t tcmalloc::metadata_system_bytes() -->
      <function-decl name='metadata_system_bytes' mangled-name='_ZN8tcmalloc21metadata_system_bytesEv' filepath='src/common.cc' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc21metadata_system_bytesEv' hash='e0055d99adb0e173'>
        <!-- typedef uint64_t -->
        <return type-id='type-id-16'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/heap-checker-bcad.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- class HeapLeakCheckerGlobalPrePost -->
    <class-decl name='HeapLeakCheckerGlobalPrePost' visibility='default' size-in-bits='8' filepath='src/heap-checker-bcad.cc' line='60' column='1' hash='8d1ad826c51051b3' id='type-id-242'>
      <data-member access='public' static='yes'>
        <!-- static int HeapLeakCheckerGlobalPrePost::count_ -->
        <var-decl name='count_' type-id='type-id-1' mangled-name='_ZN28HeapLeakCheckerGlobalPrePost6count_E' visibility='default' filepath='src/heap-checker-bcad.cc' line='90' column='1' elf-symbol-id='_ZN28HeapLeakCheckerGlobalPrePost6count_E'/>
      </data-member>
      <member-function access='private' destructor='yes'>
        <!-- HeapLeakCheckerGlobalPrePost::~HeapLeakCheckerGlobalPrePost() -->
        <function-decl name='~HeapLeakCheckerGlobalPrePost' mangled-name='_ZN28HeapLeakCheckerGlobalPrePostD1Ev' filepath='src/heap-checker-bcad.cc' line='79' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN28HeapLeakCheckerGlobalPrePostD1Ev' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'HeapLeakCheckerGlobalPrePost*' -->
          <parameter type-id='type-id-243' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- HeapLeakCheckerGlobalPrePost* -->
    <pointer-type-def type-id='type-id-242' size-in-bits='64' hash='a621862bcbe54005' id='type-id-243'/>
    <!-- HeapLeakCheckerGlobalPrePost* const -->
    <qualified-type-def type-id='type-id-243' const='yes' hash='5237db837ff51788' id='type-id-244'/>
    <!-- bool heap_leak_checker_bcad_variable -->
    <var-decl name='heap_leak_checker_bcad_variable' type-id='type-id-59' mangled-name='heap_leak_checker_bcad_variable' visibility='default' filepath='src/heap-checker-bcad.cc' line='53' column='1' elf-symbol-id='heap_leak_checker_bcad_variable'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/heap-checker.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <!-- AtomicWord[8] -->
    <array-type-def dimensions='1' type-id='type-id-245' size-in-bits='512' hash='ecac7e1584aeceef#2' id='type-id-246'>
      <!-- <anonymous range>[8] -->
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-247'/>
    </array-type-def>
    <!-- class AddressMap<HeapProfileTable::AllocValue> -->
    <class-decl name='AddressMap&lt;HeapProfileTable::AllocValue&gt;' visibility='default' size-in-bits='320' filepath='src/addressmap-inl.h' line='104' column='1' hash='6eacb0f56ba1e983' id='type-id-248'>
      <member-type access='private'>
        <!-- struct AddressMap<HeapProfileTable::AllocValue>::Cluster -->
        <class-decl name='Cluster' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-249'/>
      </member-type>
      <member-type access='private'>
        <!-- struct AddressMap<HeapProfileTable::AllocValue>::Entry -->
        <class-decl name='Entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-250'/>
      </member-type>
      <member-type access='private'>
        <!-- struct AddressMap<HeapProfileTable::AllocValue>::Object -->
        <class-decl name='Object' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-251'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- AddressMap<HeapProfileTable::AllocValue>::Cluster** AddressMap<HeapProfileTable::AllocValue>::hashtable_ -->
        <var-decl name='hashtable_' type-id='type-id-252' visibility='default' filepath='src/addressmap-inl.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- AddressMap<HeapProfileTable::AllocValue>::Entry* AddressMap<HeapProfileTable::AllocValue>::free_ -->
        <var-decl name='free_' type-id='type-id-253' visibility='default' filepath='src/addressmap-inl.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- void* (* AddressMap<HeapProfileTable::AllocValue>::alloc_)(unsigned long int) -->
        <var-decl name='alloc_' type-id='type-id-254' visibility='default' filepath='src/addressmap-inl.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <!-- void (* AddressMap<HeapProfileTable::AllocValue>::dealloc_)(void*) -->
        <var-decl name='dealloc_' type-id='type-id-255' visibility='default' filepath='src/addressmap-inl.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <!-- AddressMap<HeapProfileTable::AllocValue>::Object* AddressMap<HeapProfileTable::AllocValue>::allocated_ -->
        <var-decl name='allocated_' type-id='type-id-256' visibility='default' filepath='src/addressmap-inl.h' line='253' column='1'/>
      </data-member>
      <member-function access='private'>
        <!-- void AddressMap<HeapProfileTable::AllocValue>::AddressMap(void* (*)(unsigned long int), void (*)(void*)) -->
        <function-decl name='AddressMap' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEEC2EPFPvmEPFvS3_E' filepath='src/addressmap-inl.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10AddressMapIN16HeapProfileTable10AllocValueEEC2EPFPvmEPFvS3_E' hash='e7946129631a25a2'>
          <!-- implicit parameter of type 'AddressMap<HeapProfileTable::AllocValue>*' -->
          <parameter type-id='type-id-257' is-artificial='yes'/>
          <!-- parameter of type 'void* (*)(unsigned long int)' -->
          <parameter type-id='type-id-254'/>
          <!-- parameter of type 'void (*)(void*)' -->
          <parameter type-id='type-id-255'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void AddressMap<HeapProfileTable::AllocValue>::Insert(void*, HeapProfileTable::AllocValue) -->
        <function-decl name='Insert' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE6InsertEPKvS1_' filepath='src/addressmap-inl.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE6InsertEPKvS1_' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'AddressMap<HeapProfileTable::AllocValue>*' -->
          <parameter type-id='type-id-257' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- parameter of type 'struct HeapProfileTable::AllocValue' -->
          <parameter type-id='type-id-258'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class GoogleInitializer -->
    <class-decl name='GoogleInitializer' visibility='default' size-in-bits='128' filepath='src/base/googleinit.h' line='39' column='1' hash='44f5dfa25db33174' id='type-id-259'>
      <member-type access='private'>
        <!-- typedef void (*)(void) GoogleInitializer::VoidFunction -->
        <typedef-decl name='VoidFunction' type-id='type-id-261' size-in-bits='64' filepath='./src/base/googleinit.h' line='41' column='1' hash='fd7a63c0c6c822c4' id='type-id-260'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- const char* const GoogleInitializer::name_ -->
        <var-decl name='name_' type-id='type-id-262' visibility='default' filepath='src/base/googleinit.h' line='55' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- const GoogleInitializer::VoidFunction GoogleInitializer::destructor_ -->
        <var-decl name='destructor_' type-id='type-id-263' visibility='default' filepath='src/base/googleinit.h' line='56' column='1'/>
      </data-member>
      <member-function access='private' destructor='yes'>
        <!-- GoogleInitializer::~GoogleInitializer() -->
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'GoogleInitializer*' -->
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- GoogleInitializer::~GoogleInitializer() -->
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'GoogleInitializer*' -->
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- GoogleInitializer::~GoogleInitializer() -->
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'GoogleInitializer*' -->
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- GoogleInitializer::~GoogleInitializer() -->
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'GoogleInitializer*' -->
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- GoogleInitializer::~GoogleInitializer() -->
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'GoogleInitializer*' -->
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- GoogleInitializer::~GoogleInitializer() -->
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'GoogleInitializer*' -->
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- GoogleInitializer::~GoogleInitializer() -->
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='./src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'GoogleInitializer*' -->
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- GoogleInitializer::~GoogleInitializer() -->
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'GoogleInitializer*' -->
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class HeapCleaner -->
    <class-decl name='HeapCleaner' visibility='default' size-in-bits='8' filepath='./src/gperftools/heap-checker.h' line='403' column='1' hash='c1c248c574bcc05a' id='type-id-265'>
      <member-type access='private'>
        <!-- typedef void (*)(void) HeapCleaner::void_function -->
        <typedef-decl name='void_function' type-id='type-id-261' size-in-bits='64' filepath='./src/gperftools/heap-checker.h' line='405' column='1' hash='fd7a63c0c6c822c4' id='type-id-266'/>
      </member-type>
      <data-member access='public' static='yes'>
        <!-- static std::vector<void (*)(), std::allocator<void (*)()> >* HeapCleaner::heap_cleanups_ -->
        <var-decl name='heap_cleanups_' type-id='type-id-267' mangled-name='_ZN11HeapCleaner14heap_cleanups_E' visibility='default' filepath='src/heap-checker.cc' line='1906' column='1' elf-symbol-id='_ZN11HeapCleaner14heap_cleanups_E'/>
      </data-member>
      <member-function access='private' static='yes'>
        <!-- void HeapCleaner::RunHeapCleanups() -->
        <function-decl name='RunHeapCleanups' mangled-name='_ZN11HeapCleaner15RunHeapCleanupsEv' filepath='src/heap-checker.cc' line='1917' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11HeapCleaner15RunHeapCleanupsEv' hash='7f32ffea222edbe7'>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- HeapCleaner::HeapCleaner(HeapCleaner::void_function) -->
        <function-decl name='HeapCleaner' mangled-name='_ZN11HeapCleanerC1EPFvvE' filepath='src/heap-checker.cc' line='1910' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11HeapCleanerC1EPFvvE' hash='5695f5ce05a4c55f'>
          <!-- implicit parameter of type 'HeapCleaner*' -->
          <parameter type-id='type-id-268' is-artificial='yes'/>
          <!-- parameter of type 'typedef HeapCleaner::void_function' -->
          <parameter type-id='type-id-266'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class HeapLeakChecker -->
    <class-decl name='HeapLeakChecker' visibility='default' size-in-bits='448' filepath='src/gperftools/heap-checker.h' line='78' column='1' hash='58e4a70268cc98a3' id='type-id-269'>
      <member-type access='private'>
        <!-- class HeapLeakChecker::Disabler -->
        <class-decl name='Disabler' visibility='default' size-in-bits='8' filepath='./src/gperftools/heap-checker.h' line='175' column='1' hash='292407e770723063' id='type-id-270'>
          <member-function access='private' destructor='yes'>
            <!-- HeapLeakChecker::Disabler::~Disabler() -->
            <function-decl name='~Disabler' mangled-name='_ZN15HeapLeakChecker8DisablerD1Ev' filepath='src/heap-checker.cc' line='516' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8DisablerD1Ev' hash='7f32ffea222edbe7'>
              <!-- implicit parameter of type 'HeapLeakChecker::Disabler*' -->
              <parameter type-id='type-id-271' is-artificial='yes'/>
              <!-- void -->
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='private' constructor='yes'>
            <!-- HeapLeakChecker::Disabler::Disabler() -->
            <function-decl name='Disabler' mangled-name='_ZN15HeapLeakChecker8DisablerC1Ev' filepath='src/heap-checker.cc' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8DisablerC1Ev' hash='7f32ffea222edbe7'>
              <!-- implicit parameter of type 'HeapLeakChecker::Disabler*' -->
              <parameter type-id='type-id-271' is-artificial='yes'/>
              <!-- void -->
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- enum HeapLeakChecker::ProcMapsResult -->
        <enum-decl name='ProcMapsResult' size-in-bits='32' alignment-in-bits='32' filepath='./src/gperftools/heap-checker.h' line='301' column='1' hash='5acc66b484e08503' id='type-id-272'>
          <underlying-type type-id='type-id-93'/>
          <enumerator name='PROC_MAPS_USED' value='0'/>
          <enumerator name='CANT_OPEN_PROC_MAPS' value='1'/>
          <enumerator name='NO_SHARED_LIBS_IN_PROC_MAPS' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <!-- enum HeapLeakChecker::ProcMapsTask -->
        <enum-decl name='ProcMapsTask' size-in-bits='32' alignment-in-bits='32' filepath='./src/gperftools/heap-checker.h' line='295' column='1' hash='5d48bb902be64192' id='type-id-273'>
          <underlying-type type-id='type-id-93'/>
          <enumerator name='RECORD_GLOBAL_DATA' value='0'/>
          <enumerator name='DISABLE_LIBRARY_ALLOCS' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <!-- enum HeapLeakChecker::ShouldSymbolize -->
        <enum-decl name='ShouldSymbolize' size-in-bits='32' alignment-in-bits='32' filepath='./src/gperftools/heap-checker.h' line='225' column='1' hash='40841eec60d1b1b9' id='type-id-274'>
          <underlying-type type-id='type-id-93'/>
          <enumerator name='SYMBOLIZE' value='0'/>
          <enumerator name='DO_NOT_SYMBOLIZE' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapLeakChecker::Allocator -->
        <class-decl name='Allocator' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/heap-checker.cc' line='292' column='1' hash='9db6034888da57eb' id='type-id-275'>
          <data-member access='public' static='yes'>
            <!-- static LowLevelAlloc::Arena* HeapLeakChecker::Allocator::arena_ -->
            <var-decl name='arena_' type-id='type-id-87' mangled-name='_ZN15HeapLeakChecker9Allocator6arena_E' visibility='default' filepath='src/heap-checker.cc' line='337' column='1' elf-symbol-id='_ZN15HeapLeakChecker9Allocator6arena_E'/>
          </data-member>
          <data-member access='public' static='yes'>
            <!-- static int HeapLeakChecker::Allocator::alloc_count_ -->
            <var-decl name='alloc_count_' type-id='type-id-1' mangled-name='_ZN15HeapLeakChecker9Allocator12alloc_count_E' visibility='default' filepath='src/heap-checker.cc' line='338' column='1' elf-symbol-id='_ZN15HeapLeakChecker9Allocator12alloc_count_E'/>
          </data-member>
          <member-function access='public' static='yes'>
            <!-- void* HeapLeakChecker::Allocator::Allocate() -->
            <function-decl name='Allocate' mangled-name='_ZN15HeapLeakChecker9Allocator8AllocateEm' filepath='src/heap-checker.cc' line='309' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9Allocator8AllocateEm' hash='e0055d99adb0e173'>
              <!-- parameter of type 'typedef size_t' -->
              <parameter type-id='type-id-61'/>
              <!-- void* -->
              <return type-id='type-id-56'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <!-- void HeapLeakChecker::Allocator::Free() -->
            <function-decl name='Free' mangled-name='_ZN15HeapLeakChecker9Allocator4FreeEPv' filepath='src/heap-checker.cc' line='315' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9Allocator4FreeEPv' hash='7f32ffea222edbe7'>
              <!-- parameter of type 'void*' -->
              <parameter type-id='type-id-56'/>
              <!-- void -->
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapLeakChecker::RangeValue -->
        <class-decl name='RangeValue' is-struct='yes' visibility='default' size-in-bits='128' filepath='src/heap-checker.cc' line='404' column='1' hash='4f3e20a025af33d8' id='type-id-276'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- uintptr_t HeapLeakChecker::RangeValue::start_address -->
            <var-decl name='start_address' type-id='type-id-277' visibility='default' filepath='src/heap-checker.cc' line='405' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- int HeapLeakChecker::RangeValue::max_depth -->
            <var-decl name='max_depth' type-id='type-id-1' visibility='default' filepath='src/heap-checker.cc' line='406' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- SpinLock* HeapLeakChecker::lock_ -->
        <var-decl name='lock_' type-id='type-id-104' visibility='default' filepath='./src/gperftools/heap-checker.h' line='358' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- const char* HeapLeakChecker::name_ -->
        <var-decl name='name_' type-id='type-id-60' visibility='default' filepath='./src/gperftools/heap-checker.h' line='359' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- void* HeapLeakChecker::start_snapshot_ -->
        <var-decl name='start_snapshot_' type-id='type-id-56' visibility='default' filepath='./src/gperftools/heap-checker.h' line='365' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <!-- bool HeapLeakChecker::has_checked_ -->
        <var-decl name='has_checked_' type-id='type-id-59' visibility='default' filepath='./src/gperftools/heap-checker.h' line='367' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <!-- ssize_t HeapLeakChecker::inuse_bytes_increase_ -->
        <var-decl name='inuse_bytes_increase_' type-id='type-id-278' visibility='default' filepath='./src/gperftools/heap-checker.h' line='368' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <!-- ssize_t HeapLeakChecker::inuse_allocs_increase_ -->
        <var-decl name='inuse_allocs_increase_' type-id='type-id-278' visibility='default' filepath='./src/gperftools/heap-checker.h' line='369' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <!-- bool HeapLeakChecker::keep_profiles_ -->
        <var-decl name='keep_profiles_' type-id='type-id-59' visibility='default' filepath='./src/gperftools/heap-checker.h' line='371' column='1'/>
      </data-member>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::DisableChecksIn() -->
        <function-decl name='DisableChecksIn' mangled-name='_ZN15HeapLeakChecker15DisableChecksInEPKc' filepath='src/heap-checker.cc' line='1514' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker15DisableChecksInEPKc' hash='53885bde0aa65efe#2'>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-60'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::BeforeConstructorsLocked() -->
        <function-decl name='BeforeConstructorsLocked' mangled-name='_ZN15HeapLeakChecker24BeforeConstructorsLockedEv' filepath='src/heap-checker.cc' line='2203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker24BeforeConstructorsLockedEv' hash='7f32ffea222edbe7'>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- char* HeapLeakChecker::MakeProfileNameLocked() -->
        <function-decl name='MakeProfileNameLocked' mangled-name='_ZN15HeapLeakChecker21MakeProfileNameLockedEv' filepath='src/heap-checker.cc' line='1564' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker21MakeProfileNameLockedEv' hash='02a096d257a5e00d'>
          <!-- implicit parameter of type 'HeapLeakChecker*' -->
          <parameter type-id='type-id-279' is-artificial='yes'/>
          <!-- char* -->
          <return type-id='type-id-130'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::DisableChecksFromToLocked(void*, int) -->
        <function-decl name='DisableChecksFromToLocked' mangled-name='_ZN15HeapLeakChecker25DisableChecksFromToLockedEPKvS1_i' filepath='src/heap-checker.cc' line='2336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker25DisableChecksFromToLockedEPKvS1_i' hash='388da3fa973fde78'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::DisableLibraryAllocsLocked(uintptr_t, uintptr_t) -->
        <function-decl name='DisableLibraryAllocsLocked' mangled-name='_ZN15HeapLeakChecker26DisableLibraryAllocsLockedEPKcmm' filepath='src/heap-checker.cc' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker26DisableLibraryAllocsLockedEPKcmm' hash='528fd71af1a2ca2e'>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-60'/>
          <!-- parameter of type 'typedef uintptr_t' -->
          <parameter type-id='type-id-277'/>
          <!-- parameter of type 'typedef uintptr_t' -->
          <parameter type-id='type-id-277'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::TurnItselfOffLocked() -->
        <function-decl name='TurnItselfOffLocked' mangled-name='_ZN15HeapLeakChecker19TurnItselfOffLockedEv' filepath='src/heap-checker.cc' line='2229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker19TurnItselfOffLockedEv' hash='7f32ffea222edbe7'>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::IgnoreLiveObjectsLocked(const char*) -->
        <function-decl name='IgnoreLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker23IgnoreLiveObjectsLockedEPKcS1_' filepath='src/heap-checker.cc' line='1392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker23IgnoreLiveObjectsLockedEPKcS1_' hash='3d5693612af11c46'>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-60'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-60'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void* HeapLeakChecker::GetAllocCaller() -->
        <function-decl name='GetAllocCaller' mangled-name='_ZN15HeapLeakChecker14GetAllocCallerEPv' filepath='src/heap-checker.cc' line='2380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14GetAllocCallerEPv' hash='7f32ffea222edbe7'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- void* -->
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::CancelGlobalCheck() -->
        <function-decl name='CancelGlobalCheck' mangled-name='_ZN15HeapLeakChecker17CancelGlobalCheckEv' filepath='src/heap-checker.cc' line='2193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker17CancelGlobalCheckEv' hash='7f32ffea222edbe7'>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- HeapLeakChecker* HeapLeakChecker::GlobalChecker() -->
        <function-decl name='GlobalChecker' mangled-name='_ZN15HeapLeakChecker13GlobalCheckerEv' filepath='src/heap-checker.cc' line='2181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker13GlobalCheckerEv' hash='99664fa74c8b5886'>
          <!-- HeapLeakChecker* -->
          <return type-id='type-id-279'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool HeapLeakChecker::IsActive() -->
        <function-decl name='IsActive' mangled-name='_ZN15HeapLeakChecker8IsActiveEv' filepath='src/heap-checker.cc' line='1901' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8IsActiveEv' hash='c7c710e908194b91'>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- ssize_t HeapLeakChecker::ObjectsLeaked() -->
        <function-decl name='ObjectsLeaked' mangled-name='_ZNK15HeapLeakChecker13ObjectsLeakedEv' filepath='src/heap-checker.cc' line='1645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15HeapLeakChecker13ObjectsLeakedEv' hash='52c0efb08d2aa513'>
          <!-- implicit parameter of type 'const HeapLeakChecker*' -->
          <parameter type-id='type-id-280' is-artificial='yes'/>
          <!-- typedef ssize_t -->
          <return type-id='type-id-278'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- ssize_t HeapLeakChecker::BytesLeaked() -->
        <function-decl name='BytesLeaked' mangled-name='_ZNK15HeapLeakChecker11BytesLeakedEv' filepath='src/heap-checker.cc' line='1637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15HeapLeakChecker11BytesLeakedEv' hash='52c0efb08d2aa513'>
          <!-- implicit parameter of type 'const HeapLeakChecker*' -->
          <parameter type-id='type-id-280' is-artificial='yes'/>
          <!-- typedef ssize_t -->
          <return type-id='type-id-278'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::UnIgnoreObject() -->
        <function-decl name='UnIgnoreObject' mangled-name='_ZN15HeapLeakChecker14UnIgnoreObjectEPKv' filepath='src/heap-checker.cc' line='1539' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14UnIgnoreObjectEPKv' hash='7f32ffea222edbe7'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- HeapLeakChecker::~HeapLeakChecker() -->
        <function-decl name='~HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerD1Ev' filepath='src/heap-checker.cc' line='1875' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerD1Ev' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'HeapLeakChecker*' -->
          <parameter type-id='type-id-279' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::IgnoreNonThreadLiveObjectsLocked() -->
        <function-decl name='IgnoreNonThreadLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker32IgnoreNonThreadLiveObjectsLockedEv' filepath='src/heap-checker.cc' line='1093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker32IgnoreNonThreadLiveObjectsLockedEv' hash='7f32ffea222edbe7'>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::DoIgnoreObject() -->
        <function-decl name='DoIgnoreObject' mangled-name='_ZN15HeapLeakChecker14DoIgnoreObjectEPKv' filepath='src/heap-checker.cc' line='1519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14DoIgnoreObjectEPKv' hash='7f32ffea222edbe7'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void HeapLeakChecker::Create(const char*, bool) -->
        <function-decl name='Create' mangled-name='_ZN15HeapLeakChecker6CreateEPKcb' filepath='src/heap-checker.cc' line='1576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker6CreateEPKcb' hash='1d691fe62b812ee9'>
          <!-- implicit parameter of type 'HeapLeakChecker*' -->
          <parameter type-id='type-id-279' is-artificial='yes'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-60'/>
          <!-- parameter of type 'bool' -->
          <parameter type-id='type-id-59'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- HeapLeakChecker::HeapLeakChecker() -->
        <function-decl name='HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerC1Ev' filepath='src/heap-checker.cc' line='1621' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerC1Ev' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'HeapLeakChecker*' -->
          <parameter type-id='type-id-279' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- HeapLeakChecker::HeapLeakChecker(const char*) -->
        <function-decl name='HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerC1EPKc' filepath='src/heap-checker.cc' line='1616' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerC1EPKc' hash='53885bde0aa65efe'>
          <!-- implicit parameter of type 'HeapLeakChecker*' -->
          <parameter type-id='type-id-279' is-artificial='yes'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-60'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- HeapLeakChecker::ProcMapsResult HeapLeakChecker::UseProcMapsLocked() -->
        <function-decl name='UseProcMapsLocked' mangled-name='_ZN15HeapLeakChecker17UseProcMapsLockedENS_12ProcMapsTaskE' filepath='src/heap-checker.cc' line='892' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker17UseProcMapsLockedENS_12ProcMapsTaskE' hash='6c1520210560e52a'>
          <!-- parameter of type 'enum HeapLeakChecker::ProcMapsTask' -->
          <parameter type-id='type-id-273'/>
          <!-- enum HeapLeakChecker::ProcMapsResult -->
          <return type-id='type-id-272'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- int HeapLeakChecker::IgnoreLiveThreadsLocked(int, pid_t*, typedef __va_list_tag __va_list_tag*) -->
        <function-decl name='IgnoreLiveThreadsLocked' mangled-name='_ZN15HeapLeakChecker23IgnoreLiveThreadsLockedEPviPiP13__va_list_tag' filepath='src/heap-checker.cc' line='1021' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker23IgnoreLiveThreadsLockedEPviPiP13__va_list_tag' hash='60f7fa789d54ab1c'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'pid_t*' -->
          <parameter type-id='type-id-79'/>
          <!-- parameter of type 'typedef __va_list_tag __va_list_tag*' -->
          <parameter type-id='type-id-80'/>
          <!-- int -->
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapLeakChecker::IgnoreAllLiveObjectsLocked() -->
        <function-decl name='IgnoreAllLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker26IgnoreAllLiveObjectsLockedEPKv' filepath='src/heap-checker.cc' line='1261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker26IgnoreAllLiveObjectsLockedEPKv' hash='7f32ffea222edbe7'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- bool HeapLeakChecker::DoNoLeaks(HeapLeakChecker::ShouldSymbolize) -->
        <function-decl name='DoNoLeaks' mangled-name='_ZN15HeapLeakChecker9DoNoLeaksENS_15ShouldSymbolizeE' filepath='src/heap-checker.cc' line='1712' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9DoNoLeaksENS_15ShouldSymbolizeE' hash='201b9a45c4cc743f'>
          <!-- implicit parameter of type 'HeapLeakChecker*' -->
          <parameter type-id='type-id-279' is-artificial='yes'/>
          <!-- parameter of type 'enum HeapLeakChecker::ShouldSymbolize' -->
          <parameter type-id='type-id-274'/>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool HeapLeakChecker::NoGlobalLeaksMaybeSymbolize() -->
        <function-decl name='NoGlobalLeaksMaybeSymbolize' mangled-name='_ZN15HeapLeakChecker27NoGlobalLeaksMaybeSymbolizeENS_15ShouldSymbolizeE' filepath='src/heap-checker.cc' line='2141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker27NoGlobalLeaksMaybeSymbolizeENS_15ShouldSymbolizeE' hash='201b9a45c4cc743f#2'>
          <!-- parameter of type 'enum HeapLeakChecker::ShouldSymbolize' -->
          <parameter type-id='type-id-274'/>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool HeapLeakChecker::NoGlobalLeaks() -->
        <function-decl name='NoGlobalLeaks' mangled-name='_ZN15HeapLeakChecker13NoGlobalLeaksEv' filepath='src/heap-checker.cc' line='2187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker13NoGlobalLeaksEv' hash='c7c710e908194b91'>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool HeapLeakChecker::DoMainHeapCheck() -->
        <function-decl name='DoMainHeapCheck' mangled-name='_ZN15HeapLeakChecker15DoMainHeapCheckEv' filepath='src/heap-checker.cc' line='2153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker15DoMainHeapCheckEv' hash='c7c710e908194b91'>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class HeapProfileTable -->
    <class-decl name='HeapProfileTable' visibility='default' size-in-bits='832' filepath='src/heap-profile-table.h' line='51' column='1' hash='345094956414ce3a' id='type-id-281'>
      <member-type access='private'>
        <!-- struct HeapProfileTable::AddNonLiveArgs -->
        <class-decl name='AddNonLiveArgs' is-struct='yes' visibility='default' size-in-bits='128' filepath='src/heap-profile-table.h' line='305' column='1' hash='8e781208f7863759' id='type-id-282'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- HeapProfileTable::Snapshot* HeapProfileTable::AddNonLiveArgs::dest -->
            <var-decl name='dest' type-id='type-id-283' visibility='default' filepath='src/heap-profile-table.h' line='306' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- HeapProfileTable::Snapshot* HeapProfileTable::AddNonLiveArgs::base -->
            <var-decl name='base' type-id='type-id-283' visibility='default' filepath='src/heap-profile-table.h' line='307' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapProfileTable::AllocContextInfo -->
        <class-decl name='AllocContextInfo' is-struct='yes' visibility='default' size-in-bits='320' filepath='src/heap-profile-table.h' line='77' column='1' hash='bac876d81c2c4cc1' id='type-id-284'>
          <!-- struct HeapProfileStats -->
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-285'/>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- int HeapProfileTable::AllocContextInfo::stack_depth -->
            <var-decl name='stack_depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='78' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <!-- void* const* HeapProfileTable::AllocContextInfo::call_stack -->
            <var-decl name='call_stack' type-id='type-id-286' visibility='default' filepath='src/heap-profile-table.h' line='79' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapProfileTable::AllocInfo -->
        <class-decl name='AllocInfo' is-struct='yes' visibility='default' size-in-bits='192' filepath='src/heap-profile-table.h' line='66' column='1' hash='4cb0991ce88c3954' id='type-id-287'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- size_t HeapProfileTable::AllocInfo::object_size -->
            <var-decl name='object_size' type-id='type-id-61' visibility='default' filepath='src/heap-profile-table.h' line='67' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- void* const* HeapProfileTable::AllocInfo::call_stack -->
            <var-decl name='call_stack' type-id='type-id-286' visibility='default' filepath='src/heap-profile-table.h' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- int HeapProfileTable::AllocInfo::stack_depth -->
            <var-decl name='stack_depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='69' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='160'>
            <!-- bool HeapProfileTable::AllocInfo::live -->
            <var-decl name='live' type-id='type-id-59' visibility='default' filepath='src/heap-profile-table.h' line='70' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='168'>
            <!-- bool HeapProfileTable::AllocInfo::ignored -->
            <var-decl name='ignored' type-id='type-id-59' visibility='default' filepath='src/heap-profile-table.h' line='71' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapProfileTable::AllocValue -->
        <class-decl name='AllocValue' is-struct='yes' visibility='default' size-in-bits='128' filepath='src/heap-profile-table.h' line='190' column='1' hash='8293b8cc349a54a5' id='type-id-258'>
          <member-type access='private'>
            <!-- typedef HeapProfileBucket HeapProfileTable::AllocValue::Bucket -->
            <typedef-decl name='Bucket' type-id='type-id-289' size-in-bits='448' filepath='src/heap-profile-table.h' line='187' column='1' id='type-id-288'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- size_t HeapProfileTable::AllocValue::bytes -->
            <var-decl name='bytes' type-id='type-id-61' visibility='default' filepath='src/heap-profile-table.h' line='197' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <!-- uintptr_t HeapProfileTable::AllocValue::bucket_rep -->
            <var-decl name='bucket_rep' type-id='type-id-277' visibility='default' filepath='src/heap-profile-table.h' line='218' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapProfileTable::BufferArgs -->
        <class-decl name='BufferArgs' is-struct='yes' visibility='default' size-in-bits='128' filepath='src/heap-profile-table.h' line='227' column='1' hash='091015b07ff18e1f' id='type-id-290'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- char* HeapProfileTable::BufferArgs::buf -->
            <var-decl name='buf' type-id='type-id-130' visibility='default' filepath='src/heap-profile-table.h' line='234' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- int HeapProfileTable::BufferArgs::buflen -->
            <var-decl name='buflen' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='235' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <!-- int HeapProfileTable::BufferArgs::bufsize -->
            <var-decl name='bufsize' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='236' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapProfileTable::DumpArgs -->
        <class-decl name='DumpArgs' is-struct='yes' visibility='default' size-in-bits='128' filepath='src/heap-profile-table.h' line='242' column='1' hash='56f87ce773364004' id='type-id-291'>
          <member-type access='public'>
            <!-- typedef HeapProfileStats HeapProfileTable::DumpArgs::Stats -->
            <typedef-decl name='Stats' type-id='type-id-285' size-in-bits='192' filepath='src/heap-profile-table.h' line='63' column='1' id='type-id-292'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- RawFD HeapProfileTable::DumpArgs::fd -->
            <var-decl name='fd' type-id='type-id-83' visibility='default' filepath='src/heap-profile-table.h' line='248' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- HeapProfileTable::DumpArgs::Stats* HeapProfileTable::DumpArgs::profile_stats -->
            <var-decl name='profile_stats' type-id='type-id-293' visibility='default' filepath='src/heap-profile-table.h' line='249' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct HeapProfileTable::Snapshot -->
        <class-decl name='Snapshot' is-struct='yes' visibility='default' size-in-bits='768' filepath='src/heap-profile-table.h' line='347' column='1' hash='b9c3c49a890454d3' id='type-id-294'>
          <member-type access='private'>
            <!-- struct HeapProfileTable::Snapshot::Entry -->
            <class-decl name='Entry' is-struct='yes' visibility='default' size-in-bits='128' filepath='src/heap-profile-table.cc' line='514' column='1' hash='a965c1627ce0ce09' id='type-id-295'>
              <data-member access='public' layout-offset-in-bits='0'>
                <!-- int HeapProfileTable::Snapshot::Entry::count -->
                <var-decl name='count' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.cc' line='515' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='32'>
                <!-- int HeapProfileTable::Snapshot::Entry::bytes -->
                <var-decl name='bytes' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.cc' line='516' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='64'>
                <!-- HeapProfileTable::AllocValue::Bucket* HeapProfileTable::Snapshot::Entry::bucket -->
                <var-decl name='bucket' type-id='type-id-296' visibility='default' filepath='src/heap-profile-table.cc' line='517' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <!-- struct HeapProfileTable::Snapshot::ReportState -->
            <class-decl name='ReportState' is-struct='yes' visibility='default' size-in-bits='384' filepath='src/heap-profile-table.cc' line='528' column='1' hash='59f79b350a60fcce' id='type-id-297'>
              <data-member access='public' layout-offset-in-bits='0'>
                <!-- std::map<HeapProfileTable::Bucket*, HeapProfileTable::Snapshot::Entry, std::less<HeapProfileTable::Bucket*>, std::allocator<std::pair<HeapProfileTable::Bucket* const, HeapProfileTable::Snapshot::Entry> > > HeapProfileTable::Snapshot::ReportState::buckets_ -->
                <var-decl name='buckets_' type-id='type-id-298' visibility='default' filepath='src/heap-profile-table.cc' line='529' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <!-- HeapProfileTable::AllocValue::Bucket HeapProfileTable::Snapshot::total_ -->
            <var-decl name='total_' type-id='type-id-288' visibility='default' filepath='src/heap-profile-table.h' line='372' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='448'>
            <!-- HeapProfileTable::AllocationMap HeapProfileTable::Snapshot::map_ -->
            <var-decl name='map_' type-id='type-id-299' visibility='default' filepath='src/heap-profile-table.h' line='376' column='1'/>
          </data-member>
          <member-function access='private' static='yes'>
            <!-- void HeapProfileTable::Snapshot::ReportObject(HeapProfileTable::AllocValue*, char*) -->
            <function-decl name='ReportObject' mangled-name='_ZN16HeapProfileTable8Snapshot12ReportObjectEPKvPNS_10AllocValueEPc' filepath='src/heap-profile-table.cc' line='614' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot12ReportObjectEPKvPNS_10AllocValueEPc' hash='c3d5e8d93c14b581'>
              <!-- parameter of type 'void*' -->
              <parameter type-id='type-id-56'/>
              <!-- parameter of type 'HeapProfileTable::AllocValue*' -->
              <parameter type-id='type-id-300'/>
              <!-- parameter of type 'char*' -->
              <parameter type-id='type-id-130'/>
              <!-- void -->
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <!-- void HeapProfileTable::Snapshot::ReportIndividualObjects() -->
            <function-decl name='ReportIndividualObjects' mangled-name='_ZN16HeapProfileTable8Snapshot23ReportIndividualObjectsEv' filepath='src/heap-profile-table.cc' line='622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot23ReportIndividualObjectsEv' hash='7f32ffea222edbe7'>
              <!-- implicit parameter of type 'HeapProfileTable::Snapshot*' -->
              <parameter type-id='type-id-283' is-artificial='yes'/>
              <!-- void -->
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <!-- void HeapProfileTable::Snapshot::ReportCallback(HeapProfileTable::AllocValue*, HeapProfileTable::Snapshot::ReportState*) -->
            <function-decl name='ReportCallback' mangled-name='_ZN16HeapProfileTable8Snapshot14ReportCallbackEPKvPNS_10AllocValueEPNS0_11ReportStateE' filepath='src/heap-profile-table.cc' line='533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot14ReportCallbackEPKvPNS_10AllocValueEPNS0_11ReportStateE' hash='d794cebc31bd91f7'>
              <!-- parameter of type 'void*' -->
              <parameter type-id='type-id-56'/>
              <!-- parameter of type 'HeapProfileTable::AllocValue*' -->
              <parameter type-id='type-id-300'/>
              <!-- parameter of type 'HeapProfileTable::Snapshot::ReportState*' -->
              <parameter type-id='type-id-301'/>
              <!-- void -->
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <!-- void HeapProfileTable::Snapshot::ReportLeaks(const char*, const char*, bool) -->
            <function-decl name='ReportLeaks' mangled-name='_ZN16HeapProfileTable8Snapshot11ReportLeaksEPKcS2_b' filepath='src/heap-profile-table.cc' line='542' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot11ReportLeaksEPKcS2_b' hash='fc23a79e09513cdb'>
              <!-- implicit parameter of type 'HeapProfileTable::Snapshot*' -->
              <parameter type-id='type-id-283' is-artificial='yes'/>
              <!-- parameter of type 'const char*' -->
              <parameter type-id='type-id-60'/>
              <!-- parameter of type 'const char*' -->
              <parameter type-id='type-id-60'/>
              <!-- parameter of type 'bool' -->
              <parameter type-id='type-id-59'/>
              <!-- void -->
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- typedef void (*)(const HeapProfileTable::AllocContextInfo&) HeapProfileTable::AllocContextIterator -->
        <typedef-decl name='AllocContextIterator' type-id='type-id-303' size-in-bits='64' filepath='src/heap-profile-table.h' line='147' column='1' hash='fd7a63c0c6c822c4' id='type-id-302'/>
      </member-type>
      <member-type access='private'>
        <!-- typedef void (*)(void*, const HeapProfileTable::AllocInfo&) HeapProfileTable::AllocIterator -->
        <typedef-decl name='AllocIterator' type-id='type-id-305' size-in-bits='64' filepath='src/heap-profile-table.h' line='138' column='1' hash='fd7a63c0c6c822c4' id='type-id-304'/>
      </member-type>
      <member-type access='private'>
        <!-- typedef AddressMap<HeapProfileTable::AllocValue> HeapProfileTable::AllocationMap -->
        <typedef-decl name='AllocationMap' type-id='type-id-248' size-in-bits='320' filepath='src/heap-profile-table.h' line='224' column='1' id='type-id-299'/>
      </member-type>
      <member-type access='private'>
        <!-- typedef void* (*)(size_t) HeapProfileTable::Allocator -->
        <typedef-decl name='Allocator' type-id='type-id-307' size-in-bits='64' filepath='src/heap-profile-table.h' line='83' column='1' hash='fd7a63c0c6c822c4' id='type-id-306'/>
      </member-type>
      <member-type access='private'>
        <!-- typedef void (*)(void*) HeapProfileTable::DeAllocator -->
        <typedef-decl name='DeAllocator' type-id='type-id-255' size-in-bits='64' filepath='src/heap-profile-table.h' line='84' column='1' hash='fd7a63c0c6c822c4' id='type-id-308'/>
      </member-type>
      <data-member access='public' static='yes'>
        <!-- static char HeapProfileTable::kFileExt[] -->
        <var-decl name='kFileExt' type-id='type-id-309' mangled-name='_ZN16HeapProfileTable8kFileExtE' visibility='default' filepath='src/heap-profile-table.cc' line='99' column='1' elf-symbol-id='_ZN16HeapProfileTable8kFileExtE'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static const int HeapProfileTable::kMaxStackDepth -->
        <var-decl name='kMaxStackDepth' type-id='type-id-159' mangled-name='_ZN16HeapProfileTable14kMaxStackDepthE' visibility='default' filepath='src/heap-profile-table.h' line='58' column='1' elf-symbol-id='_ZN16HeapProfileTable14kMaxStackDepthE'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- HeapProfileTable::Allocator HeapProfileTable::alloc_ -->
        <var-decl name='alloc_' type-id='type-id-306' visibility='default' filepath='src/heap-profile-table.h' line='325' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- HeapProfileTable::DeAllocator HeapProfileTable::dealloc_ -->
        <var-decl name='dealloc_' type-id='type-id-308' visibility='default' filepath='src/heap-profile-table.h' line='326' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- HeapProfileTable::AllocValue::Bucket HeapProfileTable::total_ -->
        <var-decl name='total_' type-id='type-id-288' visibility='default' filepath='src/heap-profile-table.h' line='330' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <!-- bool HeapProfileTable::profile_mmap_ -->
        <var-decl name='profile_mmap_' type-id='type-id-59' visibility='default' filepath='src/heap-profile-table.h' line='332' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <!-- HeapProfileTable::AllocValue::Bucket** HeapProfileTable::bucket_table_ -->
        <var-decl name='bucket_table_' type-id='type-id-310' visibility='default' filepath='src/heap-profile-table.h' line='338' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <!-- int HeapProfileTable::num_buckets_ -->
        <var-decl name='num_buckets_' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='339' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <!-- HeapProfileTable::AllocationMap* HeapProfileTable::address_map_ -->
        <var-decl name='address_map_' type-id='type-id-311' visibility='default' filepath='src/heap-profile-table.h' line='342' column='1'/>
      </data-member>
      <member-function access='private' static='yes'>
        <!-- void HeapProfileTable::MapArgsAllocIterator(HeapProfileTable::AllocValue*, HeapProfileTable::AllocIterator) -->
        <function-decl name='MapArgsAllocIterator' mangled-name='_ZN16HeapProfileTable20MapArgsAllocIteratorEPKvPNS_10AllocValueEPFvS1_RKNS_9AllocInfoEE' filepath='src/heap-profile-table.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable20MapArgsAllocIteratorEPKvPNS_10AllocValueEPFvS1_RKNS_9AllocInfoEE' hash='79e377909b3eb7d7'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- parameter of type 'HeapProfileTable::AllocValue*' -->
          <parameter type-id='type-id-300'/>
          <!-- parameter of type 'typedef HeapProfileTable::AllocIterator' -->
          <parameter type-id='type-id-304'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- size_t HeapProfileTable::AllocValueSize() -->
        <function-decl name='AllocValueSize' mangled-name='_ZN16HeapProfileTable14AllocValueSizeERKNS_10AllocValueE' filepath='src/heap-profile-table.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable14AllocValueSizeERKNS_10AllocValueE' hash='eea6ded2882eee29'>
          <!-- parameter of type 'const HeapProfileTable::AllocValue&' -->
          <parameter type-id='type-id-312'/>
          <!-- typedef size_t -->
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <!-- HeapProfileTable::~HeapProfileTable() -->
        <function-decl name='~HeapProfileTable' mangled-name='_ZN16HeapProfileTableD1Ev' filepath='src/heap-profile-table.cc' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTableD1Ev' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'HeapProfileTable*' -->
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void HeapProfileTable::ReleaseSnapshot(HeapProfileTable::Snapshot*) -->
        <function-decl name='ReleaseSnapshot' mangled-name='_ZN16HeapProfileTable15ReleaseSnapshotEPNS_8SnapshotE' filepath='src/heap-profile-table.cc' line='485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable15ReleaseSnapshotEPNS_8SnapshotE' hash='d055d1fa605b6d5c'>
          <!-- implicit parameter of type 'HeapProfileTable*' -->
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <!-- parameter of type 'HeapProfileTable::Snapshot*' -->
          <parameter type-id='type-id-283'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <!-- HeapProfileTable::HeapProfileTable(HeapProfileTable::Allocator, HeapProfileTable::DeAllocator, bool) -->
        <function-decl name='HeapProfileTable' mangled-name='_ZN16HeapProfileTableC2EPFPvmEPFvS0_Eb' filepath='src/heap-profile-table.cc' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTableC2EPFPvmEPFvS0_Eb' hash='86e303dd42a54213'>
          <!-- implicit parameter of type 'HeapProfileTable*' -->
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <!-- parameter of type 'typedef HeapProfileTable::Allocator' -->
          <parameter type-id='type-id-306'/>
          <!-- parameter of type 'typedef HeapProfileTable::DeAllocator' -->
          <parameter type-id='type-id-308'/>
          <!-- parameter of type 'bool' -->
          <parameter type-id='type-id-59'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- int HeapProfileTable::UnparseBucket(char*, int, int, const char*, HeapProfileTable::DumpArgs::Stats*) -->
        <function-decl name='UnparseBucket' mangled-name='_ZN16HeapProfileTable13UnparseBucketERK17HeapProfileBucketPciiPKcP16HeapProfileStats' filepath='src/heap-profile-table.cc' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13UnparseBucketERK17HeapProfileBucketPciiPKcP16HeapProfileStats' hash='446a63ade4236164'>
          <!-- parameter of type 'const HeapProfileTable::AllocValue::Bucket&' -->
          <parameter type-id='type-id-314'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-130'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-60'/>
          <!-- parameter of type 'HeapProfileTable::DumpArgs::Stats*' -->
          <parameter type-id='type-id-293'/>
          <!-- int -->
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapProfileTable::DumpNonLiveIterator(HeapProfileTable::AllocValue*, const HeapProfileTable::DumpArgs&) -->
        <function-decl name='DumpNonLiveIterator' mangled-name='_ZN16HeapProfileTable19DumpNonLiveIteratorEPKvPNS_10AllocValueERKNS_8DumpArgsE' filepath='src/heap-profile-table.cc' line='397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable19DumpNonLiveIteratorEPKvPNS_10AllocValueERKNS_8DumpArgsE' hash='54cc623966dbb6a1'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- parameter of type 'HeapProfileTable::AllocValue*' -->
          <parameter type-id='type-id-300'/>
          <!-- parameter of type 'const HeapProfileTable::DumpArgs&' -->
          <parameter type-id='type-id-315'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapProfileTable::DumpBucketIterator(HeapProfileTable::BufferArgs*) -->
        <function-decl name='DumpBucketIterator' mangled-name='_ZN16HeapProfileTable18DumpBucketIteratorEPK17HeapProfileBucketPNS_10BufferArgsE' filepath='src/heap-profile-table.cc' line='390' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable18DumpBucketIteratorEPK17HeapProfileBucketPNS_10BufferArgsE' hash='696e4681e6be6694'>
          <!-- parameter of type 'const HeapProfileTable::AllocValue::Bucket*' -->
          <parameter type-id='type-id-316'/>
          <!-- parameter of type 'HeapProfileTable::BufferArgs*' -->
          <parameter type-id='type-id-317'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- HeapProfileTable::AllocValue::Bucket* HeapProfileTable::GetBucket(int, void* const*) -->
        <function-decl name='GetBucket' mangled-name='_ZN16HeapProfileTable9GetBucketEiPKPKv' filepath='src/heap-profile-table.cc' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable9GetBucketEiPKPKv' hash='b6d0e8f32e037e2b'>
          <!-- implicit parameter of type 'HeapProfileTable*' -->
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'void* const*' -->
          <parameter type-id='type-id-286'/>
          <!-- HeapProfileTable::AllocValue::Bucket* -->
          <return type-id='type-id-296'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- int HeapProfileTable::GetCallerStackTrace(void**) -->
        <function-decl name='GetCallerStackTrace' mangled-name='_ZN16HeapProfileTable19GetCallerStackTraceEiPPv' filepath='src/heap-profile-table.cc' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable19GetCallerStackTraceEiPPv' hash='50a6880b60aff73f'>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'void**' -->
          <parameter type-id='type-id-184'/>
          <!-- int -->
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- HeapProfileTable::AllocValue::Bucket** HeapProfileTable::MakeSortedBucketList() -->
        <function-decl name='MakeSortedBucketList' mangled-name='_ZNK16HeapProfileTable20MakeSortedBucketListEv' filepath='src/heap-profile-table.cc' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable20MakeSortedBucketListEv' hash='60ed56c89de5e837'>
          <!-- implicit parameter of type 'const HeapProfileTable*' -->
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <!-- HeapProfileTable::AllocValue::Bucket** -->
          <return type-id='type-id-310'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void HeapProfileTable::IterateOrderedAllocContexts(HeapProfileTable::AllocContextIterator) -->
        <function-decl name='IterateOrderedAllocContexts' mangled-name='_ZNK16HeapProfileTable27IterateOrderedAllocContextsEPFvRKNS_16AllocContextInfoEE' filepath='src/heap-profile-table.cc' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable27IterateOrderedAllocContextsEPFvRKNS_16AllocContextInfoEE' hash='5695f5ce05a4c55f'>
          <!-- implicit parameter of type 'const HeapProfileTable*' -->
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <!-- parameter of type 'typedef HeapProfileTable::AllocContextIterator' -->
          <parameter type-id='type-id-302'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- int HeapProfileTable::FillOrderedProfile(char*, int) -->
        <function-decl name='FillOrderedProfile' mangled-name='_ZNK16HeapProfileTable18FillOrderedProfileEPci' filepath='src/heap-profile-table.cc' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable18FillOrderedProfileEPci' hash='8487c9d489875495'>
          <!-- implicit parameter of type 'const HeapProfileTable*' -->
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <!-- parameter of type 'char*' -->
          <parameter type-id='type-id-130'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- int -->
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void HeapProfileTable::MarkAsIgnored(void*) -->
        <function-decl name='MarkAsIgnored' mangled-name='_ZN16HeapProfileTable13MarkAsIgnoredEPKv' filepath='src/heap-profile-table.cc' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13MarkAsIgnoredEPKv' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'HeapProfileTable*' -->
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool HeapProfileTable::WriteProfile(const HeapProfileTable::AllocValue::Bucket&, HeapProfileTable::AllocationMap*) -->
        <function-decl name='WriteProfile' mangled-name='_ZN16HeapProfileTable12WriteProfileEPKcRK17HeapProfileBucketP10AddressMapINS_10AllocValueEE' filepath='src/heap-profile-table.cc' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12WriteProfileEPKcRK17HeapProfileBucketP10AddressMapINS_10AllocValueEE' hash='d0ea9d1532049c25'>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-60'/>
          <!-- parameter of type 'const HeapProfileTable::AllocValue::Bucket&' -->
          <parameter type-id='type-id-314'/>
          <!-- parameter of type 'HeapProfileTable::AllocationMap*' -->
          <parameter type-id='type-id-311'/>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- bool HeapProfileTable::FindInsideAlloc(void*, size_t, void**, size_t*) -->
        <function-decl name='FindInsideAlloc' mangled-name='_ZNK16HeapProfileTable15FindInsideAllocEPKvmPS1_Pm' filepath='src/heap-profile-table.cc' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable15FindInsideAllocEPKvmPS1_Pm' hash='0f316b00ac7ee281'>
          <!-- implicit parameter of type 'const HeapProfileTable*' -->
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-61'/>
          <!-- parameter of type 'void**' -->
          <parameter type-id='type-id-184'/>
          <!-- parameter of type 'size_t*' -->
          <parameter type-id='type-id-319'/>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapProfileTable::AddToSnapshot(HeapProfileTable::AllocValue*, HeapProfileTable::Snapshot*) -->
        <function-decl name='AddToSnapshot' mangled-name='_ZN16HeapProfileTable13AddToSnapshotEPKvPNS_10AllocValueEPNS_8SnapshotE' filepath='src/heap-profile-table.cc' line='491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13AddToSnapshotEPKvPNS_10AllocValueEPNS_8SnapshotE' hash='e4fe7bb089a91809'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- parameter of type 'HeapProfileTable::AllocValue*' -->
          <parameter type-id='type-id-300'/>
          <!-- parameter of type 'HeapProfileTable::Snapshot*' -->
          <parameter type-id='type-id-283'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- HeapProfileTable::Snapshot* HeapProfileTable::TakeSnapshot() -->
        <function-decl name='TakeSnapshot' mangled-name='_ZN16HeapProfileTable12TakeSnapshotEv' filepath='src/heap-profile-table.cc' line='479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12TakeSnapshotEv' hash='d055d1fa605b6d5c'>
          <!-- implicit parameter of type 'HeapProfileTable*' -->
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <!-- HeapProfileTable::Snapshot* -->
          <return type-id='type-id-283'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void HeapProfileTable::RecordAlloc(void*, size_t, int, void* const*) -->
        <function-decl name='RecordAlloc' mangled-name='_ZN16HeapProfileTable11RecordAllocEPKvmiPKS1_' filepath='src/heap-profile-table.cc' line='210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable11RecordAllocEPKvmiPKS1_' hash='4d3907c2c1e842ae'>
          <!-- implicit parameter of type 'HeapProfileTable*' -->
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-61'/>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'void* const*' -->
          <parameter type-id='type-id-286'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- void HeapProfileTable::RecordFree(void*) -->
        <function-decl name='RecordFree' mangled-name='_ZN16HeapProfileTable10RecordFreeEPKv' filepath='src/heap-profile-table.cc' line='225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable10RecordFreeEPKv' hash='7f32ffea222edbe7'>
          <!-- implicit parameter of type 'HeapProfileTable*' -->
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapProfileTable::AddIfNonLive(HeapProfileTable::AllocValue*, HeapProfileTable::AddNonLiveArgs*) -->
        <function-decl name='AddIfNonLive' mangled-name='_ZN16HeapProfileTable12AddIfNonLiveEPKvPNS_10AllocValueEPNS_14AddNonLiveArgsE' filepath='src/heap-profile-table.cc' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12AddIfNonLiveEPKvPNS_10AllocValueEPNS_14AddNonLiveArgsE' hash='f36b47d22ae82aa9'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- parameter of type 'HeapProfileTable::AllocValue*' -->
          <parameter type-id='type-id-300'/>
          <!-- parameter of type 'HeapProfileTable::AddNonLiveArgs*' -->
          <parameter type-id='type-id-320'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- HeapProfileTable::Snapshot* HeapProfileTable::NonLiveSnapshot(HeapProfileTable::Snapshot*) -->
        <function-decl name='NonLiveSnapshot' mangled-name='_ZN16HeapProfileTable15NonLiveSnapshotEPNS_8SnapshotE' filepath='src/heap-profile-table.cc' line='496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable15NonLiveSnapshotEPNS_8SnapshotE' hash='d7cf3f266b91be01'>
          <!-- implicit parameter of type 'HeapProfileTable*' -->
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <!-- parameter of type 'HeapProfileTable::Snapshot*' -->
          <parameter type-id='type-id-283'/>
          <!-- HeapProfileTable::Snapshot* -->
          <return type-id='type-id-283'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- bool HeapProfileTable::MarkAsLive(void*) -->
        <function-decl name='MarkAsLive' mangled-name='_ZN16HeapProfileTable10MarkAsLiveEPKv' filepath='src/heap-profile-table.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable10MarkAsLiveEPKv' hash='c7c710e908194b91'>
          <!-- implicit parameter of type 'HeapProfileTable*' -->
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void HeapProfileTable::CleanupOldProfiles() -->
        <function-decl name='CleanupOldProfiles' mangled-name='_ZN16HeapProfileTable18CleanupOldProfilesEPKc' filepath='src/heap-profile-table.cc' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable18CleanupOldProfilesEPKc' hash='53885bde0aa65efe'>
          <!-- parameter of type 'const char*' -->
          <parameter type-id='type-id-60'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- bool HeapProfileTable::FindAllocDetails(void*, HeapProfileTable::AllocInfo*) -->
        <function-decl name='FindAllocDetails' mangled-name='_ZNK16HeapProfileTable16FindAllocDetailsEPKvPNS_9AllocInfoE' filepath='src/heap-profile-table.cc' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable16FindAllocDetailsEPKvPNS_9AllocInfoE' hash='74fcff412c436e0b'>
          <!-- implicit parameter of type 'const HeapProfileTable*' -->
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- parameter of type 'HeapProfileTable::AllocInfo*' -->
          <parameter type-id='type-id-321'/>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <!-- bool HeapProfileTable::FindAlloc(void*, size_t*) -->
        <function-decl name='FindAlloc' mangled-name='_ZNK16HeapProfileTable9FindAllocEPKvPm' filepath='src/heap-profile-table.cc' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable9FindAllocEPKvPm' hash='a64ac8f4f7534435'>
          <!-- implicit parameter of type 'const HeapProfileTable*' -->
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- parameter of type 'size_t*' -->
          <parameter type-id='type-id-319'/>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class LowLevelAlloc -->
    <class-decl name='LowLevelAlloc' visibility='default' size-in-bits='8' filepath='src/base/low_level_alloc.h' line='44' column='1' hash='c55f19eb4cd0776f' id='type-id-322'>
      <member-type access='private'>
        <!-- struct LowLevelAlloc::Arena -->
        <class-decl name='Arena' is-struct='yes' visibility='default' size-in-bits='2560' filepath='src/base/low_level_alloc.cc' line='184' column='1' hash='f6ff43c8ab87ab07' id='type-id-323'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- SpinLock LowLevelAlloc::Arena::mu -->
            <var-decl name='mu' type-id='type-id-102' visibility='default' filepath='src/base/low_level_alloc.cc' line='189' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- low_level_alloc_internal::AllocList LowLevelAlloc::Arena::freelist -->
            <var-decl name='freelist' type-id='type-id-89' visibility='default' filepath='src/base/low_level_alloc.cc' line='191' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2304'>
            <!-- int32 LowLevelAlloc::Arena::allocation_count -->
            <var-decl name='allocation_count' type-id='type-id-81' visibility='default' filepath='src/base/low_level_alloc.cc' line='192' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2336'>
            <!-- int32 LowLevelAlloc::Arena::flags -->
            <var-decl name='flags' type-id='type-id-81' visibility='default' filepath='src/base/low_level_alloc.cc' line='193' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2368'>
            <!-- size_t LowLevelAlloc::Arena::pagesize -->
            <var-decl name='pagesize' type-id='type-id-61' visibility='default' filepath='src/base/low_level_alloc.cc' line='194' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2432'>
            <!-- size_t LowLevelAlloc::Arena::roundup -->
            <var-decl name='roundup' type-id='type-id-61' visibility='default' filepath='src/base/low_level_alloc.cc' line='195' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2496'>
            <!-- size_t LowLevelAlloc::Arena::min_size -->
            <var-decl name='min_size' type-id='type-id-61' visibility='default' filepath='src/base/low_level_alloc.cc' line='197' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-function access='private' static='yes'>
        <!-- LowLevelAlloc::Arena* LowLevelAlloc::DefaultArena() -->
        <function-decl name='DefaultArena' mangled-name='_ZN13LowLevelAlloc12DefaultArenaEv' filepath='src/base/low_level_alloc.cc' line='521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc12DefaultArenaEv' hash='b79eb19d4c2d908e'>
          <!-- LowLevelAlloc::Arena* -->
          <return type-id='type-id-87'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void* LowLevelAlloc::AllocWithArena(LowLevelAlloc::Arena*) -->
        <function-decl name='AllocWithArena' mangled-name='_ZN13LowLevelAlloc14AllocWithArenaEmPNS_5ArenaE' filepath='src/base/low_level_alloc.cc' line='510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc14AllocWithArenaEmPNS_5ArenaE' hash='ee12f578c4792ed6'>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-61'/>
          <!-- parameter of type 'LowLevelAlloc::Arena*' -->
          <parameter type-id='type-id-87'/>
          <!-- void* -->
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- LowLevelAlloc::Arena* LowLevelAlloc::NewArena(LowLevelAlloc::Arena*) -->
        <function-decl name='NewArena' mangled-name='_ZN13LowLevelAlloc8NewArenaEiPNS_5ArenaE' filepath='src/base/low_level_alloc.cc' line='296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc8NewArenaEiPNS_5ArenaE' hash='d71230e10294e65d'>
          <!-- parameter of type 'typedef int32' -->
          <parameter type-id='type-id-81'/>
          <!-- parameter of type 'LowLevelAlloc::Arena*' -->
          <parameter type-id='type-id-87'/>
          <!-- LowLevelAlloc::Arena* -->
          <return type-id='type-id-87'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void* LowLevelAlloc::Alloc() -->
        <function-decl name='Alloc' mangled-name='_ZN13LowLevelAlloc5AllocEm' filepath='src/base/low_level_alloc.cc' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc5AllocEm' hash='e0055d99adb0e173'>
          <!-- parameter of type 'typedef size_t' -->
          <parameter type-id='type-id-61'/>
          <!-- void* -->
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void LowLevelAlloc::Free() -->
        <function-decl name='Free' mangled-name='_ZN13LowLevelAlloc4FreeEPv' filepath='src/base/low_level_alloc.cc' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc4FreeEPv' hash='7f32ffea222edbe7'>
          <!-- parameter of type 'void*' -->
          <parameter type-id='type-id-56'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool LowLevelAlloc::DeleteArena() -->
        <function-decl name='DeleteArena' mangled-name='_ZN13LowLevelAlloc11DeleteArenaEPNS_5ArenaE' filepath='src/base/low_level_alloc.cc' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc11DeleteArenaEPNS_5ArenaE' hash='afc65823b0d92ac9'>
          <!-- parameter of type 'LowLevelAlloc::Arena*' -->
          <parameter type-id='type-id-87'/>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
    </class-decl>
    <!-- class MemoryRegionMap -->
    <class-decl name='MemoryRegionMap' visibility='default' size-in-bits='8' filepath='src/memory_region_map.h' line='69' column='1' hash='a7b84d65e51c3c1a' id='type-id-324'>
      <member-type access='private'>
        <!-- class MemoryRegionMap::LockHolder -->
        <class-decl name='LockHolder' visibility='default' size-in-bits='8' filepath='src/memory_region_map.h' line='126' column='1' hash='45fb04c1bd8375c4' id='type-id-325'/>
      </member-type>
      <member-type access='private'>
        <!-- struct MemoryRegionMap::MyAllocator -->
        <class-decl name='MyAllocator' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/memory_region_map.h' line='252' column='1' hash='d9ccece561bd6edb' id='type-id-326'/>
      </member-type>
      <member-type access='private'>
        <!-- struct MemoryRegionMap::Region -->
        <class-decl name='Region' is-struct='yes' visibility='default' size-in-bits='2304' filepath='src/memory_region_map.h' line='137' column='1' hash='6f3aa3a5da33f0d6' id='type-id-327'>
          <data-member access='public' layout-offset-in-bits='0'>
            <!-- uintptr_t MemoryRegionMap::Region::start_addr -->
            <var-decl name='start_addr' type-id='type-id-277' visibility='default' filepath='src/memory_region_map.h' line='138' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <!-- uintptr_t MemoryRegionMap::Region::end_addr -->
            <var-decl name='end_addr' type-id='type-id-277' visibility='default' filepath='src/memory_region_map.h' line='139' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <!-- int MemoryRegionMap::Region::call_stack_depth -->
            <var-decl name='call_stack_depth' type-id='type-id-1' visibility='default' filepath='src/memory_region_map.h' line='140' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <!-- void* MemoryRegionMap::Region::call_stack[32] -->
            <var-decl name='call_stack' type-id='type-id-328' visibility='default' filepath='src/memory_region_map.h' line='141' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2240'>
            <!-- bool MemoryRegionMap::Region::is_stack -->
            <var-decl name='is_stack' type-id='type-id-59' visibility='default' filepath='src/memory_region_map.h' line='143' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <!-- struct MemoryRegionMap::RegionCmp -->
        <class-decl name='RegionCmp' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/memory_region_map.h' line='245' column='1' hash='b84997bda69f730a' id='type-id-329'/>
      </member-type>
      <member-type access='private'>
        <!-- typedef std::_Rb_tree_const_iterator<MemoryRegionMap::Region> MemoryRegionMap::RegionIterator -->
        <typedef-decl name='RegionIterator' type-id='type-id-331' size-in-bits='64' filepath='src/memory_region_map.h' line='268' column='1' id='type-id-330'/>
      </member-type>
      <member-type access='private'>
        <!-- typedef std::set<MemoryRegionMap::Region, MemoryRegionMap::RegionCmp, STL_Allocator<MemoryRegionMap::Region, MemoryRegionMap::MyAllocator> > MemoryRegionMap::RegionSet -->
        <typedef-decl name='RegionSet' type-id='type-id-333' size-in-bits='384' filepath='src/memory_region_map.h' line='263' column='1' id='type-id-332'/>
      </member-type>
      <member-type access='private'>
        <!-- union MemoryRegionMap::RegionSetRep -->
        <union-decl name='RegionSetRep' visibility='default' is-declaration-only='yes' id='type-id-334'/>
      </member-type>
      <data-member access='public' static='yes'>
        <!-- static int MemoryRegionMap::client_count_ -->
        <var-decl name='client_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap13client_count_E' visibility='default' filepath='src/memory_region_map.cc' line='141' column='1' elf-symbol-id='_ZN15MemoryRegionMap13client_count_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static int MemoryRegionMap::max_stack_depth_ -->
        <var-decl name='max_stack_depth_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap16max_stack_depth_E' visibility='default' filepath='src/memory_region_map.cc' line='142' column='1' elf-symbol-id='_ZN15MemoryRegionMap16max_stack_depth_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static LowLevelAlloc::Arena* MemoryRegionMap::arena_ -->
        <var-decl name='arena_' type-id='type-id-87' mangled-name='_ZN15MemoryRegionMap6arena_E' visibility='default' filepath='src/memory_region_map.cc' line='144' column='1' elf-symbol-id='_ZN15MemoryRegionMap6arena_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static MemoryRegionMap::RegionSet* MemoryRegionMap::regions_ -->
        <var-decl name='regions_' type-id='type-id-335' mangled-name='_ZN15MemoryRegionMap8regions_E' visibility='default' filepath='src/memory_region_map.cc' line='143' column='1' elf-symbol-id='_ZN15MemoryRegionMap8regions_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static SpinLock MemoryRegionMap::lock_ -->
        <var-decl name='lock_' type-id='type-id-102' mangled-name='_ZN15MemoryRegionMap5lock_E' visibility='default' filepath='src/memory_region_map.cc' line='145' column='1' elf-symbol-id='_ZN15MemoryRegionMap5lock_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static SpinLock MemoryRegionMap::owner_lock_ -->
        <var-decl name='owner_lock_' type-id='type-id-102' mangled-name='_ZN15MemoryRegionMap11owner_lock_E' visibility='default' filepath='src/memory_region_map.cc' line='147' column='1' elf-symbol-id='_ZN15MemoryRegionMap11owner_lock_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static int MemoryRegionMap::recursion_count_ -->
        <var-decl name='recursion_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap16recursion_count_E' visibility='default' filepath='src/memory_region_map.cc' line='148' column='1' elf-symbol-id='_ZN15MemoryRegionMap16recursion_count_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static pthread_t MemoryRegionMap::lock_owner_tid_ -->
        <var-decl name='lock_owner_tid_' type-id='type-id-336' mangled-name='_ZN15MemoryRegionMap15lock_owner_tid_E' visibility='default' filepath='src/memory_region_map.cc' line='149' column='1' elf-symbol-id='_ZN15MemoryRegionMap15lock_owner_tid_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static int64 MemoryRegionMap::map_size_ -->
        <var-decl name='map_size_' type-id='type-id-105' mangled-name='_ZN15MemoryRegionMap9map_size_E' visibility='default' filepath='src/memory_region_map.cc' line='150' column='1' elf-symbol-id='_ZN15MemoryRegionMap9map_size_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static int64 MemoryRegionMap::unmap_size_ -->
        <var-decl name='unmap_size_' type-id='type-id-105' mangled-name='_ZN15MemoryRegionMap11unmap_size_E' visibility='default' filepath='src/memory_region_map.cc' line='151' column='1' elf-symbol-id='_ZN15MemoryRegionMap11unmap_size_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static HeapProfileBucket** MemoryRegionMap::bucket_table_ -->
        <var-decl name='bucket_table_' type-id='type-id-337' mangled-name='_ZN15MemoryRegionMap13bucket_table_E' visibility='default' filepath='src/memory_region_map.cc' line='152' column='1' elf-symbol-id='_ZN15MemoryRegionMap13bucket_table_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static int MemoryRegionMap::num_buckets_ -->
        <var-decl name='num_buckets_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap12num_buckets_E' visibility='default' filepath='src/memory_region_map.cc' line='153' column='1' elf-symbol-id='_ZN15MemoryRegionMap12num_buckets_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static int MemoryRegionMap::saved_buckets_count_ -->
        <var-decl name='saved_buckets_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap20saved_buckets_count_E' visibility='default' filepath='src/memory_region_map.cc' line='154' column='1' elf-symbol-id='_ZN15MemoryRegionMap20saved_buckets_count_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static HeapProfileBucket MemoryRegionMap::saved_buckets_[20] -->
        <var-decl name='saved_buckets_' type-id='type-id-338' mangled-name='_ZN15MemoryRegionMap14saved_buckets_E' visibility='default' filepath='src/memory_region_map.cc' line='155' column='1' elf-symbol-id='_ZN15MemoryRegionMap14saved_buckets_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <!-- static void* MemoryRegionMap::saved_buckets_keys_[20][32] -->
        <var-decl name='saved_buckets_keys_' type-id='type-id-339' mangled-name='_ZN15MemoryRegionMap19saved_buckets_keys_E' visibility='default' filepath='src/memory_region_map.cc' line='158' column='1' elf-symbol-id='_ZN15MemoryRegionMap19saved_buckets_keys_E'/>
      </data-member>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::HandleSavedRegionsLocked() -->
        <function-decl name='HandleSavedRegionsLocked' mangled-name='_ZN15MemoryRegionMap24HandleSavedRegionsLockedEPFvRKNS_6RegionEE' filepath='src/memory_region_map.cc' line='487' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap24HandleSavedRegionsLockedEPFvRKNS_6RegionEE' hash='5695f5ce05a4c55f'>
          <!-- parameter of type 'void (*)(const MemoryRegionMap::Region&)' -->
          <parameter type-id='type-id-340'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::Unlock() -->
        <function-decl name='Unlock' mangled-name='_ZN15MemoryRegionMap6UnlockEv' filepath='src/memory_region_map.cc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap6UnlockEv' hash='7f32ffea222edbe7'>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool MemoryRegionMap::LockIsHeld() -->
        <function-decl name='LockIsHeld' mangled-name='_ZN15MemoryRegionMap10LockIsHeldEv' filepath='src/memory_region_map.cc' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10LockIsHeldEv' hash='c7c710e908194b91'>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::LogAllLocked() -->
        <function-decl name='LogAllLocked' mangled-name='_ZN15MemoryRegionMap12LogAllLockedEv' filepath='src/memory_region_map.cc' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap12LogAllLockedEv' hash='7f32ffea222edbe7'>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::DoInsertRegionLocked() -->
        <function-decl name='DoInsertRegionLocked' mangled-name='_ZN15MemoryRegionMap20DoInsertRegionLockedERKNS_6RegionE' filepath='src/memory_region_map.cc' line='443' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap20DoInsertRegionLockedERKNS_6RegionE' hash='d2a180ed49dda32d'>
          <!-- parameter of type 'const MemoryRegionMap::Region&' -->
          <parameter type-id='type-id-341'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- MemoryRegionMap::RegionIterator MemoryRegionMap::EndRegionLocked() -->
        <function-decl name='EndRegionLocked' mangled-name='_ZN15MemoryRegionMap15EndRegionLockedEv' filepath='src/memory_region_map.cc' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap15EndRegionLockedEv' hash='7f32ffea222edbe7'>
          <!-- typedef MemoryRegionMap::RegionIterator -->
          <return type-id='type-id-330'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- MemoryRegionMap::RegionIterator MemoryRegionMap::BeginRegionLocked() -->
        <function-decl name='BeginRegionLocked' mangled-name='_ZN15MemoryRegionMap17BeginRegionLockedEv' filepath='src/memory_region_map.cc' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap17BeginRegionLockedEv' hash='7f32ffea222edbe7'>
          <!-- typedef MemoryRegionMap::RegionIterator -->
          <return type-id='type-id-330'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- const MemoryRegionMap::Region* MemoryRegionMap::DoFindRegionLocked() -->
        <function-decl name='DoFindRegionLocked' mangled-name='_ZN15MemoryRegionMap18DoFindRegionLockedEm' filepath='src/memory_region_map.cc' line='334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap18DoFindRegionLockedEm' hash='0d5a4f50079cbc9a'>
          <!-- parameter of type 'typedef uintptr_t' -->
          <parameter type-id='type-id-277'/>
          <!-- const MemoryRegionMap::Region* -->
          <return type-id='type-id-342'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool MemoryRegionMap::IsRecordingLocked() -->
        <function-decl name='IsRecordingLocked' mangled-name='_ZN15MemoryRegionMap17IsRecordingLockedEv' filepath='src/memory_region_map.cc' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap17IsRecordingLockedEv' hash='c7c710e908194b91'>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::Lock() -->
        <function-decl name='Lock' mangled-name='_ZN15MemoryRegionMap4LockEv' filepath='src/memory_region_map.cc' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap4LockEv' hash='7f32ffea222edbe7'>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool MemoryRegionMap::FindAndMarkStackRegion(MemoryRegionMap::Region*) -->
        <function-decl name='FindAndMarkStackRegion' mangled-name='_ZN15MemoryRegionMap22FindAndMarkStackRegionEmPNS_6RegionE' filepath='src/memory_region_map.cc' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap22FindAndMarkStackRegionEmPNS_6RegionE' hash='e33ae77537c78254'>
          <!-- parameter of type 'typedef uintptr_t' -->
          <parameter type-id='type-id-277'/>
          <!-- parameter of type 'MemoryRegionMap::Region*' -->
          <parameter type-id='type-id-343'/>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool MemoryRegionMap::FindRegion(MemoryRegionMap::Region*) -->
        <function-decl name='FindRegion' mangled-name='_ZN15MemoryRegionMap10FindRegionEmPNS_6RegionE' filepath='src/memory_region_map.cc' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10FindRegionEmPNS_6RegionE' hash='e33ae77537c78254'>
          <!-- parameter of type 'typedef uintptr_t' -->
          <parameter type-id='type-id-277'/>
          <!-- parameter of type 'MemoryRegionMap::Region*' -->
          <parameter type-id='type-id-343'/>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- bool MemoryRegionMap::Shutdown() -->
        <function-decl name='Shutdown' mangled-name='_ZN15MemoryRegionMap8ShutdownEv' filepath='src/memory_region_map.cc' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8ShutdownEv' hash='c7c710e908194b91'>
          <!-- bool -->
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <!-- void MemoryRegionMap::Init(bool) -->
        <function-decl name='Init' mangled-name='_ZN15MemoryRegionMap4InitEib' filepath='src/memory_region_map.cc' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap4InitEib' hash='a79502d22727be06'>
          <!-- parameter of type 'int' -->
          <parameter type-id='type-id-1'/>
          <!-- parameter of type 'bool' -->
          <parameter type-id='type-id-59'/>
          <!-- void -->
          <return type-id='type-id-58'/>
        </function-decl>
