<abi-corpus version='2.4' soname='libtsan.so.0'>
  <elf-needed>
    <dependency name='librt.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- AnnotateBenignRace -->
    <elf-symbol name='AnnotateBenignRace' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- AnnotateBenignRaceSized -->
    <elf-symbol name='AnnotateBenignRaceSized' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- AnnotateCondVarSignal -->
    <elf-symbol name='AnnotateCondVarSignal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- AnnotateCondVarSignalAll -->
    <elf-symbol name='AnnotateCondVarSignalAll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- AnnotateCondVarWait -->
    <elf-symbol name='AnnotateCondVarWait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- AnnotateEnableRaceDetection -->
    <elf-symbol name='AnnotateEnableRaceDetection' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- AnnotateExpectRace -->

    <elf-symbol name='textdomain' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- time -->
    <elf-symbol name='time' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- times -->
    <elf-symbol name='times' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- tmpnam -->
    <elf-symbol name='tmpnam' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- tmpnam_r -->
    <elf-symbol name='tmpnam_r' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- unlink -->
    <elf-symbol name='unlink' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- usleep -->
    <elf-symbol name='usleep' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- valloc -->
    <elf-symbol name='valloc' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- vfscanf -->
    <elf-symbol name='vfscanf' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- vscanf -->
    <elf-symbol name='vscanf' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- vsscanf -->
    <elf-symbol name='vsscanf' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- wait -->
    <elf-symbol name='wait' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- wait3 -->
    <elf-symbol name='wait3' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- wait4 -->
    <elf-symbol name='wait4' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- waitid -->
    <elf-symbol name='waitid' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- waitpid -->
    <elf-symbol name='waitpid' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- wcsnrtombs -->
    <elf-symbol name='wcsnrtombs' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- wcsrtombs -->
    <elf-symbol name='wcsrtombs' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- wcstombs -->
    <elf-symbol name='wcstombs' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- wordexp -->
    <elf-symbol name='wordexp' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- write -->
    <elf-symbol name='write' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- writev -->
    <elf-symbol name='writev' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <!-- __asan_cplus_demangle_builtin_types -->
    <elf-symbol name='__asan_cplus_demangle_builtin_types' size='1056' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __asan_cplus_demangle_operators -->
    <elf-symbol name='__asan_cplus_demangle_operators' size='1488' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='../../.././libsanitizer/interception/interception_linux.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/interception' language='LANG_C_plus_plus'>
    <!-- namespace __interception -->
    <namespace-decl name='__interception'>
      <!-- typedef unsigned long int __interception::uptr -->
      <typedef-decl name='uptr' type-id='type-id-1' size-in-bits='64' filepath='../../.././libsanitizer/interception/interception.h' line='230' column='1' hash='8fdc5eea2983a729' id='type-id-2'/>
    </namespace-decl>
    <!-- void* dlsym(void*, const char*) -->
    <function-decl name='dlsym' filepath='/usr/include/dlfcn.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64' hash='53885bde0aa65efe'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- void* -->
      <return type-id='type-id-3'/>
    </function-decl>
    <!-- void* dlvsym(void*, const char*, const char*) -->
    <function-decl name='dlvsym' filepath='/usr/include/dlfcn.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' hash='3d5693612af11c46'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- void* -->
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/interception/interception_type_test.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/interception' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- struct backtrace_state -->
    <class-decl name='backtrace_state' is-struct='yes' visibility='default' size-in-bits='576' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='127' column='1' hash='5f90f130eeca0aa2' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* backtrace_state::filename -->
        <var-decl name='filename' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int backtrace_state::threaded -->
        <var-decl name='threaded' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* backtrace_state::lock -->
        <var-decl name='lock' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- fileline backtrace_state::fileline_fn -->
        <var-decl name='fileline_fn' type-id='type-id-7' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void* backtrace_state::fileline_data -->
        <var-decl name='fileline_data' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- syminfo backtrace_state::syminfo_fn -->
        <var-decl name='syminfo_fn' type-id='type-id-8' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- void* backtrace_state::syminfo_data -->
        <var-decl name='syminfo_data' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int backtrace_state::fileline_initialization_failed -->
        <var-decl name='fileline_initialization_failed' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <!-- int backtrace_state::lock_alloc -->
        <var-decl name='lock_alloc' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- backtrace_freelist_struct* backtrace_state::freelist -->
        <var-decl name='freelist' type-id='type-id-9' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='150' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct backtrace_vector -->
    <class-decl name='backtrace_vector' is-struct='yes' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='221' column='1' hash='09d3890156946272' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* backtrace_vector::base -->
        <var-decl name='base' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t backtrace_vector::size -->
        <var-decl name='size' type-id='type-id-11' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- size_t backtrace_vector::alc -->
        <var-decl name='alc' type-id='type-id-11' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='228' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef int (*)(void*, void*) __compar_fn_t -->
    <typedef-decl name='__compar_fn_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/stdlib.h' line='742' column='1' hash='fd7a63c0c6c822c4' id='type-id-13'/>
    <!-- typedef int (*)(backtrace_state*, uintptr_t, backtrace_full_callback, backtrace_error_callback, void*) fileline -->
    <typedef-decl name='fileline' type-id='type-id-14' size-in-bits='64' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='114' column='1' hash='fd7a63c0c6c822c4' id='type-id-7'/>
    <!-- typedef void (*)(backtrace_state*, uintptr_t, backtrace_syminfo_callback, backtrace_error_callback, void*) syminfo -->
    <typedef-decl name='syminfo' type-id='type-id-15' size-in-bits='64' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='121' column='1' hash='fd7a63c0c6c822c4' id='type-id-8'/>
    <!-- backtrace_freelist_struct* -->
    <pointer-type-def type-id='type-id-16' size-in-bits='64' hash='962b3ac2ad96cea1' id='type-id-9'/>
    <!-- backtrace_vector* -->
    <pointer-type-def type-id='type-id-10' size-in-bits='64' hash='e20b7416447a373f' id='type-id-17'/>
    <!-- const unsigned char -->
    <qualified-type-def type-id='type-id-18' const='yes' hash='645f4d0d44563fc6' id='type-id-19'/>
    <!-- const unsigned char* -->
    <pointer-type-def type-id='type-id-19' size-in-bits='64' hash='61acb54cba0b002f' id='type-id-20'/>
    <!-- fileline* -->
    <pointer-type-def type-id='type-id-7' size-in-bits='64' hash='2ed8a3d03c253656' id='type-id-21'/>
    <!-- int (*)(backtrace_state*, uintptr_t, backtrace_full_callback, backtrace_error_callback, void*) -->
    <pointer-type-def type-id='type-id-22' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-14'/>
    <!-- int (*)(void*, void*) -->
    <pointer-type-def type-id='type-id-23' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-12'/>
    <!-- void (*)(backtrace_state*, uintptr_t, backtrace_syminfo_callback, backtrace_error_callback, void*) -->
    <pointer-type-def type-id='type-id-24' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-15'/>
    <!-- struct backtrace_freelist_struct -->
    <class-decl name='backtrace_freelist_struct' is-struct='yes' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='55' column='1' hash='a5bef354f231c1c0' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- backtrace_freelist_struct* backtrace_freelist_struct::next -->
        <var-decl name='next' type-id='type-id-9' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- size_t backtrace_freelist_struct::size -->
        <var-decl name='size' type-id='type-id-11' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='60' column='1'/>
      </data-member>
    </class-decl>
    <!-- int __asan_backtrace_dwarf_add(backtrace_state*, uintptr_t, const unsigned char*, size_t, const unsigned char*, size_t, const unsigned char*, size_t, const unsigned char*, size_t, const unsigned char*, size_t, int, backtrace_error_callback, void*, fileline*) -->
    <function-decl name='__asan_backtrace_dwarf_add' mangled-name='__asan_backtrace_dwarf_add' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2958' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_dwarf_add' hash='d192e3646ecf0d2b'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='type-id-25' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2958' column='1'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='type-id-26' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2959' column='1'/>
      <!-- parameter of type 'const unsigned char*' -->
      <parameter type-id='type-id-20' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2960' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2961' column='1'/>
      <!-- parameter of type 'const unsigned char*' -->
      <parameter type-id='type-id-20' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2962' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2963' column='1'/>
      <!-- parameter of type 'const unsigned char*' -->
      <parameter type-id='type-id-20' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2964' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2965' column='1'/>
      <!-- parameter of type 'const unsigned char*' -->
      <parameter type-id='type-id-20' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2966' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2967' column='1'/>
      <!-- parameter of type 'const unsigned char*' -->
      <parameter type-id='type-id-20' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2968' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2969' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2970' column='1'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2971' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2972' column='1'/>
      <!-- parameter of type 'fileline*' -->
      <parameter type-id='type-id-21' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2972' column='1'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int snprintf(char*, size_t, const char*, ...) -->
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64' hash='9e970561a213ee08'>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-28'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <parameter is-variadic='yes'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- void* bsearch(void*, void*, size_t, size_t, __compar_fn_t) -->
    <function-decl name='bsearch' filepath='/usr/include/stdlib.h' line='755' column='1' visibility='default' binding='global' size-in-bits='64' hash='3aa907ea60dd12ba'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- parameter of type 'typedef __compar_fn_t' -->
      <parameter type-id='type-id-13'/>
      <!-- void* -->
      <return type-id='type-id-3'/>
    </function-decl>
    <!-- int (backtrace_state*, uintptr_t, backtrace_full_callback, backtrace_error_callback, void*) -->
    <function-type size-in-bits='64' hash='a53129547db92175' id='type-id-22'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='type-id-25'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='type-id-26'/>
      <!-- parameter of type 'typedef backtrace_full_callback' -->
      <parameter type-id='type-id-29'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-type>
    <!-- int (void*, void*) -->
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-23'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-type>
    <!-- void (backtrace_state*, uintptr_t, backtrace_syminfo_callback, backtrace_error_callback, void*) -->
    <function-type size-in-bits='64' hash='99adda500fb55b43' id='type-id-24'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='type-id-25'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='type-id-26'/>
      <!-- parameter of type 'typedef backtrace_syminfo_callback' -->
      <parameter type-id='type-id-30'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-type>
    <!-- int (void*, uintptr_t, const char*, int, const char*) -->
    <function-type size-in-bits='64' hash='32bf556e228a1834' id='type-id-32'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='type-id-26'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-type>
    <!-- void (void*, const char*, int) -->
    <function-type size-in-bits='64' hash='7cffa03161e7e042' id='type-id-33'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-type>
    <!-- void (void*, uintptr_t, const char*, uintptr_t, uintptr_t) -->
    <function-type size-in-bits='64' hash='55702965ae6729b3' id='type-id-34'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='type-id-26'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='type-id-26'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='type-id-26'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- int __asan_backtrace_initialize(backtrace_state*, int, backtrace_error_callback, void*, fileline*) -->
    <function-decl name='__asan_backtrace_initialize' mangled-name='__asan_backtrace_initialize' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='921' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_initialize' hash='7965a1d45f912d2c'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='type-id-25' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='921' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='921' column='1'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='922' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='923' column='1'/>
      <!-- parameter of type 'fileline*' -->
      <parameter type-id='type-id-21' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='923' column='1'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int dl_iterate_phdr(int (*)(dl_phdr_info*, size_t, void*), void*) -->
    <function-decl name='dl_iterate_phdr' filepath='/usr/include/link.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64' hash='a7f99494147764a8'>
      <!-- parameter of type 'int (*)(dl_phdr_info*, size_t, void*)' -->
      <parameter type-id='type-id-35'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int (dl_phdr_info*, size_t, void*) -->
    <function-type size-in-bits='64' hash='093f0dafedf26cc2' id='type-id-36'>
      <!-- parameter of type 'dl_phdr_info*' -->
      <parameter type-id='type-id-37'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- int __asan_backtrace_pcinfo(backtrace_state*, uintptr_t, backtrace_full_callback, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_pcinfo' mangled-name='__asan_backtrace_pcinfo' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_pcinfo' hash='a53129547db92175'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='type-id-25'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='type-id-26'/>
      <!-- parameter of type 'typedef backtrace_full_callback' -->
      <parameter type-id='type-id-29'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int __asan_backtrace_syminfo(backtrace_state*, uintptr_t, backtrace_syminfo_callback, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_syminfo' mangled-name='__asan_backtrace_syminfo' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_syminfo' hash='a53129547db92175'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='type-id-25' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='182' column='1'/>
      <!-- parameter of type 'typedef uintptr_t' -->
      <parameter type-id='type-id-26' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='182' column='1'/>
      <!-- parameter of type 'typedef backtrace_syminfo_callback' -->
      <parameter type-id='type-id-30' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='183' column='1'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='184' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='184' column='1'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- void* __asan_backtrace_alloc(backtrace_state*, size_t, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_alloc' mangled-name='__asan_backtrace_alloc' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_alloc' hash='1d0853aa6ff6f603'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='type-id-25'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- void* -->
      <return type-id='type-id-3'/>
    </function-decl>
    <!-- void __asan_backtrace_free(backtrace_state*, void*, size_t, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_free' mangled-name='__asan_backtrace_free' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_free' hash='1d0853aa6ff6f603'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='type-id-25'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-decl>
    <!-- void* __asan_backtrace_vector_grow(backtrace_state*, size_t, backtrace_error_callback, void*, backtrace_vector*) -->
    <function-decl name='__asan_backtrace_vector_grow' mangled-name='__asan_backtrace_vector_grow' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_vector_grow' hash='1573068df6b94a79'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='type-id-25'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'backtrace_vector*' -->
      <parameter type-id='type-id-17'/>
      <!-- void* -->
      <return type-id='type-id-3'/>
    </function-decl>
    <!-- void* __asan_backtrace_vector_finish(backtrace_state*, backtrace_vector*, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_vector_finish' mangled-name='__asan_backtrace_vector_finish' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='258' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_vector_finish' hash='dcc5e4bb0fe68a26'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='type-id-25' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='259' column='1'/>
      <!-- parameter of type 'backtrace_vector*' -->
      <parameter type-id='type-id-17' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='260' column='1'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='261' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='262' column='1'/>
      <!-- void* -->
      <return type-id='type-id-3'/>
    </function-decl>
    <!-- int __asan_backtrace_vector_release(backtrace_state*, backtrace_vector*, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_vector_release' mangled-name='__asan_backtrace_vector_release' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='275' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_vector_release' hash='38539ea9528f701e'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='type-id-25'/>
      <!-- parameter of type 'backtrace_vector*' -->
      <parameter type-id='type-id-17'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int* __errno_location() -->
    <function-decl name='__errno_location' filepath='/usr/include/bits/errno.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64' hash='c0e4f5f42afc96e0'>
      <!-- int* -->
      <return type-id='type-id-38'/>
    </function-decl>
    <!-- int getpagesize() -->
    <function-decl name='getpagesize' filepath='/usr/include/unistd.h' line='992' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- struct backtrace_view -->
    <class-decl name='backtrace_view' is-struct='yes' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='169' column='1' hash='1f6ceb699c7e823e' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* backtrace_view::data -->
        <var-decl name='data' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* backtrace_view::base -->
        <var-decl name='base' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- size_t backtrace_view::len -->
        <var-decl name='len' type-id='type-id-11' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='176' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef long int __off_t -->
    <typedef-decl name='__off_t' type-id='type-id-40' size-in-bits='64' filepath='/usr/include/bits/types.h' line='141' column='1' hash='b119fe0931d2ee10' id='type-id-41'/>
    <!-- typedef __off_t off_t -->
    <typedef-decl name='off_t' type-id='type-id-41' size-in-bits='64' filepath='/usr/include/sys/types.h' line='87' column='1' hash='b119fe0931d2ee10' id='type-id-42'/>
    <!-- backtrace_view* -->
    <pointer-type-def type-id='type-id-39' size-in-bits='64' hash='5387604c747fa524' id='type-id-43'/>
    <!-- int __asan_backtrace_get_view(backtrace_state*, int, off_t, size_t, backtrace_error_callback, void*, backtrace_view*) -->
    <function-decl name='__asan_backtrace_get_view' mangled-name='__asan_backtrace_get_view' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_get_view' hash='999a2fb4eb8dd177'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='type-id-25' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='53' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
      <!-- parameter of type 'typedef off_t' -->
      <parameter type-id='type-id-42' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='55' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='56' column='1'/>
      <!-- parameter of type 'backtrace_view*' -->
      <parameter type-id='type-id-43' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='56' column='1'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- void __asan_backtrace_release_view(backtrace_state*, backtrace_view*, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_release_view' mangled-name='__asan_backtrace_release_view' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_release_view' hash='6dbcc950976f383f'>
      <!-- parameter of type 'backtrace_state*' -->
      <parameter type-id='type-id-25' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='87' column='1'/>
      <!-- parameter of type 'backtrace_view*' -->
      <parameter type-id='type-id-43' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='88' column='1'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='89' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='90' column='1'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- int __asan_backtrace_open(const char*, backtrace_error_callback, void*, int*) -->
    <function-decl name='__asan_backtrace_open' mangled-name='__asan_backtrace_open' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_open' hash='1dbeb0d6e7e24b8e'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-38'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int __asan_backtrace_close(int, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_close' mangled-name='__asan_backtrace_close' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_close' hash='96b11b1183f0257f'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int fcntl(int, int, ...) -->
    <function-decl name='fcntl' filepath='/usr/include/fcntl.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' hash='a9fd86e6e981c3b5'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/sort.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- void __asan_backtrace_qsort(void*, size_t, size_t, int (*)(void*, void*)) -->
    <function-decl name='__asan_backtrace_qsort' mangled-name='__asan_backtrace_qsort' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/sort.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_qsort' hash='3aa907ea60dd12ba'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- parameter of type 'int (*)(void*, void*)' -->
      <parameter type-id='type-id-12'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- backtrace_state* __asan_backtrace_create_state(const char*, int, backtrace_error_callback, void*) -->
    <function-decl name='__asan_backtrace_create_state' mangled-name='__asan_backtrace_create_state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_create_state' hash='df03b86c45b33536'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='46' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='46' column='1'/>
      <!-- parameter of type 'typedef backtrace_error_callback' -->
      <parameter type-id='type-id-27' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='47' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='48' column='1'/>
      <!-- backtrace_state* -->
      <return type-id='type-id-25'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <!-- const demangle_builtin_type_info[33] -->
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='8448' hash='f92bf1b332a3fd5b' id='type-id-45'>
      <!-- <anonymous range>[33] -->
      <subrange length='33' lower-bound='0' upper-bound='32' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='7263f41a68bc1ea3' id='type-id-47'/>
    </array-type-def>
    <!-- const demangle_operator_info[62] -->
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='11904' hash='1ccde43f962b9ca5' id='type-id-49'>
      <!-- <anonymous range>[62] -->
      <subrange length='62' lower-bound='0' upper-bound='61' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='09ae24aae7a18a68' id='type-id-50'/>
    </array-type-def>
    <!-- demangle_builtin_type_info[33] -->
    <array-type-def dimensions='1' type-id='type-id-51' size-in-bits='8448' hash='a0463f1f41510dd1' id='type-id-52'>
      <!-- <anonymous range>[33] -->
      <subrange length='33' lower-bound='0' upper-bound='32' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='7263f41a68bc1ea3' id='type-id-47'/>
    </array-type-def>
    <!-- demangle_operator_info[62] -->
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='11904' hash='0414f3cd7fee4a72' id='type-id-54'>
      <!-- <anonymous range>[62] -->
      <subrange length='62' lower-bound='0' upper-bound='61' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='09ae24aae7a18a68' id='type-id-50'/>
    </array-type-def>
    <!-- enum d_builtin_type_print -->
    <enum-decl name='d_builtin_type_print' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='51' column='1' hash='704c20194e2ea276' id='type-id-55'>
      <underlying-type type-id='type-id-56'/>
      <enumerator name='D_PRINT_DEFAULT' value='0'/>
      <enumerator name='D_PRINT_INT' value='1'/>
      <enumerator name='D_PRINT_UNSIGNED' value='2'/>
      <enumerator name='D_PRINT_LONG' value='3'/>
      <enumerator name='D_PRINT_UNSIGNED_LONG' value='4'/>
      <enumerator name='D_PRINT_LONG_LONG' value='5'/>
      <enumerator name='D_PRINT_UNSIGNED_LONG_LONG' value='6'/>
      <enumerator name='D_PRINT_BOOL' value='7'/>
      <enumerator name='D_PRINT_FLOAT' value='8'/>
      <enumerator name='D_PRINT_VOID' value='9'/>
    </enum-decl>
    <!-- enum demangle_component_type -->
    <enum-decl name='demangle_component_type' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/../include/demangle.h' line='223' column='1' hash='b520c0974bc3d2e1' id='type-id-57'>
      <underlying-type type-id='type-id-56'/>
      <enumerator name='DEMANGLE_COMPONENT_NAME' value='0'/>
      <enumerator name='DEMANGLE_COMPONENT_QUAL_NAME' value='1'/>
      <enumerator name='DEMANGLE_COMPONENT_LOCAL_NAME' value='2'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPED_NAME' value='3'/>
      <enumerator name='DEMANGLE_COMPONENT_TEMPLATE' value='4'/>
      <enumerator name='DEMANGLE_COMPONENT_TEMPLATE_PARAM' value='5'/>
      <enumerator name='DEMANGLE_COMPONENT_FUNCTION_PARAM' value='6'/>
      <enumerator name='DEMANGLE_COMPONENT_CTOR' value='7'/>
      <enumerator name='DEMANGLE_COMPONENT_DTOR' value='8'/>
      <enumerator name='DEMANGLE_COMPONENT_VTABLE' value='9'/>
      <enumerator name='DEMANGLE_COMPONENT_VTT' value='10'/>
      <enumerator name='DEMANGLE_COMPONENT_CONSTRUCTION_VTABLE' value='11'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPEINFO' value='12'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPEINFO_NAME' value='13'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPEINFO_FN' value='14'/>
      <enumerator name='DEMANGLE_COMPONENT_THUNK' value='15'/>
      <enumerator name='DEMANGLE_COMPONENT_VIRTUAL_THUNK' value='16'/>
      <enumerator name='DEMANGLE_COMPONENT_COVARIANT_THUNK' value='17'/>
      <enumerator name='DEMANGLE_COMPONENT_JAVA_CLASS' value='18'/>
      <enumerator name='DEMANGLE_COMPONENT_GUARD' value='19'/>
      <enumerator name='DEMANGLE_COMPONENT_TLS_INIT' value='20'/>
      <enumerator name='DEMANGLE_COMPONENT_TLS_WRAPPER' value='21'/>
      <enumerator name='DEMANGLE_COMPONENT_REFTEMP' value='22'/>
      <enumerator name='DEMANGLE_COMPONENT_HIDDEN_ALIAS' value='23'/>
      <enumerator name='DEMANGLE_COMPONENT_SUB_STD' value='24'/>
      <enumerator name='DEMANGLE_COMPONENT_RESTRICT' value='25'/>
      <enumerator name='DEMANGLE_COMPONENT_VOLATILE' value='26'/>
      <enumerator name='DEMANGLE_COMPONENT_CONST' value='27'/>
      <enumerator name='DEMANGLE_COMPONENT_RESTRICT_THIS' value='28'/>
      <enumerator name='DEMANGLE_COMPONENT_VOLATILE_THIS' value='29'/>
      <enumerator name='DEMANGLE_COMPONENT_CONST_THIS' value='30'/>
      <enumerator name='DEMANGLE_COMPONENT_REFERENCE_THIS' value='31'/>
      <enumerator name='DEMANGLE_COMPONENT_RVALUE_REFERENCE_THIS' value='32'/>
      <enumerator name='DEMANGLE_COMPONENT_VENDOR_TYPE_QUAL' value='33'/>
      <enumerator name='DEMANGLE_COMPONENT_POINTER' value='34'/>
      <enumerator name='DEMANGLE_COMPONENT_REFERENCE' value='35'/>
      <enumerator name='DEMANGLE_COMPONENT_RVALUE_REFERENCE' value='36'/>
      <enumerator name='DEMANGLE_COMPONENT_COMPLEX' value='37'/>
      <enumerator name='DEMANGLE_COMPONENT_IMAGINARY' value='38'/>
      <enumerator name='DEMANGLE_COMPONENT_BUILTIN_TYPE' value='39'/>
      <enumerator name='DEMANGLE_COMPONENT_VENDOR_TYPE' value='40'/>
      <enumerator name='DEMANGLE_COMPONENT_FUNCTION_TYPE' value='41'/>
      <enumerator name='DEMANGLE_COMPONENT_ARRAY_TYPE' value='42'/>
      <enumerator name='DEMANGLE_COMPONENT_PTRMEM_TYPE' value='43'/>
      <enumerator name='DEMANGLE_COMPONENT_FIXED_TYPE' value='44'/>
      <enumerator name='DEMANGLE_COMPONENT_VECTOR_TYPE' value='45'/>
      <enumerator name='DEMANGLE_COMPONENT_ARGLIST' value='46'/>
      <enumerator name='DEMANGLE_COMPONENT_TEMPLATE_ARGLIST' value='47'/>
      <enumerator name='DEMANGLE_COMPONENT_INITIALIZER_LIST' value='48'/>
      <enumerator name='DEMANGLE_COMPONENT_OPERATOR' value='49'/>
      <enumerator name='DEMANGLE_COMPONENT_EXTENDED_OPERATOR' value='50'/>
      <enumerator name='DEMANGLE_COMPONENT_CAST' value='51'/>
      <enumerator name='DEMANGLE_COMPONENT_NULLARY' value='52'/>
      <enumerator name='DEMANGLE_COMPONENT_UNARY' value='53'/>
      <enumerator name='DEMANGLE_COMPONENT_BINARY' value='54'/>
      <enumerator name='DEMANGLE_COMPONENT_BINARY_ARGS' value='55'/>
      <enumerator name='DEMANGLE_COMPONENT_TRINARY' value='56'/>
      <enumerator name='DEMANGLE_COMPONENT_TRINARY_ARG1' value='57'/>
      <enumerator name='DEMANGLE_COMPONENT_TRINARY_ARG2' value='58'/>
      <enumerator name='DEMANGLE_COMPONENT_LITERAL' value='59'/>
      <enumerator name='DEMANGLE_COMPONENT_LITERAL_NEG' value='60'/>
      <enumerator name='DEMANGLE_COMPONENT_JAVA_RESOURCE' value='61'/>
      <enumerator name='DEMANGLE_COMPONENT_COMPOUND_NAME' value='62'/>
      <enumerator name='DEMANGLE_COMPONENT_CHARACTER' value='63'/>
      <enumerator name='DEMANGLE_COMPONENT_NUMBER' value='64'/>
      <enumerator name='DEMANGLE_COMPONENT_DECLTYPE' value='65'/>
      <enumerator name='DEMANGLE_COMPONENT_GLOBAL_CONSTRUCTORS' value='66'/>
      <enumerator name='DEMANGLE_COMPONENT_GLOBAL_DESTRUCTORS' value='67'/>
      <enumerator name='DEMANGLE_COMPONENT_LAMBDA' value='68'/>
      <enumerator name='DEMANGLE_COMPONENT_DEFAULT_ARG' value='69'/>
      <enumerator name='DEMANGLE_COMPONENT_UNNAMED_TYPE' value='70'/>
      <enumerator name='DEMANGLE_COMPONENT_TRANSACTION_CLONE' value='71'/>
      <enumerator name='DEMANGLE_COMPONENT_NONTRANSACTION_CLONE' value='72'/>
      <enumerator name='DEMANGLE_COMPONENT_PACK_EXPANSION' value='73'/>
      <enumerator name='DEMANGLE_COMPONENT_TAGGED_NAME' value='74'/>
      <enumerator name='DEMANGLE_COMPONENT_CLONE' value='75'/>
    </enum-decl>
    <!-- enum gnu_v3_ctor_kinds -->
    <enum-decl name='gnu_v3_ctor_kinds' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/../include/demangle.h' line='172' column='1' hash='ad173987665e6bf5' id='type-id-58'>
      <underlying-type type-id='type-id-56'/>
      <enumerator name='gnu_v3_complete_object_ctor' value='1'/>
      <enumerator name='gnu_v3_base_object_ctor' value='2'/>
      <enumerator name='gnu_v3_complete_object_allocating_ctor' value='3'/>
      <enumerator name='gnu_v3_unified_ctor' value='4'/>
      <enumerator name='gnu_v3_object_ctor_group' value='5'/>
    </enum-decl>
    <!-- enum gnu_v3_dtor_kinds -->
    <enum-decl name='gnu_v3_dtor_kinds' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/../include/demangle.h' line='191' column='1' hash='ac8ab9354ac0c986' id='type-id-59'>
      <underlying-type type-id='type-id-56'/>
      <enumerator name='gnu_v3_deleting_dtor' value='1'/>
      <enumerator name='gnu_v3_complete_object_dtor' value='2'/>
      <enumerator name='gnu_v3_base_object_dtor' value='3'/>
      <enumerator name='gnu_v3_unified_dtor' value='4'/>
      <enumerator name='gnu_v3_object_dtor_group' value='5'/>
    </enum-decl>
    <!-- struct d_info -->
    <class-decl name='d_info' is-struct='yes' visibility='default' size-in-bits='768' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='93' column='1' hash='6f5c70432753528b' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* d_info::s -->
        <var-decl name='s' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const char* d_info::send -->
        <var-decl name='send' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int d_info::options -->
        <var-decl name='options' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- const char* d_info::n -->
        <var-decl name='n' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- demangle_component* d_info::comps -->
        <var-decl name='comps' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- int d_info::next_comp -->
        <var-decl name='next_comp' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <!-- int d_info::num_comps -->
        <var-decl name='num_comps' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- demangle_component** d_info::subs -->
        <var-decl name='subs' type-id='type-id-62' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- int d_info::next_sub -->
        <var-decl name='next_sub' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <!-- int d_info::num_subs -->
        <var-decl name='num_subs' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- int d_info::did_subs -->
        <var-decl name='did_subs' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- demangle_component* d_info::last_name -->
        <var-decl name='last_name' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- int d_info::expansion -->
        <var-decl name='expansion' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <!-- int d_info::is_expression -->
        <var-decl name='is_expression' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- int d_info::is_conversion -->
        <var-decl name='is_conversion' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='129' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct demangle_builtin_type_info -->
    <class-decl name='demangle_builtin_type_info' is-struct='yes' visibility='default' size-in-bits='256' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='77' column='1' hash='2e82a19a7f4ab54c' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* demangle_builtin_type_info::name -->
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int demangle_builtin_type_info::len -->
        <var-decl name='len' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- const char* demangle_builtin_type_info::java_name -->
        <var-decl name='java_name' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- int demangle_builtin_type_info::java_len -->
        <var-decl name='java_len' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <!-- d_builtin_type_print demangle_builtin_type_info::print -->
        <var-decl name='print' type-id='type-id-55' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct demangle_component -->
    <class-decl name='demangle_component' is-struct='yes' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/../include/demangle.h' line='453' column='1' hash='de60cae165ddb111' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- demangle_component_type demangle_component::type -->
        <var-decl name='type' type-id='type-id-57' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- union {struct {const char* s; int len;} s_name; struct {const demangle_operator_info* op;} s_operator; struct {int args; demangle_component* name;} s_extended_operator; struct {demangle_component* length; short int accum; short int sat;} s_fixed; struct {gnu_v3_ctor_kinds kind; demangle_component* name;} s_ctor; struct {gnu_v3_dtor_kinds kind; demangle_component* name;} s_dtor; struct {const demangle_builtin_type_info* type;} s_builtin; struct {const char* string; int len;} s_string; struct {long int number;} s_number; struct {int character;} s_character; struct {demangle_component* left; demangle_component* right;} s_binary; struct {demangle_component* sub; int num;} s_unary_num;} demangle_component::u -->
        <var-decl name='u' type-id='type-id-64' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='560' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct demangle_operator_info -->
    <class-decl name='demangle_operator_info' is-struct='yes' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='37' column='1' hash='8394e36452f6120e' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* demangle_operator_info::code -->
        <var-decl name='code' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const char* demangle_operator_info::name -->
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int demangle_operator_info::len -->
        <var-decl name='len' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- int demangle_operator_info::args -->
        <var-decl name='args' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {const char* s; int len;} -->
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='461' column='1' hash='4459462e1eb691f0#2' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* s -->
        <var-decl name='s' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int len -->
        <var-decl name='len' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='466' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {const char* string; int len;} -->
    <class-decl name='__anonymous_struct__7' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='522' column='1' hash='11e8ff315fe9401e#3' id='type-id-66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const char* string -->
        <var-decl name='string' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int len -->
        <var-decl name='len' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='527' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {const demangle_builtin_type_info* type;} -->
    <class-decl name='__anonymous_struct__6' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='515' column='1' hash='be1d4c210dd9c3f8#4' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const demangle_builtin_type_info* type -->
        <var-decl name='type' type-id='type-id-68' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='518' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {const demangle_operator_info* op;} -->
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='470' column='1' hash='aa2490bd20bf9ae5#5' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- const demangle_operator_info* op -->
        <var-decl name='op' type-id='type-id-70' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='473' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {demangle_component* left; demangle_component* right;} -->
    <class-decl name='__anonymous_struct__10' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='544' column='1' hash='b9b276eb9b9ee82b#6' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- demangle_component* left -->
        <var-decl name='left' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- demangle_component* right -->
        <var-decl name='right' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='549' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {demangle_component* length; short int accum; short int sat;} -->
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='486' column='1' hash='d95c42f69a907ef6#7' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- demangle_component* length -->
        <var-decl name='length' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- short int accum -->
        <var-decl name='accum' type-id='type-id-73' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <!-- short int sat -->
        <var-decl name='sat' type-id='type-id-73' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='493' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {demangle_component* sub; int num;} -->
    <class-decl name='__anonymous_struct__11' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='552' column='1' hash='f6ca4753b0b83074#8' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- demangle_component* sub -->
        <var-decl name='sub' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int num -->
        <var-decl name='num' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='557' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {gnu_v3_ctor_kinds kind; demangle_component* name;} -->
    <class-decl name='__anonymous_struct__4' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='497' column='1' hash='e5efee0a14f5c732#9' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- gnu_v3_ctor_kinds kind -->
        <var-decl name='kind' type-id='type-id-58' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- demangle_component* name -->
        <var-decl name='name' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='502' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {gnu_v3_dtor_kinds kind; demangle_component* name;} -->
    <class-decl name='__anonymous_struct__5' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='506' column='1' hash='dd7a92067caa1ab9#10' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- gnu_v3_dtor_kinds kind -->
        <var-decl name='kind' type-id='type-id-59' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- demangle_component* name -->
        <var-decl name='name' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='511' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {int args; demangle_component* name;} -->
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='477' column='1' hash='73305be8ab207ee1#11' id='type-id-77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int args -->
        <var-decl name='args' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- demangle_component* name -->
        <var-decl name='name' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='482' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {int character;} -->
    <class-decl name='__anonymous_struct__9' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='538' column='1' hash='a6136041df555d44#12' id='type-id-78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int character -->
        <var-decl name='character' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='540' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct {long int number;} -->
    <class-decl name='__anonymous_struct__8' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='531' column='1' hash='083da97dd93b5624#13' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- long int number -->
        <var-decl name='number' type-id='type-id-40' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='534' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {struct {const char* s; int len;} s_name; struct {const demangle_operator_info* op;} s_operator; struct {int args; demangle_component* name;} s_extended_operator; struct {demangle_component* length; short int accum; short int sat;} s_fixed; struct {gnu_v3_ctor_kinds kind; demangle_component* name;} s_ctor; struct {gnu_v3_dtor_kinds kind; demangle_component* name;} s_dtor; struct {const demangle_builtin_type_info* type;} s_builtin; struct {const char* string; int len;} s_string; struct {long int number;} s_number; struct {int character;} s_character; struct {demangle_component* left; demangle_component* right;} s_binary; struct {demangle_component* sub; int num;} s_unary_num;} -->
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='458' column='1' hash='d4eebc0132122e1b#3' id='type-id-64'>
      <data-member access='public'>
        <!-- struct {const char* s; int len;} s_name -->
        <var-decl name='s_name' type-id='type-id-65' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='467' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {const demangle_operator_info* op;} s_operator -->
        <var-decl name='s_operator' type-id='type-id-69' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='474' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {int args; demangle_component* name;} s_extended_operator -->
        <var-decl name='s_extended_operator' type-id='type-id-77' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='483' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {demangle_component* length; short int accum; short int sat;} s_fixed -->
        <var-decl name='s_fixed' type-id='type-id-72' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='494' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {gnu_v3_ctor_kinds kind; demangle_component* name;} s_ctor -->
        <var-decl name='s_ctor' type-id='type-id-75' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='503' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {gnu_v3_dtor_kinds kind; demangle_component* name;} s_dtor -->
        <var-decl name='s_dtor' type-id='type-id-76' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='512' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {const demangle_builtin_type_info* type;} s_builtin -->
        <var-decl name='s_builtin' type-id='type-id-67' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='519' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {const char* string; int len;} s_string -->
        <var-decl name='s_string' type-id='type-id-66' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='528' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {long int number;} s_number -->
        <var-decl name='s_number' type-id='type-id-79' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='535' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {int character;} s_character -->
        <var-decl name='s_character' type-id='type-id-78' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='541' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {demangle_component* left; demangle_component* right;} s_binary -->
        <var-decl name='s_binary' type-id='type-id-71' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='550' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- struct {demangle_component* sub; int num;} s_unary_num -->
        <var-decl name='s_unary_num' type-id='type-id-74' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='558' column='1'/>
      </data-member>
    </union-decl>
    <!-- const demangle_builtin_type_info -->
    <qualified-type-def type-id='type-id-51' const='yes' hash='afb6309cf4d14745' id='type-id-44'/>
    <!-- const demangle_builtin_type_info* -->
    <pointer-type-def type-id='type-id-44' size-in-bits='64' hash='3fdd5bde8f6f5ee8' id='type-id-68'/>
    <!-- const demangle_component -->
    <qualified-type-def type-id='type-id-63' const='yes' hash='b3526efe39aa8099' id='type-id-80'/>
    <!-- const demangle_component* -->
    <pointer-type-def type-id='type-id-80' size-in-bits='64' hash='d0a6056080b98515' id='type-id-81'/>
    <!-- const demangle_operator_info -->
    <qualified-type-def type-id='type-id-53' const='yes' hash='4e663cbab0ead054' id='type-id-48'/>
    <!-- const demangle_operator_info* -->
    <pointer-type-def type-id='type-id-48' size-in-bits='64' hash='55b3085f7ddf0d7e' id='type-id-70'/>
    <!-- d_info* -->
    <pointer-type-def type-id='type-id-60' size-in-bits='64' hash='2c0f73e9f326e0ab' id='type-id-82'/>
    <!-- demangle_component* -->
    <pointer-type-def type-id='type-id-63' size-in-bits='64' hash='61981ccd18b14661' id='type-id-61'/>
    <!-- demangle_component** -->
    <pointer-type-def type-id='type-id-61' size-in-bits='64' hash='c3f2a5582ce7584f' id='type-id-62'/>
    <!-- int __asan_cplus_demangle_fill_name(demangle_component*, const char*, int) -->
    <function-decl name='__asan_cplus_demangle_fill_name' mangled-name='__asan_cplus_demangle_fill_name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_name' hash='9bd0d36c99b8dad2'>
      <!-- parameter of type 'demangle_component*' -->
      <parameter type-id='type-id-61' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int __asan_cplus_demangle_fill_extended_operator(demangle_component*, int, demangle_component*) -->
    <function-decl name='__asan_cplus_demangle_fill_extended_operator' mangled-name='__asan_cplus_demangle_fill_extended_operator' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_extended_operator' hash='ec77335401e0731f'>
      <!-- parameter of type 'demangle_component*' -->
      <parameter type-id='type-id-61' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1'/>
      <!-- parameter of type 'demangle_component*' -->
      <parameter type-id='type-id-61' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='798' column='1'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int __asan_cplus_demangle_fill_ctor(demangle_component*, gnu_v3_ctor_kinds, demangle_component*) -->
    <function-decl name='__asan_cplus_demangle_fill_ctor' mangled-name='__asan_cplus_demangle_fill_ctor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_ctor' hash='ed2f36cf9d59eeed'>
      <!-- parameter of type 'demangle_component*' -->
      <parameter type-id='type-id-61' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='812' column='1'/>
      <!-- parameter of type 'enum gnu_v3_ctor_kinds' -->
      <parameter type-id='type-id-58' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='813' column='1'/>
      <!-- parameter of type 'demangle_component*' -->
      <parameter type-id='type-id-61' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='814' column='1'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int __asan_cplus_demangle_fill_dtor(demangle_component*, gnu_v3_dtor_kinds, demangle_component*) -->
    <function-decl name='__asan_cplus_demangle_fill_dtor' mangled-name='__asan_cplus_demangle_fill_dtor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='831' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_dtor' hash='b8bbc06c1685afe7'>
      <!-- parameter of type 'demangle_component*' -->
      <parameter type-id='type-id-61' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='831' column='1'/>
      <!-- parameter of type 'enum gnu_v3_dtor_kinds' -->
      <parameter type-id='type-id-59' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='832' column='1'/>
      <!-- parameter of type 'demangle_component*' -->
      <parameter type-id='type-id-61' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='833' column='1'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- demangle_component* __asan_cplus_demangle_mangled_name(d_info*, int) -->
    <function-decl name='__asan_cplus_demangle_mangled_name' mangled-name='__asan_cplus_demangle_mangled_name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_mangled_name' hash='34761baa5dd7a873'>
      <!-- parameter of type 'd_info*' -->
      <parameter type-id='type-id-82' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1140' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1140' column='1'/>
      <!-- demangle_component* -->
      <return type-id='type-id-61'/>
    </function-decl>
    <!-- const demangle_operator_info __asan_cplus_demangle_operators[62] -->
    <var-decl name='__asan_cplus_demangle_operators' type-id='type-id-49' mangled-name='__asan_cplus_demangle_operators' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1688' column='1' elf-symbol-id='__asan_cplus_demangle_operators'/>
    <!-- const demangle_builtin_type_info __asan_cplus_demangle_builtin_types[33] -->
    <var-decl name='__asan_cplus_demangle_builtin_types' type-id='type-id-45' mangled-name='__asan_cplus_demangle_builtin_types' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='2188' column='1' elf-symbol-id='__asan_cplus_demangle_builtin_types'/>
    <!-- demangle_component* __asan_cplus_demangle_type(d_info*) -->
    <function-decl name='__asan_cplus_demangle_type' mangled-name='__asan_cplus_demangle_type' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='2230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_type' hash='1566ada269bec3ae'>
      <!-- parameter of type 'd_info*' -->
      <parameter type-id='type-id-82' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='2230' column='1'/>
      <!-- demangle_component* -->
      <return type-id='type-id-61'/>
    </function-decl>
    <!-- int __asan_cplus_demangle_print_callback(int, const demangle_component*, demangle_callbackref, void*) -->
    <function-decl name='__asan_cplus_demangle_print_callback' mangled-name='__asan_cplus_demangle_print_callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4029' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_print_callback' hash='44d12a9b2f3ba0e7'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4029' column='1'/>
      <!-- parameter of type 'const demangle_component*' -->
      <parameter type-id='type-id-81' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4030' column='1'/>
      <!-- parameter of type 'typedef demangle_callbackref' -->
      <parameter type-id='type-id-83' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4031' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4031' column='1'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- char* __asan_cplus_demangle_print(int, const demangle_component*, int, size_t*) -->
    <function-decl name='__asan_cplus_demangle_print' mangled-name='__asan_cplus_demangle_print' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_print' hash='4c514ae725cd2237'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1'/>
      <!-- parameter of type 'const demangle_component*' -->
      <parameter type-id='type-id-81' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4070' column='1'/>
      <!-- parameter of type 'size_t*' -->
      <parameter type-id='type-id-84' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4070' column='1'/>
      <!-- char* -->
      <return type-id='type-id-28'/>
    </function-decl>
    <!-- void __asan_cplus_demangle_init_info(const char*, int, size_t, d_info*) -->
    <function-decl name='__asan_cplus_demangle_init_info' mangled-name='__asan_cplus_demangle_init_info' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_init_info' hash='558d075156e3f919'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
      <!-- parameter of type 'd_info*' -->
      <parameter type-id='type-id-82' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5732' column='1'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-decl>
    <!-- char* __asan_cplus_demangle_v3(const char*, int) -->
    <function-decl name='__asan_cplus_demangle_v3' mangled-name='__asan_cplus_demangle_v3' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6018' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_v3' hash='1b0d39e45ce45198'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6018' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6018' column='1'/>
      <!-- char* -->
      <return type-id='type-id-28'/>
    </function-decl>
    <!-- int __asan_cplus_demangle_v3_callback(const char*, int, demangle_callbackref, void*) -->
    <function-decl name='__asan_cplus_demangle_v3_callback' mangled-name='__asan_cplus_demangle_v3_callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_v3_callback' hash='b2ef61a93093af56'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6026' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6026' column='1'/>
      <!-- parameter of type 'typedef demangle_callbackref' -->
      <parameter type-id='type-id-83' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6027' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6027' column='1'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- char* __asan_java_demangle_v3(const char*) -->
    <function-decl name='__asan_java_demangle_v3' mangled-name='__asan_java_demangle_v3' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6039' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_java_demangle_v3' hash='bac6a89264ba699c'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6039' column='1'/>
      <!-- char* -->
      <return type-id='type-id-28'/>
    </function-decl>
    <!-- int __asan_java_demangle_v3_callback(const char*, demangle_callbackref, void*) -->
    <function-decl name='__asan_java_demangle_v3_callback' mangled-name='__asan_java_demangle_v3_callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6047' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_java_demangle_v3_callback' hash='047f7d52c3765ece'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6047' column='1'/>
      <!-- parameter of type 'typedef demangle_callbackref' -->
      <parameter type-id='type-id-83' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6048' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6048' column='1'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- gnu_v3_ctor_kinds __asan_is_gnu_v3_mangled_ctor(const char*) -->
    <function-decl name='__asan_is_gnu_v3_mangled_ctor' mangled-name='__asan_is_gnu_v3_mangled_ctor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_is_gnu_v3_mangled_ctor' hash='dcef754db64155b6'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6137' column='1'/>
      <!-- enum gnu_v3_ctor_kinds -->
      <return type-id='type-id-58'/>
    </function-decl>
    <!-- gnu_v3_dtor_kinds __asan_is_gnu_v3_mangled_dtor(const char*) -->
    <function-decl name='__asan_is_gnu_v3_mangled_dtor' mangled-name='__asan_is_gnu_v3_mangled_dtor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_is_gnu_v3_mangled_dtor' hash='b4517baa93919497'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6152' column='1'/>
      <!-- enum gnu_v3_dtor_kinds -->
      <return type-id='type-id-59'/>
    </function-decl>
    <!-- int sprintf(char*, const char*, ...) -->
    <function-decl name='sprintf' filepath='/usr/include/stdio.h' line='363' column='1' visibility='default' binding='global' size-in-bits='64' hash='21335fc22233a3a7'>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-28'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <parameter is-variadic='yes'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- void (const char*, size_t, void*) -->
    <function-type size-in-bits='64' hash='45200c13db6d193f' id='type-id-85'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-type>
    <!-- void (void*) -->
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-86'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/bridge.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C_plus_plus'>
    <!-- void* __asan_internal_memcpy(void*, void*, size_t) -->
    <function-decl name='__asan_internal_memcpy' mangled-name='__asan_internal_memcpy' filepath='../../.././libsanitizer/libbacktrace/bridge.cc' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_internal_memcpy' hash='e0055d99adb0e173'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- void* -->
      <return type-id='type-id-3'/>
    </function-decl>
    <!-- void* __asan_internal_memset(void*, int, size_t) -->
    <function-decl name='__asan_internal_memset' mangled-name='__asan_internal_memset' filepath='../../.././libsanitizer/libbacktrace/bridge.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_internal_memset' hash='b6a97d07f8261bc0'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- void* -->
      <return type-id='type-id-3'/>
    </function-decl>
    <!-- int __asan_internal_memcmp(void*, void*, size_t) -->
    <function-decl name='__asan_internal_memcmp' mangled-name='__asan_internal_memcmp' filepath='../../.././libsanitizer/libbacktrace/bridge.cc' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_internal_memcmp' hash='b6a97d07f8261bc0'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int __asan_internal_strcmp(const char*, const char*) -->
    <function-decl name='__asan_internal_strcmp' mangled-name='__asan_internal_strcmp' filepath='../../.././libsanitizer/libbacktrace/bridge.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_internal_strcmp' hash='5f03b5b551b5a51f'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int __asan_internal_strncmp(const char*, const char*, size_t) -->
    <function-decl name='__asan_internal_strncmp' mangled-name='__asan_internal_strncmp' filepath='../../.././libsanitizer/libbacktrace/bridge.cc' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_internal_strncmp' hash='2f99ec08ee54ebb4'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- size_t __asan_internal_strlen(const char*) -->
    <function-decl name='__asan_internal_strlen' mangled-name='__asan_internal_strlen' filepath='../../.././libsanitizer/libbacktrace/bridge.cc' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_internal_strlen' hash='ed7b6a29124427dd'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- typedef size_t -->
      <return type-id='type-id-11'/>
    </function-decl>
    <!-- size_t __asan_internal_strnlen(const char*, size_t) -->
    <function-decl name='__asan_internal_strnlen' mangled-name='__asan_internal_strnlen' filepath='../../.././libsanitizer/libbacktrace/bridge.cc' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_internal_strnlen' hash='e62a7a46b2904b02'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- typedef size_t -->
      <return type-id='type-id-11'/>
    </function-decl>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- typedef unsigned long int __sanitizer::uptr -->
      <typedef-decl name='uptr' type-id='type-id-1' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='56' column='1' hash='8fdc5eea2983a729' id='type-id-87'/>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>* const -->
    <qualified-type-def type-id='type-id-88' const='yes' hash='1bfbd854171e911a' id='type-id-89'/>
    <!-- __sanitizer::LowLevelAllocator* -->
    <pointer-type-def type-id='type-id-90' size-in-bits='64' hash='2244dc4b9d28622a' id='type-id-91'/>
    <!-- __sanitizer::LowLevelAllocator* const -->
    <qualified-type-def type-id='type-id-91' const='yes' hash='3986d9458290b7ce' id='type-id-92'/>
    <!-- const __sanitizer::CrashOnMapUnmap -->
    <qualified-type-def type-id='type-id-93' const='yes' hash='0c2b54bc75fa25c8' id='type-id-94'/>
    <!-- const __sanitizer::CrashOnMapUnmap* -->
    <pointer-type-def type-id='type-id-94' size-in-bits='64' hash='3f835102bda3763e' id='type-id-95'/>
    <!-- const __sanitizer::CrashOnMapUnmap* const -->
    <qualified-type-def type-id='type-id-95' const='yes' hash='773b756f985cd01a' id='type-id-96'/>
    <!-- void (*)(__sanitizer::uptr, __sanitizer::uptr) -->
    <pointer-type-def type-id='type-id-97' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-98'/>
    <!-- __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap>::Header* -->
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-100'/>
    <!-- __sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>::Batch* -->
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-102'/>
    <!-- __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch* -->
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-104'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- class __sanitizer::LowLevelAllocator -->
      <class-decl name='LowLevelAllocator' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='108' column='1' hash='476cbb09d7f7c521' id='type-id-90'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- char* __sanitizer::LowLevelAllocator::allocated_end_ -->
          <var-decl name='allocated_end_' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='113' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- char* __sanitizer::LowLevelAllocator::allocated_current_ -->
          <var-decl name='allocated_current_' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='114' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct __sanitizer::CrashOnMapUnmap -->
      <class-decl name='CrashOnMapUnmap' is-struct='yes' visibility='default' size-in-bits='8' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator_internal.h' line='47' column='1' hash='ad190143771af9d4' id='type-id-93'/>
      <!-- typedef void (*)(__sanitizer::uptr, __sanitizer::uptr) __sanitizer::LowLevelAllocateCallback -->
      <typedef-decl name='LowLevelAllocateCallback' type-id='type-id-98' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='116' column='1' hash='fd7a63c0c6c822c4' id='type-id-105'/>
      <!-- enum __sanitizer::AllocatorStat -->
      <enum-decl name='AllocatorStat' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='198' column='1' hash='72a4ca4ffcb04d90' id='type-id-106'>
        <underlying-type type-id='type-id-56'/>
        <enumerator name='AllocatorStatMalloced' value='0'/>
        <enumerator name='AllocatorStatFreed' value='1'/>
        <enumerator name='AllocatorStatMmapped' value='2'/>
        <enumerator name='AllocatorStatUnmapped' value='3'/>
        <enumerator name='AllocatorStatCount' value='4'/>
      </enum-decl>
      <!-- typedef void (*)(__sanitizer::uptr, void*) __sanitizer::ForEachChunkCallback -->
      <typedef-decl name='ForEachChunkCallback' type-id='type-id-107' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='284' column='1' hash='fd7a63c0c6c822c4' id='type-id-108'/>
      <!-- typedef __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> > __sanitizer::InternalAllocatorCache -->
      <typedef-decl name='InternalAllocatorCache' type-id='type-id-109' size-in-bits='441344' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator_internal.h' line='43' column='1' id='type-id-110'/>
      <!-- typedef __sanitizer::CombinedAllocator<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >, __sanitizer::LargeMmapAllocator<__sanitizer::CrashOnMapUnmap> > __sanitizer::InternalAllocator -->
      <typedef-decl name='InternalAllocator' type-id='type-id-111' size-in-bits='16940672' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator_internal.h' line='58' column='1' id='type-id-112'/>
      <!-- enum __sanitizer::memory_order -->
      <enum-decl name='memory_order' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='19' column='1' hash='3c57cb71e85bb581' id='type-id-113'>
        <underlying-type type-id='type-id-56'/>
        <enumerator name='memory_order_relaxed' value='1'/>
        <enumerator name='memory_order_consume' value='2'/>
        <enumerator name='memory_order_acquire' value='4'/>
        <enumerator name='memory_order_release' value='8'/>
        <enumerator name='memory_order_acq_rel' value='16'/>
        <enumerator name='memory_order_seq_cst' value='32'/>
      </enum-decl>
      <!-- typedef unsigned char __sanitizer::u8 -->
      <typedef-decl name='u8' type-id='type-id-18' size-in-bits='8' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='66' column='1' hash='6ebac62b3366db68' id='type-id-114'/>
      <!-- typedef unsigned long long int __sanitizer::u64 -->
      <typedef-decl name='u64' type-id='type-id-115' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='69' column='1' hash='ebdfc4685a1e82df' id='type-id-116'/>
    </namespace-decl>
    <!-- void (__sanitizer::uptr, __sanitizer::uptr) -->
    <function-type size-in-bits='64' hash='91495cdf6321a116' id='type-id-97'>
      <!-- parameter of type 'typedef __sanitizer::uptr' -->
      <parameter type-id='type-id-87'/>
      <!-- parameter of type 'typedef __sanitizer::uptr' -->
      <parameter type-id='type-id-87'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-type>
    <!-- void (const char*) -->
    <function-type size-in-bits='64' hash='53885bde0aa65efe' id='type-id-117'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-type>
    <!-- void (const char*, int, const char*, __sanitizer::u64, __sanitizer::u64) -->
    <function-type size-in-bits='64' hash='1aad1d4b8f47e2bf' id='type-id-118'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'typedef __sanitizer::u64' -->
      <parameter type-id='type-id-116'/>
      <!-- parameter of type 'typedef __sanitizer::u64' -->
      <parameter type-id='type-id-116'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-type>
    <!-- void (int) -->
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-119'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-type>
    <!-- void (void) -->
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-120'>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- __sanitizer::LoadedModule::AddressRange[6] -->
    <array-type-def dimensions='1' type-id='type-id-121' size-in-bits='768' hash='e7667f469e0dd311' id='type-id-122'>
      <!-- <anonymous range>[6] -->
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='type-id-123'/>
    </array-type-def>
    <!-- __sanitizer::InternalScopedString* -->
    <pointer-type-def type-id='type-id-124' size-in-bits='64' hash='dc093d0269e6cb7e' id='type-id-125'/>
    <!-- __sanitizer::LoadedModule* -->
    <pointer-type-def type-id='type-id-126' size-in-bits='64' hash='0292528703f77da6' id='type-id-127'/>
    <!-- __sanitizer::LoadedModule* const -->
    <qualified-type-def type-id='type-id-127' const='yes' hash='056087aa7cebba86' id='type-id-128'/>
    <!-- __sanitizer::StackTrace* -->
    <pointer-type-def type-id='type-id-129' size-in-bits='64' hash='39408408b98af71d' id='type-id-130'/>
    <!-- bool (*)(const unsigned long int&, const unsigned long int&) -->
    <pointer-type-def type-id='type-id-131' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-132'/>
    <!-- bool (*)(void*, char*, int) -->
    <pointer-type-def type-id='type-id-133' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-134'/>
    <!-- const __sanitizer::LoadedModule -->
    <qualified-type-def type-id='type-id-126' const='yes' hash='67f9b294e8737bc3' id='type-id-135'/>
    <!-- const __sanitizer::LoadedModule* -->
    <pointer-type-def type-id='type-id-135' size-in-bits='64' hash='434e0acc7197c282' id='type-id-136'/>
    <!-- const __sanitizer::LoadedModule* const -->
    <qualified-type-def type-id='type-id-136' const='yes' hash='3ae1076328acf369' id='type-id-137'/>
    <!-- const unsigned long int -->
    <qualified-type-def type-id='type-id-1' const='yes' hash='d8a94d28da6128a9#2' id='type-id-138'/>
    <!-- const unsigned long int& -->
    <reference-type-def kind='lvalue' type-id='type-id-138' size-in-bits='64' hash='5aea680f8e94fc20#2' id='type-id-139'/>
    <!-- unsigned long int** -->
    <pointer-type-def type-id='type-id-140' size-in-bits='64' hash='d73e3c43344d327f' id='type-id-141'/>
    <!-- void __sanitizer_set_report_path(const char*) -->
    <function-decl name='__sanitizer_set_report_path' mangled-name='__sanitizer_set_report_path' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_set_report_path' hash='53885bde0aa65efe'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-decl>
    <!-- void __sanitizer_sandbox_on_notify(void*) -->
    <function-decl name='__sanitizer_sandbox_on_notify' mangled-name='__sanitizer_sandbox_on_notify' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_sandbox_on_notify' hash='7f32ffea222edbe7'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-decl>
    <!-- void __sanitizer_report_error_summary(const char*) -->
    <function-decl name='__sanitizer_report_error_summary' mangled-name='__sanitizer_report_error_summary' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_report_error_summary' hash='53885bde0aa65efe'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-decl>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- class __sanitizer::InternalScopedString -->
      <class-decl name='InternalScopedString' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='88' column='1' hash='5aff20bd6f76397e' id='type-id-124'>
        <!-- class __sanitizer::InternalScopedBuffer<char> -->
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-142'/>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- __sanitizer::uptr __sanitizer::InternalScopedString::length_ -->
          <var-decl name='length_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='102' column='1'/>
        </data-member>
      </class-decl>
      <!-- class __sanitizer::LoadedModule -->
      <class-decl name='LoadedModule' visibility='default' size-in-bits='960' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='442' column='1' hash='1ce558d74dfae3bd' id='type-id-126'>
        <member-type access='private'>
          <!-- struct __sanitizer::LoadedModule::AddressRange -->
          <class-decl name='AddressRange' is-struct='yes' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='452' column='1' hash='4dbb5a5640cef4f1' id='type-id-121'>
            <data-member access='public' layout-offset-in-bits='0'>
              <!-- __sanitizer::uptr __sanitizer::LoadedModule::AddressRange::beg -->
              <var-decl name='beg' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='453' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <!-- __sanitizer::uptr __sanitizer::LoadedModule::AddressRange::end -->
              <var-decl name='end' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='454' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- char* __sanitizer::LoadedModule::full_name_ -->
          <var-decl name='full_name_' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='456' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- __sanitizer::uptr __sanitizer::LoadedModule::base_address_ -->
          <var-decl name='base_address_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='457' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- __sanitizer::LoadedModule::AddressRange __sanitizer::LoadedModule::ranges_[6] -->
          <var-decl name='ranges_' type-id='type-id-122' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='459' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='896'>
          <!-- __sanitizer::uptr __sanitizer::LoadedModule::n_ranges_ -->
          <var-decl name='n_ranges_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='460' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct __sanitizer::StackTrace -->
      <class-decl name='StackTrace' is-struct='yes' visibility='default' size-in-bits='16512' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='31' column='1' hash='e7600eb1652ecbd3' id='type-id-129'>
        <member-type access='public'>
          <!-- typedef bool (*)(void*, char*, int) __sanitizer::StackTrace::SymbolizeCallback -->
          <typedef-decl name='SymbolizeCallback' type-id='type-id-134' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='33' column='1' hash='fd7a63c0c6c822c4' id='type-id-143'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- __sanitizer::uptr __sanitizer::StackTrace::top_frame_bp -->
          <var-decl name='top_frame_bp' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- __sanitizer::uptr __sanitizer::StackTrace::size -->
          <var-decl name='size' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='35' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <!-- unsigned long int __sanitizer::StackTrace::trace[256] -->
          <var-decl name='trace' type-id='type-id-144' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='36' column='1'/>
        </data-member>
      </class-decl>
      <!-- typedef void (*)(void) __sanitizer::DieCallbackType -->
      <typedef-decl name='DieCallbackType' type-id='type-id-145' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='202' column='1' hash='fd7a63c0c6c822c4' id='type-id-146'/>
      <!-- class __sanitizer::Symbolizer -->
      <class-decl name='Symbolizer' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='64' column='1' hash='2dc9d581460df942' id='type-id-147'>
        <member-type access='protected'>
          <!-- class __sanitizer::Symbolizer::SymbolizerScope -->
          <class-decl name='SymbolizerScope' visibility='default' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='133' column='1' hash='6f614d488b22bea4' id='type-id-148'>
            <data-member access='private' layout-offset-in-bits='0'>
              <!-- const __sanitizer::Symbolizer* __sanitizer::Symbolizer::SymbolizerScope::sym_ -->
              <var-decl name='sym_' type-id='type-id-149' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='138' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <!-- typedef void (*)(void) __sanitizer::Symbolizer::EndSymbolizationHook -->
          <typedef-decl name='EndSymbolizationHook' type-id='type-id-145' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='111' column='1' hash='fd7a63c0c6c822c4' id='type-id-150'/>
        </member-type>
        <member-type access='public'>
          <!-- typedef void (*)(void) __sanitizer::Symbolizer::StartSymbolizationHook -->
          <typedef-decl name='StartSymbolizationHook' type-id='type-id-145' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='110' column='1' hash='fd7a63c0c6c822c4' id='type-id-151'/>
        </member-type>
        <data-member access='public' static='yes'>
          <!-- static __sanitizer::Symbolizer* __sanitizer::Symbolizer::symbolizer_ -->
          <var-decl name='symbolizer_' type-id='type-id-152' mangled-name='_ZN11__sanitizer10Symbolizer11symbolizer_E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.cc' line='19' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <!-- static __sanitizer::StaticSpinMutex __sanitizer::Symbolizer::init_mu_ -->
          <var-decl name='init_mu_' type-id='type-id-153' mangled-name='_ZN11__sanitizer10Symbolizer8init_mu_E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.cc' line='20' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <!-- static __sanitizer::LowLevelAllocator __sanitizer::Symbolizer::symbolizer_allocator_ -->
          <var-decl name='symbolizer_allocator_' type-id='type-id-90' mangled-name='_ZN11__sanitizer10Symbolizer21symbolizer_allocator_E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.cc' line='21' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <!-- __sanitizer::Symbolizer::StartSymbolizationHook __sanitizer::Symbolizer::start_hook_ -->
          <var-decl name='start_hook_' type-id='type-id-151' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='131' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='128'>
          <!-- __sanitizer::Symbolizer::EndSymbolizationHook __sanitizer::Symbolizer::end_hook_ -->
          <var-decl name='end_hook_' type-id='type-id-150' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='132' column='1'/>
        </data-member>
        <member-function access='public' vtable-offset='0'>
          <!-- __sanitizer::uptr __sanitizer::Symbolizer::SymbolizeCode(__sanitizer::uptr, __sanitizer::AddressInfo*, __sanitizer::uptr) -->
          <function-decl name='SymbolizeCode' mangled-name='_ZN11__sanitizer10Symbolizer13SymbolizeCodeEmPNS_11AddressInfoEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64' hash='25cd40cd27039a9f'>
            <!-- implicit parameter of type '__sanitizer::Symbolizer*' -->
            <parameter type-id='type-id-152' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='type-id-87' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='85' column='1'/>
            <!-- parameter of type '__sanitizer::AddressInfo*' -->
            <parameter type-id='type-id-154' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='85' column='1'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='type-id-87' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='86' column='1'/>
            <!-- typedef __sanitizer::uptr -->
            <return type-id='type-id-87'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='1'>
          <!-- bool __sanitizer::Symbolizer::SymbolizeData(__sanitizer::uptr, __sanitizer::DataInfo*) -->
          <function-decl name='SymbolizeData' mangled-name='_ZN11__sanitizer10Symbolizer13SymbolizeDataEmPNS_8DataInfoE' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64' hash='ec014b6e6334a8bc'>
            <!-- implicit parameter of type '__sanitizer::Symbolizer*' -->
            <parameter type-id='type-id-152' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='type-id-87' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='89' column='1'/>
            <!-- parameter of type '__sanitizer::DataInfo*' -->
            <parameter type-id='type-id-155' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='89' column='1'/>
            <!-- bool -->
            <return type-id='type-id-156'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='2'>
          <!-- bool __sanitizer::Symbolizer::IsAvailable() -->
          <function-decl name='IsAvailable' mangled-name='_ZN11__sanitizer10Symbolizer11IsAvailableEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64' hash='c7c710e908194b91'>
            <!-- implicit parameter of type '__sanitizer::Symbolizer*' -->
            <parameter type-id='type-id-152' is-artificial='yes'/>
            <!-- bool -->
            <return type-id='type-id-156'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <!-- bool __sanitizer::Symbolizer::IsExternalAvailable() -->
          <function-decl name='IsExternalAvailable' mangled-name='_ZN11__sanitizer10Symbolizer19IsExternalAvailableEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64' hash='c7c710e908194b91'>
            <!-- implicit parameter of type '__sanitizer::Symbolizer*' -->
            <parameter type-id='type-id-152' is-artificial='yes'/>
            <!-- bool -->
            <return type-id='type-id-156'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <!-- void __sanitizer::Symbolizer::Flush() -->
          <function-decl name='Flush' mangled-name='_ZN11__sanitizer10Symbolizer5FlushEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type '__sanitizer::Symbolizer*' -->
            <parameter type-id='type-id-152' is-artificial='yes'/>
            <!-- void -->
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='5'>
          <!-- const char* __sanitizer::Symbolizer::Demangle(const char*) -->
          <function-decl name='Demangle' mangled-name='_ZN11__sanitizer10Symbolizer8DemangleEPKc' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64' hash='3d5693612af11c46'>
            <!-- implicit parameter of type '__sanitizer::Symbolizer*' -->
            <parameter type-id='type-id-152' is-artificial='yes'/>
            <!-- parameter of type 'const char*' -->
            <parameter type-id='type-id-4'/>
            <!-- const char* -->
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='6'>
          <!-- void __sanitizer::Symbolizer::PrepareForSandboxing() -->
          <function-decl name='PrepareForSandboxing' mangled-name='_ZN11__sanitizer10Symbolizer20PrepareForSandboxingEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type '__sanitizer::Symbolizer*' -->
            <parameter type-id='type-id-152' is-artificial='yes'/>
            <!-- void -->
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <!-- void __sanitizer::CheckFailed(const char*, int, const char*, __sanitizer::u64, __sanitizer::u64) -->
      <function-decl name='CheckFailed' mangled-name='_ZN11__sanitizer11CheckFailedEPKciS1_yy' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11__sanitizer11CheckFailedEPKciS1_yy' hash='1aad1d4b8f47e2bf'>
        <!-- parameter of type 'const char*' -->
        <parameter type-id='type-id-4'/>
        <!-- parameter of type 'int' -->
        <parameter type-id='type-id-6'/>
        <!-- parameter of type 'const char*' -->
        <parameter type-id='type-id-4'/>
        <!-- parameter of type 'typedef __sanitizer::u64' -->
        <parameter type-id='type-id-116'/>
        <!-- parameter of type 'typedef __sanitizer::u64' -->
        <parameter type-id='type-id-116'/>
        <!-- void -->
        <return type-id='type-id-31'/>
      </function-decl>
      <!-- typedef void (*)(const char*, int, const char*, __sanitizer::u64, __sanitizer::u64) __sanitizer::CheckFailedCallbackType -->
      <typedef-decl name='CheckFailedCallbackType' type-id='type-id-157' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='205' column='1' hash='fd7a63c0c6c822c4' id='type-id-158'/>
      <!-- typedef int __sanitizer::fd_t -->
      <typedef-decl name='fd_t' type-id='type-id-6' size-in-bits='32' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='74' column='1' hash='09d17c08f594edc7' id='type-id-159'/>
    </namespace-decl>
    <!-- bool (const unsigned long int&, const unsigned long int&) -->
    <function-type size-in-bits='64' hash='6b05c161826cdf1a' id='type-id-131'>
      <!-- parameter of type 'const unsigned long int&' -->
      <parameter type-id='type-id-139'/>
      <!-- parameter of type 'const unsigned long int&' -->
      <parameter type-id='type-id-139'/>
      <!-- bool -->
      <return type-id='type-id-156'/>
    </function-type>
    <!-- bool (void*, char*, int) -->
    <function-type size-in-bits='64' hash='444e544ba02da0ee' id='type-id-133'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-28'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6'/>
      <!-- bool -->
      <return type-id='type-id-156'/>
    </function-type>
    <!-- void (void*, __sanitizer::uptr) -->
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-160'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'typedef __sanitizer::uptr' -->
      <parameter type-id='type-id-87'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-type>
    <!-- __sanitizer::uptr (__sanitizer::Symbolizer::*) (__sanitizer::uptr, __sanitizer::AddressInfo*, __sanitizer::uptr) -->
    <function-type method-class-id='type-id-147' size-in-bits='64' hash='25cd40cd27039a9f' id='type-id-161'>
      <!-- implicit parameter of type '__sanitizer::Symbolizer*' -->
      <parameter type-id='type-id-152' is-artificial='yes'/>
      <!-- parameter of type 'typedef __sanitizer::uptr' -->
      <parameter type-id='type-id-87' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='85' column='1'/>
      <!-- parameter of type '__sanitizer::AddressInfo*' -->
      <parameter type-id='type-id-154' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='85' column='1'/>
      <!-- parameter of type 'typedef __sanitizer::uptr' -->
      <parameter type-id='type-id-87' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='86' column='1'/>
      <!-- typedef __sanitizer::uptr -->
      <return type-id='type-id-87'/>
    </function-type>
    <!-- bool (__sanitizer::Symbolizer::*) () -->
    <function-type method-class-id='type-id-147' size-in-bits='64' hash='c7c710e908194b91' id='type-id-162'>
      <!-- implicit parameter of type '__sanitizer::Symbolizer*' -->
      <parameter type-id='type-id-152' is-artificial='yes'/>
      <!-- bool -->
      <return type-id='type-id-156'/>
    </function-type>
    <!-- bool (__sanitizer::Symbolizer::*) (__sanitizer::uptr, __sanitizer::DataInfo*) -->
    <function-type method-class-id='type-id-147' size-in-bits='64' hash='ec014b6e6334a8bc' id='type-id-163'>
      <!-- implicit parameter of type '__sanitizer::Symbolizer*' -->
      <parameter type-id='type-id-152' is-artificial='yes'/>
      <!-- parameter of type 'typedef __sanitizer::uptr' -->
      <parameter type-id='type-id-87' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='89' column='1'/>
      <!-- parameter of type '__sanitizer::DataInfo*' -->
      <parameter type-id='type-id-155' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='89' column='1'/>
      <!-- bool -->
      <return type-id='type-id-156'/>
    </function-type>
    <!-- const char* (__sanitizer::Symbolizer::*) (const char*) -->
    <function-type method-class-id='type-id-147' size-in-bits='64' hash='3d5693612af11c46' id='type-id-164'>
      <!-- implicit parameter of type '__sanitizer::Symbolizer*' -->
      <parameter type-id='type-id-152' is-artificial='yes'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- const char* -->
      <return type-id='type-id-4'/>
    </function-type>
    <!-- void (__sanitizer::Symbolizer::*) () -->
    <function-type method-class-id='type-id-147' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-165'>
      <!-- implicit parameter of type '__sanitizer::Symbolizer*' -->
      <parameter type-id='type-id-152' is-artificial='yes'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_common_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_coverage.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- __sanitizer::InternalMmapVector<long unsigned int>* -->
    <pointer-type-def type-id='type-id-166' size-in-bits='64' hash='37b410eb8b10f623' id='type-id-167'/>
    <!-- __sanitizer::InternalMmapVector<long unsigned int>* const -->
    <qualified-type-def type-id='type-id-167' const='yes' hash='287766d5e4ab629c' id='type-id-168'/>
    <!-- __sanitizer::InternalMmapVector<unsigned int>* -->
    <pointer-type-def type-id='type-id-169' size-in-bits='64' hash='d37ba974318082f6' id='type-id-170'/>
    <!-- __sanitizer::InternalMmapVector<unsigned int>* const -->
    <qualified-type-def type-id='type-id-170' const='yes' hash='a6b6ee215b8c8837' id='type-id-171'/>
    <!-- const __sanitizer::InternalMmapVector<long unsigned int> -->
    <qualified-type-def type-id='type-id-166' const='yes' hash='3744ce03666d1157' id='type-id-172'/>
    <!-- const __sanitizer::InternalMmapVector<long unsigned int>& -->
    <reference-type-def kind='lvalue' type-id='type-id-172' size-in-bits='64' hash='51a4326a037fdf9a' id='type-id-173'/>
    <!-- const __sanitizer::InternalMmapVector<long unsigned int>* -->
    <pointer-type-def type-id='type-id-172' size-in-bits='64' hash='23c94f7b5e5de60d' id='type-id-174'/>
    <!-- const __sanitizer::InternalMmapVector<long unsigned int>* const -->
    <qualified-type-def type-id='type-id-174' const='yes' hash='9792afcfbfe392a8' id='type-id-175'/>
    <!-- const __sanitizer::InternalMmapVector<unsigned int> -->
    <qualified-type-def type-id='type-id-169' const='yes' hash='33713c6470efa09e' id='type-id-176'/>
    <!-- const __sanitizer::InternalMmapVector<unsigned int>& -->
    <reference-type-def kind='lvalue' type-id='type-id-176' size-in-bits='64' hash='f3a9583d9f03baf1' id='type-id-177'/>
    <!-- const __sanitizer::InternalMmapVector<unsigned int>* -->
    <pointer-type-def type-id='type-id-176' size-in-bits='64' hash='7618a48ba4b5f8b3' id='type-id-178'/>
    <!-- const __sanitizer::InternalMmapVector<unsigned int>* const -->
    <qualified-type-def type-id='type-id-178' const='yes' hash='f9a1e5ce970ba082' id='type-id-179'/>
    <!-- const unsigned int -->
    <qualified-type-def type-id='type-id-180' const='yes' hash='6e5b7fbd041269f4' id='type-id-181'/>
    <!-- const unsigned int& -->
    <reference-type-def kind='lvalue' type-id='type-id-181' size-in-bits='64' hash='a2578beb6ca2184c' id='type-id-182'/>
    <!-- const unsigned int* -->
    <pointer-type-def type-id='type-id-181' size-in-bits='64' hash='7b228ce973c39aff' id='type-id-183'/>
    <!-- const unsigned long int* -->
    <pointer-type-def type-id='type-id-138' size-in-bits='64' hash='3cecca488cd00e0d#2' id='type-id-184'/>
    <!-- unsigned int& -->
    <reference-type-def kind='lvalue' type-id='type-id-180' size-in-bits='64' hash='a22afb13109fd39d' id='type-id-185'/>
    <!-- void __sanitizer_cov(void*) -->
    <function-decl name='__sanitizer_cov' mangled-name='__sanitizer_cov' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_coverage.cc' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_cov' hash='7f32ffea222edbe7'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-decl>
    <!-- void __sanitizer_cov_dump() -->
    <function-decl name='__sanitizer_cov_dump' mangled-name='__sanitizer_cov_dump' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_coverage.cc' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_cov_dump' hash='7f32ffea222edbe7'>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-decl>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- class __sanitizer::InternalMmapVector<long unsigned int> -->
      <class-decl name='InternalMmapVector&lt;long unsigned int&gt;' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='320' column='1' hash='bc399a347d7d6190' id='type-id-166'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- unsigned long int* __sanitizer::InternalMmapVector<long unsigned int>::data_ -->
          <var-decl name='data_' type-id='type-id-140' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='382' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- __sanitizer::uptr __sanitizer::InternalMmapVector<long unsigned int>::capacity_ -->
          <var-decl name='capacity_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='383' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- __sanitizer::uptr __sanitizer::InternalMmapVector<long unsigned int>::size_ -->
          <var-decl name='size_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='384' column='1'/>
        </data-member>
      </class-decl>
      <!-- class __sanitizer::InternalMmapVector<unsigned int> -->
      <class-decl name='InternalMmapVector&lt;unsigned int&gt;' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='320' column='1' hash='751815d654f2dc76' id='type-id-169'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- unsigned int* __sanitizer::InternalMmapVector<unsigned int>::data_ -->
          <var-decl name='data_' type-id='type-id-186' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='382' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- __sanitizer::uptr __sanitizer::InternalMmapVector<unsigned int>::capacity_ -->
          <var-decl name='capacity_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='383' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- __sanitizer::uptr __sanitizer::InternalMmapVector<unsigned int>::size_ -->
          <var-decl name='size_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='384' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_flags.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- typedef long long int __sanitizer::s64 -->
      <typedef-decl name='s64' type-id='type-id-187' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='73' column='1' hash='5ae7f9eec1fc43d6' id='type-id-188'/>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_libc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- struct __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> > -->
      <class-decl name='SizeClassAllocatorLocalCache&lt;__sanitizer::SizeClassAllocator32&lt;0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap&lt;17ul, 64ul, 14ul&gt;, 24ul, __sanitizer::TwoLevelByteMap&lt;2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback&gt;, __sanitizer::NoOpMapUnmapCallback&gt; &gt;' is-struct='yes' visibility='default' size-in-bits='441344' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='889' column='1' hash='29c841a968bf73d6' id='type-id-109'>
        <member-type access='public'>
          <!-- struct __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::PerClass -->
          <class-decl name='PerClass' is-struct='yes' visibility='default' size-in-bits='8320' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='942' column='1' hash='7277531e5c0a53cc' id='type-id-189'>
            <data-member access='public' layout-offset-in-bits='0'>
              <!-- __sanitizer::uptr __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::PerClass::count -->
              <var-decl name='count' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='943' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <!-- __sanitizer::uptr __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::PerClass::max_count -->
              <var-decl name='max_count' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='944' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <!-- void* __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::PerClass::batch[128] -->
              <var-decl name='batch' type-id='type-id-190' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='945' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <!-- typedef __sanitizer::SizeClassMap<17ul, 64ul, 14ul>::TransferBatch __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::Batch -->
          <typedef-decl name='Batch' type-id='type-id-103' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='941' column='1' id='type-id-191'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::PerClass __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::per_class_[53] -->
          <var-decl name='per_class_' type-id='type-id-192' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='947' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='440960'>
          <!-- __sanitizer::AllocatorStats __sanitizer::SizeClassAllocatorLocalCache<__sanitizer::SizeClassAllocator32<0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap<17ul, 64ul, 14ul>, 24ul, __sanitizer::TwoLevelByteMap<2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback>, __sanitizer::NoOpMapUnmapCallback> >::stats_ -->
          <var-decl name='stats_' type-id='type-id-193' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='948' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- __sanitizer::LibIgnore* const -->
    <qualified-type-def type-id='type-id-194' const='yes' hash='511a84126e604852' id='type-id-195'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- class __sanitizer::InternalMmapVector<__sanitizer::Suppression*> -->
      <class-decl name='InternalMmapVector&lt;__sanitizer::Suppression*&gt;' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='320' column='1' hash='10a7690341119695' id='type-id-196'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- __sanitizer::Suppression** __sanitizer::InternalMmapVector<__sanitizer::Suppression*>::data_ -->
          <var-decl name='data_' type-id='type-id-197' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='382' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- __sanitizer::uptr __sanitizer::InternalMmapVector<__sanitizer::Suppression*>::capacity_ -->
          <var-decl name='capacity_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='383' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- __sanitizer::uptr __sanitizer::InternalMmapVector<__sanitizer::Suppression*>::size_ -->
          <var-decl name='size_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='384' column='1'/>
        </data-member>
      </class-decl>
      <!-- enum __sanitizer::SuppressionType -->
      <enum-decl name='SuppressionType' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_suppressions.h' line='19' column='1' hash='67963126f34f1d81' id='type-id-198'>
        <underlying-type type-id='type-id-56'/>
        <enumerator name='SuppressionNone' value='0'/>
        <enumerator name='SuppressionRace' value='1'/>
        <enumerator name='SuppressionMutex' value='2'/>
        <enumerator name='SuppressionThread' value='3'/>
        <enumerator name='SuppressionSignal' value='4'/>
        <enumerator name='SuppressionLeak' value='5'/>
        <enumerator name='SuppressionLib' value='6'/>
        <enumerator name='SuppressionTypeCount' value='7'/>
      </enum-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- char[256] -->
    <array-type-def dimensions='1' type-id='type-id-199' size-in-bits='2048' hash='b1acd4e4c2ca8eab' id='type-id-200'>
      <!-- <anonymous range>[256] -->
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='type-id-201'/>
    </array-type-def>
    <!-- struct Elf64_Dyn -->
    <class-decl name='Elf64_Dyn' is-struct='yes' naming-typedef-id='type-id-202' visibility='default' size-in-bits='128' filepath='/usr/include/elf.h' line='643' column='1' hash='fe10d98cdb17c2d2' id='type-id-203'>
      <member-type access='public'>
        <!-- union {Elf64_Xword d_val; Elf64_Addr d_ptr;} -->
        <union-decl name='__anonymous_union__' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='/usr/include/elf.h' line='646' column='1' hash='ae366dda56a7307c' id='type-id-204'>
          <data-member access='public'>
            <!-- Elf64_Xword d_val -->
            <var-decl name='d_val' type-id='type-id-205' visibility='default' filepath='/usr/include/elf.h' line='647' column='1'/>
          </data-member>
          <data-member access='public'>
            <!-- Elf64_Addr d_ptr -->
            <var-decl name='d_ptr' type-id='type-id-206' visibility='default' filepath='/usr/include/elf.h' line='648' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Elf64_Sxword Elf64_Dyn::d_tag -->
        <var-decl name='d_tag' type-id='type-id-207' visibility='default' filepath='/usr/include/elf.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- union {Elf64_Xword d_val; Elf64_Addr d_ptr;} Elf64_Dyn::d_un -->
        <var-decl name='d_un' type-id='type-id-204' visibility='default' filepath='/usr/include/elf.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct link_map -->
    <class-decl name='link_map' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/include/link.h' line='85' column='1' hash='124c4e0a403ca2e6' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- Elf64_Addr link_map::l_addr -->
        <var-decl name='l_addr' type-id='type-id-206' visibility='default' filepath='/usr/include/link.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- char* link_map::l_name -->
        <var-decl name='l_name' type-id='type-id-28' visibility='default' filepath='/usr/include/link.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- Elf64_Dyn* link_map::l_ld -->
        <var-decl name='l_ld' type-id='type-id-209' visibility='default' filepath='/usr/include/link.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- link_map* link_map::l_next -->
        <var-decl name='l_next' type-id='type-id-210' visibility='default' filepath='/usr/include/link.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- link_map* link_map::l_prev -->
        <var-decl name='l_prev' type-id='type-id-210' visibility='default' filepath='/usr/include/link.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct sigaltstack -->
    <class-decl name='sigaltstack' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/bits/sigstack.h' line='50' column='1' hash='c19f43ea42846939' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* sigaltstack::ss_sp -->
        <var-decl name='ss_sp' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/sigstack.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int sigaltstack::ss_flags -->
        <var-decl name='ss_flags' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/sigstack.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- size_t sigaltstack::ss_size -->
        <var-decl name='ss_size' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/sigstack.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef Elf64_Dyn Elf64_Dyn -->
    <typedef-decl name='Elf64_Dyn' type-id='type-id-203' size-in-bits='128' filepath='/usr/include/elf.h' line='650' column='1' id='type-id-202'/>
    <!-- typedef int64_t Elf64_Sxword -->
    <typedef-decl name='Elf64_Sxword' type-id='type-id-212' size-in-bits='64' filepath='/usr/include/elf.h' line='46' column='1' hash='b119fe0931d2ee10' id='type-id-207'/>
    <!-- typedef long int int64_t -->
    <typedef-decl name='int64_t' type-id='type-id-40' size-in-bits='64' filepath='/usr/include/sys/types.h' line='198' column='1' hash='b119fe0931d2ee10' id='type-id-212'/>
    <!-- Elf64_Dyn* -->
    <pointer-type-def type-id='type-id-202' size-in-bits='64' hash='3206d1002e26588e' id='type-id-209'/>
    <!-- __sanitizer::BlockingMutex* const -->
    <qualified-type-def type-id='type-id-213' const='yes' hash='e01e5630379fda29' id='type-id-214'/>
    <!-- __sanitizer::MemoryMappingLayout* -->
    <pointer-type-def type-id='type-id-215' size-in-bits='64' hash='e95c7d509c86c421' id='type-id-216'/>
    <!-- __sanitizer::MemoryMappingLayout* const -->
    <qualified-type-def type-id='type-id-216' const='yes' hash='1a1fb61c957e9fb1' id='type-id-217'/>
    <!-- __sanitizer::ThreadLister* -->
    <pointer-type-def type-id='type-id-218' size-in-bits='64' hash='1149b23fc6efa315' id='type-id-219'/>
    <!-- __sanitizer::ThreadLister* const -->
    <qualified-type-def type-id='type-id-219' const='yes' hash='823e90432d0dab43' id='type-id-220'/>
    <!-- __sanitizer::__sanitizer_kernel_sigaction_t* -->
    <pointer-type-def type-id='type-id-221' size-in-bits='64' hash='01c3cae7e870eb9a' id='type-id-222'/>
    <!-- __sanitizer::linux_dirent* -->
    <pointer-type-def type-id='type-id-223' size-in-bits='64' hash='621d78dc8b27a169' id='type-id-224'/>
    <!-- char* const -->
    <qualified-type-def type-id='type-id-28' const='yes' hash='351aa155d9983c83' id='type-id-225'/>
    <!-- char* const* -->
    <pointer-type-def type-id='type-id-225' size-in-bits='64' hash='789df74c745bc4e9' id='type-id-226'/>
    <!-- const __sanitizer::__sanitizer_kernel_sigaction_t -->
    <qualified-type-def type-id='type-id-221' const='yes' hash='458926da4923f9cb' id='type-id-227'/>
    <!-- const __sanitizer::__sanitizer_kernel_sigaction_t* -->
    <pointer-type-def type-id='type-id-227' size-in-bits='64' hash='cf00ff6d2322dc0d' id='type-id-228'/>
    <!-- const sigaltstack -->
    <qualified-type-def type-id='type-id-211' const='yes' hash='d6a53cdc94d219d7' id='type-id-229'/>
    <!-- const sigaltstack* -->
    <pointer-type-def type-id='type-id-229' size-in-bits='64' hash='1ffe3482ef2b665d' id='type-id-230'/>
    <!-- int (*)(void*) -->
    <pointer-type-def type-id='type-id-231' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-232'/>
    <!-- link_map* -->
    <pointer-type-def type-id='type-id-208' size-in-bits='64' hash='90f68929c8bd68b8' id='type-id-210'/>
    <!-- sigaltstack* -->
    <pointer-type-def type-id='type-id-211' size-in-bits='64' hash='49dbed255dc32841' id='type-id-233'/>
    <!-- void (*)(int, void*, void*) -->
    <pointer-type-def type-id='type-id-234' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-235'/>
    <!-- void (*)(void*, __sanitizer::uptr) -->
    <pointer-type-def type-id='type-id-160' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-236'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- class __sanitizer::MemoryMappingLayout -->
      <class-decl name='MemoryMappingLayout' visibility='default' size-in-bits='256' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='42' column='1' hash='c4b64c99398fc77b' id='type-id-215'>
        <data-member access='public' static='yes'>
          <!-- static __sanitizer::ProcSelfMapsBuff __sanitizer::MemoryMappingLayout::cached_proc_self_maps_ -->
          <var-decl name='cached_proc_self_maps_' type-id='type-id-237' mangled-name='_ZN11__sanitizer19MemoryMappingLayout22cached_proc_self_maps_E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='321' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <!-- static __sanitizer::StaticSpinMutex __sanitizer::MemoryMappingLayout::cache_lock_ -->
          <var-decl name='cache_lock_' type-id='type-id-153' mangled-name='_ZN11__sanitizer19MemoryMappingLayout11cache_lock_E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='322' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- __sanitizer::ProcSelfMapsBuff __sanitizer::MemoryMappingLayout::proc_self_maps_ -->
          <var-decl name='proc_self_maps_' type-id='type-id-237' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='100' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <!-- char* __sanitizer::MemoryMappingLayout::current_ -->
          <var-decl name='current_' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='101' column='1'/>
        </data-member>
      </class-decl>
      <!-- class __sanitizer::ThreadLister -->
      <class-decl name='ThreadLister' visibility='default' size-in-bits='384' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='46' column='1' hash='6a4b4a8a7c45757c' id='type-id-218'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- int __sanitizer::ThreadLister::pid_ -->
          <var-decl name='pid_' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='59' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='32'>
          <!-- int __sanitizer::ThreadLister::descriptor_ -->
          <var-decl name='descriptor_' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='60' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- __sanitizer::InternalScopedBuffer<char> __sanitizer::ThreadLister::buffer_ -->
          <var-decl name='buffer_' type-id='type-id-142' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='61' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <!-- bool __sanitizer::ThreadLister::error_ -->
          <var-decl name='error_' type-id='type-id-156' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='62' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <!-- __sanitizer::linux_dirent* __sanitizer::ThreadLister::entry_ -->
          <var-decl name='entry_' type-id='type-id-224' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='63' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='320'>
          <!-- int __sanitizer::ThreadLister::bytes_read_ -->
          <var-decl name='bytes_read_' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct __sanitizer::ProcSelfMapsBuff -->
      <class-decl name='ProcSelfMapsBuff' is-struct='yes' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='35' column='1' hash='e4bef2058ca7c3c7' id='type-id-237'>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- char* __sanitizer::ProcSelfMapsBuff::data -->
          <var-decl name='data' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='36' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- __sanitizer::uptr __sanitizer::ProcSelfMapsBuff::mmaped_size -->
          <var-decl name='mmaped_size' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <!-- __sanitizer::uptr __sanitizer::ProcSelfMapsBuff::len -->
          <var-decl name='len' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='38' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct __sanitizer::__sanitizer_kernel_sigaction_t -->
      <class-decl name='__sanitizer_kernel_sigaction_t' is-struct='yes' visibility='default' size-in-bits='256' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='423' column='1' hash='2011cc95858d6767' id='type-id-221'>
        <member-type access='public'>
          <!-- union {void (* sigaction)(int, void*, void*); void (* handler)(int);} -->
          <union-decl name='__anonymous_union__' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='424' column='1' hash='8adc7ec905fb1aa7#4' id='type-id-238'>
            <data-member access='public'>
              <!-- void (* sigaction)(int, void*, void*) -->
              <var-decl name='sigaction' type-id='type-id-235' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='425' column='1'/>
            </data-member>
            <data-member access='public'>
              <!-- void (* handler)(int) -->
              <var-decl name='handler' type-id='type-id-239' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='426' column='1'/>
            </data-member>
          </union-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- union {void (* sigaction)(int, void*, void*); void (* handler)(int);} -->
          <var-decl name='' type-id='type-id-238' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- unsigned long int __sanitizer::__sanitizer_kernel_sigaction_t::sa_flags -->
          <var-decl name='sa_flags' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='428' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <!-- void (* __sanitizer::__sanitizer_kernel_sigaction_t::sa_restorer)(void) -->
          <var-decl name='sa_restorer' type-id='type-id-145' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='429' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <!-- __sanitizer::__sanitizer_kernel_sigset_t __sanitizer::__sanitizer_kernel_sigaction_t::sa_mask -->
          <var-decl name='sa_mask' type-id='type-id-240' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='430' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct __sanitizer::linux_dirent -->
      <class-decl name='linux_dirent' is-struct='yes' visibility='default' size-in-bits='2240' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='565' column='1' hash='3de15d923e0da3fa' id='type-id-223'>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- unsigned long int __sanitizer::linux_dirent::d_ino -->
          <var-decl name='d_ino' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='566' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- unsigned long int __sanitizer::linux_dirent::d_off -->
          <var-decl name='d_off' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='567' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <!-- unsigned short int __sanitizer::linux_dirent::d_reclen -->
          <var-decl name='d_reclen' type-id='type-id-241' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='568' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='144'>
          <!-- char __sanitizer::linux_dirent::d_name[256] -->
          <var-decl name='d_name' type-id='type-id-200' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='569' column='1'/>
        </data-member>
      </class-decl>
      <!-- typedef unsigned int __sanitizer::u32 -->
      <typedef-decl name='u32' type-id='type-id-180' size-in-bits='32' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='68' column='1' hash='e66b43f97c38e87a' id='type-id-242'/>
      <!-- typedef __sanitizer::u64 __sanitizer::OFF_T -->
      <typedef-decl name='OFF_T' type-id='type-id-116' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='81' column='1' hash='ebdfc4685a1e82df' id='type-id-243'/>
      <!-- typedef void (*)(__sanitizer::uptr, __sanitizer::uptr, bool, __sanitizer::uptr*, __sanitizer::uptr) __sanitizer::fill_profile_f -->
      <typedef-decl name='fill_profile_f' type-id='type-id-244' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='119' column='1' hash='fd7a63c0c6c822c4' id='type-id-245'/>
    </namespace-decl>
    <!-- int (void*) -->
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-231'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-type>
    <!-- void (int, void*, void*) -->
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-234'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-type>
    <!-- bool (const char*) -->
    <function-type size-in-bits='64' hash='19a1d02fa5635f5c' id='type-id-246'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- bool -->
      <return type-id='type-id-156'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_linux_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- char[56] -->
    <array-type-def dimensions='1' type-id='type-id-199' size-in-bits='448' hash='b9acc09cd17d593e' id='type-id-247'>
      <!-- <anonymous range>[56] -->
      <subrange length='56' lower-bound='0' upper-bound='55' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='1911f4cdae5d7aa5' id='type-id-248'/>
    </array-type-def>
    <!-- enum _Unwind_Reason_Code -->
    <enum-decl name='_Unwind_Reason_Code' naming-typedef-id='type-id-249' linkage-name='19_Unwind_Reason_Code' size-in-bits='32' alignment-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/host-x86_64-unknown-linux-gnu/gcc/include/unwind.h' line='66' column='1' hash='bbc6671cb57edbd5' id='type-id-250'>
      <underlying-type type-id='type-id-56'/>
      <enumerator name='_URC_NO_REASON' value='0'/>
      <enumerator name='_URC_FOREIGN_EXCEPTION_CAUGHT' value='1'/>
      <enumerator name='_URC_FATAL_PHASE2_ERROR' value='2'/>
      <enumerator name='_URC_FATAL_PHASE1_ERROR' value='3'/>
      <enumerator name='_URC_NORMAL_STOP' value='4'/>
      <enumerator name='_URC_END_OF_STACK' value='5'/>
      <enumerator name='_URC_HANDLER_FOUND' value='6'/>
      <enumerator name='_URC_INSTALL_CONTEXT' value='7'/>
      <enumerator name='_URC_CONTINUE_UNWIND' value='8'/>
    </enum-decl>
    <!-- typedef unsigned long int _Unwind_Ptr -->
    <typedef-decl name='_Unwind_Ptr' type-id='type-id-1' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/host-x86_64-unknown-linux-gnu/gcc/include/unwind.h' line='53' column='1' hash='8fdc5eea2983a729' id='type-id-251'/>
    <!-- typedef _Unwind_Reason_Code _Unwind_Reason_Code -->
    <typedef-decl name='_Unwind_Reason_Code' type-id='type-id-250' size-in-bits='32' alignment-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/host-x86_64-unknown-linux-gnu/gcc/include/unwind.h' line='76' column='1' hash='bbc6671cb57edbd5' id='type-id-249'/>
    <!-- typedef pthread_attr_t pthread_attr_t -->
    <typedef-decl name='pthread_attr_t' type-id='type-id-252' size-in-bits='448' filepath='/usr/include/bits/pthreadtypes.h' line='57' column='1' id='type-id-253'/>
    <!-- union pthread_attr_t -->
    <union-decl name='pthread_attr_t' naming-typedef-id='type-id-253' visibility='default' size-in-bits='448' filepath='/usr/include/bits/pthreadtypes.h' line='54' column='1' hash='f1fee08f614bcebf' id='type-id-252'>
      <data-member access='public'>
        <!-- char pthread_attr_t::__size[56] -->
        <var-decl name='__size' type-id='type-id-247' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='55' column='1'/>
      </data-member>
      <data-member access='public'>
        <!-- long int pthread_attr_t::__align -->
        <var-decl name='__align' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='56' column='1'/>
      </data-member>
    </union-decl>
    <!-- __sanitizer::StackTrace* const -->
    <qualified-type-def type-id='type-id-130' const='yes' hash='72cfd84015ae84bd' id='type-id-254'/>
    <!-- bool (*)(const char*) -->
    <pointer-type-def type-id='type-id-246' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-255'/>
    <!-- const pthread_attr_t -->
    <qualified-type-def type-id='type-id-253' const='yes' hash='13a03dff5e111f90' id='type-id-256'/>
    <!-- const pthread_attr_t* -->
    <pointer-type-def type-id='type-id-256' size-in-bits='64' hash='119feddb672945aa' id='type-id-257'/>
    <!-- pthread_attr_t* -->
    <pointer-type-def type-id='type-id-253' size-in-bits='64' hash='cfcdc06ed6575035' id='type-id-258'/>
    <!-- size_t* -->
    <pointer-type-def type-id='type-id-11' size-in-bits='64' hash='54c1e9f81ec7a1db' id='type-id-84'/>
    <!-- _Unwind_Context* -->
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-260'/>
    <!-- struct _Unwind_Context -->
    <class-decl name='_Unwind_Context' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-259'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- typedef bool (*)(const char*) __sanitizer::string_predicate_t -->
      <typedef-decl name='string_predicate_t' type-id='type-id-255' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='467' column='1' hash='fd7a63c0c6c822c4' id='type-id-261'/>
    </namespace-decl>
    <!-- _Unwind_Ptr _Unwind_GetIP(_Unwind_Context*) -->
    <function-decl name='_Unwind_GetIP' filepath='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/host-x86_64-unknown-linux-gnu/gcc/include/unwind.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64' hash='e0055d99adb0e173'>
      <!-- parameter of type '_Unwind_Context*' -->
      <parameter type-id='type-id-260'/>
      <!-- typedef _Unwind_Ptr -->
      <return type-id='type-id-251'/>
    </function-decl>
    <!-- int pthread_attr_setstacksize(pthread_attr_t*, size_t) -->
    <function-decl name='pthread_attr_setstacksize' filepath='/usr/include/pthread.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64' hash='037c1ed5d741755a'>
      <!-- parameter of type 'pthread_attr_t*' -->
      <parameter type-id='type-id-258'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_linux.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_posix.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- __sanitizer::InternalScopedString* const -->
    <qualified-type-def type-id='type-id-125' const='yes' hash='f51c5ece061576b8' id='type-id-262'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_posix_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- typedef unsigned int __uid_t -->
    <typedef-decl name='__uid_t' type-id='type-id-180' size-in-bits='32' filepath='/usr/include/bits/types.h' line='135' column='1' hash='e66b43f97c38e87a' id='type-id-263'/>
    <!-- typedef unsigned int __useconds_t -->
    <typedef-decl name='__useconds_t' type-id='type-id-180' size-in-bits='32' filepath='/usr/include/bits/types.h' line='150' column='1' hash='e66b43f97c38e87a' id='type-id-264'/>
    <!-- typedef unsigned long int pthread_t -->
    <typedef-decl name='pthread_t' type-id='type-id-1' size-in-bits='64' filepath='/usr/include/bits/pthreadtypes.h' line='50' column='1' hash='8fdc5eea2983a729' id='type-id-265'/>
    <!-- const rlimit -->
    <qualified-type-def type-id='type-id-266' const='yes' hash='9172abf1d29bca7d' id='type-id-267'/>
    <!-- const rlimit* -->
    <pointer-type-def type-id='type-id-267' size-in-bits='64' hash='1338b009d1566512' id='type-id-268'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
    <!-- pthread_t pthread_self() -->
    <function-decl name='pthread_self' filepath='/usr/include/pthread.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64' hash='e0055d99adb0e173'>
      <!-- typedef pthread_t -->
      <return type-id='type-id-265'/>
    </function-decl>
    <!-- int madvise(void*, size_t, int) -->
    <function-decl name='madvise' filepath='/usr/include/sys/mman.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64' hash='3c22fdaad7e0fe35'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- parameter of type 'typedef size_t' -->
      <parameter type-id='type-id-11'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int getrlimit(__rlimit_resource_t, rlimit*) -->
    <function-decl name='getrlimit' filepath='/usr/include/sys/resource.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' hash='87894dd047aa9af0'>
      <!-- parameter of type 'typedef __rlimit_resource_t' -->
      <parameter type-id='type-id-269'/>
      <!-- parameter of type 'rlimit*' -->
      <parameter type-id='type-id-270'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int setrlimit(__rlimit_resource_t, const rlimit*) -->
    <function-decl name='setrlimit' filepath='/usr/include/sys/resource.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64' hash='b049dea9ea8b238a'>
      <!-- parameter of type 'typedef __rlimit_resource_t' -->
      <parameter type-id='type-id-269'/>
      <!-- parameter of type 'const rlimit*' -->
      <parameter type-id='type-id-268'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- __uid_t getuid() -->
    <function-decl name='getuid' filepath='/usr/include/unistd.h' line='694' column='1' visibility='default' binding='global' size-in-bits='64' hash='2bb88322482ae81c'>
      <!-- typedef __uid_t -->
      <return type-id='type-id-263'/>
    </function-decl>
    <!-- int isatty(int) -->
    <function-decl name='isatty' filepath='/usr/include/unistd.h' line='798' column='1' visibility='default' binding='global' size-in-bits='64' hash='d628501fd2223339'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_printf.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- void (*)(const char*) -->
    <pointer-type-def type-id='type-id-117' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-271'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- void __sanitizer::OnPrint(const char*) -->
      <function-decl name='OnPrint' mangled-name='_ZN11__sanitizer7OnPrintEPKc' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_printf.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11__sanitizer7OnPrintEPKc' hash='53885bde0aa65efe'>
        <!-- parameter of type 'const char*' -->
        <parameter type-id='type-id-4'/>
        <!-- void -->
        <return type-id='type-id-31'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- unsigned long int[1] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='64' hash='ce8b5719f8a8572f' id='type-id-272'>
      <!-- <anonymous range>[1] -->
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-273'/>
    </array-type-def>
    <!-- __sanitizer::InternalMmapVector<__sanitizer::StackDepotReverseMap::IdDescPair>* -->
    <pointer-type-def type-id='type-id-274' size-in-bits='64' hash='9eb919c61376d09f' id='type-id-275'/>
    <!-- __sanitizer::InternalMmapVector<__sanitizer::StackDepotReverseMap::IdDescPair>* const -->
    <qualified-type-def type-id='type-id-275' const='yes' hash='3b0f1ffd014dc509' id='type-id-276'/>
    <!-- __sanitizer::StackDepotReverseMap* -->
    <pointer-type-def type-id='type-id-277' size-in-bits='64' hash='565711851b49540b' id='type-id-278'/>
    <!-- __sanitizer::StackDepotReverseMap* const -->
    <qualified-type-def type-id='type-id-278' const='yes' hash='5730a45e9834f5c1' id='type-id-279'/>
    <!-- __sanitizer::StackDepotReverseMap::IdDescPair& -->
    <reference-type-def kind='lvalue' type-id='type-id-280' size-in-bits='64' hash='be9c095d26e9dacc' id='type-id-281'/>
    <!-- __sanitizer::StackDepotReverseMap::IdDescPair* -->
    <pointer-type-def type-id='type-id-280' size-in-bits='64' hash='8907dae3fbddcd18' id='type-id-282'/>
    <!-- __sanitizer::StackDepotStats* -->
    <pointer-type-def type-id='type-id-283' size-in-bits='64' hash='0a4930d39277009f' id='type-id-284'/>
    <!-- __sanitizer::StackDesc* -->
    <pointer-type-def type-id='type-id-285' size-in-bits='64' hash='e5ef88b9332b51ca' id='type-id-286'/>
    <!-- bool (*)(const __sanitizer::StackDepotReverseMap::IdDescPair&, const __sanitizer::StackDepotReverseMap::IdDescPair&) -->
    <pointer-type-def type-id='type-id-287' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-288'/>
    <!-- const __sanitizer::InternalMmapVector<__sanitizer::StackDepotReverseMap::IdDescPair> -->
    <qualified-type-def type-id='type-id-274' const='yes' hash='4523e41949dd73b6' id='type-id-289'/>
    <!-- const __sanitizer::InternalMmapVector<__sanitizer::StackDepotReverseMap::IdDescPair>& -->
    <reference-type-def kind='lvalue' type-id='type-id-289' size-in-bits='64' hash='33af9c0279c10bbb' id='type-id-290'/>
    <!-- const __sanitizer::InternalMmapVector<__sanitizer::StackDepotReverseMap::IdDescPair>* -->
    <pointer-type-def type-id='type-id-289' size-in-bits='64' hash='49863d3e18ff6065' id='type-id-291'/>
    <!-- const __sanitizer::InternalMmapVector<__sanitizer::StackDepotReverseMap::IdDescPair>* const -->
    <qualified-type-def type-id='type-id-291' const='yes' hash='79524f3e0406bc6e' id='type-id-292'/>
    <!-- const __sanitizer::StackDepotReverseMap -->
    <qualified-type-def type-id='type-id-277' const='yes' hash='9cbfd15f041dd465' id='type-id-293'/>
    <!-- const __sanitizer::StackDepotReverseMap& -->
    <reference-type-def kind='lvalue' type-id='type-id-293' size-in-bits='64' hash='1016567df29be97b' id='type-id-294'/>
    <!-- const __sanitizer::StackDepotReverseMap::IdDescPair -->
    <qualified-type-def type-id='type-id-280' const='yes' hash='e7d91581f73ebe76' id='type-id-295'/>
    <!-- const __sanitizer::StackDepotReverseMap::IdDescPair& -->
    <reference-type-def kind='lvalue' type-id='type-id-295' size-in-bits='64' hash='7d1c47fbf01f5265' id='type-id-296'/>
    <!-- const __sanitizer::StackDepotReverseMap::IdDescPair* -->
    <pointer-type-def type-id='type-id-295' size-in-bits='64' hash='2b4b7cc4548d549a' id='type-id-297'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- class __sanitizer::InternalMmapVector<__sanitizer::StackDepotReverseMap::IdDescPair> -->
      <class-decl name='InternalMmapVector&lt;__sanitizer::StackDepotReverseMap::IdDescPair&gt;' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='320' column='1' hash='6f446c6db3abf9e7' id='type-id-274'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- __sanitizer::StackDepotReverseMap::IdDescPair* __sanitizer::InternalMmapVector<__sanitizer::StackDepotReverseMap::IdDescPair>::data_ -->
          <var-decl name='data_' type-id='type-id-282' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='382' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- __sanitizer::uptr __sanitizer::InternalMmapVector<__sanitizer::StackDepotReverseMap::IdDescPair>::capacity_ -->
          <var-decl name='capacity_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='383' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- __sanitizer::uptr __sanitizer::InternalMmapVector<__sanitizer::StackDepotReverseMap::IdDescPair>::size_ -->
          <var-decl name='size_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='384' column='1'/>
        </data-member>
      </class-decl>
      <!-- class __sanitizer::StackDepotReverseMap -->
      <class-decl name='StackDepotReverseMap' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='39' column='1' hash='34a0a20f69d8b5c2' id='type-id-277'>
        <member-type access='private'>
          <!-- struct __sanitizer::StackDepotReverseMap::IdDescPair -->
          <class-decl name='IdDescPair' is-struct='yes' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='45' column='1' hash='c8da829e5f0a4e96' id='type-id-280'>
            <data-member access='public' layout-offset-in-bits='0'>
              <!-- __sanitizer::u32 __sanitizer::StackDepotReverseMap::IdDescPair::id -->
              <var-decl name='id' type-id='type-id-242' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='46' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <!-- __sanitizer::StackDesc* __sanitizer::StackDepotReverseMap::IdDescPair::desc -->
              <var-decl name='desc' type-id='type-id-286' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='47' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- __sanitizer::InternalMmapVector<__sanitizer::StackDepotReverseMap::IdDescPair> __sanitizer::StackDepotReverseMap::map_ -->
          <var-decl name='map_' type-id='type-id-274' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='52' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct __sanitizer::StackDepotStats -->
      <class-decl name='StackDepotStats' is-struct='yes' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='26' column='1' hash='7c7efb6f7698814b' id='type-id-283'>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- __sanitizer::uptr __sanitizer::StackDepotStats::n_uniq_ids -->
          <var-decl name='n_uniq_ids' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='27' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- __sanitizer::uptr __sanitizer::StackDepotStats::mapped -->
          <var-decl name='mapped' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='28' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct __sanitizer::StackDesc -->
      <class-decl name='StackDesc' is-struct='yes' visibility='default' size-in-bits='256' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.cc' line='27' column='1' hash='744ae2bad145df74' id='type-id-285'>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- __sanitizer::StackDesc* __sanitizer::StackDesc::link -->
          <var-decl name='link' type-id='type-id-286' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.cc' line='28' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- __sanitizer::u32 __sanitizer::StackDesc::id -->
          <var-decl name='id' type-id='type-id-242' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.cc' line='29' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <!-- __sanitizer::u32 __sanitizer::StackDesc::hash -->
          <var-decl name='hash' type-id='type-id-242' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.cc' line='30' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <!-- __sanitizer::uptr __sanitizer::StackDesc::size -->
          <var-decl name='size' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.cc' line='31' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <!-- unsigned long int __sanitizer::StackDesc::stack[1] -->
          <var-decl name='stack' type-id='type-id-272' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.cc' line='32' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <!-- bool (const __sanitizer::StackDepotReverseMap::IdDescPair&, const __sanitizer::StackDepotReverseMap::IdDescPair&) -->
    <function-type size-in-bits='64' hash='00498bfbf5d1cf02' id='type-id-287'>
      <!-- parameter of type 'const __sanitizer::StackDepotReverseMap::IdDescPair&' -->
      <parameter type-id='type-id-296'/>
      <!-- parameter of type 'const __sanitizer::StackDepotReverseMap::IdDescPair&' -->
      <parameter type-id='type-id-296'/>
      <!-- bool -->
      <return type-id='type-id-156'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- typedef __pid_t pid_t -->
    <typedef-decl name='pid_t' type-id='type-id-298' size-in-bits='32' filepath='/usr/include/sched.h' line='37' column='1' hash='09d17c08f594edc7' id='type-id-299'/>
    <!-- __sanitizer::InternalMmapVector<int>* const -->
    <qualified-type-def type-id='type-id-300' const='yes' hash='664ccfdb6273700e' id='type-id-301'/>
    <!-- __sanitizer::ScopedSetTracerPID* -->
    <pointer-type-def type-id='type-id-302' size-in-bits='64' hash='953713545cc66323' id='type-id-303'/>
    <!-- __sanitizer::ScopedSetTracerPID* const -->
    <qualified-type-def type-id='type-id-303' const='yes' hash='cefd0674ef39d2db' id='type-id-304'/>
    <!-- __sanitizer::ScopedStackSpaceWithGuard* -->
    <pointer-type-def type-id='type-id-305' size-in-bits='64' hash='525364e44a753625' id='type-id-306'/>
    <!-- __sanitizer::ScopedStackSpaceWithGuard* const -->
    <qualified-type-def type-id='type-id-306' const='yes' hash='f45ec6ba2bea9018' id='type-id-307'/>
    <!-- __sanitizer::StopTheWorldScope* -->
    <pointer-type-def type-id='type-id-308' size-in-bits='64' hash='642f1fc81c73cfcb' id='type-id-309'/>
    <!-- __sanitizer::StopTheWorldScope* const -->
    <qualified-type-def type-id='type-id-309' const='yes' hash='444453e09cb7e7c5' id='type-id-310'/>
    <!-- __sanitizer::SuspendedThreadsList& -->
    <reference-type-def kind='lvalue' type-id='type-id-311' size-in-bits='64' hash='06dd1ad8c19d2a28' id='type-id-312'/>
    <!-- __sanitizer::SuspendedThreadsList* const -->
    <qualified-type-def type-id='type-id-313' const='yes' hash='977cd94ffa183523' id='type-id-314'/>
    <!-- __sanitizer::ThreadSuspender* -->
    <pointer-type-def type-id='type-id-315' size-in-bits='64' hash='ae0e26828e6b18b6' id='type-id-316'/>
    <!-- __sanitizer::ThreadSuspender* const -->
    <qualified-type-def type-id='type-id-316' const='yes' hash='7ad7c0b85efb99c3' id='type-id-317'/>
    <!-- const __sanitizer::InternalMmapVector<int>* const -->
    <qualified-type-def type-id='type-id-318' const='yes' hash='79a0aa10e01a95b7' id='type-id-319'/>
    <!-- const __sanitizer::ScopedStackSpaceWithGuard -->
    <qualified-type-def type-id='type-id-305' const='yes' hash='82975a0ac0ef83fe' id='type-id-320'/>
    <!-- const __sanitizer::ScopedStackSpaceWithGuard* -->
    <pointer-type-def type-id='type-id-320' size-in-bits='64' hash='35b01d82aa0dcb11' id='type-id-321'/>
    <!-- const __sanitizer::ScopedStackSpaceWithGuard* const -->
    <qualified-type-def type-id='type-id-321' const='yes' hash='e8cb5e7230562785' id='type-id-322'/>
    <!-- const __sanitizer::SuspendedThreadsList* const -->
    <qualified-type-def type-id='type-id-323' const='yes' hash='7be146eddfce62e6' id='type-id-324'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- class __sanitizer::ScopedStackSpaceWithGuard -->
      <class-decl name='ScopedStackSpaceWithGuard' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='276' column='1' hash='9e70a21c6e024ae7' id='type-id-305'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- __sanitizer::uptr __sanitizer::ScopedStackSpaceWithGuard::stack_size_ -->
          <var-decl name='stack_size_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='295' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- __sanitizer::uptr __sanitizer::ScopedStackSpaceWithGuard::guard_size_ -->
          <var-decl name='guard_size_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='296' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- __sanitizer::uptr __sanitizer::ScopedStackSpaceWithGuard::guard_start_ -->
          <var-decl name='guard_start_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='297' column='1'/>
        </data-member>
      </class-decl>
      <!-- class __sanitizer::StopTheWorldScope -->
      <class-decl name='StopTheWorldScope' visibility='default' size-in-bits='32' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='307' column='1' hash='7f1c917f4ed01f44' id='type-id-308'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- int __sanitizer::StopTheWorldScope::process_was_dumpable_ -->
          <var-decl name='process_was_dumpable_' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='354' column='1'/>
        </data-member>
      </class-decl>
      <!-- class __sanitizer::ThreadSuspender -->
      <class-decl name='ThreadSuspender' visibility='default' size-in-bits='256' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='72' column='1' hash='b7ecce7b49ed3a35' id='type-id-315'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- __sanitizer::SuspendedThreadsList __sanitizer::ThreadSuspender::suspended_threads_list_ -->
          <var-decl name='suspended_threads_list_' type-id='type-id-311' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='85' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <!-- pid_t __sanitizer::ThreadSuspender::pid_ -->
          <var-decl name='pid_' type-id='type-id-299' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='86' column='1'/>
        </data-member>
      </class-decl>
      <!-- struct __sanitizer::ScopedSetTracerPID -->
      <class-decl name='ScopedSetTracerPID' is-struct='yes' visibility='default' size-in-bits='8' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='360' column='1' hash='15f94241d5f8b3b0' id='type-id-302'/>
      <!-- struct __sanitizer::TracerThreadArgument -->
      <class-decl name='TracerThreadArgument' is-struct='yes' visibility='default' size-in-bits='896' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='181' column='1' hash='4c18fcde12136247' id='type-id-325'>
        <data-member access='public' layout-offset-in-bits='0'>
          <!-- __sanitizer::StopTheWorldCallback __sanitizer::TracerThreadArgument::callback -->
          <var-decl name='callback' type-id='type-id-326' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='182' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <!-- void* __sanitizer::TracerThreadArgument::callback_argument -->
          <var-decl name='callback_argument' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='183' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <!-- __sanitizer::BlockingMutex __sanitizer::TracerThreadArgument::mutex -->
          <var-decl name='mutex' type-id='type-id-327' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='186' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <!-- __sanitizer::uptr __sanitizer::TracerThreadArgument::parent_pid -->
          <var-decl name='parent_pid' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='187' column='1'/>
        </data-member>
      </class-decl>
      <!-- typedef int __sanitizer::SuspendedThreadID -->
      <typedef-decl name='SuspendedThreadID' type-id='type-id-6' size-in-bits='32' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld.h' line='19' column='1' hash='09d17c08f594edc7' id='type-id-328'/>
      <!-- typedef void (*)(const __sanitizer::SuspendedThreadsList&, void*) __sanitizer::StopTheWorldCallback -->
      <typedef-decl name='StopTheWorldCallback' type-id='type-id-329' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld.h' line='54' column='1' hash='fd7a63c0c6c822c4' id='type-id-326'/>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_suppressions.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- const __sanitizer::InternalMmapVector<__sanitizer::Suppression>* const -->
    <qualified-type-def type-id='type-id-330' const='yes' hash='8dc819db9be99882' id='type-id-331'/>
    <!-- const __sanitizer::SuppressionContext* const -->
    <qualified-type-def type-id='type-id-332' const='yes' hash='3b02866561d1dd42' id='type-id-333'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- __sanitizer::Symbolizer::SymbolizerScope* const -->
    <qualified-type-def type-id='type-id-334' const='yes' hash='9bab1c151d47f26b' id='type-id-335'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_libbacktrace.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- typedef void (*)(void*, const char*, int) backtrace_error_callback -->
    <typedef-decl name='backtrace_error_callback' type-id='type-id-336' size-in-bits='64' filepath='../../.././libsanitizer/../libbacktrace/backtrace.h' line='82' column='1' hash='fd7a63c0c6c822c4' id='type-id-27'/>
    <!-- typedef int (*)(void*, uintptr_t, const char*, int, const char*) backtrace_full_callback -->
    <typedef-decl name='backtrace_full_callback' type-id='type-id-337' size-in-bits='64' filepath='../../.././libsanitizer/../libbacktrace/backtrace.h' line='110' column='1' hash='fd7a63c0c6c822c4' id='type-id-29'/>
    <!-- typedef void (*)(void*, uintptr_t, const char*, uintptr_t, uintptr_t) backtrace_syminfo_callback -->
    <typedef-decl name='backtrace_syminfo_callback' type-id='type-id-338' size-in-bits='64' filepath='../../.././libsanitizer/../libbacktrace/backtrace.h' line='175' column='1' hash='fd7a63c0c6c822c4' id='type-id-30'/>
    <!-- typedef void (*)(const char*, size_t, void*) demangle_callbackref -->
    <typedef-decl name='demangle_callbackref' type-id='type-id-339' size-in-bits='64' filepath='../../.././libsanitizer/../include/demangle.h' line='150' column='1' hash='fd7a63c0c6c822c4' id='type-id-83'/>
    <!-- typedef unsigned long int uintptr_t -->
    <typedef-decl name='uintptr_t' type-id='type-id-1' size-in-bits='64' filepath='/usr/include/stdint.h' line='123' column='1' hash='8fdc5eea2983a729' id='type-id-26'/>
    <!-- __sanitizer::LibbacktraceSymbolizer* const -->
    <qualified-type-def type-id='type-id-340' const='yes' hash='e08b601b335ae2f0' id='type-id-341'/>
    <!-- backtrace_state* -->
    <pointer-type-def type-id='type-id-5' size-in-bits='64' hash='957d2e94c2467230' id='type-id-25'/>
    <!-- int (*)(void*, uintptr_t, const char*, int, const char*) -->
    <pointer-type-def type-id='type-id-32' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-337'/>
    <!-- void (*)(const char*, size_t, void*) -->
    <pointer-type-def type-id='type-id-85' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-339'/>
    <!-- void (*)(void*, const char*, int) -->
    <pointer-type-def type-id='type-id-33' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-336'/>
    <!-- void (*)(void*, uintptr_t, const char*, uintptr_t, uintptr_t) -->
    <pointer-type-def type-id='type-id-34' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-338'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- char[16384] -->
    <array-type-def dimensions='1' type-id='type-id-199' size-in-bits='131072' hash='cadeca2069e0eeee' id='type-id-342'>
      <!-- <anonymous range>[16384] -->
      <subrange length='16384' lower-bound='0' upper-bound='16383' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='2c27b44d567888c8' id='type-id-343'/>
    </array-type-def>
    <!-- __sanitizer::ExternalSymbolizer* -->
    <pointer-type-def type-id='type-id-344' size-in-bits='64' hash='39ca0204e7a4bc79' id='type-id-345'/>
    <!-- __sanitizer::ExternalSymbolizer* const -->
    <qualified-type-def type-id='type-id-345' const='yes' hash='895c485228306dc7' id='type-id-346'/>
    <!-- __sanitizer::InternalSymbolizer* -->
    <pointer-type-def type-id='type-id-347' size-in-bits='64' hash='628adc80af734371' id='type-id-348'/>
    <!-- __sanitizer::InternalSymbolizer* const -->
    <qualified-type-def type-id='type-id-348' const='yes' hash='6f9521d527cb877c' id='type-id-349'/>
    <!-- __sanitizer::LibbacktraceSymbolizer* -->
    <pointer-type-def type-id='type-id-350' size-in-bits='64' hash='42ccd576f5b989d2' id='type-id-340'/>
    <!-- __sanitizer::POSIXSymbolizer* -->
    <pointer-type-def type-id='type-id-351' size-in-bits='64' hash='c0cdafe0af1c1f1c' id='type-id-352'/>
    <!-- __sanitizer::POSIXSymbolizer* const -->
    <qualified-type-def type-id='type-id-352' const='yes' hash='292363c76f5d6d7c' id='type-id-353'/>
    <!-- __sanitizer::Symbolizer::SymbolizerScope* -->
    <pointer-type-def type-id='type-id-148' size-in-bits='64' hash='8c4411f6b2f40542' id='type-id-334'/>
    <!-- bool (*)(const char*, __sanitizer::u64, char*, int) -->
    <pointer-type-def type-id='type-id-354' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-355'/>
    <!-- const __sanitizer::Symbolizer -->
    <qualified-type-def type-id='type-id-147' const='yes' hash='55063340c758423a' id='type-id-356'/>
    <!-- const __sanitizer::Symbolizer* -->
    <pointer-type-def type-id='type-id-356' size-in-bits='64' hash='38845c80cd6d6c04' id='type-id-149'/>
    <!-- namespace __cxxabiv1 -->
    <namespace-decl name='__cxxabiv1'>
      <!-- char* __cxxabiv1::__cxa_demangle(const char*, char*, size_t*, int*) -->
      <function-decl name='__cxa_demangle' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='34' column='1' visibility='default' binding='global' size-in-bits='64' hash='d05fbc442f59b10d'>
        <!-- parameter of type 'const char*' -->
        <parameter type-id='type-id-4'/>
        <!-- parameter of type 'char*' -->
        <parameter type-id='type-id-28'/>
        <!-- parameter of type 'size_t*' -->
        <parameter type-id='type-id-84'/>
        <!-- parameter of type 'int*' -->
        <parameter type-id='type-id-38'/>
        <!-- char* -->
        <return type-id='type-id-28'/>
      </function-decl>
    </namespace-decl>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- class __sanitizer::ExternalSymbolizer -->
      <class-decl name='ExternalSymbolizer' visibility='default' size-in-bits='131328' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='208' column='1' hash='1872146c80cfc461' id='type-id-344'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- const char* __sanitizer::ExternalSymbolizer::path_ -->
          <var-decl name='path_' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='294' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- int __sanitizer::ExternalSymbolizer::input_fd_ -->
          <var-decl name='input_fd_' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='295' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='96'>
          <!-- int __sanitizer::ExternalSymbolizer::output_fd_ -->
          <var-decl name='output_fd_' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='296' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- char __sanitizer::ExternalSymbolizer::buffer_[16384] -->
          <var-decl name='buffer_' type-id='type-id-342' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='299' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='131200'>
          <!-- __sanitizer::uptr __sanitizer::ExternalSymbolizer::times_restarted_ -->
          <var-decl name='times_restarted_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='302' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='131264'>
          <!-- bool __sanitizer::ExternalSymbolizer::failed_to_start_ -->
          <var-decl name='failed_to_start_' type-id='type-id-156' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='303' column='1'/>
        </data-member>
      </class-decl>
      <!-- class __sanitizer::InternalSymbolizer -->
      <class-decl name='InternalSymbolizer' visibility='default' size-in-bits='131072' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='321' column='1' hash='8b85f3b6935f2551' id='type-id-347'>
        <member-type access='public'>
          <!-- typedef bool (*)(const char*, __sanitizer::u64, char*, int) __sanitizer::InternalSymbolizer::SanitizerSymbolizeFn -->
          <typedef-decl name='SanitizerSymbolizeFn' type-id='type-id-355' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='323' column='1' hash='fd7a63c0c6c822c4' id='type-id-357'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- char __sanitizer::InternalSymbolizer::buffer_[16384] -->
          <var-decl name='buffer_' type-id='type-id-342' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='369' column='1'/>
        </data-member>
      </class-decl>
      <!-- class __sanitizer::LibbacktraceSymbolizer -->
      <class-decl name='LibbacktraceSymbolizer' visibility='default' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_libbacktrace.h' line='23' column='1' hash='0bfc8cb6ac829cca' id='type-id-350'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- void* __sanitizer::LibbacktraceSymbolizer::state_ -->
          <var-decl name='state_' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_libbacktrace.h' line='37' column='1'/>
        </data-member>
      </class-decl>
      <!-- class __sanitizer::POSIXSymbolizer -->
      <class-decl name='POSIXSymbolizer' visibility='default' size-in-bits='1280' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='385' column='1' hash='35a821a349d4cd41' id='type-id-351'>
        <!-- class __sanitizer::Symbolizer -->
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-147'/>
        <data-member access='private' layout-offset-in-bits='192'>
          <!-- __sanitizer::LoadedModule* __sanitizer::POSIXSymbolizer::modules_ -->
          <var-decl name='modules_' type-id='type-id-127' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='582' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <!-- __sanitizer::uptr __sanitizer::POSIXSymbolizer::n_modules_ -->
          <var-decl name='n_modules_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='583' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='320'>
          <!-- bool __sanitizer::POSIXSymbolizer::modules_fresh_ -->
          <var-decl name='modules_fresh_' type-id='type-id-156' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='585' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='384'>
          <!-- __sanitizer::BlockingMutex __sanitizer::POSIXSymbolizer::mu_ -->
          <var-decl name='mu_' type-id='type-id-327' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='586' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='1088'>
          <!-- __sanitizer::ExternalSymbolizer* __sanitizer::POSIXSymbolizer::external_symbolizer_ -->
          <var-decl name='external_symbolizer_' type-id='type-id-345' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='588' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='1152'>
          <!-- __sanitizer::InternalSymbolizer* const __sanitizer::POSIXSymbolizer::internal_symbolizer_ -->
          <var-decl name='internal_symbolizer_' type-id='type-id-349' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='589' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='1216'>
          <!-- __sanitizer::LibbacktraceSymbolizer* __sanitizer::POSIXSymbolizer::libbacktrace_symbolizer_ -->
          <var-decl name='libbacktrace_symbolizer_' type-id='type-id-340' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='590' column='1'/>
        </data-member>
        <member-function access='public' vtable-offset='0'>
          <!-- __sanitizer::uptr __sanitizer::POSIXSymbolizer::SymbolizeCode(__sanitizer::uptr, __sanitizer::AddressInfo*, __sanitizer::uptr) -->
          <function-decl name='SymbolizeCode' mangled-name='_ZN11__sanitizer15POSIXSymbolizer13SymbolizeCodeEmPNS_11AddressInfoEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='395' column='1' visibility='default' binding='global' size-in-bits='64' hash='25cd40cd27039a9f'>
            <!-- implicit parameter of type '__sanitizer::POSIXSymbolizer*' -->
            <parameter type-id='type-id-352' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='type-id-87'/>
            <!-- parameter of type '__sanitizer::AddressInfo*' -->
            <parameter type-id='type-id-154'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='type-id-87'/>
            <!-- typedef __sanitizer::uptr -->
            <return type-id='type-id-87'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='1'>
          <!-- bool __sanitizer::POSIXSymbolizer::SymbolizeData(__sanitizer::uptr, __sanitizer::DataInfo*) -->
          <function-decl name='SymbolizeData' mangled-name='_ZN11__sanitizer15POSIXSymbolizer13SymbolizeDataEmPNS_8DataInfoE' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='464' column='1' visibility='default' binding='global' size-in-bits='64' hash='ec014b6e6334a8bc'>
            <!-- implicit parameter of type '__sanitizer::POSIXSymbolizer*' -->
            <parameter type-id='type-id-352' is-artificial='yes'/>
            <!-- parameter of type 'typedef __sanitizer::uptr' -->
            <parameter type-id='type-id-87'/>
            <!-- parameter of type '__sanitizer::DataInfo*' -->
            <parameter type-id='type-id-155'/>
            <!-- bool -->
            <return type-id='type-id-156'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='2'>
          <!-- bool __sanitizer::POSIXSymbolizer::IsAvailable() -->
          <function-decl name='IsAvailable' mangled-name='_ZN11__sanitizer15POSIXSymbolizer11IsAvailableEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='490' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' hash='c7c710e908194b91'>
            <!-- implicit parameter of type '__sanitizer::POSIXSymbolizer*' -->
            <parameter type-id='type-id-352' is-artificial='yes'/>
            <!-- bool -->
            <return type-id='type-id-156'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <!-- bool __sanitizer::POSIXSymbolizer::IsExternalAvailable() -->
          <function-decl name='IsExternalAvailable' mangled-name='_ZN11__sanitizer15POSIXSymbolizer19IsExternalAvailableEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='495' column='1' visibility='default' binding='global' size-in-bits='64' hash='c7c710e908194b91'>
            <!-- implicit parameter of type '__sanitizer::POSIXSymbolizer*' -->
            <parameter type-id='type-id-352' is-artificial='yes'/>
            <!-- bool -->
            <return type-id='type-id-156'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <!-- void __sanitizer::POSIXSymbolizer::Flush() -->
          <function-decl name='Flush' mangled-name='_ZN11__sanitizer15POSIXSymbolizer5FlushEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='499' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type '__sanitizer::POSIXSymbolizer*' -->
            <parameter type-id='type-id-352' is-artificial='yes'/>
            <!-- void -->
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='5'>
          <!-- const char* __sanitizer::POSIXSymbolizer::Demangle(const char*) -->
          <function-decl name='Demangle' mangled-name='_ZN11__sanitizer15POSIXSymbolizer8DemangleEPKc' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='509' column='1' visibility='default' binding='global' size-in-bits='64' hash='3d5693612af11c46'>
            <!-- implicit parameter of type '__sanitizer::POSIXSymbolizer*' -->
            <parameter type-id='type-id-352' is-artificial='yes'/>
            <!-- parameter of type 'const char*' -->
            <parameter type-id='type-id-4'/>
            <!-- const char* -->
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='6'>
          <!-- void __sanitizer::POSIXSymbolizer::PrepareForSandboxing() -->
          <function-decl name='PrepareForSandboxing' mangled-name='_ZN11__sanitizer15POSIXSymbolizer20PrepareForSandboxingEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='524' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
            <!-- implicit parameter of type '__sanitizer::POSIXSymbolizer*' -->
            <parameter type-id='type-id-352' is-artificial='yes'/>
            <!-- void -->
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <!-- int execl(const char*, const char*, ...) -->
    <function-decl name='execl' filepath='/usr/include/unistd.h' line='570' column='1' visibility='default' binding='global' size-in-bits='64' hash='5f03b5b551b5a51f'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <parameter is-variadic='yes'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int getdtablesize() -->
    <function-decl name='getdtablesize' filepath='/usr/include/unistd.h' line='997' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- bool (const char*, __sanitizer::u64, char*, int) -->
    <function-type size-in-bits='64' hash='ed90573adf183943' id='type-id-354'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'typedef __sanitizer::u64' -->
      <parameter type-id='type-id-116'/>
      <!-- parameter of type 'char*' -->
      <parameter type-id='type-id-28'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6'/>
      <!-- bool -->
      <return type-id='type-id-156'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_thread_registry.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <!-- __sanitizer::IntrusiveList<__sanitizer::ThreadContextBase>* const -->
    <qualified-type-def type-id='type-id-358' const='yes' hash='f4f51862fd75f4d2' id='type-id-359'/>
    <!-- __sanitizer::ThreadContextBase* const -->
    <qualified-type-def type-id='type-id-360' const='yes' hash='8da4f8ebbe10e998' id='type-id-361'/>
    <!-- const __sanitizer::IntrusiveList<__sanitizer::ThreadContextBase>* const -->
    <qualified-type-def type-id='type-id-362' const='yes' hash='5e239c3961c78bae' id='type-id-363'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
      <!-- typedef __sanitizer::ThreadContextBase* (*)(__sanitizer::u32) __sanitizer::ThreadContextFactory -->
      <typedef-decl name='ThreadContextFactory' type-id='type-id-364' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_thread_registry.h' line='71' column='1' hash='fd7a63c0c6c822c4' id='type-id-365'/>
    </namespace-decl>
    <!-- void (__sanitizer::ThreadContextBase::*) () -->
    <function-type method-class-id='type-id-366' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-367'>
      <!-- implicit parameter of type '__sanitizer::ThreadContextBase*' -->
      <parameter type-id='type-id-360' is-artificial='yes'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-type>
    <!-- void (__sanitizer::ThreadContextBase::*) (void*) -->
    <function-type method-class-id='type-id-366' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-368'>
      <!-- implicit parameter of type '__sanitizer::ThreadContextBase*' -->
      <parameter type-id='type-id-360' is-artificial='yes'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3'/>
      <!-- void -->
      <return type-id='type-id-31'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/tsan/tsan_clock.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/tsan' language='LANG_C_plus_plus'>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-6'/>
    <!-- sizetype -->
    <type-decl name='sizetype' size-in-bits='64' hash='3e84f1a1648448f5' id='type-id-46'/>
    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='type-id-56'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-180'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-1'/>
    <!-- unsigned long long int -->
    <type-decl name='unsigned long long int' size-in-bits='64' hash='ebdfc4685a1e82df#3' id='type-id-115'/>
    <!-- unsigned long long int[16384] -->
    <array-type-def dimensions='1' type-id='type-id-115' size-in-bits='1048576' hash='92354dbd77d9b6b3' id='type-id-369'>
      <!-- <anonymous range>[16384] -->
      <subrange length='16384' lower-bound='0' upper-bound='16383' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='2c27b44d567888c8' id='type-id-343'/>
    </array-type-def>
    <!-- __tsan::SyncClock* -->
    <pointer-type-def type-id='type-id-370' size-in-bits='64' hash='479500b4ae25d54b' id='type-id-371'/>
    <!-- __tsan::SyncClock* const -->
    <qualified-type-def type-id='type-id-371' const='yes' hash='0604ca3a859f1c79' id='type-id-372'/>
    <!-- __tsan::ThreadClock* -->
    <pointer-type-def type-id='type-id-373' size-in-bits='64' hash='7f5adc830ffd8423' id='type-id-374'/>
    <!-- __tsan::ThreadClock* const -->
    <qualified-type-def type-id='type-id-374' const='yes' hash='23be82b95dd01b0b' id='type-id-375'/>
    <!-- __tsan::Vector<long long unsigned int>* -->
    <pointer-type-def type-id='type-id-376' size-in-bits='64' hash='32be8d6e6ef077b8' id='type-id-377'/>
    <!-- __tsan::Vector<long long unsigned int>* const -->
    <qualified-type-def type-id='type-id-377' const='yes' hash='1c6bc23d3426d145' id='type-id-378'/>
    <!-- const __tsan::MBlockType -->
    <qualified-type-def type-id='type-id-379' const='yes' hash='1c7ceba604a3c911' id='type-id-380'/>
    <!-- const __tsan::SyncClock -->
    <qualified-type-def type-id='type-id-370' const='yes' hash='3b83daec96af29be' id='type-id-381'/>
    <!-- const __tsan::SyncClock* -->
    <pointer-type-def type-id='type-id-381' size-in-bits='64' hash='8dae87a32858b04d' id='type-id-382'/>
    <!-- const __tsan::ThreadClock -->
    <qualified-type-def type-id='type-id-373' const='yes' hash='245bef550874897b' id='type-id-383'/>
    <!-- const __tsan::ThreadClock* -->
    <pointer-type-def type-id='type-id-383' size-in-bits='64' hash='304075f25ebb8888' id='type-id-384'/>
    <!-- const __tsan::ThreadClock* const -->
    <qualified-type-def type-id='type-id-384' const='yes' hash='28bc40cb99e592bd' id='type-id-385'/>
    <!-- const __tsan::Vector<long long unsigned int> -->
    <qualified-type-def type-id='type-id-376' const='yes' hash='a81bb0955c0b7a44' id='type-id-386'/>
    <!-- const __tsan::Vector<long long unsigned int>& -->
    <reference-type-def kind='lvalue' type-id='type-id-386' size-in-bits='64' hash='c44f58147f5a5540' id='type-id-387'/>
    <!-- const __tsan::Vector<long long unsigned int>* -->
    <pointer-type-def type-id='type-id-386' size-in-bits='64' hash='c9d14478e950e4f9' id='type-id-388'/>
    <!-- const __tsan::Vector<long long unsigned int>* const -->
    <qualified-type-def type-id='type-id-388' const='yes' hash='69d3ef7df28480c3' id='type-id-389'/>
    <!-- const unsigned long long int -->
    <qualified-type-def type-id='type-id-115' const='yes' hash='f06d84c079ff07f5#3' id='type-id-390'/>
    <!-- const unsigned long long int& -->
    <reference-type-def kind='lvalue' type-id='type-id-390' size-in-bits='64' hash='e29bc4e9795dc799#3' id='type-id-391'/>
    <!-- unsigned long long int& -->
    <reference-type-def kind='lvalue' type-id='type-id-115' size-in-bits='64' hash='6356f9ae036b2084#3' id='type-id-392'/>
    <!-- unsigned long long int* -->
    <pointer-type-def type-id='type-id-115' size-in-bits='64' hash='2cf5ae0f158917c2#3' id='type-id-393'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
    <!-- namespace __tsan -->
    <namespace-decl name='__tsan'>
      <!-- class __tsan::SyncClock -->
      <class-decl name='SyncClock' visibility='default' size-in-bits='256' filepath='../../.././libsanitizer/tsan/tsan_clock.h' line='20' column='1' hash='19da309c4d401914' id='type-id-370'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- __tsan::Vector<long long unsigned int> __tsan::SyncClock::clk_ -->
          <var-decl name='clk_' type-id='type-id-376' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_clock.h' line='33' column='1'/>
        </data-member>
      </class-decl>
      <!-- class __tsan::Vector<long long unsigned int> -->
      <class-decl name='Vector&lt;long long unsigned int&gt;' visibility='default' size-in-bits='256' filepath='../../.././libsanitizer/tsan/tsan_vector.h' line='23' column='1' hash='3c3d55096071d4eb' id='type-id-376'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- const __tsan::MBlockType __tsan::Vector<long long unsigned int>::typ_ -->
          <var-decl name='typ_' type-id='type-id-380' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_vector.h' line='80' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- unsigned long long int* __tsan::Vector<long long unsigned int>::begin_ -->
          <var-decl name='begin_' type-id='type-id-393' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_vector.h' line='81' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <!-- unsigned long long int* __tsan::Vector<long long unsigned int>::end_ -->
          <var-decl name='end_' type-id='type-id-393' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_vector.h' line='82' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <!-- unsigned long long int* __tsan::Vector<long long unsigned int>::last_ -->
          <var-decl name='last_' type-id='type-id-393' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_vector.h' line='83' column='1'/>
        </data-member>
      </class-decl>
      <!-- enum __tsan::MBlockType -->
      <enum-decl name='MBlockType' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/tsan/tsan_mman.h' line='41' column='1' hash='5186fc6b60d4cabc' id='type-id-379'>
        <underlying-type type-id='type-id-56'/>
        <enumerator name='MBlockScopedBuf' value='0'/>
        <enumerator name='MBlockString' value='1'/>
        <enumerator name='MBlockStackTrace' value='2'/>
        <enumerator name='MBlockShadowStack' value='3'/>
        <enumerator name='MBlockSync' value='4'/>
        <enumerator name='MBlockClock' value='5'/>
        <enumerator name='MBlockThreadContex' value='6'/>
        <enumerator name='MBlockDeadInfo' value='7'/>
        <enumerator name='MBlockRacyStacks' value='8'/>
        <enumerator name='MBlockRacyAddresses' value='9'/>
        <enumerator name='MBlockAtExit' value='10'/>
        <enumerator name='MBlockFlag' value='11'/>
        <enumerator name='MBlockReport' value='12'/>
        <enumerator name='MBlockReportMop' value='13'/>
        <enumerator name='MBlockReportThread' value='14'/>
        <enumerator name='MBlockReportMutex' value='15'/>
        <enumerator name='MBlockReportLoc' value='16'/>
        <enumerator name='MBlockReportStack' value='17'/>
        <enumerator name='MBlockSuppression' value='18'/>
        <enumerator name='MBlockExpectRace' value='19'/>
        <enumerator name='MBlockSignal' value='20'/>
        <enumerator name='MBlockFD' value='21'/>
        <enumerator name='MBlockJmpBuf' value='22'/>
        <enumerator name='MBlockTypeCount' value='23'/>
      </enum-decl>
      <!-- struct __tsan::ThreadClock -->
      <class-decl name='ThreadClock' is-struct='yes' visibility='default' size-in-bits='1048640' filepath='../../.././libsanitizer/tsan/tsan_clock.h' line='38' column='1' hash='c593d7a0e34a6965' id='type-id-373'>
        <data-member access='private' layout-offset-in-bits='0'>
          <!-- __sanitizer::uptr __tsan::ThreadClock::nclk_ -->
          <var-decl name='nclk_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_clock.h' line='72' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <!-- unsigned long long int __tsan::ThreadClock::clk_[16384] -->
          <var-decl name='clk_' type-id='type-id-369' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_clock.h' line='73' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <!-- void -->
    <type-decl name='void' id='type-id-31'/>
    <!-- void* -->
    <pointer-type-def type-id='type-id-31' id='type-id-3'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/tsan/tsan_fd.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/tsan' language='LANG_C_plus_plus'>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
    <!-- namespace __tsan -->
    <namespace-decl name='__tsan'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/tsan/tsan_flags.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/tsan' language='LANG_C_plus_plus'>
    <!-- __sanitizer::CommonFlags* -->
    <pointer-type-def type-id='type-id-394' size-in-bits='64' hash='18bb34c70254df90' id='type-id-395'/>
    <!-- bool* -->
    <pointer-type-def type-id='type-id-156' size-in-bits='64' hash='9c0e3f8596726a0b' id='type-id-396'/>
    <!-- const char** -->
    <pointer-type-def type-id='type-id-4' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-397'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
    <!-- namespace __tsan -->
    <namespace-decl name='__tsan'>
      <!-- const char* __tsan::__tsan_default_options() -->
      <function-decl name='__tsan_default_options' mangled-name='__tsan_default_options' filepath='../../.././libsanitizer/tsan/tsan_flags.cc' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__tsan_default_options' hash='53885bde0aa65efe'>
        <!-- const char* -->
        <return type-id='type-id-4'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/tsan/tsan_ignoreset.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/tsan' language='LANG_C_plus_plus'>
    <!-- __tsan::IgnoreSet* const -->
    <qualified-type-def type-id='type-id-398' const='yes' hash='958fcabf07462d25' id='type-id-399'/>
    <!-- const __tsan::IgnoreSet* const -->
    <qualified-type-def type-id='type-id-400' const='yes' hash='35f216b772bad53a' id='type-id-401'/>
    <!-- namespace __sanitizer -->
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/tsan/tsan_interceptors.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/tsan' language='LANG_C_plus_plus'>
    <!-- __sanitizer::LibIgnore::LibCodeRange[128] -->
    <array-type-def dimensions='1' type-id='type-id-402' size-in-bits='16384' hash='ea37f580cd6ce268' id='type-id-403'>
      <!-- <anonymous range>[128] -->
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='type-id-404'/>
    </array-type-def>
    <!-- __sanitizer::LibIgnore::Lib[128] -->
    <array-type-def dimensions='1' type-id='type-id-405' size-in-bits='32768' hash='2b7744df10f59af7' id='type-id-406'>
      <!-- <anonymous range>[128] -->
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='type-id-404'/>
    </array-type-def>
    <!-- __tsan::SignalDesc[64] -->
    <array-type-def dimensions='1' type-id='type-id-407' size-in-bits='552960' hash='10ad0608ccf9609e' id='type-id-408'>
      <!-- <anonymous range>[64] -->
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='type-id-409'/>
    </array-type-def>
    <!-- bool[128] -->
    <array-type-def dimensions='1' type-id='type-id-156' size-in-bits='1024' hash='f8edbaa82efaf55f' id='type-id-410'>
      <!-- <anonymous range>[128] -->
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='type-id-404'/>
    </array-type-def>
    <!-- char[14] -->
    <array-type-def dimensions='1' type-id='type-id-199' size-in-bits='112' hash='32c03ac42667596f' id='type-id-411'>
      <!-- <anonymous range>[14] -->
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='type-id-412'/>
    </array-type-def>
    <!-- class AtExitContext -->
    <class-decl name='AtExitContext' visibility='default' size-in-bits='17536' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='281' column='1' hash='d76dfa08962303cb' id='type-id-413'>
      <member-type access='public'>
        <!-- typedef void (*)(void) AtExitContext::atexit_t -->
        <typedef-decl name='atexit_t' type-id='type-id-145' size-in-bits='64' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='288' column='1' hash='fd7a63c0c6c822c4' id='type-id-414'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- __tsan::Mutex AtExitContext::mtx_ -->
        <var-decl name='mtx_' type-id='type-id-415' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='333' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- void (* AtExitContext::stack_[128])(void) -->
        <var-decl name='stack_' type-id='type-id-416' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='334' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8256'>
        <!-- void* AtExitContext::args_[128] -->
        <var-decl name='args_' type-id='type-id-190' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='335' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='16448'>
        <!-- bool AtExitContext::is_on_exits_[128] -->
        <var-decl name='is_on_exits_' type-id='type-id-410' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='336' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='17472'>
        <!-- int AtExitContext::pos_ -->
        <var-decl name='pos_' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='337' column='1'/>
      </data-member>
    </class-decl>
    <!-- class ScopedInterceptor -->
    <class-decl name='ScopedInterceptor' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='155' column='1' hash='ba8b5daf127fa32d' id='type-id-417'>
      <data-member access='private' layout-offset-in-bits='0'>
        <!-- __tsan::ThreadState* const ScopedInterceptor::thr_ -->
        <var-decl name='thr_' type-id='type-id-418' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='160' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <!-- const __sanitizer::uptr ScopedInterceptor::pc_ -->
        <var-decl name='pc_' type-id='type-id-419' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='161' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <!-- const int ScopedInterceptor::in_rtl_ -->
        <var-decl name='in_rtl_' type-id='type-id-420' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='162' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <!-- bool ScopedInterceptor::in_ignored_lib_ -->
        <var-decl name='in_ignored_lib_' type-id='type-id-156' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='163' column='1'/>
      </data-member>
    </class-decl>
    <!-- double -->
    <type-decl name='double' size-in-bits='64' hash='e9e9b320886d9aa6' id='type-id-421'/>
    <!-- float -->
    <type-decl name='float' size-in-bits='32' hash='d7ec3bf03d3c5690' id='type-id-422'/>
    <!-- ioctl_desc[500] -->
    <array-type-def dimensions='1' type-id='type-id-423' size-in-bits='64000' hash='4cd0225066d8d015' id='type-id-424'>
      <!-- <anonymous range>[500] -->
      <subrange length='500' lower-bound='0' upper-bound='499' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='1e6b7243faa8d2c8' id='type-id-425'/>
    </array-type-def>
    <!-- long double -->
    <type-decl name='long double' size-in-bits='128' hash='2a9bbfe8bb0475f1#2' id='type-id-426'/>
    <!-- long long int -->
    <type-decl name='long long int' size-in-bits='64' hash='5ae7f9eec1fc43d6#3' id='type-id-187'/>
    <!-- struct BlockingCall -->
    <class-decl name='BlockingCall' is-struct='yes' visibility='default' size-in-bits='64' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='225' column='1' hash='0b9163ce3abb1ee6' id='type-id-427'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __tsan::SignalContext* BlockingCall::ctx -->
        <var-decl name='ctx' type-id='type-id-428' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='235' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct ScopedSyscall -->
    <class-decl name='ScopedSyscall' is-struct='yes' visibility='default' size-in-bits='64' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='1920' column='1' hash='5127a7c8e47a8270' id='type-id-429'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __tsan::ThreadState* ScopedSyscall::thr -->
        <var-decl name='thr' type-id='type-id-430' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='1921' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct ioctl_desc -->
    <class-decl name='ioctl_desc' is-struct='yes' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors_ioctl.inc' line='13' column='1' hash='345a726a2a83848b' id='type-id-423'>
      <member-type access='public'>
        <!-- enum {CUSTOM=3, NONE=0, READ=1, WRITE=2, } -->
        <enum-decl name='__anonymous_enum__' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors_ioctl.inc' line='16' column='1' hash='41fcfc1ed2a40f53' id='type-id-431'>
          <underlying-type type-id='type-id-56'/>
          <enumerator name='NONE' value='0'/>
          <enumerator name='READ' value='1'/>
          <enumerator name='WRITE' value='2'/>
          <enumerator name='CUSTOM' value='3'/>
        </enum-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int ioctl_desc::req -->
        <var-decl name='req' type-id='type-id-180' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors_ioctl.inc' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- ioctl_desc::__anonymous_enum__ ioctl_desc::type -->
        <var-decl name='type' type-id='type-id-431' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors_ioctl.inc' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34'>
        <!-- unsigned int ioctl_desc::size -->
        <var-decl name='size' type-id='type-id-180' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors_ioctl.inc' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- const char* ioctl_desc::name -->
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors_ioctl.inc' line='23' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct ioctl_desc_compare -->
    <class-decl name='ioctl_desc_compare' is-struct='yes' visibility='default' size-in-bits='8' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors_ioctl.inc' line='462' column='1' hash='5623818598eee39e' id='type-id-432'/>
    <!-- struct my_siginfo_t -->
    <class-decl name='my_siginfo_t' is-struct='yes' visibility='default' size-in-bits='1024' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='32' column='1' hash='c6c9f3c390ec0678' id='type-id-433'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long long int my_siginfo_t::opaque[16] -->
        <var-decl name='opaque' type-id='type-id-434' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='34' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct sanitizer_kernel_iovec -->
    <class-decl name='sanitizer_kernel_iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='88' column='1' hash='c47012dc94087867' id='type-id-435'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* sanitizer_kernel_iovec::iov_base -->
        <var-decl name='iov_base' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- unsigned long int sanitizer_kernel_iovec::iov_len -->
        <var-decl name='iov_len' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='90' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct sanitizer_kernel_mmsghdr -->
    <class-decl name='sanitizer_kernel_mmsghdr' is-struct='yes' visibility='default' size-in-bits='512' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='103' column='1' hash='6d4b5a4f1da8f35f' id='type-id-436'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- sanitizer_kernel_msghdr sanitizer_kernel_mmsghdr::msg_hdr -->
        <var-decl name='msg_hdr' type-id='type-id-437' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- unsigned int sanitizer_kernel_mmsghdr::msg_len -->
        <var-decl name='msg_len' type-id='type-id-180' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='105' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct sanitizer_kernel_msghdr -->
    <class-decl name='sanitizer_kernel_msghdr' is-struct='yes' visibility='default' size-in-bits='448' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='93' column='1' hash='67f9f51f2a6d5a1d' id='type-id-437'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void* sanitizer_kernel_msghdr::msg_name -->
        <var-decl name='msg_name' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int sanitizer_kernel_msghdr::msg_namelen -->
        <var-decl name='msg_namelen' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- sanitizer_kernel_iovec* sanitizer_kernel_msghdr::msg_iov -->
        <var-decl name='msg_iov' type-id='type-id-438' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- unsigned long int sanitizer_kernel_msghdr::msg_iovlen -->
        <var-decl name='msg_iovlen' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void* sanitizer_kernel_msghdr::msg_control -->
        <var-decl name='msg_control' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- unsigned long int sanitizer_kernel_msghdr::msg_controllen -->
        <var-decl name='msg_controllen' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- unsigned int sanitizer_kernel_msghdr::msg_flags -->
        <var-decl name='msg_flags' type-id='type-id-180' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='100' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct sanitizer_kernel_sockaddr -->
    <class-decl name='sanitizer_kernel_sockaddr' is-struct='yes' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='123' column='1' hash='82f466e263025957' id='type-id-439'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned short int sanitizer_kernel_sockaddr::sa_family -->
        <var-decl name='sa_family' type-id='type-id-241' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <!-- char sanitizer_kernel_sockaddr::sa_data[14] -->
        <var-decl name='sa_data' type-id='type-id-411' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='125' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct sigaction_t -->
    <class-decl name='sigaction_t' is-struct='yes' visibility='default' size-in-bits='1216' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='91' column='1' hash='b5816ad8593acf6c' id='type-id-440'>
      <member-type access='public'>
        <!-- union {sighandler_t sa_handler; void (* sa_sigaction)(int, my_siginfo_t*, void*);} -->
        <union-decl name='__anonymous_union__' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='92' column='1' hash='67b323f70848ee4b#2' id='type-id-441'>
          <data-member access='public'>
            <!-- sighandler_t sa_handler -->
            <var-decl name='sa_handler' type-id='type-id-442' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='93' column='1'/>
          </data-member>
          <data-member access='public'>
            <!-- void (* sa_sigaction)(int, my_siginfo_t*, void*) -->
            <var-decl name='sa_sigaction' type-id='type-id-443' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='94' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- union {sighandler_t sa_handler; void (* sa_sigaction)(int, my_siginfo_t*, void*);} -->
        <var-decl name='' type-id='type-id-441' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- __sanitizer::__sanitizer_sigset_t sigaction_t::sa_mask -->
        <var-decl name='sa_mask' type-id='type-id-444' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <!-- int sigaction_t::sa_flags -->
        <var-decl name='sa_flags' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- void (* sigaction_t::sa_restorer)(void) -->
        <var-decl name='sa_restorer' type-id='type-id-145' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='98' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct typedef __va_list_tag __va_list_tag -->
    <class-decl name='typedef __va_list_tag __va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='82aec996f90384a2' id='type-id-445'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int typedef __va_list_tag __va_list_tag::gp_offset -->
        <var-decl name='gp_offset' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int typedef __va_list_tag __va_list_tag::fp_offset -->
        <var-decl name='fp_offset' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void* typedef __va_list_tag __va_list_tag::overflow_arg_area -->
        <var-decl name='overflow_arg_area' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void* typedef __va_list_tag __va_list_tag::reg_save_area -->
        <var-decl name='reg_save_area' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <!-- struct ucontext_t -->
    <class-decl name='ucontext_t' is-struct='yes' visibility='default' size-in-bits='7552' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='37' column='1' hash='372af74ed7dfff59' id='type-id-446'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long long int ucontext_t::opaque[118] -->
        <var-decl name='opaque' type-id='type-id-447' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='39' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __sanitizer::s64 INTMAX_T -->
    <typedef-decl name='INTMAX_T' type-id='type-id-188' size-in-bits='64' filepath='../../.././libsanitizer/interception/interception.h' line='27' column='1' hash='5ae7f9eec1fc43d6' id='type-id-448'/>
    <!-- typedef __sanitizer::OFF64_T OFF64_T -->
    <typedef-decl name='OFF64_T' type-id='type-id-449' size-in-bits='64' filepath='../../.././libsanitizer/interception/interception.h' line='29' column='1' hash='ebdfc4685a1e82df' id='type-id-450'/>
    <!-- typedef __sanitizer::OFF_T OFF_T -->
    <typedef-decl name='OFF_T' type-id='type-id-243' size-in-bits='64' filepath='../../.././libsanitizer/interception/interception.h' line='28' column='1' hash='ebdfc4685a1e82df' id='type-id-451'/>
    <!-- typedef __sanitizer::uptr SIZE_T -->
    <typedef-decl name='SIZE_T' type-id='type-id-87' size-in-bits='64' filepath='../../.././libsanitizer/interception/interception.h' line='24' column='1' hash='8fdc5eea2983a729' id='type-id-452'/>
    <!-- typedef __sanitizer::sptr SSIZE_T -->
    <typedef-decl name='SSIZE_T' type-id='type-id-453' size-in-bits='64' filepath='../../.././libsanitizer/interception/interception.h' line='25' column='1' hash='b119fe0931d2ee10' id='type-id-454'/>
    <!-- typedef void kernel_sigset_t -->
    <typedef-decl name='kernel_sigset_t' type-id='type-id-31' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='130' column='1' id='type-id-455'/>
    <!-- typedef long int long_t -->
    <typedef-decl name='long_t' type-id='type-id-40' size-in-bits='64' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='79' column='1' hash='b119fe0931d2ee10' id='type-id-456'/>
    <!-- typedef int (*)(const __sanitizer::__sanitizer_dirent64**, const __sanitizer::__sanitizer_dirent64**) scandir64_compar_f -->
    <typedef-decl name='scandir64_compar_f' type-id='type-id-457' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1943' column='1' hash='fd7a63c0c6c822c4' id='type-id-458'/>
    <!-- typedef int (*)(const __sanitizer::__sanitizer_dirent64*) scandir64_filter_f -->
    <typedef-decl name='scandir64_filter_f' type-id='type-id-459' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1942' column='1' hash='fd7a63c0c6c822c4' id='type-id-460'/>
    <!-- typedef int (*)(const __sanitizer::__sanitizer_dirent**, const __sanitizer::__sanitizer_dirent**) scandir_compar_f -->
    <typedef-decl name='scandir_compar_f' type-id='type-id-461' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1890' column='1' hash='fd7a63c0c6c822c4' id='type-id-462'/>
    <!-- typedef int (*)(const __sanitizer::__sanitizer_dirent*) scandir_filter_f -->
    <typedef-decl name='scandir_filter_f' type-id='type-id-463' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1889' column='1' hash='fd7a63c0c6c822c4' id='type-id-464'/>
    <!-- typedef void (*)(int) sighandler_t -->
    <typedef-decl name='sighandler_t' type-id='type-id-239' size-in-bits='64' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='87' column='1' hash='fd7a63c0c6c822c4' id='type-id-442'/>
    <!-- unsigned char[6] -->
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='48' hash='4d151751a9342ebe' id='type-id-465'>
      <!-- <anonymous range>[6] -->
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='type-id-123'/>
    </array-type-def>
    <!-- unsigned char[8] -->
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='64' hash='6581debd9544f9df' id='type-id-466'>
      <!-- <anonymous range>[8] -->
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-467'/>
    </array-type-def>
    <!-- unsigned long int[16] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='1024' hash='ed1e12a813ec6094#2' id='type-id-468'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-469'/>
    </array-type-def>
    <!-- unsigned long int[4] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='256' hash='d24c0d20b5304476' id='type-id-470'>
      <!-- <anonymous range>[4] -->
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-471'/>
    </array-type-def>
    <!-- unsigned long long int[118] -->
    <array-type-def dimensions='1' type-id='type-id-115' size-in-bits='7552' hash='c28bce6e9e582b63' id='type-id-447'>
      <!-- <anonymous range>[118] -->
      <subrange length='118' lower-bound='0' upper-bound='117' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6f97e773a1e88e39' id='type-id-472'/>
    </array-type-def>
    <!-- unsigned long long int[16] -->
    <array-type-def dimensions='1' type-id='type-id-115' size-in-bits='1024' hash='8fc03dfdfa2d2d80#3' id='type-id-434'>
      <!-- <anonymous range>[16] -->
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-469'/>
    </array-type-def>
    <!-- void (*[128])(void) -->
    <array-type-def dimensions='1' type-id='type-id-145' size-in-bits='8192' hash='723ad4905b0e82d4' id='type-id-416'>
      <!-- <anonymous range>[128] -->
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='type-id-404'/>
    </array-type-def>
    <!-- wchar_t -->
    <type-decl name='wchar_t' size-in-bits='32' hash='4b224bc24abb5f1b' id='type-id-473'/>
    <!-- AtExitContext* -->
    <pointer-type-def type-id='type-id-413' size-in-bits='64' hash='2fe4cf4630f5ed99' id='type-id-474'/>
    <!-- AtExitContext* const -->
    <qualified-type-def type-id='type-id-474' const='yes' hash='dc7bbc711d809e41' id='type-id-475'/>
    <!-- BlockingCall* -->
    <pointer-type-def type-id='type-id-427' size-in-bits='64' hash='03afa333156b82ef' id='type-id-476'/>
    <!-- BlockingCall* const -->
    <qualified-type-def type-id='type-id-476' const='yes' hash='7e05fd05994c3be2' id='type-id-477'/>
    <!-- SIZE_T* -->
    <pointer-type-def type-id='type-id-452' size-in-bits='64' hash='9fd3033f0b045812' id='type-id-478'/>
    <!-- ScopedInterceptor* -->
    <pointer-type-def type-id='type-id-417' size-in-bits='64' hash='8aa81351e474dda0' id='type-id-479'/>
    <!-- ScopedInterceptor* const -->
    <qualified-type-def type-id='type-id-479' const='yes' hash='8bfb58088952d791' id='type-id-480'/>
    <!-- ScopedSyscall* -->
    <pointer-type-def type-id='type-id-429' size-in-bits='64' hash='4cf5a7c1c12ca837' id='type-id-481'/>
    <!-- ScopedSyscall* const -->
    <qualified-type-def type-id='type-id-481' const='yes' hash='c6dd0b4b165da900' id='type-id-482'/>
    <!-- __interception::uptr* -->
    <pointer-type-def type-id='type-id-2' size-in-bits='64' hash='9ccf4b235df98601' id='type-id-483'/>
    <!-- __sanitizer::InternalMmapVector<__sanitizer::Suppression*>* -->
    <pointer-type-def type-id='type-id-196' size-in-bits='64' hash='33137f3b153f3748' id='type-id-484'/>
    <!-- __sanitizer::InternalMmapVector<__sanitizer::Suppression>* -->
    <pointer-type-def type-id='type-id-485' size-in-bits='64' hash='fdf519147b0bd16a' id='type-id-486'/>
    <!-- __sanitizer::LibIgnore* -->
    <pointer-type-def type-id='type-id-487' size-in-bits='64' hash='3d2069e3e149ff71' id='type-id-194'/>
    <!-- __sanitizer::Suppression& -->
    <reference-type-def kind='lvalue' type-id='type-id-488' size-in-bits='64' hash='bb1b48eafb479d6f' id='type-id-489'/>
    <!-- __sanitizer::Suppression** -->
    <pointer-type-def type-id='type-id-490' size-in-bits='64' hash='6b05b8589807a4f0' id='type-id-197'/>
    <!-- __sanitizer::SuppressionContext* -->
    <pointer-type-def type-id='type-id-491' size-in-bits='64' hash='b8e25bde82c4efef' id='type-id-492'/>
    <!-- __sanitizer::__sanitizer___kernel_fd_set* -->
    <pointer-type-def type-id='type-id-493' size-in-bits='64' hash='d612b30660e9d46c' id='type-id-494'/>
    <!-- __sanitizer::__sanitizer___kernel_gid_t* -->
    <pointer-type-def type-id='type-id-495' size-in-bits='64' hash='ebaa6579df05fde9' id='type-id-496'/>
    <!-- __sanitizer::__sanitizer___kernel_loff_t* -->
    <pointer-type-def type-id='type-id-497' size-in-bits='64' hash='47e8c00e7ce462dd' id='type-id-498'/>
    <!-- __sanitizer::__sanitizer___kernel_off_t* -->
    <pointer-type-def type-id='type-id-499' size-in-bits='64' hash='d8386c50ae411116' id='type-id-500'/>
    <!-- __sanitizer::__sanitizer___kernel_old_gid_t* -->
    <pointer-type-def type-id='type-id-501' size-in-bits='64' hash='2147159cd293fbbd' id='type-id-502'/>
    <!-- __sanitizer::__sanitizer___kernel_old_uid_t* -->
    <pointer-type-def type-id='type-id-503' size-in-bits='64' hash='110f7d2491365f15' id='type-id-504'/>
    <!-- __sanitizer::__sanitizer___sysctl_args* -->
    <pointer-type-def type-id='type-id-505' size-in-bits='64' hash='b9129a7ace6ad10e' id='type-id-506'/>
    <!-- __sanitizer::__sanitizer_dirent* -->
    <pointer-type-def type-id='type-id-507' size-in-bits='64' hash='f76116780a6f3391' id='type-id-508'/>
    <!-- __sanitizer::__sanitizer_dirent** -->
    <pointer-type-def type-id='type-id-508' size-in-bits='64' hash='f9b945451b1e350c' id='type-id-509'/>
    <!-- __sanitizer::__sanitizer_dirent*** -->
    <pointer-type-def type-id='type-id-509' size-in-bits='64' hash='e24ae38dc1463b92' id='type-id-510'/>
    <!-- __sanitizer::__sanitizer_dirent64* -->
    <pointer-type-def type-id='type-id-511' size-in-bits='64' hash='9898a6da8a482e18' id='type-id-512'/>
    <!-- __sanitizer::__sanitizer_dirent64** -->
    <pointer-type-def type-id='type-id-512' size-in-bits='64' hash='37ce478b472e0630' id='type-id-513'/>
    <!-- __sanitizer::__sanitizer_dirent64*** -->
    <pointer-type-def type-id='type-id-513' size-in-bits='64' hash='1ec08ddcc5fc13cf' id='type-id-514'/>
    <!-- __sanitizer::__sanitizer_ether_addr* -->
    <pointer-type-def type-id='type-id-515' size-in-bits='64' hash='e11969648e05ce33' id='type-id-516'/>
    <!-- __sanitizer::__sanitizer_hostent* -->
    <pointer-type-def type-id='type-id-517' size-in-bits='64' hash='f779c55c1b5a19b5' id='type-id-518'/>
    <!-- __sanitizer::__sanitizer_hostent** -->
    <pointer-type-def type-id='type-id-518' size-in-bits='64' hash='fdf8c892a146030c' id='type-id-519'/>
    <!-- __sanitizer::__sanitizer_io_event* -->
    <pointer-type-def type-id='type-id-520' size-in-bits='64' hash='07967821d1c4d67b' id='type-id-521'/>
    <!-- __sanitizer::__sanitizer_iocb* -->
    <pointer-type-def type-id='type-id-522' size-in-bits='64' hash='f867638d5ea4316c' id='type-id-523'/>
    <!-- __sanitizer::__sanitizer_iocb** -->
    <pointer-type-def type-id='type-id-523' size-in-bits='64' hash='7ed3b89c52cb4e1c' id='type-id-524'/>
    <!-- __sanitizer::__sanitizer_iovec* -->
    <pointer-type-def type-id='type-id-525' size-in-bits='64' hash='ffcc9acdc8cffde9' id='type-id-526'/>
    <!-- __sanitizer::__sanitizer_kernel_sigset_t* -->
    <pointer-type-def type-id='type-id-240' size-in-bits='64' hash='596f1936b84c2482' id='type-id-527'/>
    <!-- __sanitizer::__sanitizer_mntent* -->
    <pointer-type-def type-id='type-id-528' size-in-bits='64' hash='fbfe56eaa12f7e7c' id='type-id-529'/>
    <!-- __sanitizer::__sanitizer_msghdr* -->
    <pointer-type-def type-id='type-id-530' size-in-bits='64' hash='4cb70f50555f72b9' id='type-id-531'/>
    <!-- __sanitizer::__sanitizer_perf_event_attr* -->
    <pointer-type-def type-id='type-id-532' size-in-bits='64' hash='526529c54edef279' id='type-id-533'/>
    <!-- __sanitizer::__sanitizer_pollfd* -->
    <pointer-type-def type-id='type-id-534' size-in-bits='64' hash='425ddf96562f5644' id='type-id-535'/>
    <!-- __sanitizer::__sanitizer_sigset_t* -->
    <pointer-type-def type-id='type-id-444' size-in-bits='64' hash='06c4279440ed17f9' id='type-id-536'/>
    <!-- __sanitizer::__sanitizer_tm* -->
    <pointer-type-def type-id='type-id-537' size-in-bits='64' hash='70a5e7e8071e6571' id='type-id-538'/>
    <!-- __sanitizer::__sanitizer_wordexp_t* -->
    <pointer-type-def type-id='type-id-539' size-in-bits='64' hash='c5063e3525a1bcfd' id='type-id-540'/>
    <!-- __sanitizer::atomic_uint32_t* -->
    <pointer-type-def type-id='type-id-541' size-in-bits='64' hash='a4e61793cf52c8b9' id='type-id-542'/>
    <!-- __sanitizer::atomic_uint32_t::Type* -->
    <pointer-type-def type-id='type-id-543' size-in-bits='64' hash='058dfb8da7831c8e' id='type-id-544'/>
    <!-- __sanitizer::u32* -->
    <pointer-type-def type-id='type-id-242' size-in-bits='64' hash='d91ded9019e1e29d' id='type-id-545'/>
    <!-- char** -->
    <pointer-type-def type-id='type-id-28' size-in-bits='64' hash='a93039fe023ed77b' id='type-id-546'/>
    <!-- const __sanitizer::InternalMmapVector<__sanitizer::Suppression> -->
    <qualified-type-def type-id='type-id-485' const='yes' hash='82170b369094fff8' id='type-id-547'/>
    <!-- const __sanitizer::InternalMmapVector<__sanitizer::Suppression>& -->
    <reference-type-def kind='lvalue' type-id='type-id-547' size-in-bits='64' hash='d09a64b1f8392d00' id='type-id-548'/>
    <!-- const __sanitizer::InternalMmapVector<__sanitizer::Suppression>* -->
    <pointer-type-def type-id='type-id-547' size-in-bits='64' hash='78df0f23701e0fd2' id='type-id-330'/>
    <!-- const __sanitizer::LibIgnore -->
    <qualified-type-def type-id='type-id-487' const='yes' hash='7fa34445adc5c889' id='type-id-549'/>
    <!-- const __sanitizer::LibIgnore& -->
    <reference-type-def kind='lvalue' type-id='type-id-549' size-in-bits='64' hash='cc38c4c8c4190a2f' id='type-id-550'/>
    <!-- const __sanitizer::LibIgnore* -->
    <pointer-type-def type-id='type-id-549' size-in-bits='64' hash='c3242e48fd9f4eb0' id='type-id-551'/>
    <!-- const __sanitizer::LibIgnore* const -->
    <qualified-type-def type-id='type-id-551' const='yes' hash='4053cc996891644a' id='type-id-552'/>
    <!-- const __sanitizer::Suppression -->
    <qualified-type-def type-id='type-id-488' const='yes' hash='71f01444a50e51e6' id='type-id-553'/>
    <!-- const __sanitizer::Suppression& -->
    <reference-type-def kind='lvalue' type-id='type-id-553' size-in-bits='64' hash='a58eadccc8ca3f86' id='type-id-554'/>
    <!-- const __sanitizer::Suppression* -->
    <pointer-type-def type-id='type-id-553' size-in-bits='64' hash='e84e49fb85aef037' id='type-id-555'/>
    <!-- const __sanitizer::SuppressionContext -->
    <qualified-type-def type-id='type-id-491' const='yes' hash='3340b157edd7f712' id='type-id-556'/>
    <!-- const __sanitizer::SuppressionContext& -->
    <reference-type-def kind='lvalue' type-id='type-id-556' size-in-bits='64' hash='63fa9d3b8e8ae979' id='type-id-557'/>
    <!-- const __sanitizer::SuppressionContext* -->
    <pointer-type-def type-id='type-id-556' size-in-bits='64' hash='6a823b16a32cc479' id='type-id-332'/>
    <!-- const __sanitizer::__sanitizer_dirent -->
    <qualified-type-def type-id='type-id-507' const='yes' hash='65dca71099900db5' id='type-id-558'/>
    <!-- const __sanitizer::__sanitizer_dirent* -->
    <pointer-type-def type-id='type-id-558' size-in-bits='64' hash='e3e769d12bb98eb1' id='type-id-559'/>
    <!-- const __sanitizer::__sanitizer_dirent** -->
    <pointer-type-def type-id='type-id-559' size-in-bits='64' hash='d2f208c3e083798c' id='type-id-560'/>
    <!-- const __sanitizer::__sanitizer_dirent64 -->
    <qualified-type-def type-id='type-id-511' const='yes' hash='d594475795648151' id='type-id-561'/>
    <!-- const __sanitizer::__sanitizer_dirent64* -->
    <pointer-type-def type-id='type-id-561' size-in-bits='64' hash='3b26210508c25064' id='type-id-562'/>
    <!-- const __sanitizer::__sanitizer_dirent64** -->
    <pointer-type-def type-id='type-id-562' size-in-bits='64' hash='5f06945fb5f6fafe' id='type-id-563'/>
    <!-- const __sanitizer::__sanitizer_iovec -->
    <qualified-type-def type-id='type-id-525' const='yes' hash='556d49656de740c4' id='type-id-564'/>
    <!-- const __sanitizer::__sanitizer_iovec* -->
    <pointer-type-def type-id='type-id-564' size-in-bits='64' hash='065d6b494a6859af' id='type-id-565'/>
    <!-- const __sanitizer::__sanitizer_sigset_t -->
    <qualified-type-def type-id='type-id-444' const='yes' hash='94fd9394d055ce05' id='type-id-566'/>
    <!-- const __sanitizer::__sanitizer_sigset_t* -->
    <pointer-type-def type-id='type-id-566' size-in-bits='64' hash='7ead6ba524e65d8f' id='type-id-567'/>
    <!-- const __tsan::Vector<__tsan::JmpBuf>* const -->
    <qualified-type-def type-id='type-id-568' const='yes' hash='bd3176cef92fc3fb' id='type-id-569'/>
    <!-- const ioctl_desc -->
    <qualified-type-def type-id='type-id-423' const='yes' hash='583c78564811cfb0' id='type-id-570'/>
    <!-- const ioctl_desc& -->
    <reference-type-def kind='lvalue' type-id='type-id-570' size-in-bits='64' hash='d55ff2a337b292fb' id='type-id-571'/>
    <!-- const ioctl_desc_compare -->
    <qualified-type-def type-id='type-id-432' const='yes' hash='f04fb08dd3692748' id='type-id-572'/>
    <!-- const ioctl_desc_compare* -->
    <pointer-type-def type-id='type-id-572' size-in-bits='64' hash='a087dceabe564cc7' id='type-id-573'/>
    <!-- const ioctl_desc_compare* const -->
    <qualified-type-def type-id='type-id-573' const='yes' hash='e7bc468689db77b5' id='type-id-574'/>
    <!-- const kernel_sigset_t -->
    <qualified-type-def type-id='type-id-455' const='yes' hash='fec1b3ab36b3bee9' id='type-id-575'/>
    <!-- const std::nothrow_t -->
    <qualified-type-def type-id='type-id-576' const='yes' hash='83efb55678943094' id='type-id-577'/>
    <!-- const std::nothrow_t& -->
    <reference-type-def kind='lvalue' type-id='type-id-577' size-in-bits='64' hash='2f3b7481bf476291' id='type-id-578'/>
    <!-- const volatile __sanitizer::atomic_uint32_t -->
    <qualified-type-def type-id='type-id-579' const='yes' hash='2e38a40d99872256' id='type-id-580'/>
    <!-- const volatile __sanitizer::atomic_uint32_t* -->
    <pointer-type-def type-id='type-id-580' size-in-bits='64' hash='af0dbcba6ef63250' id='type-id-581'/>
    <!-- const wchar_t -->
    <qualified-type-def type-id='type-id-473' const='yes' hash='f2fba7dbc42fc9d5' id='type-id-582'/>
    <!-- const wchar_t* -->
    <pointer-type-def type-id='type-id-582' size-in-bits='64' hash='317089067e76910a' id='type-id-583'/>
    <!-- const wchar_t** -->
    <pointer-type-def type-id='type-id-583' size-in-bits='64' hash='535c62eb027026ae' id='type-id-584'/>
    <!-- double* -->
    <pointer-type-def type-id='type-id-421' size-in-bits='64' hash='dd31f93f4361bc41' id='type-id-585'/>
    <!-- float* -->
    <pointer-type-def type-id='type-id-422' size-in-bits='64' hash='5022839615992ac0' id='type-id-586'/>
    <!-- int (*)(const __sanitizer::__sanitizer_dirent*) -->
    <pointer-type-def type-id='type-id-587' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-463'/>
    <!-- int (*)(const __sanitizer::__sanitizer_dirent**, const __sanitizer::__sanitizer_dirent**) -->
    <pointer-type-def type-id='type-id-588' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-461'/>
    <!-- int (*)(const __sanitizer::__sanitizer_dirent64*) -->
    <pointer-type-def type-id='type-id-589' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-459'/>
    <!-- int (*)(const __sanitizer::__sanitizer_dirent64**, const __sanitizer::__sanitizer_dirent64**) -->
    <pointer-type-def type-id='type-id-590' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-457'/>
    <!-- ioctl_desc& -->
    <reference-type-def kind='lvalue' type-id='type-id-423' size-in-bits='64' hash='e9f9003618ad6e07' id='type-id-591'/>
    <!-- ioctl_desc(*)[500] -->
    <pointer-type-def type-id='type-id-424' size-in-bits='64' hash='09158ef4db2f3a2e' id='type-id-592'/>
    <!-- long double* -->
    <pointer-type-def type-id='type-id-426' size-in-bits='64' hash='04598ca17c1b4f7f' id='type-id-593'/>
    <!-- long int* -->
    <pointer-type-def type-id='type-id-40' size-in-bits='64' hash='9525b6affe75cc9d#2' id='type-id-594'/>
    <!-- my_siginfo_t* -->
    <pointer-type-def type-id='type-id-433' size-in-bits='64' hash='3b5f55d8721447c6' id='type-id-595'/>
    <!-- sanitizer_kernel_iovec* -->
    <pointer-type-def type-id='type-id-435' size-in-bits='64' hash='991b37073e13060c' id='type-id-438'/>
    <!-- sanitizer_kernel_mmsghdr* -->
    <pointer-type-def type-id='type-id-436' size-in-bits='64' hash='03935355120f5a0e' id='type-id-596'/>
    <!-- sanitizer_kernel_msghdr* -->
    <pointer-type-def type-id='type-id-437' size-in-bits='64' hash='4c04f8b87db1c92e' id='type-id-597'/>
    <!-- sanitizer_kernel_sockaddr* -->
    <pointer-type-def type-id='type-id-439' size-in-bits='64' hash='9c6590d4e21b17c5' id='type-id-598'/>
    <!-- sigaction_t* -->
    <pointer-type-def type-id='type-id-440' size-in-bits='64' hash='dc89d352292e5898' id='type-id-599'/>
    <!-- typedef __va_list_tag __va_list_tag* -->
    <pointer-type-def type-id='type-id-445' size-in-bits='64' hash='648313adc1c4c534' id='type-id-600'/>
    <!-- unsigned int* -->
    <pointer-type-def type-id='type-id-180' size-in-bits='64' hash='232fa04f890c2a5a' id='type-id-186'/>
    <!-- unsigned long int* -->
    <pointer-type-def type-id='type-id-1' size-in-bits='64' hash='d9e2f19705735211#2' id='type-id-140'/>
    <!-- void (*)(int) -->
    <pointer-type-def type-id='type-id-119' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-239'/>
    <!-- void (*)(int, my_siginfo_t*, void*) -->
    <pointer-type-def type-id='type-id-601' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-443'/>
    <!-- void (*)(int, void*) -->
    <pointer-type-def type-id='type-id-602' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-603'/>
    <!-- void (*)(void) -->
    <pointer-type-def type-id='type-id-120' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-145'/>
    <!-- void* (*)(void*) -->
    <pointer-type-def type-id='type-id-604' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-605'/>
    <!-- volatile __sanitizer::atomic_uint32_t -->
    <qualified-type-def type-id='type-id-541' volatile='yes' hash='d7bdf65d989eca0f' id='type-id-579'/>
    <!-- volatile __sanitizer::atomic_uint32_t* -->
    <pointer-type-def type-id='type-id-579' size-in-bits='64' hash='8572a8b173994baf' id='type-id-606'/>
    <!-- volatile __sanitizer::atomic_uint32_t::Type -->
    <qualified-type-def type-id='type-id-543' volatile='yes' hash='89bbbc5b1bf748f6' id='type-id-607'/>
    <!-- wchar_t* -->
    <pointer-type-def type-id='type-id-473' size-in-bits='64' hash='fb9a8c973ae04ed8' id='type-id-608'/>
    <!-- const kernel_sigset_t* -->
    <pointer-type-def type-id='type-id-575' size-in-bits='64' id='type-id-609'/>
    <!-- kernel_sigset_t* -->
    <pointer-type-def type-id='type-id-455' size-in-bits='64' id='type-id-610'/>
    <!-- namespace std -->
    <namespace-decl name='std'>
      <!-- struct std::nothrow_t -->
      <class-decl name='nothrow_t' is-struct='yes' visibility='default' size-in-bits='8' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='108' column='1' hash='774107ffdadd3c2c' id='type-id-576'/>
    </namespace-decl>
    <!-- namespace __interception -->
    <namespace-decl name='__interception'>
    </namespace-decl>
    <!-- char* __interceptor_textdomain(const char*) -->
    <function-decl name='__interceptor_textdomain' mangled-name='__interceptor_textdomain' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_textdomain' hash='bac6a89264ba699c'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6039' column='1'/>
      <!-- char* -->
      <return type-id='type-id-28'/>
    </function-decl>
    <!-- int __interceptor_strcmp(const char*, const char*) -->
    <function-decl name='__interceptor_strcmp' mangled-name='__interceptor_strcmp' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_strcmp' hash='5f03b5b551b5a51f'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int __interceptor_strncmp(const char*, const char*, __sanitizer::uptr) -->
    <function-decl name='__interceptor_strncmp' mangled-name='__interceptor_strncmp' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_strncmp' hash='2f99ec08ee54ebb4'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'typedef __sanitizer::uptr' -->
      <parameter type-id='type-id-87'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int __interceptor_strcasecmp(const char*, const char*) -->
    <function-decl name='__interceptor_strcasecmp' mangled-name='__interceptor_strcasecmp' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_strcasecmp' hash='5f03b5b551b5a51f'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- int __interceptor_strncasecmp(const char*, const char*, SIZE_T) -->
    <function-decl name='__interceptor_strncasecmp' mangled-name='__interceptor_strncasecmp' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_strncasecmp' hash='2f99ec08ee54ebb4'>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='141' column='1'/>
      <!-- parameter of type 'const char*' -->
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='141' column='1'/>
      <!-- parameter of type 'typedef SIZE_T' -->
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='141' column='1'/>
      <!-- int -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- double __interceptor_frexp(double, int*) -->
    <function-decl name='__interceptor_frexp' mangled-name='__interceptor_frexp' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_frexp' hash='ad7941a31128189e'>
      <!-- parameter of type 'double' -->
      <parameter type-id='type-id-421' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2788' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2788' column='1'/>
      <!-- double -->
      <return type-id='type-id-421'/>
    </function-decl>
    <!-- float __interceptor_frexpf(float, int*) -->
    <function-decl name='__interceptor_frexpf' mangled-name='__interceptor_frexpf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_frexpf' hash='08eeaabf75ec666f'>
      <!-- parameter of type 'float' -->
      <parameter type-id='type-id-422' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2795' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2795' column='1'/>
      <!-- float -->
      <return type-id='type-id-422'/>
    </function-decl>
    <!-- long double __interceptor_frexpl(long double, int*) -->
    <function-decl name='__interceptor_frexpl' mangled-name='__interceptor_frexpl' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_frexpl' hash='789fa05bf47206ac'>
      <!-- parameter of type 'long double' -->
      <parameter type-id='type-id-426' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2802' column='1'/>
      <!-- parameter of type 'int*' -->
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2802' column='1'/>
      <!-- long double -->
      <return type-id='type-id-426'/>
    </function-decl>
    <!-- SSIZE_T __interceptor_read(int, void*, SIZE_T) -->
    <function-decl name='__interceptor_read' mangled-name='__interceptor_read' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_read' hash='e1f135b405ab837f'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='316' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='316' column='1'/>
      <!-- parameter of type 'typedef SIZE_T' -->
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='316' column='1'/>
      <!-- typedef SSIZE_T -->
      <return type-id='type-id-454'/>
    </function-decl>
    <!-- SSIZE_T __interceptor_pread(int, void*, SIZE_T, OFF_T) -->
    <function-decl name='__interceptor_pread' mangled-name='__interceptor_pread' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_pread' hash='961c0ae14eb4a37c'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1'/>
      <!-- parameter of type 'typedef SIZE_T' -->
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1'/>
      <!-- parameter of type 'typedef OFF_T' -->
      <parameter type-id='type-id-451' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1'/>
      <!-- typedef SSIZE_T -->
      <return type-id='type-id-454'/>
    </function-decl>
    <!-- SSIZE_T __interceptor_pread64(int, void*, SIZE_T, OFF64_T) -->
    <function-decl name='__interceptor_pread64' mangled-name='__interceptor_pread64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_pread64' hash='961c0ae14eb4a37c'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='253' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='253' column='1'/>
      <!-- parameter of type 'typedef SIZE_T' -->
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='253' column='1'/>
      <!-- parameter of type 'typedef OFF64_T' -->
      <parameter type-id='type-id-450' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='253' column='1'/>
      <!-- typedef SSIZE_T -->
      <return type-id='type-id-454'/>
    </function-decl>
    <!-- SSIZE_T __interceptor_readv(int, __sanitizer::__sanitizer_iovec*, int) -->
    <function-decl name='__interceptor_readv' mangled-name='__interceptor_readv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_readv' hash='c00ce4f4c2fba3a7'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='363' column='1'/>
      <!-- parameter of type '__sanitizer::__sanitizer_iovec*' -->
      <parameter type-id='type-id-526' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='363' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='363' column='1'/>
      <!-- typedef SSIZE_T -->
      <return type-id='type-id-454'/>
    </function-decl>
    <!-- SSIZE_T __interceptor_preadv(int, __sanitizer::__sanitizer_iovec*, int, OFF_T) -->
    <function-decl name='__interceptor_preadv' mangled-name='__interceptor_preadv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_preadv' hash='d054e4cac163658b'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='379' column='1'/>
      <!-- parameter of type '__sanitizer::__sanitizer_iovec*' -->
      <parameter type-id='type-id-526' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='379' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='379' column='1'/>
      <!-- parameter of type 'typedef OFF_T' -->
      <parameter type-id='type-id-451' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='379' column='1'/>
      <!-- typedef SSIZE_T -->
      <return type-id='type-id-454'/>
    </function-decl>
    <!-- SSIZE_T __interceptor_preadv64(int, __sanitizer::__sanitizer_iovec*, int, OFF64_T) -->
    <function-decl name='__interceptor_preadv64' mangled-name='__interceptor_preadv64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_preadv64' hash='d054e4cac163658b'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='395' column='1'/>
      <!-- parameter of type '__sanitizer::__sanitizer_iovec*' -->
      <parameter type-id='type-id-526' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='395' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='395' column='1'/>
      <!-- parameter of type 'typedef OFF64_T' -->
      <parameter type-id='type-id-450' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='395' column='1'/>
      <!-- typedef SSIZE_T -->
      <return type-id='type-id-454'/>
    </function-decl>
    <!-- SSIZE_T __interceptor_write(int, void*, SIZE_T) -->
    <function-decl name='__interceptor_write' mangled-name='__interceptor_write' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_write' hash='e1f135b405ab837f'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='316' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='316' column='1'/>
      <!-- parameter of type 'typedef SIZE_T' -->
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='316' column='1'/>
      <!-- typedef SSIZE_T -->
      <return type-id='type-id-454'/>
    </function-decl>
    <!-- SSIZE_T __interceptor_pwrite(int, void*, SIZE_T, OFF_T) -->
    <function-decl name='__interceptor_pwrite' mangled-name='__interceptor_pwrite' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_pwrite' hash='961c0ae14eb4a37c'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1'/>
      <!-- parameter of type 'typedef SIZE_T' -->
