<abi-corpus version='2.4'>
  <elf-needed>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_Z3barRKSs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z3fooRKSs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNSt11char_traitsIcE6lengthEPKc' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZStplIcSt11char_traitsIcESaIcEESbIT_T0_T1_EPKS3_RKS6_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='test24-drop-fns.cc' comp-dir-path='/home/dodji/git/libabigail.git/suppr/tests/data/test-read-dwarf' language='LANG_C_plus_plus'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-2'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='32' hash='932523ac2c3bfb84' id='type-id-3'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-5'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' hash='e9e9b320886d9aa6' id='type-id-6'/>
    <type-decl name='float' size-in-bits='32' hash='d7ec3bf03d3c5690' id='type-id-7'/>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-8'/>
    <type-decl name='long double' size-in-bits='128' hash='2a9bbfe8bb0475f1#2' id='type-id-9'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-10'/>
    <type-decl name='long long int' size-in-bits='64' hash='5ae7f9eec1fc43d6#3' id='type-id-11'/>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#4' id='type-id-12'/>
    <type-decl name='sizetype' size-in-bits='64' hash='3e84f1a1648448f5' id='type-id-4'/>
    <class-decl name='__mbstate_t' is-struct='yes' naming-typedef-id='type-id-13' visibility='default' size-in-bits='64' filepath='/usr/include/wchar.h' line='83' column='1' hash='e97fe294ce223fec' id='type-id-14'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='/usr/include/wchar.h' line='86' column='1' hash='db9d16b710a8f305' id='type-id-15'>
          <data-member access='public'>
            <var-decl name='__wch' type-id='type-id-16' visibility='default' filepath='/usr/include/wchar.h' line='88' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='__wchb' type-id='type-id-3' visibility='default' filepath='/usr/include/wchar.h' line='92' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-8' visibility='default' filepath='/usr/include/wchar.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-15' visibility='default' filepath='/usr/include/wchar.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lconv' is-struct='yes' visibility='default' size-in-bits='768' filepath='/usr/include/locale.h' line='53' column='1' hash='91b2fd0786b4df3e' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='type-id-18' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='type-id-2' visibility='default' filepath='/usr/include/locale.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/include/time.h' line='133' column='1' hash='831fa813c3806379' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-10' visibility='default' filepath='/usr/include/time.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-20' visibility='default' filepath='/usr/include/time.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='typedef __va_list_tag __va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='82aec996f90384a2' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Atomic_word' type-id='type-id-8' size-in-bits='32' filepath='/usr/include/c++/5.3.1/x86_64-redhat-linux/bits/atomic_word.h' line='32' column='1' hash='09d17c08f594edc7' id='type-id-23'/>
    <typedef-decl name='__int32_t' type-id='type-id-8' size-in-bits='32' filepath='/usr/include/bits/types.h' line='40' column='1' hash='09d17c08f594edc7' id='type-id-24'/>
    <typedef-decl name='__mbstate_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/wchar.h' line='94' column='1' id='type-id-13'/>
    <typedef-decl name='mbstate_t' type-id='type-id-13' size-in-bits='64' filepath='/usr/include/wchar.h' line='106' column='1' id='type-id-25'/>
    <typedef-decl name='size_t' type-id='type-id-26' size-in-bits='64' filepath='/usr/lib/gcc/x86_64-redhat-linux/5.3.1/include/stddef.h' line='216' column='1' hash='8fdc5eea2983a729' id='type-id-27'/>
    <typedef-decl name='wctrans_t' type-id='type-id-28' size-in-bits='64' filepath='/usr/include/wctype.h' line='186' column='1' hash='96e1bfcb27b9d6ed' id='type-id-29'/>
    <typedef-decl name='wctype_t' type-id='type-id-26' size-in-bits='64' filepath='/usr/include/wctype.h' line='52' column='1' hash='8fdc5eea2983a729' id='type-id-30'/>
    <typedef-decl name='wint_t' type-id='type-id-16' size-in-bits='32' filepath='/usr/lib/gcc/x86_64-redhat-linux/5.3.1/include/stddef.h' line='357' column='1' hash='e66b43f97c38e87a' id='type-id-31'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-16'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-26'/>
    <type-decl name='unsigned long long int' size-in-bits='64' hash='ebdfc4685a1e82df#3' id='type-id-32'/>
    <type-decl name='wchar_t' size-in-bits='32' hash='4b224bc24abb5f1b' id='type-id-33'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' hash='608f46af5d93b320' id='type-id-35'/>
    <reference-type-def kind='lvalue' type-id='type-id-2' size-in-bits='64' hash='ffc913127619398d' id='type-id-36'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-18'/>
    <qualified-type-def type-id='type-id-34' const='yes' hash='d0c896a319e39135' id='type-id-37'/>
    <reference-type-def kind='lvalue' type-id='type-id-37' size-in-bits='64' hash='9a4f67b0de72c33d' id='type-id-38'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' hash='0481e4c0dbe5485f' id='type-id-39'/>
    <qualified-type-def type-id='type-id-24' const='yes' hash='3aaf0f2479f2834c' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' hash='96e1bfcb27b9d6ed' id='type-id-28'/>
    <qualified-type-def type-id='type-id-2' const='yes' hash='3e50fd33f9bb78d9' id='type-id-41'/>
    <reference-type-def kind='lvalue' type-id='type-id-41' size-in-bits='64' hash='78bf127c69ae91c1' id='type-id-42'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' hash='c44743f354f6a443' id='type-id-20'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-43'/>
    <qualified-type-def type-id='type-id-8' const='yes' hash='8cef8df4b6728924' id='type-id-44'/>
    <qualified-type-def type-id='type-id-10' const='yes' hash='ea466b949f1ce7b6#2' id='type-id-45'/>
    <qualified-type-def type-id='type-id-25' const='yes' hash='a328f2686e4dcc6e' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' hash='965b139f91617649' id='type-id-47'/>
    <qualified-type-def type-id='type-id-12' const='yes' hash='fa0f98d319d2e5f4#3' id='type-id-48'/>
    <qualified-type-def type-id='type-id-49' const='yes' hash='902ffeb42efa2254' id='type-id-50'/>
    <reference-type-def kind='lvalue' type-id='type-id-50' size-in-bits='64' hash='7d4280c016344b59' id='type-id-51'/>
    <qualified-type-def type-id='type-id-52' const='yes' hash='42938116911f2585' id='type-id-53'/>
    <reference-type-def kind='lvalue' type-id='type-id-53' size-in-bits='64' hash='ebc94b0648ba0254' id='type-id-54'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' hash='f14dbace06951209' id='type-id-55'/>
    <qualified-type-def type-id='type-id-56' const='yes' hash='7226944aa4e46352' id='type-id-57'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' hash='61c33da8fd0cc9a8' id='type-id-58'/>
    <qualified-type-def type-id='type-id-59' const='yes' hash='f3ad494e9f7aea44' id='type-id-60'/>
    <qualified-type-def type-id='type-id-61' const='yes' hash='0d301f00e830e5eb' id='type-id-62'/>
    <reference-type-def kind='lvalue' type-id='type-id-62' size-in-bits='64' hash='d98a60be7234f7c8' id='type-id-63'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' hash='f4903706bce76c85' id='type-id-64'/>
    <qualified-type-def type-id='type-id-65' const='yes' hash='9c3f1503b45b0328' id='type-id-66'/>
    <reference-type-def kind='lvalue' type-id='type-id-66' size-in-bits='64' hash='00b5256d58d8bd92' id='type-id-67'/>
    <qualified-type-def type-id='type-id-68' const='yes' hash='18782c365e5b3732' id='type-id-69'/>
    <reference-type-def kind='lvalue' type-id='type-id-69' size-in-bits='64' hash='c1a2c2d06c5e591e' id='type-id-70'/>
    <qualified-type-def type-id='type-id-19' const='yes' hash='6d30d2c0485b21b8' id='type-id-71'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' hash='934b82f269d593b3' id='type-id-72'/>
    <qualified-type-def type-id='type-id-33' const='yes' hash='f2fba7dbc42fc9d5' id='type-id-73'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' hash='317089067e76910a' id='type-id-74'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' hash='535c62eb027026ae' id='type-id-75'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' hash='6921f81febec828e' id='type-id-76'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' hash='18fb85b101e2cd25' id='type-id-77'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' hash='e3d0c180eee5d782' id='type-id-78'/>
    <reference-type-def kind='lvalue' type-id='type-id-52' size-in-bits='64' hash='d8ed513ed2f704b1' id='type-id-79'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' hash='c23efea4cbf2dbe8' id='type-id-80'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' hash='9d029584a1ffef40' id='type-id-82'/>
    <reference-type-def kind='lvalue' type-id='type-id-56' size-in-bits='64' hash='dce7c83b7dca5265' id='type-id-83'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' hash='0eeadcf9df869442' id='type-id-84'/>
    <reference-type-def kind='lvalue' type-id='type-id-61' size-in-bits='64' hash='75929b1513585467' id='type-id-85'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' hash='4cef840ef4725ab6' id='type-id-86'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' hash='648313adc1c4c534' id='type-id-87'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' hash='fb9a8c973ae04ed8' id='type-id-88'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' hash='f6157ba411f3141d' id='type-id-89'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-91'/>
    <namespace-decl name='std'>
      <class-decl name='allocator&lt;char&gt;' visibility='default' size-in-bits='8' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='92' column='1' hash='0e29bc311ca95715' id='type-id-49'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-34'/>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-42' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='100' column='1' hash='78bf127c69ae91c1' id='type-id-92'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-36' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='99' column='1' hash='ffc913127619398d' id='type-id-93'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-95' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/allocator.h' line='95' column='1' hash='8fdc5eea2983a729' id='type-id-94'/>
        </member-type>
      </class-decl>
      <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' visibility='default' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2510' column='1' hash='41e28a36dddcbfdb' id='type-id-52'>
        <member-type access='private'>
          <class-decl name='_Alloc_hider' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2670' column='1' hash='b2053c926fcda493' id='type-id-81'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-49'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_p' type-id='type-id-18' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2675' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2553' column='1' hash='1100d7022e36b961' id='type-id-56'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-96'/>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep_base' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2546' column='1' hash='ef64d4b91b5de2fe' id='type-id-96'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_length' type-id='type-id-59' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2548' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_capacity' type-id='type-id-59' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2549' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_M_refcount' type-id='type-id-23' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2550' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-49' size-in-bits='8' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2518' column='1' id='type-id-97'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-92' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2522' column='1' hash='78bf127c69ae91c1' id='type-id-98'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-93' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2521' column='1' hash='ffc913127619398d' id='type-id-99'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-94' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2519' column='1' hash='8fdc5eea2983a729' id='type-id-59'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-101' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2527' column='1' id='type-id-100'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-103' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2528' column='1' id='type-id-102'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-105' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2525' column='1' id='type-id-104'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-107' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2529' column='1' id='type-id-106'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_dataplus' type-id='type-id-81' visibility='default' filepath='/usr/include/c++/5.3.1/bits/basic_string.h' line='2687' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='char_traits&lt;char&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='/usr/include/c++/5.3.1/bits/char_traits.h' line='233' column='1' hash='fc88b5d70352b916' id='type-id-108'>
        <member-type access='public'>
          <typedef-decl name='char_type' type-id='type-id-2' size-in-bits='8' filepath='/usr/include/c++/5.3.1/bits/char_traits.h' line='235' column='1' hash='65b2d157027b431a' id='type-id-61'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='int_type' type-id='type-id-8' size-in-bits='32' filepath='/usr/include/c++/5.3.1/bits/char_traits.h' line='236' column='1' hash='09d17c08f594edc7' id='type-id-65'/>
        </member-type>
        <member-function access='public' static='yes'>
          <function-decl name='length' mangled-name='_ZNSt11char_traitsIcE6lengthEPKc' filepath='/usr/include/c++/5.3.1/bits/char_traits.h' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt11char_traitsIcE6lengthEPKc' hash='020ad60f75c8b018'>
            <parameter type-id='type-id-64'/>
            <return type-id='type-id-95'/>
          </function-decl>
        </member-function>
      </class-decl>
      <typedef-decl name='size_t' type-id='type-id-26' size-in-bits='64' filepath='/usr/include/c++/5.3.1/x86_64-redhat-linux/bits/c++config.h' line='1969' column='1' hash='8fdc5eea2983a729' id='type-id-95'/>
      <typedef-decl name='string' type-id='type-id-52' size-in-bits='64' filepath='/usr/include/c++/5.3.1/bits/stringfwd.h' line='74' column='1' id='type-id-68'/>
      <class-decl name='basic_ostream&lt;char, std::char_traits&lt;char&gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-109'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char const*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-103'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char*, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-107'/>
      <function-decl name='operator+&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' mangled-name='_ZStplIcSt11char_traitsIcESaIcEESbIT_T0_T1_EPKS3_RKS6_' filepath='/usr/include/c++/5.3.1/bits/basic_string.tcc' line='1151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZStplIcSt11char_traitsIcESaIcEESbIT_T0_T1_EPKS3_RKS6_' hash='af03af46bc40880c'>
        <parameter type-id='type-id-20'/>
        <parameter type-id='type-id-54'/>
        <return type-id='type-id-52'/>
      </function-decl>
      <typedef-decl name='ostream' type-id='type-id-109' filepath='/usr/include/c++/5.3.1/iosfwd' line='141' column='1' id='type-id-110'/>
    </namespace-decl>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-111'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-112'/>
    <function-decl name='foo' mangled-name='_Z3fooRKSs' filepath='/home/dodji/git/libabigail.git/suppr/tests/data/test-read-dwarf/test24-drop-fns.cc' line='14' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z3fooRKSs' hash='e4d69d935f5c1015'>
      <parameter type-id='type-id-70' filepath='/home/dodji/git/libabigail.git/suppr/tests/data/test-read-dwarf/test24-drop-fns.cc' line='14' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
