<abi-corpus version='2.4'>
  <elf-needed>
    <dependency name='build/cached/third_party/boost-1.60.0/libboost_system.so'/>
    <dependency name='libm.so.6'/>
    <dependency name='libssl.so.1.0.0'/>
    <dependency name='libcrypto.so.1.0.0'/>
    <dependency name='librt.so.1'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libatomic.so.1'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_ZN5boost10shared_ptrINS_9iostreams6detail16mapped_file_implEE5resetIS3_EEvPT_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN5boost10shared_ptrINS_9iostreams6detail20file_descriptor_implEE5resetIS3_EEvPT_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN5boost15throw_exceptionINSt8ios_base7failureB5cxx11EEEvRKT_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN5boost16exception_detail20copy_boost_exceptionEPNS_9exceptionEPKS1_' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZNK5boost9iostreams18mapped_file_source7is_openEv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK5boost9iostreams18mapped_file_sourcecvMNS1_16safe_bool_helperEiEv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK5boost9iostreams18mapped_file_sourcentEv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK5boost9iostreams6detail20file_descriptor_impl7is_openEv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='_ZTIN5boost16exception_detail10clone_baseE' size='16' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost16exception_detail10clone_implINS0_19error_info_injectorINSt8ios_base7failureB5cxx11EEEEE' size='56' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost16exception_detail19error_info_injectorINSt8ios_base7failureB5cxx11EEE' size='56' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost6detail15sp_counted_baseE' size='16' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost6detail17sp_counted_impl_pINS_9iostreams6detail16mapped_file_implEEE' size='24' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost6detail17sp_counted_impl_pINS_9iostreams6detail20file_descriptor_implEEE' size='24' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN5boost9exceptionE' size='16' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost16exception_detail10clone_baseE' size='39' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost16exception_detail10clone_implINS0_19error_info_injectorINSt8ios_base7failureB5cxx11EEEEE' size='97' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost16exception_detail19error_info_injectorINSt8ios_base7failureB5cxx11EEE' size='78' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost6detail15sp_counted_baseE' size='33' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost6detail17sp_counted_impl_pINS_9iostreams6detail16mapped_file_implEEE' size='76' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost6detail17sp_counted_impl_pINS_9iostreams6detail20file_descriptor_implEEE' size='80' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN5boost9exceptionE' size='19' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' comp-dir-path='/home/andrew/Documents/10gen/dev/src/mongodb' language='LANG_C_plus_plus'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-2'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='32' hash='932523ac2c3bfb84' id='type-id-3'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-4' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-5'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' hash='e9e9b320886d9aa6' id='type-id-6'/>
    <type-decl name='float' size-in-bits='32' hash='d7ec3bf03d3c5690' id='type-id-7'/>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-8'/>
    <pointer-to-member-type member-type-id='type-id-8' containing-type-id='type-id-9' size-in-bits='64' hash='05e960c485f909aa' id='type-id-10'/>
    <type-decl name='long double' size-in-bits='128' hash='2a9bbfe8bb0475f1#2' id='type-id-11'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-12'/>
    <type-decl name='long long int' size-in-bits='64' hash='5ae7f9eec1fc43d6#3' id='type-id-13'/>
    <type-decl name='sizetype' size-in-bits='64' hash='3e84f1a1648448f5' id='type-id-4'/>
    <class-decl name='__mbstate_t' is-struct='yes' naming-typedef-id='type-id-14' visibility='default' size-in-bits='64' filepath='/usr/include/wchar.h' line='82' column='1' hash='e97fe294ce223fec' id='type-id-15'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='/usr/include/wchar.h' line='85' column='1' hash='db9d16b710a8f305' id='type-id-16'>
          <data-member access='public'>
            <var-decl name='__wch' type-id='type-id-17' visibility='default' filepath='/usr/include/wchar.h' line='88' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='__wchb' type-id='type-id-3' visibility='default' filepath='/usr/include/wchar.h' line='92' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-8' visibility='default' filepath='/usr/include/wchar.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-16' visibility='default' filepath='/usr/include/wchar.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='3cf0fd8284404e34' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ldiv_t' is-struct='yes' naming-typedef-id='type-id-20' visibility='default' size-in-bits='128' filepath='/usr/include/stdlib.h' line='105' column='1' hash='f73ee30feb9e9f76' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-12' visibility='default' filepath='/usr/include/stdlib.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-12' visibility='default' filepath='/usr/include/stdlib.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lldiv_t' is-struct='yes' naming-typedef-id='type-id-22' visibility='default' size-in-bits='128' filepath='/usr/include/stdlib.h' line='117' column='1' hash='564e04be97ca0408' id='type-id-23'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-13' visibility='default' filepath='/usr/include/stdlib.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-13' visibility='default' filepath='/usr/include/stdlib.h' line='120' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/include/time.h' line='133' column='1' hash='831fa813c3806379' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-12' visibility='default' filepath='/usr/include/time.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-25' visibility='default' filepath='/usr/include/time.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_G_fpos_t' type-id='type-id-21' size-in-bits='128' filepath='/usr/include/_G_config.h' line='25' column='1' id='type-id-26'/>
    <typedef-decl name='__clock_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='135' column='1' hash='b119fe0931d2ee10' id='type-id-27'/>
    <typedef-decl name='__compar_fn_t' type-id='type-id-28' size-in-bits='64' filepath='/usr/include/stdlib.h' line='741' column='1' hash='fd7a63c0c6c822c4' id='type-id-29'/>
    <typedef-decl name='__int32_t' type-id='type-id-8' size-in-bits='32' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' hash='09d17c08f594edc7' id='type-id-30'/>
    <typedef-decl name='__mbstate_t' type-id='type-id-15' size-in-bits='64' filepath='/usr/include/wchar.h' line='94' column='1' id='type-id-14'/>
    <typedef-decl name='__time_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='139' column='1' hash='b119fe0931d2ee10' id='type-id-31'/>
    <typedef-decl name='clock_t' type-id='type-id-27' size-in-bits='64' filepath='/usr/include/time.h' line='59' column='1' hash='b119fe0931d2ee10' id='type-id-32'/>
    <typedef-decl name='div_t' type-id='type-id-21' size-in-bits='128' filepath='/usr/include/stdlib.h' line='101' column='1' id='type-id-33'/>
    <typedef-decl name='fpos_t' type-id='type-id-26' size-in-bits='128' filepath='/usr/include/stdio.h' line='110' column='1' id='type-id-34'/>
    <typedef-decl name='int_least32_t' type-id='type-id-8' size-in-bits='32' filepath='/usr/include/stdint.h' line='67' column='1' hash='09d17c08f594edc7' id='type-id-35'/>
    <typedef-decl name='intmax_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/stdint.h' line='134' column='1' hash='b119fe0931d2ee10' id='type-id-36'/>
    <typedef-decl name='ldiv_t' type-id='type-id-21' size-in-bits='128' filepath='/usr/include/stdlib.h' line='109' column='1' id='type-id-20'/>
    <typedef-decl name='lldiv_t' type-id='type-id-23' size-in-bits='128' filepath='/usr/include/stdlib.h' line='121' column='1' id='type-id-22'/>
    <typedef-decl name='mbstate_t' type-id='type-id-14' size-in-bits='64' filepath='/usr/include/wchar.h' line='106' column='1' id='type-id-37'/>
    <typedef-decl name='size_t' type-id='type-id-38' size-in-bits='64' filepath='/usr/lib/llvm-3.9/bin/../lib/clang/3.9.1/include/stddef.h' line='62' column='1' hash='8fdc5eea2983a729' id='type-id-39'/>
    <typedef-decl name='time_t' type-id='type-id-31' size-in-bits='64' filepath='/usr/include/time.h' line='75' column='1' hash='b119fe0931d2ee10' id='type-id-40'/>
    <typedef-decl name='wctrans_t' type-id='type-id-41' size-in-bits='64' filepath='/usr/include/wctype.h' line='186' column='1' hash='96e1bfcb27b9d6ed' id='type-id-42'/>
    <typedef-decl name='wctype_t' type-id='type-id-38' size-in-bits='64' filepath='/usr/include/wctype.h' line='52' column='1' hash='8fdc5eea2983a729' id='type-id-43'/>
    <typedef-decl name='wint_t' type-id='type-id-17' size-in-bits='32' filepath='/usr/lib/llvm-3.9/bin/../lib/clang/3.9.1/include/stddef.h' line='132' column='1' hash='e66b43f97c38e87a' id='type-id-44'/>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='type-id-45'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-17'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-38'/>
    <type-decl name='unsigned long long int' size-in-bits='64' hash='ebdfc4685a1e82df#3' id='type-id-46'/>
    <type-decl name='wchar_t' size-in-bits='32' hash='4b224bc24abb5f1b' id='type-id-47'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' hash='39fc40d7ba4ca689' id='type-id-48'/>
    <reference-type-def kind='lvalue' type-id='type-id-49' size-in-bits='64' hash='9c0c84d44b5ee339' id='type-id-50'/>
    <reference-type-def kind='rvalue' type-id='type-id-49' size-in-bits='64' hash='6a617d67e2de0301' id='type-id-51'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' hash='49ce24a983d58ef3' id='type-id-52'/>
    <reference-type-def kind='lvalue' type-id='type-id-53' size-in-bits='64' hash='f4b09dd1b44324ba' id='type-id-54'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' hash='9ae25daa6fb15dde' id='type-id-55'/>
    <reference-type-def kind='lvalue' type-id='type-id-56' size-in-bits='64' hash='790816064a45801c' id='type-id-57'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' hash='cfede871914a6db3' id='type-id-58'/>
    <reference-type-def kind='lvalue' type-id='type-id-59' size-in-bits='64' hash='aa2237a0fed79def' id='type-id-60'/>
    <reference-type-def kind='rvalue' type-id='type-id-59' size-in-bits='64' hash='5532a332ebfd9d42' id='type-id-61'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' hash='e7187a72011eb60b' id='type-id-62'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' hash='2fbe9a4f7da96492' id='type-id-64'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' hash='a37bd087479cbe62' id='type-id-66'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' hash='40865ecbbedc3c3c' id='type-id-68'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' hash='cefb4e97ae155afa' id='type-id-70'/>
    <reference-type-def kind='lvalue' type-id='type-id-71' size-in-bits='64' hash='4946f9689529fb73' id='type-id-72'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' hash='004b0f9fe58567f6' id='type-id-73'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' hash='885c3cc99e75deb2' id='type-id-75'/>
    <reference-type-def kind='lvalue' type-id='type-id-76' size-in-bits='64' hash='f2f6362bacc51f48' id='type-id-77'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' hash='df96572da91d8a75' id='type-id-78'/>
    <reference-type-def kind='lvalue' type-id='type-id-79' size-in-bits='64' hash='5d681b02444f9817' id='type-id-80'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' hash='914b81c2ab3a4937' id='type-id-81'/>
    <reference-type-def kind='lvalue' type-id='type-id-82' size-in-bits='64' hash='b716055c22ba74ea' id='type-id-83'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' hash='29d6e7ee47b20b72' id='type-id-85'/>
    <reference-type-def kind='lvalue' type-id='type-id-86' size-in-bits='64' hash='54199a9248c6bf47' id='type-id-87'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' hash='722bc3120c90bfae' id='type-id-88'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' hash='9d2cd3c73b594e5a' id='type-id-90'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' hash='4cef840ef4725ab6' id='type-id-92'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' hash='c6650be88a0231d6' id='type-id-94'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' hash='f085edea825c57a8' id='type-id-96'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' hash='99beceeb265886e6' id='type-id-98'/>
    <reference-type-def kind='lvalue' type-id='type-id-99' size-in-bits='64' hash='4004f0dfc8a9e965' id='type-id-100'/>
    <reference-type-def kind='rvalue' type-id='type-id-99' size-in-bits='64' hash='6ff05e4f4c1acf46' id='type-id-101'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' hash='36ad1b7787500072' id='type-id-102'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' hash='ec4fb3c2e8e35e26' id='type-id-104'/>
    <reference-type-def kind='lvalue' type-id='type-id-105' size-in-bits='64' hash='80eb43eca180a101' id='type-id-106'/>
    <reference-type-def kind='rvalue' type-id='type-id-105' size-in-bits='64' hash='6ddddf0d6856a91b' id='type-id-107'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' hash='a653308902fbe06d' id='type-id-108'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' hash='ec4fb3c2e8e35e26#2' id='type-id-110'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-111'/>
    <qualified-type-def type-id='type-id-111' restrict='yes' hash='566dfacc48804f50' id='type-id-112'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' hash='a93039fe023ed77b' id='type-id-113'/>
    <qualified-type-def type-id='type-id-113' restrict='yes' hash='b04f089b5ae14a6d' id='type-id-114'/>
    <qualified-type-def type-id='type-id-30' const='yes' hash='3aaf0f2479f2834c' id='type-id-115'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' hash='96e1bfcb27b9d6ed' id='type-id-41'/>
    <qualified-type-def type-id='type-id-49' const='yes' hash='173e95aad8bf3e0d' id='type-id-116'/>
    <reference-type-def kind='lvalue' type-id='type-id-116' size-in-bits='64' hash='f812cc142a038176' id='type-id-117'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' hash='bca3047a254337a8' id='type-id-118'/>
    <qualified-type-def type-id='type-id-53' const='yes' hash='b6ae999616d0fd25' id='type-id-119'/>
    <reference-type-def kind='lvalue' type-id='type-id-119' size-in-bits='64' hash='78b0ce8e98bd3bdb' id='type-id-120'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' hash='935d99e043ae4790' id='type-id-121'/>
    <qualified-type-def type-id='type-id-56' const='yes' hash='9478066a592ab653' id='type-id-122'/>
    <reference-type-def kind='lvalue' type-id='type-id-122' size-in-bits='64' hash='b7b0c064d75ca3b5' id='type-id-123'/>
    <qualified-type-def type-id='type-id-59' const='yes' hash='2950bb6143b1947d' id='type-id-124'/>
    <reference-type-def kind='lvalue' type-id='type-id-124' size-in-bits='64' hash='a1e25fb07e43e967' id='type-id-125'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' hash='f47065404cad6a3d' id='type-id-126'/>
    <qualified-type-def type-id='type-id-63' const='yes' hash='4342cef923c23716' id='type-id-127'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' hash='ab5154e50426816a' id='type-id-128'/>
    <qualified-type-def type-id='type-id-65' const='yes' hash='43d7f46e13cae650' id='type-id-129'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' hash='bb08cf494ca932f2' id='type-id-130'/>
    <qualified-type-def type-id='type-id-67' const='yes' hash='87ba99ebc40e3a99' id='type-id-131'/>
    <reference-type-def kind='lvalue' type-id='type-id-131' size-in-bits='64' hash='132d2beaec784881' id='type-id-132'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' hash='f02f73a6cf6afaea' id='type-id-133'/>
    <qualified-type-def type-id='type-id-69' const='yes' hash='3e3ea629beff135e' id='type-id-134'/>
    <reference-type-def kind='lvalue' type-id='type-id-134' size-in-bits='64' hash='2d974ea3123a4f1b' id='type-id-135'/>
    <qualified-type-def type-id='type-id-71' const='yes' hash='b93ecccc7d2a732c' id='type-id-136'/>
    <reference-type-def kind='lvalue' type-id='type-id-136' size-in-bits='64' hash='80b1f817bd14db9f' id='type-id-137'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' hash='10b33576b4958e56' id='type-id-138'/>
    <qualified-type-def type-id='type-id-74' const='yes' hash='e7945002ce310551' id='type-id-139'/>
    <reference-type-def kind='lvalue' type-id='type-id-139' size-in-bits='64' hash='332c8664c8c721cc' id='type-id-140'/>
    <qualified-type-def type-id='type-id-76' const='yes' hash='75385df31df2599e' id='type-id-141'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' hash='1fd2dcf785bfd66c' id='type-id-142'/>
    <qualified-type-def type-id='type-id-79' const='yes' hash='3b5177699d6eedb3' id='type-id-143'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' hash='3d99bf3945f5fa25' id='type-id-144'/>
    <qualified-type-def type-id='type-id-86' const='yes' hash='148b5aff85bcec6d' id='type-id-145'/>
    <reference-type-def kind='lvalue' type-id='type-id-145' size-in-bits='64' hash='cd910ddf5ff7890d' id='type-id-146'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' hash='77815f74cfb97065' id='type-id-147'/>
    <qualified-type-def type-id='type-id-89' const='yes' hash='ae5bfeb03391417a' id='type-id-148'/>
    <reference-type-def kind='lvalue' type-id='type-id-148' size-in-bits='64' hash='547c3815bd9cdcc8' id='type-id-149'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' hash='d588e4d7c957aaf1' id='type-id-150'/>
    <qualified-type-def type-id='type-id-91' const='yes' hash='0d301f00e830e5eb' id='type-id-151'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' hash='f4903706bce76c85' id='type-id-152'/>
    <qualified-type-def type-id='type-id-93' const='yes' hash='928b785ef21561de' id='type-id-153'/>
    <reference-type-def kind='lvalue' type-id='type-id-153' size-in-bits='64' hash='dc42ed39ede29efe' id='type-id-154'/>
    <qualified-type-def type-id='type-id-95' const='yes' hash='0a3d02d12f5fad56' id='type-id-155'/>
    <reference-type-def kind='lvalue' type-id='type-id-155' size-in-bits='64' hash='4d84d1781e7de2ab' id='type-id-156'/>
    <qualified-type-def type-id='type-id-97' const='yes' hash='68190ae312af4f38' id='type-id-157'/>
    <reference-type-def kind='lvalue' type-id='type-id-157' size-in-bits='64' hash='0f8c4c036faf07fa' id='type-id-158'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' hash='0e6552e15b3de876' id='type-id-159'/>
    <qualified-type-def type-id='type-id-160' const='yes' hash='9d7c97e4080ed510' id='type-id-161'/>
    <reference-type-def kind='lvalue' type-id='type-id-161' size-in-bits='64' hash='86e6519a5bbe41a5' id='type-id-162'/>
    <qualified-type-def type-id='type-id-99' const='yes' hash='4397f867e181030f' id='type-id-163'/>
    <reference-type-def kind='lvalue' type-id='type-id-163' size-in-bits='64' hash='f4213ecb1e5210ff' id='type-id-164'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' hash='1fe7b4bcfcb2038a' id='type-id-165'/>
    <qualified-type-def type-id='type-id-105' const='yes' hash='ad7d95fd6ee6bd47' id='type-id-166'/>
    <reference-type-def kind='lvalue' type-id='type-id-166' size-in-bits='64' hash='2a28b4080601db58' id='type-id-167'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' hash='9a78af697d9fb3e5' id='type-id-168'/>
    <qualified-type-def type-id='type-id-2' const='yes' hash='3e50fd33f9bb78d9' id='type-id-169'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' hash='c44743f354f6a443' id='type-id-25'/>
    <qualified-type-def type-id='type-id-25' restrict='yes' hash='b7d5472019e79b5f' id='type-id-170'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-171'/>
    <qualified-type-def type-id='type-id-171' restrict='yes' hash='fbe490393272f46f' id='type-id-172'/>
    <qualified-type-def type-id='type-id-34' const='yes' hash='d85759e223fc0d30' id='type-id-173'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' hash='f7e9f827001f357b' id='type-id-174'/>
    <qualified-type-def type-id='type-id-37' const='yes' hash='a328f2686e4dcc6e' id='type-id-175'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' hash='965b139f91617649' id='type-id-176'/>
    <qualified-type-def type-id='type-id-177' const='yes' hash='0d8f9d9650b5d747' id='type-id-178'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' hash='cd27a0d647279ed7' id='type-id-179'/>
    <qualified-type-def type-id='type-id-180' const='yes' hash='71f635ccf79eea6a' id='type-id-181'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' hash='2746fb84b9877a09' id='type-id-182'/>
    <qualified-type-def type-id='type-id-183' const='yes' hash='eb6db0d6f25cbef0' id='type-id-184'/>
    <reference-type-def kind='lvalue' type-id='type-id-184' size-in-bits='64' hash='69f19426160ba2bb' id='type-id-185'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' hash='dbdc1c6849daf261' id='type-id-186'/>
    <qualified-type-def type-id='type-id-187' const='yes' hash='57eecf60b200d8e2' id='type-id-188'/>
    <reference-type-def kind='lvalue' type-id='type-id-188' size-in-bits='64' hash='abebe63256823f5c' id='type-id-189'/>
    <qualified-type-def type-id='type-id-40' const='yes' hash='3d3ed5b21cd59821' id='type-id-190'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' hash='5933014f14812f40' id='type-id-191'/>
    <qualified-type-def type-id='type-id-24' const='yes' hash='6d30d2c0485b21b8' id='type-id-192'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' hash='934b82f269d593b3' id='type-id-193'/>
    <qualified-type-def type-id='type-id-193' restrict='yes' hash='eb8bfc989b1d24fd' id='type-id-194'/>
    <qualified-type-def type-id='type-id-47' const='yes' hash='f2fba7dbc42fc9d5' id='type-id-195'/>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' hash='317089067e76910a' id='type-id-196'/>
    <qualified-type-def type-id='type-id-196' restrict='yes' hash='a7cbe991932f15ea' id='type-id-197'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' hash='535c62eb027026ae' id='type-id-198'/>
    <qualified-type-def type-id='type-id-198' restrict='yes' hash='b4619c63bc369da8' id='type-id-199'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' hash='dd31f93f4361bc41' id='type-id-200'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' hash='7d5bf80d5b25efb1' id='type-id-201'/>
    <qualified-type-def type-id='type-id-201' restrict='yes' hash='27e7da842baf24fa' id='type-id-202'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-28'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' hash='3fd83b2c14ae2f2f' id='type-id-204'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' hash='18fb85b101e2cd25' id='type-id-205'/>
    <qualified-type-def type-id='type-id-205' restrict='yes' hash='42a15c82a35f0371' id='type-id-206'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' hash='a5dba88f5d9452df' id='type-id-207'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' hash='2d9edde74ded9d27' id='type-id-208'/>
    <reference-type-def kind='lvalue' type-id='type-id-183' size-in-bits='64' hash='be327758a6483de1' id='type-id-209'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' hash='336ae7322422c69e' id='type-id-210'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' hash='784a05f2083b5c30' id='type-id-211'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' hash='0450557ac0931bcf' id='type-id-212'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-214'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' hash='fb9a8c973ae04ed8' id='type-id-215'/>
    <qualified-type-def type-id='type-id-215' restrict='yes' hash='d4434201fa643c76' id='type-id-216'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' hash='f6157ba411f3141d' id='type-id-217'/>
    <qualified-type-def type-id='type-id-217' restrict='yes' hash='ba836cf7b0a451a7' id='type-id-218'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-220'/>
    <qualified-type-def type-id='type-id-220' restrict='yes' id='type-id-221'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-223'/>
    <qualified-type-def type-id='type-id-223' restrict='yes' id='type-id-224'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-226'/>
    <qualified-type-def type-id='type-id-227' const='yes' id='type-id-228'/>
    <reference-type-def kind='lvalue' type-id='type-id-228' size-in-bits='64' id='type-id-229'/>
    <qualified-type-def type-id='type-id-230' const='yes' id='type-id-231'/>
    <reference-type-def kind='lvalue' type-id='type-id-231' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-231' size-in-bits='64' id='type-id-233'/>
    <qualified-type-def type-id='type-id-234' const='yes' id='type-id-235'/>
    <reference-type-def kind='lvalue' type-id='type-id-235' size-in-bits='64' id='type-id-236'/>
    <qualified-type-def type-id='type-id-237' const='yes' id='type-id-238'/>
    <reference-type-def kind='lvalue' type-id='type-id-238' size-in-bits='64' id='type-id-239'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-241'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-242'/>
    <class-decl name='lconv' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-240'/>
    <type-decl name='variadic parameter type' id='type-id-243'/>
    <qualified-type-def type-id='type-id-19' restrict='yes' id='type-id-244'/>
    <qualified-type-def type-id='type-id-19' restrict='yes' id='type-id-245'/>
    <namespace-decl name='std'>
      <class-decl name='fpos&lt;__mbstate_t&gt;' visibility='default' size-in-bits='128' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/postypes.h' line='112' column='1' hash='f8284cd71d4bc4e6' id='type-id-183'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_off' type-id='type-id-246' visibility='default' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/postypes.h' line='115' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_state' type-id='type-id-15' visibility='default' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/postypes.h' line='116' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='ios_base' visibility='default' size-in-bits='1728' hash='688f6a57eb0d4d69' id='type-id-247'>
        <member-type access='private'>
          <class-decl name='failure' visibility='default' size-in-bits='256' hash='a1d127d0dd3a03ba' id='type-id-187'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='openmode' type-id='type-id-249' size-in-bits='32' alignment-in-bits='32' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/ios_base.h' line='429' column='1' hash='383dec6b2a959b4a' id='type-id-248'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='seekdir' type-id='type-id-251' size-in-bits='32' alignment-in-bits='32' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/ios_base.h' line='461' column='1' hash='cc81a470c8adf5ed' id='type-id-250'/>
        </member-type>
      </class-decl>
      <class-decl name='system_error' visibility='default' size-in-bits='256' hash='cbf6bb0e9a863f59' id='type-id-252'/>
      <enum-decl name='_Ios_Openmode' size-in-bits='32' alignment-in-bits='32' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/ios_base.h' line='111' column='1' hash='383dec6b2a959b4a' id='type-id-249'>
        <underlying-type type-id='type-id-45'/>
        <enumerator name='_S_app' value='1'/>
        <enumerator name='_S_ate' value='2'/>
        <enumerator name='_S_bin' value='4'/>
        <enumerator name='_S_in' value='8'/>
        <enumerator name='_S_out' value='16'/>
        <enumerator name='_S_trunc' value='32'/>
        <enumerator name='_S_ios_openmode_end' value='65536'/>
        <enumerator name='_S_ios_openmode_max' value='2147483647'/>
        <enumerator name='_S_ios_openmode_min' value='-2147483648'/>
      </enum-decl>
      <enum-decl name='_Ios_Seekdir' size-in-bits='32' alignment-in-bits='32' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/ios_base.h' line='193' column='1' hash='cc81a470c8adf5ed' id='type-id-251'>
        <underlying-type type-id='type-id-45'/>
        <enumerator name='_S_beg' value='0'/>
        <enumerator name='_S_cur' value='1'/>
        <enumerator name='_S_end' value='2'/>
        <enumerator name='_S_ios_seekdir_end' value='65536'/>
      </enum-decl>
      <enum-decl name='io_errc' size-in-bits='32' alignment-in-bits='32' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/ios_base.h' line='203' column='1' hash='3d6ff242d1b692bd' id='type-id-253'>
        <underlying-type type-id='type-id-45'/>
        <enumerator name='stream' value='1'/>
      </enum-decl>
      <class-decl name='error_code' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/system_error' line='138' column='1' hash='9539f88cf8a9ae5c' id='type-id-177'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_value' type-id='type-id-8' visibility='default' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/system_error' line='190' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_cat' type-id='type-id-233' visibility='default' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/system_error' line='191' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='error_condition' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/system_error' line='216' column='1' hash='b084820c8a8adea0' id='type-id-180'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_value' type-id='type-id-8' visibility='default' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/system_error' line='264' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_cat' type-id='type-id-233' visibility='default' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/system_error' line='265' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='ptrdiff_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/x86_64-linux-gnu/c++/5.4.0/bits/c++config.h' line='197' column='1' hash='b119fe0931d2ee10' id='type-id-254'/>
      <typedef-decl name='size_t' type-id='type-id-38' size-in-bits='64' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/x86_64-linux-gnu/c++/5.4.0/bits/c++config.h' line='196' column='1' hash='8fdc5eea2983a729' id='type-id-255'/>
      <typedef-decl name='streamoff' type-id='type-id-12' size-in-bits='64' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/postypes.h' line='88' column='1' hash='b119fe0931d2ee10' id='type-id-246'/>
      <typedef-decl name='streampos' type-id='type-id-183' size-in-bits='128' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/postypes.h' line='228' column='1' id='type-id-256'/>
      <typedef-decl name='streamsize' type-id='type-id-254' size-in-bits='64' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/postypes.h' line='98' column='1' hash='b119fe0931d2ee10' id='type-id-257'/>
      <class-decl name='type_info' visibility='default' is-declaration-only='yes' id='type-id-258'/>
      <namespace-decl name='_V2'>
        <class-decl name='error_category' visibility='default' is-declaration-only='yes' id='type-id-230'/>
      </namespace-decl>
      <namespace-decl name='__cxx11'>
        <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-259'/>
        <class-decl name='basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-260'/>
        <typedef-decl name='string' type-id='type-id-259' size-in-bits='256' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/stringfwd.h' line='74' column='1' id='type-id-234'/>
        <typedef-decl name='wstring' type-id='type-id-260' size-in-bits='256' filepath='/usr/bin/../lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/bits/stringfwd.h' line='78' column='1' id='type-id-237'/>
      </namespace-decl>
    </namespace-decl>
    <typedef-decl name='FILE' type-id='type-id-242' size-in-bits='1728' filepath='/usr/include/stdio.h' line='48' column='1' id='type-id-219'/>
    <typedef-decl name='__FILE' type-id='type-id-242' size-in-bits='1728' filepath='/usr/include/stdio.h' line='64' column='1' id='type-id-222'/>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='394' column='1' visibility='default' binding='global' size-in-bits='64' hash='ed7b6a29124427dd'>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='408' column='1' visibility='default' binding='global' size-in-bits='64' hash='64137bddd2d8bd37'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-111'/>
    </function-decl>
    <namespace-decl name='boost'>
      <class-decl name='exception' visibility='default' size-in-bits='320' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='208' column='1' hash='6a90ffb346ded4aa' id='type-id-63'>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='data_' type-id='type-id-71' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='269' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='throw_function_' type-id='type-id-25' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='270' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='throw_file_' type-id='type-id-25' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='271' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='throw_line_' type-id='type-id-8' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='272' column='1'/>
        </data-member>
        <member-function access='protected' destructor='yes' vtable-offset='0'>
          <function-decl name='~exception' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='237' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-64' is-artificial='yes'/>
            <return type-id='type-id-261'/>
          </function-decl>
        </member-function>
        <member-function access='protected' static='yes' destructor='yes' vtable-offset='0'>
          <function-decl name='~exception' mangled-name='_ZN5boost9exceptionD2Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='282' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
            <return type-id='type-id-261'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='shared_ptr&lt;boost::iostreams::detail::file_descriptor_impl&gt;' visibility='default' size-in-bits='128' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='336' column='1' hash='46d515acec721b3a' id='type-id-99'>
        <member-type access='private'>
          <typedef-decl name='element_type' type-id='type-id-262' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='345' column='1' id='type-id-103'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='px' type-id='type-id-104' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='768' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='pn' type-id='type-id-49' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='769' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='reset&lt;boost::iostreams::detail::file_descriptor_impl&gt;' mangled-name='_ZN5boost10shared_ptrINS_9iostreams6detail20file_descriptor_implEE5resetIS3_EEvPT_' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='662' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10shared_ptrINS_9iostreams6detail20file_descriptor_implEE5resetIS3_EEvPT_' hash='12fc8e7dd189fdce'>
            <parameter type-id='type-id-102' is-artificial='yes'/>
            <parameter type-id='type-id-78'/>
            <return type-id='type-id-261'/>
          </function-decl>
        </member-function>
      </class-decl>
      <namespace-decl name='detail'>
        <class-decl name='sp_counted_impl_p&lt;boost::iostreams::detail::file_descriptor_impl&gt;' visibility='default' size-in-bits='192' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='53' column='1' hash='7787112fd86a506e' id='type-id-56'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-53'/>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='px_' type-id='type-id-78' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='57' column='1'/>
          </data-member>
          <member-function access='public' vtable-offset='2'>
            <function-decl name='dispose' mangled-name='_ZN5boost6detail17sp_counted_impl_pINS_9iostreams6detail20file_descriptor_implEE7disposeEv' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='73' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-58' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='4'>
            <function-decl name='get_deleter' mangled-name='_ZN5boost6detail17sp_counted_impl_pINS_9iostreams6detail20file_descriptor_implEE11get_deleterERKSt9type_info' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='81' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-58' is-artificial='yes'/>
              <parameter type-id='type-id-229'/>
              <return type-id='type-id-19'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='5'>
            <function-decl name='get_untyped_deleter' mangled-name='_ZN5boost6detail17sp_counted_impl_pINS_9iostreams6detail20file_descriptor_implEE19get_untyped_deleterEv' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='86' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-58' is-artificial='yes'/>
              <return type-id='type-id-19'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='sp_array_access&lt;boost::iostreams::detail::file_descriptor_impl&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='175' column='1' hash='0928158eef875c03' id='type-id-263'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-261' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='177' column='1' id='type-id-264'/>
          </member-type>
        </class-decl>
        <class-decl name='sp_dereference&lt;boost::iostreams::detail::file_descriptor_impl&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='101' column='1' hash='04463e74ff785b12' id='type-id-265'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-77' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='103' column='1' hash='f2f6362bacc51f48' id='type-id-266'/>
          </member-type>
        </class-decl>
        <class-decl name='sp_element&lt;boost::iostreams::detail::file_descriptor_impl&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='76' column='1' hash='876ff3876b2dc733' id='type-id-267'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-76' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='78' column='1' id='type-id-262'/>
          </member-type>
        </class-decl>
        <class-decl name='sp_member_access&lt;boost::iostreams::detail::file_descriptor_impl&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='150' column='1' hash='b3676fab9faf9804' id='type-id-268'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-78' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='152' column='1' hash='df96572da91d8a75' id='type-id-269'/>
          </member-type>
        </class-decl>
        <function-decl name='sp_enable_shared_from_this' mangled-name='_ZN5boost6detail26sp_enable_shared_from_thisEz' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost6detail26sp_enable_shared_from_thisEz' hash='7f32ffea222edbe7'>
          <parameter is-variadic='yes'/>
          <return type-id='type-id-261'/>
        </function-decl>
        <function-decl name='sp_pointer_construct&lt;boost::iostreams::detail::file_descriptor_impl, boost::iostreams::detail::file_descriptor_impl&gt;' mangled-name='_ZN5boost6detail20sp_pointer_constructINS_9iostreams6detail20file_descriptor_implES4_EEvPNS_10shared_ptrIT_EEPT0_RNS0_12shared_countE' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost6detail20sp_pointer_constructINS_9iostreams6detail20file_descriptor_implES4_EEvPNS_10shared_ptrIT_EEPT0_RNS0_12shared_countE' hash='064b8652f0e68e7a'>
          <parameter type-id='type-id-102' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1'/>
          <parameter type-id='type-id-78' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1'/>
          <parameter type-id='type-id-50' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1'/>
          <return type-id='type-id-261'/>
        </function-decl>
      </namespace-decl>
      <namespace-decl name='exception_detail'>
        <class-decl name='clone_base' visibility='default' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='398' column='1' hash='db2fa0ae8b62755b' id='type-id-65'>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~clone_base' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='406' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7#2'>
              <parameter type-id='type-id-66' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~clone_base' mangled-name='_ZN5boost16exception_detail10clone_baseD0Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='406' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7#2'>
              <parameter type-id='type-id-66' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~clone_base' mangled-name='_ZN5boost16exception_detail10clone_baseD2Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='406' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7#2'>
              <parameter type-id='type-id-66' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes' vtable-offset='0'>
            <function-decl name='clone' mangled-name='_ZNK5boost16exception_detail10clone_base5cloneEv' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='402' column='1' visibility='default' binding='global' size-in-bits='64' hash='bc5fc2bf4fc48f18'>
              <parameter type-id='type-id-130' is-artificial='yes'/>
              <return type-id='type-id-130'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes' vtable-offset='1'>
            <function-decl name='rethrow' mangled-name='_ZNK5boost16exception_detail10clone_base7rethrowEv' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='403' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-130' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='clone_impl&lt;boost::exception_detail::error_info_injector&lt;std::ios_base::failure&gt; &gt;' visibility='default' size-in-bits='640' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='442' column='1' hash='26ef66727cdf1112' id='type-id-67'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-69'/>
          <base-class access='public' layout-offset-in-bits='192' is-virtual='yes' type-id='type-id-65'/>
          <member-type access='private'>
            <class-decl name='clone_tag' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='446' column='1' hash='0a554dc54586de49' id='type-id-270'/>
          </member-type>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~clone_impl' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='462' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7#2'>
              <parameter type-id='type-id-68' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~clone_impl' mangled-name='_ZN5boost16exception_detail10clone_implINS0_19error_info_injectorINSt8ios_base7failureB5cxx11EEEED0Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='462' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7#2'>
              <parameter type-id='type-id-68' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~clone_impl' mangled-name='_ZN5boost16exception_detail10clone_implINS0_19error_info_injectorINSt8ios_base7failureB5cxx11EEEED1Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='462' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7#2'>
              <parameter type-id='type-id-68' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes' destructor='yes' vtable-offset='0'>
            <function-decl name='~clone_impl' mangled-name='_ZN5boost16exception_detail10clone_implINS0_19error_info_injectorINSt8ios_base7failureB5cxx11EEEED2Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='462' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes' vtable-offset='3'>
            <function-decl name='clone' mangled-name='_ZNK5boost16exception_detail10clone_implINS0_19error_info_injectorINSt8ios_base7failureB5cxx11EEEE5cloneEv' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='469' column='1' visibility='default' binding='global' size-in-bits='64' hash='bc5fc2bf4fc48f18'>
              <parameter type-id='type-id-133' is-artificial='yes'/>
              <return type-id='type-id-130'/>
            </function-decl>
          </member-function>
          <member-function access='private' const='yes' vtable-offset='4'>
            <function-decl name='rethrow' mangled-name='_ZNK5boost16exception_detail10clone_implINS0_19error_info_injectorINSt8ios_base7failureB5cxx11EEEE7rethrowEv' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='475' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-133' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='refcount_ptr&lt;boost::exception_detail::error_info_container&gt;' visibility='default' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='23' column='1' hash='e3575253383bd73c' id='type-id-71'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='px_' type-id='type-id-226' visibility='default' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='66' column='1'/>
          </data-member>
        </class-decl>
        <class-decl name='error_info_injector&lt;std::ios_base::failure&gt;' is-struct='yes' visibility='default' size-in-bits='576' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='326' column='1' hash='9a7211d704c62301' id='type-id-69'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-187'/>
          <base-class access='public' layout-offset-in-bits='256' type-id='type-id-63'/>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~error_info_injector' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='336' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-70' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~error_info_injector' mangled-name='_ZN5boost16exception_detail19error_info_injectorINSt8ios_base7failureB5cxx11EED0Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='336' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-70' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes' destructor='yes' vtable-offset='0'>
            <function-decl name='~error_info_injector' mangled-name='_ZN5boost16exception_detail19error_info_injectorINSt8ios_base7failureB5cxx11EED2Ev' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='336' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='error_info_container' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-225'/>
        <function-decl name='copy_boost_exception' mangled-name='_ZN5boost16exception_detail20copy_boost_exceptionEPNS_9exceptionEPKS1_' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='418' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost16exception_detail20copy_boost_exceptionEPNS_9exceptionEPKS1_' hash='03bf56128e1a52ab'>
          <parameter type-id='type-id-64' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='418' column='1'/>
          <parameter type-id='type-id-128' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='418' column='1'/>
          <return type-id='type-id-261'/>
        </function-decl>
      </namespace-decl>
      <function-decl name='enable_current_exception&lt;boost::exception_detail::error_info_injector&lt;std::ios_base::failure&gt; &gt;' mangled-name='_ZN5boost24enable_current_exceptionINS_16exception_detail19error_info_injectorINSt8ios_base7failureB5cxx11EEEEENS1_10clone_implIT_EERKS7_' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='490' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost24enable_current_exceptionINS_16exception_detail19error_info_injectorINSt8ios_base7failureB5cxx11EEEEENS1_10clone_implIT_EERKS7_' hash='2cc240986613b3b0'>
        <parameter type-id='type-id-135' filepath='src/third_party/boost-1.60.0/boost/exception/exception.hpp' line='490' column='1'/>
        <return type-id='type-id-67'/>
      </function-decl>
      <namespace-decl name='iostreams'>
        <class-decl name='file_descriptor' visibility='default' size-in-bits='128' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='46' column='1' hash='2d5ab356450ce57a' id='type-id-89'>
          <member-type access='private'>
            <typedef-decl name='char_type' type-id='type-id-2' size-in-bits='8' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='51' column='1' hash='65b2d157027b431a' id='type-id-91'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='handle_type' type-id='type-id-272' size-in-bits='32' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='50' column='1' hash='09d17c08f594edc7' id='type-id-271'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='pimpl_' type-id='type-id-99' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='143' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor' mangled-name='_ZN5boost9iostreams15file_descriptorC2Ev' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptorC2Ev' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-90' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor' mangled-name='_ZN5boost9iostreams15file_descriptorC2EiNS0_21file_descriptor_flagsE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptorC2EiNS0_21file_descriptor_flagsE' hash='bf3d91b1168d61b6'>
              <parameter type-id='type-id-90' is-artificial='yes'/>
              <parameter type-id='type-id-271'/>
              <parameter type-id='type-id-273'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams15file_descriptor4openEiNS0_21file_descriptor_flagsE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor4openEiNS0_21file_descriptor_flagsE' hash='bf3d91b1168d61b6'>
              <parameter type-id='type-id-90' is-artificial='yes'/>
              <parameter type-id='type-id-271'/>
              <parameter type-id='type-id-273'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor' mangled-name='_ZN5boost9iostreams15file_descriptorC2ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptorC2ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' hash='2951319079218f97'>
              <parameter type-id='type-id-90' is-artificial='yes'/>
              <parameter type-id='type-id-236'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams15file_descriptor4openERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor4openERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' hash='2951319079218f97'>
              <parameter type-id='type-id-90' is-artificial='yes'/>
              <parameter type-id='type-id-236'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams15file_descriptor4openERKNS0_6detail4pathESt13_Ios_OpenmodeS6_' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor4openERKNS0_6detail4pathESt13_Ios_OpenmodeS6_' hash='5eac3e992083786a'>
              <parameter type-id='type-id-90' is-artificial='yes'/>
              <parameter type-id='type-id-146'/>
              <parameter type-id='type-id-248'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor' mangled-name='_ZN5boost9iostreams15file_descriptorC2EPKcSt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='391' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptorC2EPKcSt13_Ios_Openmode' hash='015d40cb9d63440a'>
              <parameter type-id='type-id-90' is-artificial='yes'/>
              <parameter type-id='type-id-25'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams15file_descriptor4openEPKcSt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='427' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor4openEPKcSt13_Ios_Openmode' hash='015d40cb9d63440a'>
              <parameter type-id='type-id-90' is-artificial='yes'/>
              <parameter type-id='type-id-25'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor' mangled-name='_ZN5boost9iostreams15file_descriptorC2ERKS1_' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptorC2ERKS1_' hash='6d2bd7f1d41f57e4'>
              <parameter type-id='type-id-90' is-artificial='yes'/>
              <parameter type-id='type-id-149'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='is_open' mangled-name='_ZNK5boost9iostreams15file_descriptor7is_openEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams15file_descriptor7is_openEv' hash='c7c710e908194b91'>
              <parameter type-id='type-id-150' is-artificial='yes'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='close' mangled-name='_ZN5boost9iostreams15file_descriptor5closeEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor5closeEv' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-90' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='read' mangled-name='_ZN5boost9iostreams15file_descriptor4readEPcl' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor4readEPcl' hash='f8910c88e4bb3717'>
              <parameter type-id='type-id-90' is-artificial='yes'/>
              <parameter type-id='type-id-92'/>
              <parameter type-id='type-id-257'/>
              <return type-id='type-id-257'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='write' mangled-name='_ZN5boost9iostreams15file_descriptor5writeEPKcl' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor5writeEPKcl' hash='56480b8dd9116ee7'>
              <parameter type-id='type-id-90' is-artificial='yes'/>
              <parameter type-id='type-id-152'/>
              <parameter type-id='type-id-257'/>
              <return type-id='type-id-257'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='seek' mangled-name='_ZN5boost9iostreams15file_descriptor4seekElSt12_Ios_Seekdir' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor4seekElSt12_Ios_Seekdir' hash='bc2c2c735f8e0da8'>
              <parameter type-id='type-id-90' is-artificial='yes'/>
              <parameter type-id='type-id-274'/>
              <parameter type-id='type-id-250'/>
              <return type-id='type-id-256'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='handle' mangled-name='_ZNK5boost9iostreams15file_descriptor6handleEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='443' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams15file_descriptor6handleEv' hash='388da3fa973fde78'>
              <parameter type-id='type-id-150' is-artificial='yes'/>
              <return type-id='type-id-271'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='init' mangled-name='_ZN5boost9iostreams15file_descriptor4initEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams15file_descriptor4initEv' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-90' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='file_descriptor_sink' visibility='default' size-in-bits='128' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='228' column='1' hash='7b296667f627400d' id='type-id-93'>
          <base-class access='private' layout-offset-in-bits='0' type-id='type-id-89'/>
          <member-type access='private'>
            <typedef-decl name='handle_type' type-id='type-id-8' size-in-bits='32' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='233' column='1' hash='09d17c08f594edc7' id='type-id-275'/>
          </member-type>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_sink' mangled-name='_ZN5boost9iostreams20file_descriptor_sinkC2EiNS0_21file_descriptor_flagsE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='531' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sinkC2EiNS0_21file_descriptor_flagsE' hash='bf3d91b1168d61b6'>
              <parameter type-id='type-id-94' is-artificial='yes'/>
              <parameter type-id='type-id-275'/>
              <parameter type-id='type-id-273'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams20file_descriptor_sink4openEiNS0_21file_descriptor_flagsE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='565' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sink4openEiNS0_21file_descriptor_flagsE' hash='bf3d91b1168d61b6'>
              <parameter type-id='type-id-94' is-artificial='yes'/>
              <parameter type-id='type-id-275'/>
              <parameter type-id='type-id-273'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_sink' mangled-name='_ZN5boost9iostreams20file_descriptor_sinkC2ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sinkC2ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' hash='2951319079218f97'>
              <parameter type-id='type-id-94' is-artificial='yes'/>
              <parameter type-id='type-id-236'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams20file_descriptor_sink4openERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='585' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sink4openERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' hash='2951319079218f97'>
              <parameter type-id='type-id-94' is-artificial='yes'/>
              <parameter type-id='type-id-236'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams20file_descriptor_sink4openERKNS0_6detail4pathESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='593' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sink4openERKNS0_6detail4pathESt13_Ios_Openmode' hash='96f5ce410b53c012'>
              <parameter type-id='type-id-94' is-artificial='yes'/>
              <parameter type-id='type-id-146'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_sink' mangled-name='_ZN5boost9iostreams20file_descriptor_sinkC2EPKcSt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='557' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sinkC2EPKcSt13_Ios_Openmode' hash='015d40cb9d63440a'>
              <parameter type-id='type-id-94' is-artificial='yes'/>
              <parameter type-id='type-id-25'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams20file_descriptor_sink4openEPKcSt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='589' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sink4openEPKcSt13_Ios_Openmode' hash='015d40cb9d63440a'>
              <parameter type-id='type-id-94' is-artificial='yes'/>
              <parameter type-id='type-id-25'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_sink' mangled-name='_ZN5boost9iostreams20file_descriptor_sinkC2ERKS1_' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams20file_descriptor_sinkC2ERKS1_' hash='578d7d615212274e'>
              <parameter type-id='type-id-94' is-artificial='yes'/>
              <parameter type-id='type-id-154'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='file_descriptor_source' visibility='default' size-in-bits='128' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='146' column='1' hash='ce3e2aabdd55f69c' id='type-id-95'>
          <base-class access='private' layout-offset-in-bits='0' type-id='type-id-89'/>
          <member-type access='private'>
            <typedef-decl name='handle_type' type-id='type-id-8' size-in-bits='32' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='151' column='1' hash='09d17c08f594edc7' id='type-id-276'/>
          </member-type>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_source' mangled-name='_ZN5boost9iostreams22file_descriptor_sourceC2EiNS0_21file_descriptor_flagsE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_sourceC2EiNS0_21file_descriptor_flagsE' hash='bf3d91b1168d61b6'>
              <parameter type-id='type-id-96' is-artificial='yes'/>
              <parameter type-id='type-id-276'/>
              <parameter type-id='type-id-273'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams22file_descriptor_source4openEiNS0_21file_descriptor_flagsE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_source4openEiNS0_21file_descriptor_flagsE' hash='bf3d91b1168d61b6'>
              <parameter type-id='type-id-96' is-artificial='yes'/>
              <parameter type-id='type-id-276'/>
              <parameter type-id='type-id-273'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_source' mangled-name='_ZN5boost9iostreams22file_descriptor_sourceC2ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_sourceC2ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' hash='2951319079218f97'>
              <parameter type-id='type-id-96' is-artificial='yes'/>
              <parameter type-id='type-id-236'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams22file_descriptor_source4openERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='513' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_source4openERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt13_Ios_Openmode' hash='2951319079218f97'>
              <parameter type-id='type-id-96' is-artificial='yes'/>
              <parameter type-id='type-id-236'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams22file_descriptor_source4openERKNS0_6detail4pathESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_source4openERKNS0_6detail4pathESt13_Ios_Openmode' hash='96f5ce410b53c012'>
              <parameter type-id='type-id-96' is-artificial='yes'/>
              <parameter type-id='type-id-146'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_source' mangled-name='_ZN5boost9iostreams22file_descriptor_sourceC2EPKcSt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='484' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_sourceC2EPKcSt13_Ios_Openmode' hash='015d40cb9d63440a'>
              <parameter type-id='type-id-96' is-artificial='yes'/>
              <parameter type-id='type-id-25'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='open' mangled-name='_ZN5boost9iostreams22file_descriptor_source4openEPKcSt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='517' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_source4openEPKcSt13_Ios_Openmode' hash='015d40cb9d63440a'>
              <parameter type-id='type-id-96' is-artificial='yes'/>
              <parameter type-id='type-id-25'/>
              <parameter type-id='type-id-248'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='file_descriptor_source' mangled-name='_ZN5boost9iostreams22file_descriptor_sourceC2ERKS1_' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams22file_descriptor_sourceC2ERKS1_' hash='7266b7175b11e148'>
              <parameter type-id='type-id-96' is-artificial='yes'/>
              <parameter type-id='type-id-156'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
        </class-decl>
        <enum-decl name='file_descriptor_flags' size-in-bits='32' alignment-in-bits='32' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/file_descriptor.hpp' line='40' column='1' hash='bfaf251fc4cd816b' id='type-id-273'>
          <underlying-type type-id='type-id-45'/>
          <enumerator name='never_close_handle' value='0'/>
          <enumerator name='close_handle' value='3'/>
        </enum-decl>
        <typedef-decl name='stream_offset' type-id='type-id-36' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/iostreams/positioning.hpp' line='36' column='1' hash='b119fe0931d2ee10' id='type-id-274'/>
        <namespace-decl name='detail'>
          <class-decl name='path' visibility='default' size-in-bits='576' filepath='src/third_party/boost-1.60.0/boost/iostreams/detail/path.hpp' line='37' column='1' hash='91dfe9414e83fbae' id='type-id-86'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='narrow_' type-id='type-id-234' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/detail/path.hpp' line='155' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='256'>
              <var-decl name='wide_' type-id='type-id-237' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/detail/path.hpp' line='156' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='512'>
              <var-decl name='is_wide_' type-id='type-id-1' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/detail/path.hpp' line='157' column='1'/>
            </data-member>
          </class-decl>
          <class-decl name='file_descriptor_impl' is-struct='yes' visibility='default' size-in-bits='64' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='50' column='1' hash='1f8c929b16a48641' id='type-id-76'>
            <member-type access='public'>
              <enum-decl name='flags' size-in-bits='32' alignment-in-bits='32' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='52' column='1' hash='868d89d52cfaefd1' id='type-id-277'>
                <underlying-type type-id='type-id-45'/>
                <enumerator name='never_close' value='0'/>
                <enumerator name='close_on_exit' value='1'/>
                <enumerator name='close_on_close' value='2'/>
                <enumerator name='close_always' value='3'/>
              </enum-decl>
            </member-type>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='handle_' type-id='type-id-272' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='73' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='32'>
              <var-decl name='flags_' type-id='type-id-8' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='74' column='1'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='file_descriptor_impl' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_implC2Ev' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_implC2Ev' hash='7f32ffea222edbe7'>
                <parameter type-id='type-id-78' is-artificial='yes'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='invalid_handle' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl14invalid_handleEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl14invalid_handleEv' hash='388da3fa973fde78'>
                <return type-id='type-id-272'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~file_descriptor_impl' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_implD2Ev' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_implD2Ev' hash='7f32ffea222edbe7'>
                <parameter type-id='type-id-78' is-artificial='yes'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='close_impl' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl10close_implEbb' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='244' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl10close_implEbb' hash='01b7f76184cecbb2'>
                <parameter type-id='type-id-78' is-artificial='yes'/>
                <parameter type-id='type-id-1'/>
                <parameter type-id='type-id-1'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='open' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl4openEiNS2_5flagsE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl4openEiNS2_5flagsE' hash='29c700768cc5aab5'>
                <parameter type-id='type-id-78' is-artificial='yes'/>
                <parameter type-id='type-id-272'/>
                <parameter type-id='type-id-277'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='close' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl5closeEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl5closeEv' hash='7f32ffea222edbe7'>
                <parameter type-id='type-id-78' is-artificial='yes'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='open' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl4openERKNS1_4pathESt13_Ios_Openmode' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl4openERKNS1_4pathESt13_Ios_Openmode' hash='96f5ce410b53c012'>
                <parameter type-id='type-id-78' is-artificial='yes'/>
                <parameter type-id='type-id-146'/>
                <parameter type-id='type-id-248'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='public' const='yes'>
              <function-decl name='is_open' mangled-name='_ZNK5boost9iostreams6detail20file_descriptor_impl7is_openEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams6detail20file_descriptor_impl7is_openEv' hash='c7c710e908194b91'>
                <parameter type-id='type-id-142' is-artificial='yes'/>
                <return type-id='type-id-1'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='read' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl4readEPcl' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl4readEPcl' hash='3b4a00f2cef71048'>
                <parameter type-id='type-id-78' is-artificial='yes'/>
                <parameter type-id='type-id-111'/>
                <parameter type-id='type-id-257'/>
                <return type-id='type-id-257'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='write' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl5writeEPKcl' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl5writeEPKcl' hash='f5f15ae82136b81f'>
                <parameter type-id='type-id-78' is-artificial='yes'/>
                <parameter type-id='type-id-25'/>
                <parameter type-id='type-id-257'/>
                <return type-id='type-id-257'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='seek' mangled-name='_ZN5boost9iostreams6detail20file_descriptor_impl4seekElSt12_Ios_Seekdir' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/file_descriptor.cpp' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail20file_descriptor_impl4seekElSt12_Ios_Seekdir' hash='bc2c2c735f8e0da8'>
                <parameter type-id='type-id-78' is-artificial='yes'/>
                <parameter type-id='type-id-274'/>
                <parameter type-id='type-id-250'/>
                <return type-id='type-id-256'/>
              </function-decl>
            </member-function>
          </class-decl>
          <typedef-decl name='file_handle' type-id='type-id-8' size-in-bits='32' filepath='src/third_party/boost-1.60.0/boost/iostreams/detail/file_handle.hpp' line='27' column='1' hash='09d17c08f594edc7' id='type-id-272'/>
          <function-decl name='system_failure' mangled-name='_ZN5boost9iostreams6detail14system_failureB5cxx11EPKc' filepath='src/third_party/boost-1.60.0/boost/iostreams/detail/system_failure.hpp' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail14system_failureB5cxx11EPKc' hash='53885bde0aa65efe'>
            <parameter type-id='type-id-25' filepath='src/third_party/boost-1.60.0/boost/iostreams/detail/system_failure.hpp' line='39' column='1'/>
            <return type-id='type-id-187'/>
          </function-decl>
        </namespace-decl>
      </namespace-decl>
      <function-decl name='throw_exception&lt;std::ios_base::failure&gt;' mangled-name='_ZN5boost15throw_exceptionINSt8ios_base7failureB5cxx11EEEvRKT_' filepath='src/third_party/boost-1.60.0/boost/throw_exception.hpp' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost15throw_exceptionINSt8ios_base7failureB5cxx11EEEvRKT_' hash='32d40675f9252e20'>
        <parameter type-id='type-id-189' filepath='src/third_party/boost-1.60.0/boost/throw_exception.hpp' line='62' column='1'/>
        <return type-id='type-id-261'/>
      </function-decl>
    </namespace-decl>
    <namespace-decl name='boost'>
      <class-decl name='shared_ptr&lt;boost::iostreams::detail::mapped_file_impl&gt;' visibility='default' size-in-bits='128' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='336' column='1' hash='485c3997e3a25d28' id='type-id-105'>
        <member-type access='private'>
          <typedef-decl name='element_type' type-id='type-id-278' size-in-bits='1088' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='345' column='1' id='type-id-109'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='px' type-id='type-id-110' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='768' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='pn' type-id='type-id-49' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='769' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='reset&lt;boost::iostreams::detail::mapped_file_impl&gt;' mangled-name='_ZN5boost10shared_ptrINS_9iostreams6detail16mapped_file_implEE5resetIS3_EEvPT_' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='662' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost10shared_ptrINS_9iostreams6detail16mapped_file_implEE5resetIS3_EEvPT_' hash='da0f2fd389005125'>
            <parameter type-id='type-id-108' is-artificial='yes'/>
            <parameter type-id='type-id-81'/>
            <return type-id='type-id-261'/>
          </function-decl>
        </member-function>
      </class-decl>
      <namespace-decl name='core'>
        <typedef-decl name='typeinfo' type-id='type-id-258' filepath='src/third_party/boost-1.60.0/boost/core/typeinfo.hpp' line='134' column='1' id='type-id-279'/>
      </namespace-decl>
      <namespace-decl name='detail'>
        <class-decl name='shared_count' visibility='default' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/shared_count.hpp' line='107' column='1' hash='451860ab6d9cb6de' id='type-id-49'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='pi_' type-id='type-id-55' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/shared_count.hpp' line='111' column='1'/>
          </data-member>
        </class-decl>
        <class-decl name='sp_counted_base' visibility='default' size-in-bits='128' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='61' column='1' hash='63bd400a3c4aff38' id='type-id-53'>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='use_count_' type-id='type-id-280' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='68' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='96'>
            <var-decl name='weak_count_' type-id='type-id-280' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='69' column='1'/>
          </data-member>
          <member-function access='public' destructor='yes' vtable-offset='0'>
            <function-decl name='~sp_counted_base' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='79' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-55' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='2'>
            <function-decl name='dispose' mangled-name='_ZN5boost6detail15sp_counted_base7disposeEv' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='86' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-55' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='3'>
            <function-decl name='destroy' mangled-name='_ZN5boost6detail15sp_counted_base7destroyEv' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='90' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-55' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='4'>
            <function-decl name='get_deleter' mangled-name='_ZN5boost6detail15sp_counted_base11get_deleterERKSt9type_info' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='95' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-55' is-artificial='yes'/>
              <parameter type-id='type-id-229'/>
              <return type-id='type-id-19'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='5'>
            <function-decl name='get_untyped_deleter' mangled-name='_ZN5boost6detail15sp_counted_base19get_untyped_deleterEv' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='96' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-55' is-artificial='yes'/>
              <return type-id='type-id-19'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='sp_counted_impl_p&lt;boost::iostreams::detail::mapped_file_impl&gt;' visibility='default' size-in-bits='192' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='53' column='1' hash='85778da555cbd9e4' id='type-id-281'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-53'/>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='px_' type-id='type-id-81' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='57' column='1'/>
          </data-member>
          <member-function access='public' vtable-offset='2'>
            <function-decl name='dispose' mangled-name='_ZN5boost6detail17sp_counted_impl_pINS_9iostreams6detail16mapped_file_implEE7disposeEv' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='73' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-282' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='4'>
            <function-decl name='get_deleter' mangled-name='_ZN5boost6detail17sp_counted_impl_pINS_9iostreams6detail16mapped_file_implEE11get_deleterERKSt9type_info' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='81' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-282' is-artificial='yes'/>
              <parameter type-id='type-id-229'/>
              <return type-id='type-id-19'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='5'>
            <function-decl name='get_untyped_deleter' mangled-name='_ZN5boost6detail17sp_counted_impl_pINS_9iostreams6detail16mapped_file_implEE19get_untyped_deleterEv' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_impl.hpp' line='86' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-282' is-artificial='yes'/>
              <return type-id='type-id-19'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='weak_count' visibility='default' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/shared_count.hpp' line='560' column='1' hash='e51692d9a2fa716d' id='type-id-59'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='pi_' type-id='type-id-55' visibility='default' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/shared_count.hpp' line='564' column='1'/>
          </data-member>
        </class-decl>
        <class-decl name='sp_array_access&lt;boost::iostreams::detail::mapped_file_impl&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='175' column='1' hash='1f90e8fff31e0feb' id='type-id-283'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-261' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='177' column='1' id='type-id-284'/>
          </member-type>
        </class-decl>
        <class-decl name='sp_dereference&lt;boost::iostreams::detail::mapped_file_impl&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='101' column='1' hash='c0edd317f3bde711' id='type-id-285'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-80' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='103' column='1' hash='5d681b02444f9817' id='type-id-286'/>
          </member-type>
        </class-decl>
        <class-decl name='sp_element&lt;boost::iostreams::detail::mapped_file_impl&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='76' column='1' hash='4c3a4dd9c83a1e73' id='type-id-287'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-79' size-in-bits='1088' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='78' column='1' id='type-id-278'/>
          </member-type>
        </class-decl>
        <class-decl name='sp_member_access&lt;boost::iostreams::detail::mapped_file_impl&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='150' column='1' hash='37785723fcfb290c' id='type-id-288'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='type-id-81' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='152' column='1' hash='914b81c2ab3a4937' id='type-id-289'/>
          </member-type>
        </class-decl>
        <class-decl name='sp_nothrow_tag' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/shared_count.hpp' line='71' column='1' hash='ec8d908a0f47ed49' id='type-id-290'/>
        <typedef-decl name='atomic_int_least32_t' type-id='type-id-35' size-in-bits='32' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/detail/sp_counted_base_clang.hpp' line='27' column='1' hash='09d17c08f594edc7' id='type-id-280'/>
        <typedef-decl name='sp_typeinfo' type-id='type-id-279' filepath='src/third_party/boost-1.60.0/boost/detail/sp_typeinfo.hpp' line='28' column='1' id='type-id-227'/>
        <function-decl name='sp_pointer_construct&lt;boost::iostreams::detail::mapped_file_impl, boost::iostreams::detail::mapped_file_impl&gt;' mangled-name='_ZN5boost6detail20sp_pointer_constructINS_9iostreams6detail16mapped_file_implES4_EEvPNS_10shared_ptrIT_EEPT0_RNS0_12shared_countE' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost6detail20sp_pointer_constructINS_9iostreams6detail16mapped_file_implES4_EEvPNS_10shared_ptrIT_EEPT0_RNS0_12shared_countE' hash='a8c2f33614b0019f'>
          <parameter type-id='type-id-108' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1'/>
          <parameter type-id='type-id-81' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1'/>
          <parameter type-id='type-id-50' filepath='src/third_party/boost-1.60.0/boost/smart_ptr/shared_ptr.hpp' line='282' column='1'/>
          <return type-id='type-id-261'/>
        </function-decl>
      </namespace-decl>
      <namespace-decl name='iostreams'>
        <class-decl name='mapped_file' visibility='default' size-in-bits='192' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='223' column='1' hash='deef9165f77deea7' id='type-id-291'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-292'/>
          <member-type access='private'>
            <typedef-decl name='const_iterator' type-id='type-id-25' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='239' column='1' hash='c44743f354f6a443' id='type-id-293'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='delegate_type' type-id='type-id-97' size-in-bits='128' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='225' column='1' id='type-id-294'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='iterator' type-id='type-id-111' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='238' column='1' hash='e533f42d1dd4942c' id='type-id-295'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='safe_bool' type-id='type-id-297' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='226' column='1' id='type-id-296'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='size_type' type-id='type-id-299' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='237' column='1' hash='8fdc5eea2983a729' id='type-id-298'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='delegate_' type-id='type-id-294' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='321' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='mapped_file' mangled-name='_ZN5boost9iostreams11mapped_fileC2ERKS1_' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='481' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams11mapped_fileC2ERKS1_' hash='be737bbc736868cf'>
              <parameter type-id='type-id-300' is-artificial='yes'/>
              <parameter type-id='type-id-301'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='resize' mangled-name='_ZN5boost9iostreams11mapped_file6resizeEl' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams11mapped_file6resizeEl' hash='52c0efb08d2aa513'>
              <parameter type-id='type-id-300' is-artificial='yes'/>
              <parameter type-id='type-id-274'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='mapped_file_base' visibility='default' size-in-bits='8' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='47' column='1' hash='12c69de35072ac87' id='type-id-292'>
          <member-type access='private'>
            <enum-decl name='mapmode' size-in-bits='32' alignment-in-bits='32' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='49' column='1' hash='842931bda50f2fb9' id='type-id-302'>
              <underlying-type type-id='type-id-45'/>
              <enumerator name='readonly' value='1'/>
              <enumerator name='readwrite' value='2'/>
              <enumerator name='priv' value='4'/>
            </enum-decl>
          </member-type>
        </class-decl>
        <class-decl name='mapped_file_sink' visibility='default' size-in-bits='192' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='326' column='1' hash='1323c74f289f8845' id='type-id-303'>
          <base-class access='private' layout-offset-in-bits='0' type-id='type-id-291'/>
          <member-function access='public' constructor='yes'>
            <function-decl name='mapped_file_sink' mangled-name='_ZN5boost9iostreams16mapped_file_sinkC2ERKS1_' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='490' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams16mapped_file_sinkC2ERKS1_' hash='ed1dd9886a1d34fe'>
              <parameter type-id='type-id-304' is-artificial='yes'/>
              <parameter type-id='type-id-305'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='mapped_file_source' visibility='default' size-in-bits='128' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='149' column='1' hash='3864d6490bee8e81' id='type-id-97'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-292'/>
          <member-type access='private'>
            <class-decl name='safe_bool_helper' is-struct='yes' visibility='default' size-in-bits='32' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='151' column='1' hash='6c00ef5465b6309a' id='type-id-9'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='x' type-id='type-id-8' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='151' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='iterator' type-id='type-id-25' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='166' column='1' hash='c44743f354f6a443' id='type-id-306'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='param_type' type-id='type-id-74' size-in-bits='896' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='154' column='1' id='type-id-160'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='safe_bool' type-id='type-id-10' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='152' column='1' id='type-id-297'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='size_type' type-id='type-id-255' size-in-bits='64' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='165' column='1' hash='8fdc5eea2983a729' id='type-id-299'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='pimpl_' type-id='type-id-105' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='218' column='1'/>
          </data-member>
          <member-function access='public' constructor='yes'>
            <function-decl name='mapped_file_source' mangled-name='_ZN5boost9iostreams18mapped_file_sourceC2Ev' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams18mapped_file_sourceC2Ev' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-98' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' constructor='yes'>
            <function-decl name='mapped_file_source' mangled-name='_ZN5boost9iostreams18mapped_file_sourceC2ERKS1_' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams18mapped_file_sourceC2ERKS1_' hash='41aa78f4f8419d18'>
              <parameter type-id='type-id-98' is-artificial='yes'/>
              <parameter type-id='type-id-158'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='is_open' mangled-name='_ZNK5boost9iostreams18mapped_file_source7is_openEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='448' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_source7is_openEv' hash='c7c710e908194b91'>
              <parameter type-id='type-id-159' is-artificial='yes'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='close' mangled-name='_ZN5boost9iostreams18mapped_file_source5closeEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams18mapped_file_source5closeEv' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-98' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='operator int boost::iostreams::mapped_file_source::safe_bool_helper::*' mangled-name='_ZNK5boost9iostreams18mapped_file_sourcecvMNS1_16safe_bool_helperEiEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='454' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_sourcecvMNS1_16safe_bool_helperEiEv' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-159' is-artificial='yes'/>
              <return type-id='type-id-297'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='operator!' mangled-name='_ZNK5boost9iostreams18mapped_file_sourcentEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_sourcentEv' hash='c7c710e908194b91'>
              <parameter type-id='type-id-159' is-artificial='yes'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='flags' mangled-name='_ZNK5boost9iostreams18mapped_file_source5flagsEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_source5flagsEv' hash='75732289a9cccefd'>
              <parameter type-id='type-id-159' is-artificial='yes'/>
              <return type-id='type-id-302'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='size' mangled-name='_ZNK5boost9iostreams18mapped_file_source4sizeEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_source4sizeEv' hash='e0055d99adb0e173'>
              <parameter type-id='type-id-159' is-artificial='yes'/>
              <return type-id='type-id-299'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='data' mangled-name='_ZNK5boost9iostreams18mapped_file_source4dataEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_source4dataEv' hash='53885bde0aa65efe'>
              <parameter type-id='type-id-159' is-artificial='yes'/>
              <return type-id='type-id-25'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='begin' mangled-name='_ZNK5boost9iostreams18mapped_file_source5beginEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='468' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_source5beginEv' hash='53885bde0aa65efe'>
              <parameter type-id='type-id-159' is-artificial='yes'/>
              <return type-id='type-id-306'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='end' mangled-name='_ZNK5boost9iostreams18mapped_file_source3endEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5boost9iostreams18mapped_file_source3endEv' hash='53885bde0aa65efe'>
              <parameter type-id='type-id-159' is-artificial='yes'/>
              <return type-id='type-id-306'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='alignment' mangled-name='_ZN5boost9iostreams18mapped_file_source9alignmentEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams18mapped_file_source9alignmentEv' hash='388da3fa973fde78'>
              <return type-id='type-id-8'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='init' mangled-name='_ZN5boost9iostreams18mapped_file_source4initEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='474' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams18mapped_file_source4initEv' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-98' is-artificial='yes'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='open_impl' mangled-name='_ZN5boost9iostreams18mapped_file_source9open_implERKNS0_24basic_mapped_file_paramsINS0_6detail4pathEEE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams18mapped_file_source9open_implERKNS0_24basic_mapped_file_paramsINS0_6detail4pathEEE' hash='a58420ec9a5a7df5'>
              <parameter type-id='type-id-98' is-artificial='yes'/>
              <parameter type-id='type-id-162'/>
              <return type-id='type-id-261'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='basic_mapped_file_params&lt;boost::iostreams::detail::path&gt;' is-struct='yes' visibility='default' size-in-bits='896' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='109' column='1' hash='a47c461b419d2f53' id='type-id-74'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-84'/>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='path' type-id='type-id-86' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='142' column='1'/>
          </data-member>
        </class-decl>
        <namespace-decl name='detail'>
          <class-decl name='mapped_file_impl' visibility='default' size-in-bits='1088' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='45' column='1' hash='6a06a7c9460f56c2' id='type-id-79'>
            <member-type access='private'>
              <typedef-decl name='mapmode' type-id='type-id-302' size-in-bits='32' alignment-in-bits='32' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='49' column='1' hash='842931bda50f2fb9' id='type-id-307'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='param_type' type-id='type-id-160' size-in-bits='896' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='48' column='1' id='type-id-82'/>
            </member-type>
            <member-type access='private'>
              <typedef-decl name='size_type' type-id='type-id-299' size-in-bits='64' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='47' column='1' hash='8fdc5eea2983a729' id='type-id-308'/>
            </member-type>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='params_' type-id='type-id-82' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='70' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='896'>
              <var-decl name='data_' type-id='type-id-111' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='71' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='960'>
              <var-decl name='size_' type-id='type-id-274' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='72' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='1024'>
              <var-decl name='handle_' type-id='type-id-272' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='73' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='1056'>
              <var-decl name='error_' type-id='type-id-1' visibility='default' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='77' column='1'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='mapped_file_impl' mangled-name='_ZN5boost9iostreams6detail16mapped_file_implC2Ev' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_implC2Ev' hash='7f32ffea222edbe7'>
                <parameter type-id='type-id-81' is-artificial='yes'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='clear' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl5clearEb' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl5clearEb' hash='c7c710e908194b91'>
                <parameter type-id='type-id-81' is-artificial='yes'/>
                <parameter type-id='type-id-1'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~mapped_file_impl' mangled-name='_ZN5boost9iostreams6detail16mapped_file_implD2Ev' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_implD2Ev' hash='7f32ffea222edbe7'>
                <parameter type-id='type-id-81' is-artificial='yes'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='close' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl5closeEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl5closeEv' hash='7f32ffea222edbe7'>
                <parameter type-id='type-id-81' is-artificial='yes'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='unmap_file' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl10unmap_fileEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl10unmap_fileEv' hash='c7c710e908194b91#2'>
                <parameter type-id='type-id-81' is-artificial='yes'/>
                <return type-id='type-id-1'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='open' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl4openENS0_24basic_mapped_file_paramsINS1_4pathEEE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl4openENS0_24basic_mapped_file_paramsINS1_4pathEEE' hash='7f32ffea222edbe7'>
                <parameter type-id='type-id-81' is-artificial='yes'/>
                <parameter type-id='type-id-82'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='open_file' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl9open_fileENS0_24basic_mapped_file_paramsINS1_4pathEEE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl9open_fileENS0_24basic_mapped_file_paramsINS1_4pathEEE' hash='7f32ffea222edbe7'>
                <parameter type-id='type-id-81' is-artificial='yes'/>
                <parameter type-id='type-id-82'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='map_file' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl8map_fileERNS0_24basic_mapped_file_paramsINS1_4pathEEE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl8map_fileERNS0_24basic_mapped_file_paramsINS1_4pathEEE' hash='97f21726daafe08c'>
                <parameter type-id='type-id-81' is-artificial='yes'/>
                <parameter type-id='type-id-83'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='try_map_file' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl12try_map_fileENS0_24basic_mapped_file_paramsINS1_4pathEEE' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl12try_map_fileENS0_24basic_mapped_file_paramsINS1_4pathEEE' hash='7f32ffea222edbe7'>
                <parameter type-id='type-id-81' is-artificial='yes'/>
                <parameter type-id='type-id-82'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='cleanup_and_throw' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl17cleanup_and_throwEPKc' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl17cleanup_and_throwEPKc' hash='53885bde0aa65efe'>
                <parameter type-id='type-id-81' is-artificial='yes'/>
                <parameter type-id='type-id-25'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='resize' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl6resizeEl' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl6resizeEl' hash='52c0efb08d2aa513'>
                <parameter type-id='type-id-81' is-artificial='yes'/>
                <parameter type-id='type-id-274'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
            <member-function access='public' static='yes'>
              <function-decl name='alignment' mangled-name='_ZN5boost9iostreams6detail16mapped_file_impl9alignmentEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail16mapped_file_impl9alignmentEv' hash='388da3fa973fde78'>
                <return type-id='type-id-8'/>
              </function-decl>
            </member-function>
          </class-decl>
          <class-decl name='mapped_file_params_base' is-struct='yes' visibility='default' size-in-bits='320' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='82' column='1' hash='928426a665a16c97' id='type-id-84'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='flags' type-id='type-id-302' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='92' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='32'>
              <var-decl name='mode' type-id='type-id-248' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='93' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='offset' type-id='type-id-274' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='94' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='length' type-id='type-id-255' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='95' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='new_file_size' type-id='type-id-274' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='96' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='256'>
              <var-decl name='hint' type-id='type-id-25' visibility='default' filepath='src/third_party/boost-1.60.0/boost/iostreams/device/mapped_file.hpp' line='97' column='1'/>
            </data-member>
            <member-function access='private'>
              <function-decl name='normalize' mangled-name='_ZN5boost9iostreams6detail23mapped_file_params_base9normalizeEv' filepath='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5boost9iostreams6detail23mapped_file_params_base9normalizeEv' hash='7f32ffea222edbe7'>
                <parameter type-id='type-id-85' is-artificial='yes'/>
                <return type-id='type-id-261'/>
              </function-decl>
            </member-function>
          </class-decl>
        </namespace-decl>
      </namespace-decl>
    </namespace-decl>
    <type-decl name='void' id='type-id-261'/>
    <pointer-type-def type-id='type-id-261' id='type-id-19'/>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-203'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-213'>
      <return type-id='type-id-261'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/third_party/boost-1.60.0/libs/iostreams/src/mapped_file.cpp' comp-dir-path='/home/andrew/Documents/10gen/dev/src/mongodb' language='LANG_C_plus_plus'>
    <reference-type-def kind='lvalue' type-id='type-id-281' size-in-bits='64' hash='4e55dd06e77a3b21' id='type-id-309'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' hash='44e2e50565f0b556' id='type-id-282'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' hash='b94421aa53b5b91b' id='type-id-300'/>
    <pointer-type-def type-id='type-id-303' size-in-bits='64' hash='87c7458a9b0cc28a' id='type-id-304'/>
    <reference-type-def kind='lvalue' type-id='type-id-97' size-in-bits='64' hash='0f55a0160d7c7e5f' id='type-id-310'/>
    <qualified-type-def type-id='type-id-281' const='yes' hash='ef4da528d5a7b824' id='type-id-311'/>
    <reference-type-def kind='lvalue' type-id='type-id-311' size-in-bits='64' hash='e35f926cce286658' id='type-id-312'/>
    <qualified-type-def type-id='type-id-291' const='yes' hash='8d85836f0376e140' id='type-id-313'/>
    <reference-type-def kind='lvalue' type-id='type-id-313' size-in-bits='64' hash='0da5dfeb71d7b5be' id='type-id-301'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' hash='6406de366c519f31' id='type-id-314'/>
    <qualified-type-def type-id='type-id-303' const='yes' hash='1e1db31464c0f013' id='type-id-315'/>
    <reference-type-def kind='lvalue' type-id='type-id-315' size-in-bits='64' hash='74c7ab4eb7d456d4' id='type-id-305'/>
  </abi-instr>
</abi-corpus>
