<abi-corpus version='2.4'>
  <elf-function-symbols>
    <elf-symbol name='__sdhci_add_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x74ae518'/>
    <elf-symbol name='__sdhci_read_caps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x711f65c'/>
    <elf-symbol name='sdhci_add_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x7bfb1b1a'/>
    <elf-symbol name='sdhci_adma_write_desc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x61fdb22'/>
    <elf-symbol name='sdhci_alloc_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xfeefe08b'/>
    <elf-symbol name='sdhci_calc_clk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xbfcabe7e'/>
    <elf-symbol name='sdhci_cleanup_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x380506bd'/>
    <elf-symbol name='sdhci_cqe_disable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x69b1936e'/>
    <elf-symbol name='sdhci_cqe_enable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x5ebbc838'/>

    <elf-symbol name='sdhci_free_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4626d735'/>
    <elf-symbol name='sdhci_remove_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x6be911b2'/>
    <elf-symbol name='sdhci_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x762121fa'/>
    <elf-symbol name='sdhci_reset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x1a38d936'/>
    <elf-symbol name='sdhci_reset_tuning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xd0ca49ae'/>
    <elf-symbol name='sdhci_resume_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x2e5157bf'/>
    <elf-symbol name='sdhci_runtime_resume_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x62e5c15d'/>
    <elf-symbol name='sdhci_runtime_suspend_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4526a0d1'/>
    <elf-symbol name='sdhci_send_command' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x1512952'/>
    <elf-symbol name='sdhci_send_tuning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x213a51d7'/>
    <elf-symbol name='sdhci_set_bus_width' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x67f74689'/>
    <elf-symbol name='sdhci_set_clock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x5825825c'/>
    <elf-symbol name='sdhci_set_ios' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xddc78000'/>
    <elf-symbol name='sdhci_set_power' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xc9e167b5'/>
    <elf-symbol name='sdhci_set_power_noreg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x60affb80'/>
    <elf-symbol name='sdhci_set_uhs_signaling' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4015e747'/>
    <elf-symbol name='sdhci_setup_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xc5d73caf'/>
    <elf-symbol name='sdhci_start_signal_voltage_switch' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xcb9c7748'/>
    <elf-symbol name='sdhci_start_tuning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x39f40b95'/>
    <elf-symbol name='sdhci_suspend_host' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xa6de7a42'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='/ws/android/kernel/aosp/common-mainline/common/drivers/mmc/host/sdhci.c' comp-dir-path='/ws/android/kernel/aosp/common-mainline/out/android-mainline/common' language='LANG_C89'>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' hash='4ee7381753f6ca11' id='type-id-1'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='64' hash='79fc4a0264de2ef7' id='type-id-3'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='96' hash='50c967d780f5a787' id='type-id-5'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='128' hash='afe37222ee72dd57' id='type-id-8'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='128' hash='5bcff9bd555c202f' id='type-id-10'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='72' hash='6c550e64ba3ab40a' id='type-id-12'>
      <subrange length='9' lower-bound='0' upper-bound='8' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='34fc5cd709b37f15' id='type-id-13'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='4096' hash='270157bc8fd79988' id='type-id-15'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-16'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-17' size-in-bits='256' hash='d2bb02b926125142' id='type-id-18'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-19'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='type-id-20'/>
    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='256' hash='5fc924466baf4600' id='type-id-22'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-19'/>
    </array-type-def>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-23'/>
    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='2048' hash='967be61c43ecd18f' id='type-id-25'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-16'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='192' hash='13eb7ead98221c56' id='type-id-26'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='1024' hash='187e130269c4880c' id='type-id-27'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='type-id-28'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='128' hash='20e557d8b727a2ee' id='type-id-29'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='16384' hash='0310f3b158c068da' id='type-id-30'>
      <subrange length='2048' lower-bound='0' upper-bound='2047' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='2d269dd0371d392d' id='type-id-31'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='160' hash='99641d293d1da856' id='type-id-32'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='type-id-33'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='256' hash='3e9fefcb964ef6b4' id='type-id-34'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-16'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='448' hash='b9acc09cd17d593e' id='type-id-35'>
      <subrange length='56' lower-bound='0' upper-bound='55' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='1911f4cdae5d7aa5' id='type-id-36'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='48' hash='516fef6af38b96db' id='type-id-37'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='type-id-38'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='64' hash='e1c8b625c73024c4' id='type-id-39'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-40'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-41' size-in-bits='192' hash='7bec7586129c3dad' id='type-id-42'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-43' size-in-bits='256' hash='f2c5ed1e7c1efa2d' id='type-id-44'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-4'/>
    </array-type-def>
    <enum-decl name='dl_dev_state' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='885' column='1' hash='400b22486842c01e' id='type-id-45'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='DL_DEV_NO_DRIVER' value='0'/>
      <enumerator name='DL_DEV_PROBING' value='1'/>
      <enumerator name='DL_DEV_DRIVER_BOUND' value='2'/>
      <enumerator name='DL_DEV_UNBINDING' value='3'/>
    </enum-decl>
    <enum-decl name='dma_data_direction' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-direction.h' line='5' column='1' hash='6852811c209f77b7' id='type-id-47'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='DMA_BIDIRECTIONAL' value='0'/>
      <enumerator name='DMA_TO_DEVICE' value='1'/>
      <enumerator name='DMA_FROM_DEVICE' value='2'/>
      <enumerator name='DMA_NONE' value='3'/>
    </enum-decl>
    <enum-decl name='hrtimer_restart' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='56' column='1' hash='0511556ad85d4492' id='type-id-48'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='HRTIMER_NORESTART' value='0'/>
      <enumerator name='HRTIMER_RESTART' value='1'/>
    </enum-decl>
    <enum-decl name='kobj_ns_type' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject_ns.h' line='26' column='1' hash='04ddd7ac54118b23' id='type-id-49'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='KOBJ_NS_TYPE_NONE' value='0'/>
      <enumerator name='KOBJ_NS_TYPE_NET' value='1'/>
      <enumerator name='KOBJ_NS_TYPES' value='2'/>
    </enum-decl>
    <enum-decl name='led_brightness' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/leds.h' line='26' column='1' hash='8474fbae079096aa' id='type-id-50'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='LED_OFF' value='0'/>
      <enumerator name='LED_ON' value='1'/>
      <enumerator name='LED_HALF' value='127'/>
      <enumerator name='LED_FULL' value='255'/>
    </enum-decl>
    <enum-decl name='memory_type' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='58' column='1' hash='fe227b65c3191fdc' id='type-id-51'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='MEMORY_DEVICE_PRIVATE' value='1'/>
      <enumerator name='MEMORY_DEVICE_FS_DAX' value='2'/>
      <enumerator name='MEMORY_DEVICE_DEVDAX' value='3'/>
      <enumerator name='MEMORY_DEVICE_PCI_P2PDMA' value='4'/>
    </enum-decl>
    <enum-decl name='migrate_mode' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/migrate_mode.h' line='15' column='1' hash='3846b8f2ba35d29e' id='type-id-52'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='MIGRATE_ASYNC' value='0'/>
      <enumerator name='MIGRATE_SYNC_LIGHT' value='1'/>
      <enumerator name='MIGRATE_SYNC' value='2'/>
      <enumerator name='MIGRATE_SYNC_NO_COPY' value='3'/>
    </enum-decl>
    <enum-decl name='module_state' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/module.h' line='296' column='1' hash='991d2414c9527873' id='type-id-53'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='MODULE_STATE_LIVE' value='0'/>
      <enumerator name='MODULE_STATE_COMING' value='1'/>
      <enumerator name='MODULE_STATE_GOING' value='2'/>
      <enumerator name='MODULE_STATE_UNFORMED' value='3'/>
    </enum-decl>
    <enum-decl name='page_entry_size' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm.h' line='456' column='1' hash='88ec94e55119ddb0' id='type-id-54'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='PE_SIZE_PTE' value='0'/>
      <enumerator name='PE_SIZE_PMD' value='1'/>
      <enumerator name='PE_SIZE_PUD' value='2'/>
    </enum-decl>
    <enum-decl name='pid_type' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pid.h' line='9' column='1' hash='0d3b4762ead89e3c' id='type-id-55'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='PIDTYPE_PID' value='0'/>
      <enumerator name='PIDTYPE_TGID' value='1'/>
      <enumerator name='PIDTYPE_PGID' value='2'/>
      <enumerator name='PIDTYPE_SID' value='3'/>
      <enumerator name='PIDTYPE_MAX' value='4'/>
    </enum-decl>
    <enum-decl name='probe_type' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='238' column='1' hash='7ab0473355b722fb' id='type-id-56'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='PROBE_DEFAULT_STRATEGY' value='0'/>
      <enumerator name='PROBE_PREFER_ASYNCHRONOUS' value='1'/>
      <enumerator name='PROBE_FORCE_SYNCHRONOUS' value='2'/>
    </enum-decl>
    <enum-decl name='quota_type' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='54' column='1' hash='1d43ed063a41c7d7' id='type-id-57'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='USRQUOTA' value='0'/>
      <enumerator name='GRPQUOTA' value='1'/>
      <enumerator name='PRJQUOTA' value='2'/>
    </enum-decl>
    <enum-decl name='rpm_request' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='518' column='1' hash='b7a36d5ed6de6a07' id='type-id-58'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='RPM_REQ_NONE' value='0'/>
      <enumerator name='RPM_REQ_IDLE' value='1'/>
      <enumerator name='RPM_REQ_SUSPEND' value='2'/>
      <enumerator name='RPM_REQ_AUTOSUSPEND' value='3'/>
      <enumerator name='RPM_REQ_RESUME' value='4'/>
    </enum-decl>
    <enum-decl name='rpm_status' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='496' column='1' hash='d08ec3e5fbbd8925' id='type-id-59'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='RPM_ACTIVE' value='0'/>
      <enumerator name='RPM_RESUMING' value='1'/>
      <enumerator name='RPM_SUSPENDED' value='2'/>
      <enumerator name='RPM_SUSPENDING' value='3'/>
    </enum-decl>
    <enum-decl name='rw_hint' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='298' column='1' hash='1cba2cc3324c03fd' id='type-id-60'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='WRITE_LIFE_NOT_SET' value='0'/>
      <enumerator name='WRITE_LIFE_NONE' value='1'/>
      <enumerator name='WRITE_LIFE_SHORT' value='2'/>
      <enumerator name='WRITE_LIFE_MEDIUM' value='3'/>
      <enumerator name='WRITE_LIFE_LONG' value='4'/>
      <enumerator name='WRITE_LIFE_EXTREME' value='5'/>
    </enum-decl>
    <enum-decl name='timespec_type' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/restart_block.h' line='16' column='1' hash='65f467906c5b72cd' id='type-id-61'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='TT_NONE' value='0'/>
      <enumerator name='TT_NATIVE' value='1'/>
      <enumerator name='TT_COMPAT' value='2'/>
    </enum-decl>
    <enum-decl name='uprobe_task_state' size-in-bits='32' alignment-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/uprobes.h' line='51' column='1' hash='30e87c43f5a14504' id='type-id-62'>
      <underlying-type type-id='type-id-46'/>
      <enumerator name='UTASK_RUNNING' value='0'/>
      <enumerator name='UTASK_SSTEP' value='1'/>
      <enumerator name='UTASK_SSTEP_ACK' value='2'/>
      <enumerator name='UTASK_SSTEP_TRAPPED' value='3'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='type-id-63' size-in-bits='256' hash='9cf3d19d2016d0cd' id='type-id-64'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-19'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-65' size-in-bits='512' hash='c6fd5dd664131666' id='type-id-66'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-19'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-67' size-in-bits='4096' hash='75660610e8488be1' id='type-id-68'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-40'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='192' hash='5091176e5726cfec' id='type-id-70'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-6'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-71'/>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='128' hash='3320ece1fbb1b390' id='type-id-72'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-19'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-73' size-in-bits='16384' hash='7d2a5c67373d58a9' id='type-id-74'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='type-id-75'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-76' size-in-bits='unknown' hash='091a9904f887a6db' id='type-id-77'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-78'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-79' size-in-bits='384' hash='cab6d2b334ecc0ee' id='type-id-80'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-81' size-in-bits='unknown' hash='86e8e3ffa115f2c9' id='type-id-82'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-78'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-83' hash='6fb2e9f24de4176d' id='type-id-84'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-6'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-85'/>
    <type-decl name='long long int' size-in-bits='64' hash='5ae7f9eec1fc43d6#3' id='type-id-86'/>
    <array-type-def dimensions='1' type-id='type-id-87' size-in-bits='1728' hash='2e1354bfc1e560c9' id='type-id-88'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-89' size-in-bits='2016' hash='2e918717cc54c02a' id='type-id-90'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='58190901bcecd086' id='type-id-91'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-92' size-in-bits='128' hash='eb7b17878a845dd4' id='type-id-93'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-94' size-in-bits='2688' hash='4a285e4574a75b27' id='type-id-95'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-96' size-in-bits='256' hash='daa2281de3b86738' id='type-id-97'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-19'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-98' size-in-bits='1344' hash='d3313146e8c6625d' id='type-id-99'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-100' size-in-bits='384' hash='cd660d767360324b' id='type-id-101'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-102' size-in-bits='2048' hash='9c5fd7a573e66a9c' id='type-id-103'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-11'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#4' id='type-id-104'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='type-id-105'/>
    <array-type-def dimensions='1' type-id='type-id-106' size-in-bits='192' hash='f98e8079948d0caf' id='type-id-107'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-108' size-in-bits='2304' hash='f052b2579f1b74dd' id='type-id-109'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-1' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-6'/>
    </array-type-def>
    <class-decl name='__kernel_timespec' is-struct='yes' visibility='default' size-in-bits='128' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/time_types.h' line='7' column='1' hash='a945d83245b6824d' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-111' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/time_types.h' line='8' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-86' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/time_types.h' line='9' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='acpi_device_id' is-struct='yes' visibility='default' size-in-bits='256' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mod_devicetable.h' line='210' column='1' hash='ddd60486098d257f' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-12' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mod_devicetable.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='driver_data' type-id='type-id-113' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mod_devicetable.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cls' type-id='type-id-2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mod_devicetable.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='cls_msk' type-id='type-id-2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mod_devicetable.h' line='214' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='address_space' is-struct='yes' visibility='default' size-in-bits='1280' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='442' column='1' hash='bcfa0fc3cf1e4f70' id='type-id-114'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='host' type-id='type-id-69' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='i_pages' type-id='type-id-115' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gfp_mask' type-id='type-id-116' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='i_mmap_writable' type-id='type-id-117' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='i_mmap' type-id='type-id-118' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='i_mmap_rwsem' type-id='type-id-119' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nrpages' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nrexceptional' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='writeback_index' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='a_ops' type-id='type-id-121' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='flags' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='wb_err' type-id='type-id-122' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='private_lock' type-id='type-id-123' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='private_list' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='private_data' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='457' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='address_space_operations' is-struct='yes' visibility='default' size-in-bits='1344' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='360' column='1' hash='ebda6730ddf8d7b4' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='writepage' type-id='type-id-126' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='readpage' type-id='type-id-127' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='writepages' type-id='type-id-128' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='set_page_dirty' type-id='type-id-129' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='readpages' type-id='type-id-130' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write_begin' type-id='type-id-131' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='write_end' type-id='type-id-132' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='bmap' type-id='type-id-133' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='invalidatepage' type-id='type-id-134' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='releasepage' type-id='type-id-135' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='freepage' type-id='type-id-136' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='direct_IO' type-id='type-id-137' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='migratepage' type-id='type-id-138' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='isolate_page' type-id='type-id-139' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='putback_page' type-id='type-id-136' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='launder_page' type-id='type-id-129' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='is_partially_uptodate' type-id='type-id-140' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='is_dirty_writeback' type-id='type-id-141' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='error_remove_page' type-id='type-id-142' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='swap_activate' type-id='type-id-143' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='swap_deactivate' type-id='type-id-144' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='407' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='arch_uprobe_task' is-struct='yes' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/uprobes.h' line='21' column='1' hash='5cf2c2e2194081b9' id='type-id-145'/>
    <class-decl name='assoc_array' is-struct='yes' visibility='default' size-in-bits='128' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/assoc_array.h' line='22' column='1' hash='d0c57b16b29f57ff' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='root' type-id='type-id-147' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/assoc_array.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nr_leaves_on_tree' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/assoc_array.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='atomic64_t' is-struct='yes' naming-typedef-id='type-id-148' visibility='default' size-in-bits='64' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='176' column='1' hash='569acc9a8c864f08' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='counter' type-id='type-id-150' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='177' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='atomic_t' is-struct='yes' naming-typedef-id='type-id-117' visibility='default' size-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='171' column='1' hash='4b81e2d2a912b437' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='counter' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='172' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='attribute' is-struct='yes' visibility='default' size-in-bits='128' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='30' column='1' hash='8de467f3c33f772a' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mode' type-id='type-id-154' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='attribute_group' is-struct='yes' visibility='default' size-in-bits='320' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='84' column='1' hash='2a48a3c85a32c8d1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='is_visible' type-id='type-id-156' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='is_bin_visible' type-id='type-id-157' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='attrs' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bin_attrs' type-id='type-id-159' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='91' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bin_attribute' is-struct='yes' visibility='default' size-in-bits='448' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='161' column='1' hash='8cc7b223a662ad15' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attr' type-id='type-id-152' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-161' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='private' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='read' type-id='type-id-162' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write' type-id='type-id-162' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mmap' type-id='type-id-163' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sysfs.h' line='169' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='block_device' is-struct='yes' visibility='default' size-in-bits='1728' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='466' column='1' hash='45c37b9ea6c56cc8' id='type-id-164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bd_dev' type-id='type-id-165' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bd_openers' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bd_inode' type-id='type-id-69' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bd_super' type-id='type-id-166' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bd_mutex' type-id='type-id-167' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='bd_claiming' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='bd_holder' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bd_holders' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='bd_write_holder' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='475' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='bd_holder_disks' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bd_contains' type-id='type-id-169' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='bd_block_size' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='bd_partno' type-id='type-id-171' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bd_part' type-id='type-id-172' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='bd_part_count' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='bd_invalidated' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='bd_disk' type-id='type-id-173' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='486' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='bd_queue' type-id='type-id-174' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='487' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='bd_bdi' type-id='type-id-175' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='bd_list' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='bd_private' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='bd_fsfreeze_count' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='bd_fsfreeze_mutex' type-id='type-id-167' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='501' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bpf_raw_event_map' is-struct='yes' visibility='default' size-in-bits='256' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='44' column='1' hash='1b91bd347f0455b8' id='type-id-176'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tp' type-id='type-id-177' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bpf_func' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='num_args' type-id='type-id-178' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='writable_size' type-id='type-id-178' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/tracepoint-defs.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bug_entry' is-struct='yes' visibility='default' size-in-bits='96' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/bug.h' line='23' column='1' hash='4f77c523fe84f5f5' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bug_addr_disp' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/bug.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='file_disp' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/bug.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='type-id-180' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/bug.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='flags' type-id='type-id-180' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/asm-generic/bug.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bus_type' is-struct='yes' visibility='default' size-in-bits='1344' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='115' column='1' hash='831d639cd7a056e7' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dev_root' type-id='type-id-182' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bus_groups' type-id='type-id-183' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_groups' type-id='type-id-183' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drv_groups' type-id='type-id-183' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='match' type-id='type-id-184' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='uevent' type-id='type-id-185' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='probe' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='remove' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='shutdown' type-id='type-id-187' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='online' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='offline' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='suspend' type-id='type-id-188' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='resume' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='num_vf' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='dma_configure' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='pm' type-id='type-id-189' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='iommu_ops' type-id='type-id-190' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='p' type-id='type-id-191' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='lock_key' type-id='type-id-83' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='need_parent_lock' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='callback_head' is-struct='yes' visibility='default' size-in-bits='128' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='219' column='1' hash='ac5675f07df7581e' id='type-id-192'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-193' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='func' type-id='type-id-194' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='221' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='class' is-struct='yes' visibility='default' size-in-bits='960' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='407' column='1' hash='055c76c5e35d5a42' id='type-id-195'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='owner' type-id='type-id-196' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='class_groups' type-id='type-id-183' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dev_groups' type-id='type-id-183' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_kobj' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev_uevent' type-id='type-id-185' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='devnode' type-id='type-id-198' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='class_release' type-id='type-id-199' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dev_release' type-id='type-id-187' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='shutdown_pre' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ns_type' type-id='type-id-200' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='namespace' type-id='type-id-201' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_ownership' type-id='type-id-202' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='pm' type-id='type-id-189' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='428' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='p' type-id='type-id-191' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='430' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='completion' is-struct='yes' visibility='default' size-in-bits='256' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/completion.h' line='26' column='1' hash='12ca59dcf886bc95' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='done' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/completion.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wait' type-id='type-id-204' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/completion.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='core_state' is-struct='yes' visibility='default' size-in-bits='448' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='365' column='1' hash='8b6072758e698e8a' id='type-id-205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr_threads' type-id='type-id-117' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dumper' type-id='type-id-206' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='startup' type-id='type-id-203' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='368' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='core_thread' is-struct='yes' visibility='default' size-in-bits='128' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='360' column='1' hash='d5cd3a3a96b56367' id='type-id-206'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='task' type-id='type-id-207' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-208' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/mm_types.h' line='362' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cpu_context' is-struct='yes' visibility='default' size-in-bits='832' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='110' column='1' hash='79430c6f7a71089e' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x19' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x20' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x21' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='x22' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x23' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='x24' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='x25' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='x26' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='x27' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='x28' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='fp' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='sp' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='pc' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='123' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cpu_itimer' is-struct='yes' visibility='default' size-in-bits='128' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sched/signal.h' line='35' column='1' hash='4604cce4e8e8f775' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='expires' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sched/signal.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='incr' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/sched/signal.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cpumask' is-struct='yes' visibility='default' size-in-bits='64' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cpumask.h' line='16' column='1' hash='f81b470fb22a392a' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bits' type-id='type-id-212' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cpumask.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cred' is-struct='yes' visibility='default' size-in-bits='1344' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='111' column='1' hash='c3291ec575491c21' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='usage' type-id='type-id-117' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='uid' type-id='type-id-214' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gid' type-id='type-id-76' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='suid' type-id='type-id-214' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sgid' type-id='type-id-76' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='euid' type-id='type-id-214' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='egid' type-id='type-id-76' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='fsuid' type-id='type-id-214' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fsgid' type-id='type-id-76' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='securebits' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cap_inheritable' type-id='type-id-215' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cap_permitted' type-id='type-id-215' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cap_effective' type-id='type-id-215' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cap_bset' type-id='type-id-215' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cap_ambient' type-id='type-id-215' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='jit_keyring' type-id='type-id-216' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='session_keyring' type-id='type-id-217' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='process_keyring' type-id='type-id-217' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='thread_keyring' type-id='type-id-217' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='request_key_auth' type-id='type-id-217' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='security' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='user' type-id='type-id-218' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='user_ns' type-id='type-id-219' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='group_info' type-id='type-id-220' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='' type-id='type-id-221' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='149' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='debug_info' is-struct='yes' visibility='default' size-in-bits='2176' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='97' column='1' hash='6785c56bc1c828e6' id='type-id-222'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='suspended_step' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bps_disabled' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wps_disabled' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hbp_break' type-id='type-id-223' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='hbp_watch' type-id='type-id-223' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/processor.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='delayed_call' is-struct='yes' visibility='default' size-in-bits='128' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/delayed_call.h' line='10' column='1' hash='68a7963ce4b1a2d2' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fn' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/delayed_call.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/delayed_call.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='delayed_work' is-struct='yes' visibility='default' size-in-bits='704' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/workqueue.h' line='115' column='1' hash='25ed3f301fabdc66' id='type-id-226'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='work' type-id='type-id-227' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/workqueue.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='timer' type-id='type-id-228' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/workqueue.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='wq' type-id='type-id-229' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/workqueue.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='cpu' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/workqueue.h' line='121' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dentry' is-struct='yes' visibility='default' size-in-bits='1536' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='89' column='1' hash='62d2a20e71716df1' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_flags' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='d_seq' type-id='type-id-231' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_hash' type-id='type-id-232' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d_parent' type-id='type-id-233' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='d_name' type-id='type-id-234' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='d_inode' type-id='type-id-69' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='d_iname' type-id='type-id-235' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='d_lockref' type-id='type-id-236' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='d_op' type-id='type-id-237' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='d_sb' type-id='type-id-166' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='d_time' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='d_fsdata' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='' type-id='type-id-238' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='d_child' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='d_subdirs' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='d_u' type-id='type-id-239' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='120' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dentry_operations' is-struct='yes' visibility='default' size-in-bits='1024' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='135' column='1' hash='9b96ace2a60c23db' id='type-id-240'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_revalidate' type-id='type-id-241' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_weak_revalidate' type-id='type-id-241' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_hash' type-id='type-id-242' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d_compare' type-id='type-id-243' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='d_delete' type-id='type-id-244' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='d_init' type-id='type-id-245' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='d_release' type-id='type-id-246' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='d_prune' type-id='type-id-246' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='d_iput' type-id='type-id-247' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='d_dname' type-id='type-id-248' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='d_automount' type-id='type-id-249' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='d_manage' type-id='type-id-250' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='d_real' type-id='type-id-251' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='d_canonical_path' type-id='type-id-252' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dcache.h' line='150' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dev_archdata' is-struct='yes' visibility='default' size-in-bits='64' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/device.h' line='8' column='1' hash='44671d876dbd8f85' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iommu' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/device.h' line='10' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dev_links_info' is-struct='yes' visibility='default' size-in-bits='320' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='898' column='1' hash='4958785c84efb620' id='type-id-254'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='suppliers' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='899' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='consumers' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='900' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='status' type-id='type-id-45' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='901' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dev_pagemap' is-struct='yes' visibility='default' size-in-bits='1856' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='106' column='1' hash='0609fca6d8b79794' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='altmap' type-id='type-id-256' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='res' type-id='type-id-257' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='ref' type-id='type-id-258' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='internal_ref' type-id='type-id-259' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='done' type-id='type-id-203' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='dev' type-id='type-id-182' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='type' type-id='type-id-51' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='flags' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='pci_p2pdma_bus_offset' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='ops' type-id='type-id-260' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dev_pagemap_ops' is-struct='yes' visibility='default' size-in-bits='256' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='66' column='1' hash='64d3b5e6ad333f50' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='page_free' type-id='type-id-136' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='kill' type-id='type-id-262' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cleanup' type-id='type-id-262' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='migrate_to_ram' type-id='type-id-263' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/memremap.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dev_pm_domain' is-struct='yes' visibility='default' size-in-bits='1728' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='649' column='1' hash='fbf40b9ae239e52a' id='type-id-264'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ops' type-id='type-id-265' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='650' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='detach' type-id='type-id-266' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='activate' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='sync' type-id='type-id-187' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='653' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='dismiss' type-id='type-id-187' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='654' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dev_pm_info' is-struct='yes' visibility='default' size-in-bits='2432' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='573' column='1' hash='b7c124c1ac24afc4' id='type-id-267'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='power_state' type-id='type-id-268' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='can_wakeup' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33'>
        <var-decl name='async_suspend' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34'>
        <var-decl name='in_dpm_list' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35'>
        <var-decl name='is_prepared' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36'>
        <var-decl name='is_suspended' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='579' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37'>
        <var-decl name='is_noirq_suspended' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38'>
        <var-decl name='is_late_suspended' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39'>
        <var-decl name='no_pm' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='early_init' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='583' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41'>
        <var-decl name='direct_complete' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='584' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='driver_flags' type-id='type-id-178' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='585' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lock' type-id='type-id-123' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='586' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='entry' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='completion' type-id='type-id-203' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='589' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='wakeup' type-id='type-id-269' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='wakeup_path' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='591' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='577'>
        <var-decl name='syscore' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='578'>
        <var-decl name='no_pm_callbacks' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='579'>
        <var-decl name='must_resume' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='580'>
        <var-decl name='may_skip_resume' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='suspend_timer' type-id='type-id-270' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='600' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='timer_expires' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='work' type-id='type-id-227' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='602' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='wait_queue' type-id='type-id-204' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='wakeirq' type-id='type-id-271' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='usage_count' type-id='type-id-117' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='605' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='child_count' type-id='type-id-117' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='disable_depth' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1795'>
        <var-decl name='idle_notification' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1796'>
        <var-decl name='request_pending' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1797'>
        <var-decl name='deferred_resume' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1798'>
        <var-decl name='runtime_auto' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1799'>
        <var-decl name='ignore_children' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1800'>
        <var-decl name='no_callbacks' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1801'>
        <var-decl name='irq_safe' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1802'>
        <var-decl name='use_autosuspend' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1803'>
        <var-decl name='timer_autosuspends' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='616' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1804'>
        <var-decl name='memalloc_noio' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='links_count' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='request' type-id='type-id-58' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='runtime_status' type-id='type-id-59' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='runtime_error' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='autosuspend_delay' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='last_busy' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='623' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='active_time' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='suspended_time' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='accounting_timestamp' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='subsys_data' type-id='type-id-272' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='set_latency_tolerance' type-id='type-id-273' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='qos' type-id='type-id-274' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='630' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dev_pm_ops' is-struct='yes' visibility='default' size-in-bits='1472' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='278' column='1' hash='ab8fddb1f11699a9' id='type-id-265'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prepare' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='complete' type-id='type-id-187' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='suspend' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='resume' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='freeze' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='thaw' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='poweroff' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='restore' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='suspend_late' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='resume_early' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='freeze_late' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='thaw_early' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='poweroff_late' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='restore_early' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='suspend_noirq' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='resume_noirq' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='freeze_noirq' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='thaw_noirq' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='poweroff_noirq' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='restore_noirq' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='runtime_suspend' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='runtime_resume' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='runtime_idle' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/pm.h' line='301' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='device' is-struct='yes' visibility='default' size-in-bits='5888' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='987' column='1' hash='c655324b5c9e4449' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kobj' type-id='type-id-276' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='988' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parent' type-id='type-id-182' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='989' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='p' type-id='type-id-277' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='991' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='init_name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='993' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='type' type-id='type-id-278' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='994' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bus' type-id='type-id-279' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='996' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='driver' type-id='type-id-280' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='997' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='platform_data' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='999' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='driver_data' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1001' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='mutex' type-id='type-id-167' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1006' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='links' type-id='type-id-254' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1010' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='power' type-id='type-id-267' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1011' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='pm_domain' type-id='type-id-281' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1012' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='msi_domain' type-id='type-id-282' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1015' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='pins' type-id='type-id-283' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1018' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='msi_list' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1021' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='dma_ops' type-id='type-id-284' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1024' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='dma_mask' type-id='type-id-285' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1025' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='coherent_dma_mask' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1026' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='bus_dma_mask' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1031' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='dma_pfn_offset' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1032' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='dma_parms' type-id='type-id-286' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1034' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='dma_pools' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1036' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='dma_mem' type-id='type-id-287' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1039' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='cma_area' type-id='type-id-288' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1043' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='archdata' type-id='type-id-253' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1047' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='of_node' type-id='type-id-289' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1049' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='fwnode' type-id='type-id-290' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1050' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='devt' type-id='type-id-165' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1055' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5216'>
        <var-decl name='id' type-id='type-id-178' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1056' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='devres_lock' type-id='type-id-123' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1058' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='devres_head' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1059' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='class' type-id='type-id-291' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1061' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='groups' type-id='type-id-183' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1062' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='release' type-id='type-id-187' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1064' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='iommu_group' type-id='type-id-292' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1065' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='iommu_fwspec' type-id='type-id-293' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1066' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='iommu_param' type-id='type-id-294' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1067' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='offline_disabled' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1069' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5825'>
        <var-decl name='offline' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1070' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5826'>
        <var-decl name='of_node_reused' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1071' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5827'>
        <var-decl name='dma_coherent' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='1075' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='device_dma_parameters' is-struct='yes' visibility='default' size-in-bits='128' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='754' column='1' hash='652878c9f97297f7' id='type-id-295'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max_segment_size' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='segment_boundary_mask' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='760' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='device_driver' is-struct='yes' visibility='default' size-in-bits='1024' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='280' column='1' hash='b6c0f6af08a8b94f' id='type-id-296'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bus' type-id='type-id-279' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='owner' type-id='type-id-196' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mod_name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='suppress_bind_attrs' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='probe_type' type-id='type-id-56' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='of_match_table' type-id='type-id-297' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='acpi_match_table' type-id='type-id-298' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='probe' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='remove' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='shutdown' type-id='type-id-187' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='suspend' type-id='type-id-188' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='resume' type-id='type-id-186' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='groups' type-id='type-id-183' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='pm' type-id='type-id-189' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='coredump' type-id='type-id-187' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='p' type-id='type-id-299' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='303' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='device_node' is-struct='yes' visibility='default' size-in-bits='1280' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/of.h' line='51' column='1' hash='ad2ba9326e846886' id='type-id-300'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/of.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='phandle' type-id='type-id-301' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/of.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='full_name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/of.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fwnode' type-id='type-id-302' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/of.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='properties' type-id='type-id-303' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/of.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='deadprops' type-id='type-id-303' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/of.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='parent' type-id='type-id-289' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/of.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='child' type-id='type-id-289' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/of.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sibling' type-id='type-id-289' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/of.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='kobj' type-id='type-id-276' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/of.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_flags' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/of.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='data' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/of.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='device_type' is-struct='yes' visibility='default' size-in-bits='384' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='557' column='1' hash='bf0425bc8dae437b' id='type-id-304'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='groups' type-id='type-id-183' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uevent' type-id='type-id-185' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='devnode' type-id='type-id-305' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='release' type-id='type-id-187' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pm' type-id='type-id-189' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/device.h' line='565' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dir_context' is-struct='yes' visibility='default' size-in-bits='128' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1746' column='1' hash='4a7c085a67c0e7a3' id='type-id-306'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='actor' type-id='type-id-307' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pos' type-id='type-id-308' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1748' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dma_map_ops' is-struct='yes' visibility='default' size-in-bits='1152' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='79' column='1' hash='e63036628827f61a' id='type-id-309'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='alloc' type-id='type-id-310' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free' type-id='type-id-311' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mmap' type-id='type-id-312' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='get_sgtable' type-id='type-id-313' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='map_page' type-id='type-id-314' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='unmap_page' type-id='type-id-315' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='map_sg' type-id='type-id-316' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unmap_sg' type-id='type-id-317' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='map_resource' type-id='type-id-318' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='unmap_resource' type-id='type-id-315' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='sync_single_for_cpu' type-id='type-id-319' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='sync_single_for_device' type-id='type-id-319' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='sync_sg_for_cpu' type-id='type-id-320' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='sync_sg_for_device' type-id='type-id-320' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='cache_sync' type-id='type-id-321' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='dma_supported' type-id='type-id-322' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='get_required_mask' type-id='type-id-323' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='max_mapping_size' type-id='type-id-324' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/dma-mapping.h' line='133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dquot' is-struct='yes' visibility='default' size-in-bits='1664' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='294' column='1' hash='8bbf4b2a41e44b52' id='type-id-325'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dq_hash' type-id='type-id-65' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dq_inuse' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dq_free' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dq_dirty' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dq_lock' type-id='type-id-167' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='dq_dqb_lock' type-id='type-id-123' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='dq_count' type-id='type-id-117' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='dq_sb' type-id='type-id-166' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dq_id' type-id='type-id-326' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='dq_off' type-id='type-id-308' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='dq_flags' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='dq_dqb' type-id='type-id-327' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='306' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dquot_operations' is-struct='yes' visibility='default' size-in-bits='704' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='322' column='1' hash='0d4460883f835da4' id='type-id-328'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='write_dquot' type-id='type-id-329' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='alloc_dquot' type-id='type-id-330' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy_dquot' type-id='type-id-331' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='acquire_dquot' type-id='type-id-329' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='release_dquot' type-id='type-id-329' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mark_dirty' type-id='type-id-329' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='write_info' type-id='type-id-332' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_reserved_space' type-id='type-id-333' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='get_projid' type-id='type-id-334' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='get_inode_usage' type-id='type-id-335' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='get_next_id' type-id='type-id-336' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='337' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='elf64_sym' is-struct='yes' visibility='default' size-in-bits='192' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='192' column='1' hash='86745d173b56e8ed' id='type-id-337'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_name' type-id='type-id-338' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='st_info' type-id='type-id-216' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='st_other' type-id='type-id-216' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='st_shndx' type-id='type-id-339' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_value' type-id='type-id-340' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_size' type-id='type-id-341' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/elf.h' line='198' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='exception_table_entry' is-struct='yes' visibility='default' size-in-bits='64' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/extable.h' line='18' column='1' hash='33e7e8032dc0ab4c' id='type-id-342'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='insn' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/extable.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fixup' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/arch/arm64/include/asm/extable.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fasync_struct' is-struct='yes' visibility='default' size-in-bits='384' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1313' column='1' hash='22046b3743306a5f' id='type-id-343'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fa_lock' type-id='type-id-344' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='magic' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='fa_fd' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fa_next' type-id='type-id-345' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fa_file' type-id='type-id-346' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fa_rcu' type-id='type-id-192' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1319' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fiemap_extent' is-struct='yes' visibility='default' size-in-bits='448' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/fiemap.h' line='17' column='1' hash='0016add3824dee27' id='type-id-347'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fe_logical' type-id='type-id-7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/fiemap.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fe_physical' type-id='type-id-7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/fiemap.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fe_length' type-id='type-id-7' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/fiemap.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fe_reserved64' type-id='type-id-8' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/fiemap.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fe_flags' type-id='type-id-2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/fiemap.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='fe_reserved' type-id='type-id-5' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/uapi/linux/fiemap.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fiemap_extent_info' is-struct='yes' visibility='default' size-in-bits='192' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1725' column='1' hash='5ad29c8f174c69d2' id='type-id-348'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fi_flags' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fi_extents_mapped' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fi_extents_max' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1728' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fi_extents_start' type-id='type-id-349' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1729' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file' is-struct='yes' visibility='default' size-in-bits='2048' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='922' column='1' hash='bc05c4ed66f8b34b' id='type-id-350'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_u' type-id='type-id-351' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='926' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_path' type-id='type-id-352' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='927' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_inode' type-id='type-id-69' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='928' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_op' type-id='type-id-353' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='929' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_lock' type-id='type-id-123' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='f_write_hint' type-id='type-id-60' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_count' type-id='type-id-17' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_flags' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='f_mode' type-id='type-id-354' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='939' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_pos_lock' type-id='type-id-167' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='f_pos' type-id='type-id-308' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='941' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='f_owner' type-id='type-id-355' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='f_cred' type-id='type-id-356' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='f_ra' type-id='type-id-357' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='f_version' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='f_security' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='private_data' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='951' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='f_ep_links' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='955' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='f_tfile_llink' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='956' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='f_mapping' type-id='type-id-358' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='958' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='f_wb_err' type-id='type-id-122' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='959' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file_lock' is-struct='yes' visibility='default' size-in-bits='1728' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1066' column='1' hash='faca702dab38bed0' id='type-id-359'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fl_blocker' type-id='type-id-360' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1067' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fl_list' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1068' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fl_link' type-id='type-id-65' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1069' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fl_blocked_requests' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1070' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='fl_blocked_member' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1073' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='fl_owner' type-id='type-id-361' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1076' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='fl_flags' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1077' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='fl_type' type-id='type-id-216' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1078' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='fl_pid' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1079' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='fl_link_cpu' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1080' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='fl_wait' type-id='type-id-204' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1081' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='fl_file' type-id='type-id-346' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1082' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='fl_start' type-id='type-id-308' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1083' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='fl_end' type-id='type-id-308' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1084' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='fl_fasync' type-id='type-id-345' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1086' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='fl_break_time' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1088' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='fl_downgrade_time' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1089' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='fl_ops' type-id='type-id-362' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1091' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='fl_lmops' type-id='type-id-363' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1092' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='fl_u' type-id='type-id-364' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1101' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file_lock_context' is-struct='yes' visibility='default' size-in-bits='448' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1104' column='1' hash='62a6fa2bfd7004c8' id='type-id-365'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flc_lock' type-id='type-id-123' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flc_flock' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flc_posix' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='flc_lease' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1108' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file_lock_operations' is-struct='yes' visibility='default' size-in-bits='128' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1016' column='1' hash='035f93aa255c1b47' id='type-id-366'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fl_copy_lock' type-id='type-id-367' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1017' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fl_release_private' type-id='type-id-368' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1018' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file_operations' is-struct='yes' visibility='default' size-in-bits='2048' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1800' column='1' hash='db11cde9278258f5' id='type-id-369'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='owner' type-id='type-id-196' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1801' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='llseek' type-id='type-id-370' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1802' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='read' type-id='type-id-371' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='write' type-id='type-id-372' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='read_iter' type-id='type-id-137' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1805' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write_iter' type-id='type-id-137' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='iopoll' type-id='type-id-373' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1807' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='iterate' type-id='type-id-374' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1808' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='iterate_shared' type-id='type-id-374' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1809' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='poll' type-id='type-id-375' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1810' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='unlocked_ioctl' type-id='type-id-376' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1811' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='compat_ioctl' type-id='type-id-376' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1812' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='mmap' type-id='type-id-377' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='mmap_supported_flags' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='open' type-id='type-id-378' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='flush' type-id='type-id-379' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='release' type-id='type-id-378' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='fsync' type-id='type-id-380' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1818' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='fasync' type-id='type-id-381' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1819' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='lock' type-id='type-id-382' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1820' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='sendpage' type-id='type-id-383' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='get_unmapped_area' type-id='type-id-384' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1822' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='check_flags' type-id='type-id-385' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1823' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='flock' type-id='type-id-382' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1824' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='splice_write' type-id='type-id-386' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1825' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='splice_read' type-id='type-id-387' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1826' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='setlease' type-id='type-id-388' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1827' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='fallocate' type-id='type-id-389' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='show_fdinfo' type-id='type-id-390' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1830' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='copy_file_range' type-id='type-id-391' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1834' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='remap_file_range' type-id='type-id-392' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1836' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='fadvise' type-id='type-id-380' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1839' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file_ra_state' is-struct='yes' visibility='default' size-in-bits='256' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='902' column='1' hash='1005145b8870a91e' id='type-id-357'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='903' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='904' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='async_size' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='905' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ra_pages' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='908' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='mmap_miss' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='909' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='prev_pos' type-id='type-id-308' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='910' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='file_system_type' is-struct='yes' visibility='default' size-in-bits='640' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2200' column='1' hash='ee3ab696c2e8a74a' id='type-id-393'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fs_flags' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='init_fs_context' type-id='type-id-394' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='parameters' type-id='type-id-395' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mount' type-id='type-id-396' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='alloc_mnt_data' type-id='type-id-397' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='kill_sb' type-id='type-id-398' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='owner' type-id='type-id-196' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='next' type-id='type-id-399' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='fs_supers' type-id='type-id-63' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='s_lock_key' type-id='type-id-83' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='s_umount_key' type-id='type-id-83' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='s_vfs_rename_key' type-id='type-id-83' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='s_writers_key' type-id='type-id-84' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='i_lock_key' type-id='type-id-83' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='i_mutex_key' type-id='type-id-83' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='i_mutex_dir_key' type-id='type-id-83' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='2226' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fown_struct' is-struct='yes' visibility='default' size-in-bits='256' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='891' column='1' hash='0d1d794d3aae8bb7' id='type-id-355'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='type-id-344' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='892' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pid' type-id='type-id-96' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='893' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pid_type' type-id='type-id-55' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='894' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='uid' type-id='type-id-214' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='895' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='euid' type-id='type-id-214' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='895' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='signum' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='896' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fwnode_endpoint' is-struct='yes' visibility='default' size-in-bits='128' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='28' column='1' hash='99d09d3a5633a0fd' id='type-id-400'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='port' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='id' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='local_fwnode' type-id='type-id-401' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fwnode_handle' is-struct='yes' visibility='default' size-in-bits='128' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='17' column='1' hash='8e7de453711fe852' id='type-id-302'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secondary' type-id='type-id-290' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ops' type-id='type-id-402' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='19' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fwnode_operations' is-struct='yes' visibility='default' size-in-bits='960' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='69' column='1' hash='6d3cb33aca2e8c5a' id='type-id-403'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='get' type-id='type-id-404' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='put' type-id='type-id-405' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='device_is_available' type-id='type-id-406' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='device_get_match_data' type-id='type-id-407' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='property_present' type-id='type-id-408' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='property_read_int_array' type-id='type-id-409' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='property_read_string_array' type-id='type-id-410' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_parent' type-id='type-id-411' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='get_next_child_node' type-id='type-id-412' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='get_named_child_node' type-id='type-id-413' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='get_reference_args' type-id='type-id-414' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='graph_get_next_endpoint' type-id='type-id-412' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='graph_get_remote_endpoint' type-id='type-id-411' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='graph_get_port_parent' type-id='type-id-404' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='graph_parse_endpoint' type-id='type-id-415' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='103' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='fwnode_reference_args' is-struct='yes' visibility='default' size-in-bits='640' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='42' column='1' hash='f38b7e1d408a3b9e' id='type-id-416'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fwnode' type-id='type-id-290' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nargs' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='args' type-id='type-id-417' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fwnode.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='group_info' is-struct='yes' visibility='default' size-in-bits='64' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='25' column='1' hash='c6920efe04b1216c' id='type-id-418'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='usage' type-id='type-id-117' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ngroups' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gid' type-id='type-id-77' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/cred.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hlist_bl_head' is-struct='yes' visibility='default' size-in-bits='64' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/list_bl.h' line='34' column='1' hash='27a87fb82c25b31e' id='type-id-419'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-420' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/list_bl.h' line='35' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hlist_bl_node' is-struct='yes' visibility='default' size-in-bits='128' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/list_bl.h' line='38' column='1' hash='8b006c61fb56c4e3' id='type-id-232'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-420' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/list_bl.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pprev' type-id='type-id-421' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/list_bl.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hlist_head' is-struct='yes' visibility='default' size-in-bits='64' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='185' column='1' hash='faed70ef349f130c' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-422' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hlist_node' is-struct='yes' visibility='default' size-in-bits='128' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='189' column='1' hash='ccb61e67d2dcb3e7' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-422' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pprev' type-id='type-id-423' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/types.h' line='190' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hrtimer' is-struct='yes' visibility='default' size-in-bits='512' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='107' column='1' hash='184a3999c010b02b' id='type-id-270'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='node' type-id='type-id-424' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_softexpires' type-id='type-id-425' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='function' type-id='type-id-426' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='base' type-id='type-id-427' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='state' type-id='type-id-171' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='is_rel' type-id='type-id-171' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='is_soft' type-id='type-id-171' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hrtimer_clock_base' is-struct='yes' visibility='default' size-in-bits='512' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='147' column='1' hash='f0346f83d10772bd' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cpu_base' type-id='type-id-428' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='index' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='clockid' type-id='type-id-429' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='seq' type-id='type-id-231' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='running' type-id='type-id-430' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='active' type-id='type-id-431' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_time' type-id='type-id-432' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='offset' type-id='type-id-425' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hrtimer_cpu_base' is-struct='yes' visibility='default' size-in-bits='4608' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='198' column='1' hash='902814b99654792f' id='type-id-433'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='type-id-434' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cpu' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='active_bases' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='clock_was_set_seq' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hres_active' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='129'>
        <var-decl name='in_hrtirq' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='130'>
        <var-decl name='hang_detected' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131'>
        <var-decl name='softirq_activated' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nr_events' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nr_retries' type-id='type-id-180' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='nr_hangs' type-id='type-id-180' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='max_hang_time' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='expires_next' type-id='type-id-425' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next_timer' type-id='type-id-430' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='softirq_expires_next' type-id='type-id-425' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='softirq_next_timer' type-id='type-id-430' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='clock_base' type-id='type-id-68' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/hrtimer.h' line='217' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iattr' is-struct='yes' visibility='default' size-in-bits='640' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='222' column='1' hash='08e3108bdcd523bf' id='type-id-435'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ia_valid' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ia_mode' type-id='type-id-154' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ia_uid' type-id='type-id-214' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ia_gid' type-id='type-id-76' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ia_size' type-id='type-id-308' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ia_atime' type-id='type-id-436' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ia_mtime' type-id='type-id-436' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ia_ctime' type-id='type-id-436' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ia_file' type-id='type-id-346' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='237' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='idr' is-struct='yes' visibility='default' size-in-bits='192' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/idr.h' line='19' column='1' hash='fa93c3ff8f55faa0' id='type-id-437'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='idr_rt' type-id='type-id-115' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/idr.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='idr_base' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/idr.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='idr_next' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/idr.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='inode' is-struct='yes' visibility='default' size-in-bits='4672' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='621' column='1' hash='f35750334cf71f50' id='type-id-438'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='i_mode' type-id='type-id-154' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='i_opflags' type-id='type-id-180' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='623' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='i_uid' type-id='type-id-214' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='i_gid' type-id='type-id-76' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='i_flags' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='i_acl' type-id='type-id-439' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='i_default_acl' type-id='type-id-439' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='630' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='i_op' type-id='type-id-440' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='i_sb' type-id='type-id-166' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='i_mapping' type-id='type-id-358' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='635' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='i_security' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='638' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='i_ino' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='642' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='' type-id='type-id-441' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='650' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='i_rdev' type-id='type-id-165' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='i_size' type-id='type-id-308' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='i_atime' type-id='type-id-436' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='656' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='i_mtime' type-id='type-id-436' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='i_ctime' type-id='type-id-436' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='i_lock' type-id='type-id-123' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='i_bytes' type-id='type-id-180' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1136'>
        <var-decl name='i_blkbits' type-id='type-id-171' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='661' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1144'>
        <var-decl name='i_write_hint' type-id='type-id-171' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='i_blocks' type-id='type-id-442' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='i_state' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='670' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='i_rwsem' type-id='type-id-119' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='dirtied_when' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='dirtied_time_when' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='i_hash' type-id='type-id-65' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='i_io_list' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='i_wb' type-id='type-id-443' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='i_wb_frn_winner' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='i_wb_frn_avg_time' type-id='type-id-444' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2096'>
        <var-decl name='i_wb_frn_history' type-id='type-id-444' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='i_lru' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='i_sb_list' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='i_wb_list' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='688' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='' type-id='type-id-445' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='i_version' type-id='type-id-148' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='i_count' type-id='type-id-117' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='694' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='i_dio_count' type-id='type-id-117' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='695' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='i_writecount' type-id='type-id-117' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='696' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='i_readcount' type-id='type-id-117' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='698' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='' type-id='type-id-446' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='i_flctx' type-id='type-id-447' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='i_data' type-id='type-id-114' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='i_devices' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='' type-id='type-id-448' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='707' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='i_generation' type-id='type-id-2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4448'>
        <var-decl name='i_fsnotify_mask' type-id='type-id-2' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='i_fsnotify_marks' type-id='type-id-449' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='i_crypt_info' type-id='type-id-450' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='723' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='i_private' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='726' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='inode_operations' is-struct='yes' visibility='default' size-in-bits='1536' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1842' column='1' hash='d8687c7fcff14495' id='type-id-451'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lookup' type-id='type-id-452' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get_link' type-id='type-id-453' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1844' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='permission' type-id='type-id-454' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1845' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='permission2' type-id='type-id-455' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_acl' type-id='type-id-456' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1847' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='readlink' type-id='type-id-457' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1849' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='create' type-id='type-id-458' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1851' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='link' type-id='type-id-459' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1852' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unlink' type-id='type-id-460' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1853' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='symlink' type-id='type-id-461' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1854' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mkdir' type-id='type-id-462' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1855' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='rmdir' type-id='type-id-460' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1856' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='mknod' type-id='type-id-463' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1857' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='rename' type-id='type-id-464' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='setattr' type-id='type-id-465' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1860' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='setattr2' type-id='type-id-466' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1861' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='getattr' type-id='type-id-467' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1862' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='listxattr' type-id='type-id-468' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1863' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='fiemap' type-id='type-id-469' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1864' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='update_time' type-id='type-id-470' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1866' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='atomic_open' type-id='type-id-471' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tmpfile' type-id='type-id-462' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='set_acl' type-id='type-id-472' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='1871' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='io_context' is-struct='yes' visibility='default' size-in-bits='832' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='98' column='1' hash='2a1a8fddc63cc21f' id='type-id-473'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='type-id-17' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='active_ref' type-id='type-id-117' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nr_tasks' type-id='type-id-117' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lock' type-id='type-id-123' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='ioprio' type-id='type-id-180' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nr_batch_requests' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='last_waited' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='icq_tree' type-id='type-id-115' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='icq_hint' type-id='type-id-474' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='icq_list' type-id='type-id-63' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='release_work' type-id='type-id-227' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='118' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='io_cq' is-struct='yes' visibility='default' size-in-bits='448' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='72' column='1' hash='0005880a8dca38cb' id='type-id-475'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='q' type-id='type-id-174' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ioc' type-id='type-id-476' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-477' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-478' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='flags' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/iocontext.h' line='91' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='k_sigaction' is-struct='yes' visibility='default' size-in-bits='256' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/signal_types.h' line='49' column='1' hash='b95f5f54622fe118' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa' type-id='type-id-479' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/signal_types.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernel_cap_struct' is-struct='yes' visibility='default' size-in-bits='64' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/capability.h' line='24' column='1' hash='74ed376e62777829' id='type-id-480'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cap' type-id='type-id-3' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/capability.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernel_param' is-struct='yes' visibility='default' size-in-bits='320' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='69' column='1' hash='fa80e0c13b4b126e' id='type-id-481'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mod' type-id='type-id-196' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ops' type-id='type-id-482' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='perm' type-id='type-id-483' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='level' type-id='type-id-484' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='flags' type-id='type-id-171' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-485' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernel_param_ops' is-struct='yes' visibility='default' size-in-bits='256' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='47' column='1' hash='d1fc1458fde4e251' id='type-id-486'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='set' type-id='type-id-487' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get' type-id='type-id-488' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='free' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernel_siginfo' is-struct='yes' visibility='default' size-in-bits='384' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/signal_types.h' line='12' column='1' hash='93f82f7f0907e131' id='type-id-489'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-490' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/signal_types.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernel_symbol' is-struct='yes' visibility='default' size-in-bits='64' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/export.h' line='61' column='1' hash='62835693b9de85a8' id='type-id-491'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value_offset' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/export.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name_offset' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/export.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernfs_elem_attr' is-struct='yes' visibility='default' size-in-bits='256' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='100' column='1' hash='cecd124cfa1bcd96' id='type-id-492'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ops' type-id='type-id-493' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='open' type-id='type-id-494' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-308' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='notify_next' type-id='type-id-495' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='104' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernfs_elem_dir' is-struct='yes' visibility='default' size-in-bits='192' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='84' column='1' hash='795456de3fb92fb9' id='type-id-496'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='subdirs' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='children' type-id='type-id-497' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='root' type-id='type-id-498' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernfs_elem_symlink' is-struct='yes' visibility='default' size-in-bits='64' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='96' column='1' hash='890a8227b41a8e22' id='type-id-499'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='target_kn' type-id='type-id-495' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernfs_node' is-struct='yes' visibility='default' size-in-bits='1024' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='131' column='1' hash='18d6c9a1382746c7' id='type-id-500'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-117' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='active' type-id='type-id-117' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='parent' type-id='type-id-495' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rb' type-id='type-id-100' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ns' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hash' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='' type-id='type-id-501' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='priv' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='id' type-id='type-id-502' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='flags' type-id='type-id-180' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='912'>
        <var-decl name='mode' type-id='type-id-154' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='iattr' type-id='type-id-503' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='161' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernfs_open_file' is-struct='yes' visibility='default' size-in-bits='1216' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='199' column='1' hash='5d0a72b3a62bdc27' id='type-id-504'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kn' type-id='type-id-495' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='file' type-id='type-id-346' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='seq_file' type-id='type-id-505' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mutex' type-id='type-id-167' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='prealloc_mutex' type-id='type-id-167' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='event' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='list' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='prealloc_buf' type-id='type-id-24' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='atomic_write_len' type-id='type-id-161' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mmapped' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1089'>
        <var-decl name='released' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='vm_ops' type-id='type-id-506' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernfs_ops' is-struct='yes' visibility='default' size-in-bits='768' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='219' column='1' hash='533c05b87fb87b6b' id='type-id-507'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='open' type-id='type-id-508' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='release' type-id='type-id-509' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='seq_show' type-id='type-id-510' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='seq_start' type-id='type-id-511' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='seq_next' type-id='type-id-512' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='seq_stop' type-id='type-id-513' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='read' type-id='type-id-514' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='atomic_write_len' type-id='type-id-161' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='prealloc' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='write' type-id='type-id-514' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='poll' type-id='type-id-515' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='mmap' type-id='type-id-516' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='268' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernfs_root' is-struct='yes' visibility='default' size-in-bits='768' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='183' column='1' hash='0c381fb74a3eea86' id='type-id-517'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kn' type-id='type-id-495' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ino_idr' type-id='type-id-437' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next_generation' type-id='type-id-178' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='syscall_ops' type-id='type-id-518' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='supers' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='deactivate_waitq' type-id='type-id-204' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='196' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kernfs_syscall_ops' is-struct='yes' visibility='default' size-in-bits='320' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='171' column='1' hash='fd125cedf4d7330a' id='type-id-519'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='show_options' type-id='type-id-520' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mkdir' type-id='type-id-521' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rmdir' type-id='type-id-522' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rename' type-id='type-id-523' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='show_path' type-id='type-id-524' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kernfs.h' line='179' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='key' is-struct='yes' visibility='default' size-in-bits='1728' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='172' column='1' hash='d95e3444f63cf3e6' id='type-id-525'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='usage' type-id='type-id-526' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='serial' type-id='type-id-527' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-528' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sem' type-id='type-id-119' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='user' type-id='type-id-529' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='security' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='' type-id='type-id-530' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='last_used_at' type-id='type-id-531' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='uid' type-id='type-id-214' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='gid' type-id='type-id-76' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='perm' type-id='type-id-532' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='quotalen' type-id='type-id-180' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='944'>
        <var-decl name='datalen' type-id='type-id-180' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='state' type-id='type-id-104' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='flags' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='' type-id='type-id-533' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='' type-id='type-id-534' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='restrict_link' type-id='type-id-535' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='254' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='key_restriction' is-struct='yes' visibility='default' size-in-bits='192' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='153' column='1' hash='955a47d6218f1db0' id='type-id-536'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='check' type-id='type-id-537' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='type-id-217' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='keytype' type-id='type-id-538' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='key_tag' is-struct='yes' visibility='default' size-in-bits='192' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='85' column='1' hash='daefaf7102b71786' id='type-id-539'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rcu' type-id='type-id-192' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='usage' type-id='type-id-526' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='removed' type-id='type-id-168' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='keyring_index_key' is-struct='yes' visibility='default' size-in-bits='320' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='91' column='1' hash='115bbee048a2e9df' id='type-id-540'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hash' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-541' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-538' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='domain_tag' type-id='type-id-542' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='description' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/key.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kgid_t' is-struct='yes' naming-typedef-id='type-id-76' visibility='default' size-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/uidgid.h' line='26' column='1' hash='73ea77308badbc93' id='type-id-543'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='type-id-544' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/uidgid.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kiocb' is-struct='yes' visibility='default' size-in-bits='384' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='316' column='1' hash='2dc2b42198c517a8' id='type-id-545'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ki_filp' type-id='type-id-346' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ki_pos' type-id='type-id-308' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ki_complete' type-id='type-id-546' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='private' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ki_flags' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ki_hint' type-id='type-id-444' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='ki_ioprio' type-id='type-id-444' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ki_cookie' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/fs.h' line='328' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kobj_ns_type_operations' is-struct='yes' visibility='default' size-in-bits='384' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject_ns.h' line='39' column='1' hash='f25cde1d00478ec9' id='type-id-547'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-49' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject_ns.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='current_may_mount' type-id='type-id-548' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject_ns.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grab_current_ns' type-id='type-id-397' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject_ns.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='netlink_ns' type-id='type-id-549' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject_ns.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='initial_ns' type-id='type-id-397' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject_ns.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='drop_ns' type-id='type-id-225' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject_ns.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kobj_type' is-struct='yes' visibility='default' size-in-bits='448' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='139' column='1' hash='f83b3a6e1616e836' id='type-id-550'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='release' type-id='type-id-551' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sysfs_ops' type-id='type-id-552' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='default_attrs' type-id='type-id-158' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='default_groups' type-id='type-id-183' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='child_ns_type' type-id='type-id-553' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='namespace' type-id='type-id-554' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_ownership' type-id='type-id-555' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kobj_uevent_env' is-struct='yes' visibility='default' size-in-bits='18688' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='149' column='1' hash='545c0ac99acdf42a' id='type-id-556'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='argv' type-id='type-id-26' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='envp' type-id='type-id-25' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='envp_idx' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='buf' type-id='type-id-30' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18656'>
        <var-decl name='buflen' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='154' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kobject' is-struct='yes' visibility='default' size-in-bits='512' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='65' column='1' hash='d24f860024ead59d' id='type-id-276'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entry' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='parent' type-id='type-id-197' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='kset' type-id='type-id-557' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ktype' type-id='type-id-558' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='sd' type-id='type-id-495' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='kref' type-id='type-id-559' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='state_initialized' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='481'>
        <var-decl name='state_in_sysfs' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='482'>
        <var-decl name='state_add_uevent_sent' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='483'>
        <var-decl name='state_remove_uevent_sent' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='484'>
        <var-decl name='uevent_suppress' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kparam_array' is-struct='yes' visibility='default' size-in-bits='256' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='92' column='1' hash='3014f0d1b3dc0a0d' id='type-id-560'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='elemsize' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num' type-id='type-id-561' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ops' type-id='type-id-482' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='elem' type-id='type-id-124' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kparam_string' is-struct='yes' visibility='default' size-in-bits='128' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='86' column='1' hash='a2dd5242f874282a' id='type-id-562'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='maxlen' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='string' type-id='type-id-24' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/moduleparam.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kprojid_t' is-struct='yes' naming-typedef-id='type-id-563' visibility='default' size-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/projid.h' line='22' column='1' hash='3c2802146347f111' id='type-id-564'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='type-id-565' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/projid.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kqid' is-struct='yes' visibility='default' size-in-bits='64' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='68' column='1' hash='e6de0c44c1d4effb' id='type-id-326'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-566' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='type' type-id='type-id-57' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/quota.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kref' is-struct='yes' visibility='default' size-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kref.h' line='19' column='1' hash='70c3779a571459e8' id='type-id-559'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='type-id-526' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kref.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kset' is-struct='yes' visibility='default' size-in-bits='768' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='193' column='1' hash='64a447f36c0d1270' id='type-id-567'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list' type-id='type-id-79' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='list_lock' type-id='type-id-123' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='kobj' type-id='type-id-276' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='uevent_ops' type-id='type-id-568' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='197' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kset_uevent_ops' is-struct='yes' visibility='default' size-in-bits='192' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='157' column='1' hash='53f683884262aa3a' id='type-id-569'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='filter' type-id='type-id-570' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-571' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uevent' type-id='type-id-572' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/kobject.h' line='160' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kstat' is-struct='yes' visibility='default' size-in-bits='1088' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='24' column='1' hash='3c6c6fca6b1a2919' id='type-id-573'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='result_mask' type-id='type-id-178' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mode' type-id='type-id-154' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nlink' type-id='type-id-170' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='blksize' type-id='type-id-574' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='attributes' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='attributes_mask' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ino' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev' type-id='type-id-165' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='rdev' type-id='type-id-165' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='uid' type-id='type-id-214' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='gid' type-id='type-id-76' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='size' type-id='type-id-308' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='atime' type-id='type-id-436' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mtime' type-id='type-id-436' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ctime' type-id='type-id-436' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='btime' type-id='type-id-436' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='blocks' type-id='type-id-210' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/stat.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='kuid_t' is-struct='yes' naming-typedef-id='type-id-214' visibility='default' size-in-bits='32' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/uidgid.h' line='21' column='1' hash='c43fc010ddf6e608' id='type-id-575'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='type-id-576' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/uidgid.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='latch_tree_node' is-struct='yes' visibility='default' size-in-bits='384' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rbtree_latch.h' line='40' column='1' hash='e038efb23c99a00a' id='type-id-577'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='node' type-id='type-id-101' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/rbtree_latch.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='led_classdev' is-struct='yes' visibility='default' size-in-bits='2752' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/leds.h' line='33' column='1' hash='f476fdc897734766' id='type-id-578'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-153' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/leds.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='brightness' type-id='type-id-50' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/leds.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='max_brightness' type-id='type-id-50' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/leds.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-71' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/leds.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='work_flags' type-id='type-id-120' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/leds.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='brightness_set' type-id='type-id-579' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/leds.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='brightness_set_blocking' type-id='type-id-580' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/leds.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='brightness_get' type-id='type-id-581' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/leds.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='blink_set' type-id='type-id-582' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/leds.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pattern_set' type-id='type-id-583' visibility='default' filepath='/ws/android/kernel/aosp/common-mainline/common/include/linux/leds.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
