<abi-corpus version='2.4' soname='libgdbm.so.6'>
  <elf-needed>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_gdbm_alloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_gdbm_base64_decode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_gdbm_base64_encode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_gdbm_bucket_dir' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_gdbm_cache_entry_invalidate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_gdbm_dump_ascii' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_gdbm_end_update' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_gdbm_fatal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_gdbm_file_extend' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='gdbm_import_from_file' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_last_errno' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_last_syserr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_load' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_load_bdb_dump' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_load_from_file' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_needs_recovery' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_nextkey' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_open' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_recover' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_reorganize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_set_errno' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_setopt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_store' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_sync' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_version_cmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='get_len' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='read_record' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='gdbm_errlist' size='320' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_syserr' size='160' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_version' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gdbm_version_number' size='12' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='base64.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <qualified-type-def type-id='type-id-1' const='yes' hash='645f4d0d44563fc6' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' hash='61acb54cba0b002f' id='type-id-3'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' hash='af4ac49f7abe50c2' id='type-id-5'/>
    <function-decl name='_gdbm_base64_encode' mangled-name='_gdbm_base64_encode' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/base64.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_base64_encode' hash='2ca24461521ab21b'>
      <parameter type-id='type-id-3' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/base64.c' line='35' column='1'/>
      <parameter type-id='type-id-6' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/base64.c' line='35' column='1'/>
      <parameter type-id='type-id-5' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/base64.c' line='36' column='1'/>
      <parameter type-id='type-id-7' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/base64.c' line='36' column='1'/>
      <parameter type-id='type-id-7' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/base64.c' line='37' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_base64_decode' mangled-name='_gdbm_base64_decode' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/base64.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_base64_decode' hash='bff078d8f481b142'>
      <parameter type-id='type-id-3' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/base64.c' line='79' column='1'/>
      <parameter type-id='type-id-6' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/base64.c' line='79' column='1'/>
      <parameter type-id='type-id-5' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/base64.c' line='80' column='1'/>
      <parameter type-id='type-id-7' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/base64.c' line='80' column='1'/>
      <parameter type-id='type-id-7' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/base64.c' line='81' column='1'/>
      <parameter type-id='type-id-7' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/base64.c' line='81' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='bucket.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='_gdbm_new_bucket' mangled-name='_gdbm_new_bucket' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_new_bucket' hash='f81f70cccfec3887'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='29' column='1'/>
      <parameter type-id='type-id-10' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='29' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='29' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gdbm_dir_entry_valid_p' mangled-name='gdbm_dir_entry_valid_p' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_dir_entry_valid_p' hash='65d6498fcd4d4cda'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='53' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='53' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_get_bucket' mangled-name='_gdbm_get_bucket' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_get_bucket' hash='65d6498fcd4d4cda'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='53' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='53' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_read_bucket_at' mangled-name='_gdbm_read_bucket_at' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_read_bucket_at' hash='675791bb5faedb8c'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='170' column='1'/>
      <parameter type-id='type-id-12' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='170' column='1'/>
      <parameter type-id='type-id-10' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='170' column='1'/>
      <parameter type-id='type-id-6' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='171' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_split_bucket' mangled-name='_gdbm_split_bucket' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_split_bucket' hash='65d6498fcd4d4cda'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='53' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='53' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_write_bucket' mangled-name='_gdbm_write_bucket' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_write_bucket' hash='91edc49029708098'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='436' column='1'/>
      <parameter type-id='type-id-13' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='436' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='falloc.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='_gdbm_alloc' mangled-name='_gdbm_alloc' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/falloc.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_alloc' hash='18a4ccc2d184c19d'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/falloc.c' line='52' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/falloc.c' line='52' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='_gdbm_free' mangled-name='_gdbm_free' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/falloc.c' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_free' hash='39096baac38b83e1'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/falloc.c' line='100' column='1'/>
      <parameter type-id='type-id-12' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/falloc.c' line='100' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/falloc.c' line='100' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_put_av_elem' mangled-name='_gdbm_put_av_elem' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/falloc.c' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_put_av_elem' hash='ed1ff244ff561754'>
      <parameter type-id='type-id-14' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/falloc.c' line='423' column='1'/>
      <parameter type-id='type-id-15' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/falloc.c' line='423' column='1'/>
      <parameter type-id='type-id-16' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/falloc.c' line='423' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/falloc.c' line='424' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='findkey.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' hash='a93039fe023ed77b' id='type-id-18'/>
    <function-decl name='gdbm_bucket_element_valid_p' mangled-name='gdbm_bucket_element_valid_p' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/findkey.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_bucket_element_valid_p' hash='65d6498fcd4d4cda'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='53' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='53' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_read_entry' mangled-name='_gdbm_read_entry' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/findkey.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_read_entry' hash='0f405658962239cd'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/findkey.c' line='44' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/findkey.c' line='44' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='_gdbm_findkey' mangled-name='_gdbm_findkey' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/findkey.c' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_findkey' hash='fc57a282b5025c40'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/findkey.c' line='140' column='1'/>
      <parameter type-id='type-id-19' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/findkey.c' line='140' column='1'/>
      <parameter type-id='type-id-18' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/findkey.c' line='140' column='1'/>
      <parameter type-id='type-id-16' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/findkey.c' line='140' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fullio.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='_gdbm_full_read' mangled-name='_gdbm_full_read' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/fullio.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_full_read' hash='e803fd805d96645b'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/fullio.c' line='25' column='1'/>
      <parameter type-id='type-id-20' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/fullio.c' line='25' column='1'/>
      <parameter type-id='type-id-6' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/fullio.c' line='25' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_full_write' mangled-name='_gdbm_full_write' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/fullio.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_full_write' hash='e803fd805d96645b'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/fullio.c' line='25' column='1'/>
      <parameter type-id='type-id-20' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/fullio.c' line='25' column='1'/>
      <parameter type-id='type-id-6' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/fullio.c' line='25' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_file_extend' mangled-name='_gdbm_file_extend' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/fullio.c' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_file_extend' hash='ec8459a17deed6f1'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/fullio.c' line='82' column='1'/>
      <parameter type-id='type-id-12' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/fullio.c' line='82' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmclose.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' hash='4ee7381753f6ca11' id='type-id-21'/>
    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='128' hash='3967109fa5e12514' id='type-id-22'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-23'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='768' hash='4751b6a227d2da31' id='type-id-24'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='type-id-25'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-26' size-in-bits='192' hash='0ec4629d3b7ad585' id='type-id-27'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-23'/>
    </array-type-def>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-28'/>
    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='32' hash='932523ac2c3bfb84' id='type-id-29'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-30'/>
    </array-type-def>
    <enum-decl name='__anonymous_enum__' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' filepath='./gdbmdefs.h' line='211' column='1' hash='0189db4fe7fa90db' id='type-id-31'>
      <underlying-type type-id='type-id-32'/>
      <enumerator name='LOCKING_NONE' value='0'/>
      <enumerator name='LOCKING_FLOCK' value='1'/>
      <enumerator name='LOCKING_LOCKF' value='2'/>
      <enumerator name='LOCKING_FCNTL' value='3'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-8'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-33'/>
    <class-decl name='avail_block' is-struct='yes' naming-typedef-id='type-id-34' visibility='default' size-in-bits='256' filepath='./gdbmdefs.h' line='62' column='1' hash='16570d9f8232f3af' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='count' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next_block' type-id='type-id-12' visibility='default' filepath='./gdbmdefs.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='av_table' type-id='type-id-22' visibility='default' filepath='./gdbmdefs.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='avail_elem' is-struct='yes' naming-typedef-id='type-id-14' visibility='default' size-in-bits='128' filepath='./gdbmdefs.h' line='54' column='1' hash='b6e55d728fc8276b' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='av_size' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='av_adr' type-id='type-id-12' visibility='default' filepath='./gdbmdefs.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bucket_element' is-struct='yes' naming-typedef-id='type-id-26' visibility='default' size-in-bits='192' filepath='./gdbmdefs.h' line='106' column='1' hash='cbb068d3ef9b3fe3' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hash_value' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='key_start' type-id='type-id-29' visibility='default' filepath='./gdbmdefs.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data_pointer' type-id='type-id-12' visibility='default' filepath='./gdbmdefs.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='key_size' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='data_size' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='113' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cache_elem' is-struct='yes' naming-typedef-id='type-id-38' visibility='default' size-in-bits='512' filepath='./gdbmdefs.h' line='160' column='1' hash='d4ab5630df7188cf' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ca_bucket' type-id='type-id-10' visibility='default' filepath='./gdbmdefs.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ca_adr' type-id='type-id-12' visibility='default' filepath='./gdbmdefs.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ca_changed' type-id='type-id-28' visibility='default' filepath='./gdbmdefs.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ca_data' type-id='type-id-40' visibility='default' filepath='./gdbmdefs.h' line='165' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='data_cache_elem' is-struct='yes' naming-typedef-id='type-id-40' visibility='default' size-in-bits='320' filepath='./gdbmdefs.h' line='150' column='1' hash='ffdad291806440b4' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hash_val' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='data_size' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key_size' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dptr' type-id='type-id-17' visibility='default' filepath='./gdbmdefs.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dsize' type-id='type-id-6' visibility='default' filepath='./gdbmdefs.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='elem_loc' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='157' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='gdbm_file_header' is-struct='yes' naming-typedef-id='type-id-42' visibility='default' size-in-bits='576' filepath='./gdbmdefs.h' line='84' column='1' hash='fda902a1d4860ae2' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='header_magic' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='block_size' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dir' type-id='type-id-12' visibility='default' filepath='./gdbmdefs.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dir_size' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dir_bits' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bucket_size' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='bucket_elems' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='next_block' type-id='type-id-12' visibility='default' filepath='./gdbmdefs.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='avail' type-id='type-id-34' visibility='default' filepath='./gdbmdefs.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='gdbm_file_info' is-struct='yes' visibility='default' size-in-bits='1344' filepath='./gdbmdefs.h' line='172' column='1' hash='5aaa659b4f40a06e' id='type-id-44'>
      <member-type access='public'>
        <enum-decl name='__anonymous_enum__' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' filepath='./gdbmdefs.h' line='211' column='1' hash='831c81f8fb8a67c3#2' id='type-id-45'>
          <underlying-type type-id='type-id-32'/>
          <enumerator name='LOCKING_NONE' value='0'/>
          <enumerator name='LOCKING_FLOCK' value='1'/>
          <enumerator name='LOCKING_LOCKF' value='2'/>
          <enumerator name='LOCKING_FCNTL' value='3'/>
        </enum-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-17' visibility='default' filepath='./gdbmdefs.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='read_write' type-id='type-id-46' visibility='default' filepath='./gdbmdefs.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66'>
        <var-decl name='fast_write' type-id='type-id-46' visibility='default' filepath='./gdbmdefs.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67'>
        <var-decl name='central_free' type-id='type-id-46' visibility='default' filepath='./gdbmdefs.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='68'>
        <var-decl name='coalesce_blocks' type-id='type-id-46' visibility='default' filepath='./gdbmdefs.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='69'>
        <var-decl name='file_locking' type-id='type-id-46' visibility='default' filepath='./gdbmdefs.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='70'>
        <var-decl name='memory_mapping' type-id='type-id-46' visibility='default' filepath='./gdbmdefs.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='71'>
        <var-decl name='cloexec' type-id='type-id-46' visibility='default' filepath='./gdbmdefs.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='need_recovery' type-id='type-id-46' visibility='default' filepath='./gdbmdefs.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='last_error' type-id='type-id-47' visibility='default' filepath='./gdbmdefs.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='last_syserror' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='last_errstr' type-id='type-id-17' visibility='default' filepath='./gdbmdefs.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lock_type' type-id='type-id-31' visibility='default' filepath='./gdbmdefs.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fatal_err' type-id='type-id-48' visibility='default' filepath='./gdbmdefs.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='desc' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='header' type-id='type-id-49' visibility='default' filepath='./gdbmdefs.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dir' type-id='type-id-50' visibility='default' filepath='./gdbmdefs.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bucket_cache' type-id='type-id-13' visibility='default' filepath='./gdbmdefs.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='cache_size' type-id='type-id-6' visibility='default' filepath='./gdbmdefs.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='last_read' type-id='type-id-6' visibility='default' filepath='./gdbmdefs.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bucket' type-id='type-id-10' visibility='default' filepath='./gdbmdefs.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='bucket_dir' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='cache_entry' type-id='type-id-13' visibility='default' filepath='./gdbmdefs.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='header_changed' type-id='type-id-46' visibility='default' filepath='./gdbmdefs.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='961'>
        <var-decl name='directory_changed' type-id='type-id-46' visibility='default' filepath='./gdbmdefs.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='962'>
        <var-decl name='bucket_changed' type-id='type-id-46' visibility='default' filepath='./gdbmdefs.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='963'>
        <var-decl name='second_changed' type-id='type-id-46' visibility='default' filepath='./gdbmdefs.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='mapped_size_max' type-id='type-id-6' visibility='default' filepath='./gdbmdefs.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mapped_region' type-id='type-id-20' visibility='default' filepath='./gdbmdefs.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='mapped_size' type-id='type-id-6' visibility='default' filepath='./gdbmdefs.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='mapped_pos' type-id='type-id-12' visibility='default' filepath='./gdbmdefs.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='mapped_off' type-id='type-id-12' visibility='default' filepath='./gdbmdefs.h' line='253' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hash_bucket' is-struct='yes' naming-typedef-id='type-id-51' visibility='default' size-in-bits='1088' filepath='./gdbmdefs.h' line='130' column='1' hash='bf93e6ccc902041a' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='av_count' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bucket_avail' type-id='type-id-24' visibility='default' filepath='./gdbmdefs.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='bucket_bits' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='count' type-id='type-id-8' visibility='default' filepath='./gdbmdefs.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='h_table' type-id='type-id-27' visibility='default' filepath='./gdbmdefs.h' line='136' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GDBM_FILE' type-id='type-id-53' size-in-bits='64' filepath='./gdbm.h' line='99' column='1' hash='4fe8b2cfce9a3665' id='type-id-9'/>
    <typedef-decl name='__off_t' type-id='type-id-33' size-in-bits='64' filepath='/usr/include/bits/types.h' line='152' column='1' hash='b119fe0931d2ee10' id='type-id-54'/>
    <typedef-decl name='avail_block' type-id='type-id-35' size-in-bits='256' filepath='./gdbmdefs.h' line='68' column='1' id='type-id-34'/>
    <typedef-decl name='avail_elem' type-id='type-id-36' size-in-bits='128' filepath='./gdbmdefs.h' line='58' column='1' id='type-id-14'/>
    <typedef-decl name='bucket_element' type-id='type-id-37' size-in-bits='192' filepath='./gdbmdefs.h' line='114' column='1' id='type-id-26'/>
    <typedef-decl name='cache_elem' type-id='type-id-39' size-in-bits='512' filepath='./gdbmdefs.h' line='166' column='1' id='type-id-38'/>
    <typedef-decl name='data_cache_elem' type-id='type-id-41' size-in-bits='320' filepath='./gdbmdefs.h' line='158' column='1' id='type-id-40'/>
    <typedef-decl name='gdbm_error' type-id='type-id-8' size-in-bits='32' filepath='./gdbm.h' line='238' column='1' hash='09d17c08f594edc7' id='type-id-47'/>
    <typedef-decl name='gdbm_file_header' type-id='type-id-43' size-in-bits='576' filepath='./gdbmdefs.h' line='97' column='1' id='type-id-42'/>
    <typedef-decl name='hash_bucket' type-id='type-id-52' size-in-bits='1088' filepath='./gdbmdefs.h' line='137' column='1' id='type-id-51'/>
    <typedef-decl name='off_t' type-id='type-id-54' size-in-bits='64' filepath='/usr/include/sys/types.h' line='85' column='1' hash='b119fe0931d2ee10' id='type-id-12'/>
    <typedef-decl name='size_t' type-id='type-id-55' size-in-bits='64' filepath='/usr/lib64/clang/8.0.0/include/stddef.h' line='62' column='1' hash='8fdc5eea2983a729' id='type-id-6'/>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='type-id-32'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-46'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-55'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' hash='6eb78ba14b9f8664' id='type-id-13'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-17'/>
    <qualified-type-def type-id='type-id-28' const='yes' hash='3e50fd33f9bb78d9' id='type-id-56'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' hash='c44743f354f6a443' id='type-id-57'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' hash='9d65b938f1f09ec4' id='type-id-49'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' hash='4fe8b2cfce9a3665' id='type-id-53'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' hash='43a958ec78ee48db' id='type-id-10'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' hash='a1a7df579bd2d909' id='type-id-50'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-48'/>
    <function-decl name='gdbm_close' mangled-name='gdbm_close' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmclose.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_close' hash='0b8154fa7c382b73'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmclose.c' line='30' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <type-decl name='void' id='type-id-11'/>
    <pointer-type-def type-id='type-id-11' id='type-id-20'/>
    <function-type size-in-bits='64' hash='53885bde0aa65efe' id='type-id-58'>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-11'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmcount.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <typedef-decl name='gdbm_count_t' type-id='type-id-59' size-in-bits='64' filepath='./gdbm.h' line='88' column='1' hash='ebdfc4685a1e82df' id='type-id-60'/>
    <type-decl name='unsigned long long int' size-in-bits='64' hash='ebdfc4685a1e82df#3' id='type-id-59'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' hash='ece3c62107ba90dc' id='type-id-61'/>
    <function-decl name='gdbm_count' mangled-name='gdbm_count' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmcount.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_count' hash='8db5086e3cd20ae9'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmcount.c' line='25' column='1'/>
      <parameter type-id='type-id-61' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmcount.c' line='25' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmdelete.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <class-decl name='datum' is-struct='yes' naming-typedef-id='type-id-19' visibility='default' size-in-bits='128' filepath='./gdbm.h' line='91' column='1' hash='4e070a0e2ffebad1' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dptr' type-id='type-id-17' visibility='default' filepath='./gdbm.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dsize' type-id='type-id-8' visibility='default' filepath='./gdbm.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='datum' type-id='type-id-62' size-in-bits='128' filepath='./gdbm.h' line='95' column='1' id='type-id-19'/>
    <function-decl name='gdbm_delete' mangled-name='gdbm_delete' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdelete.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_delete' hash='0b8154fa7c382b73'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdelete.c' line='30' column='1'/>
      <parameter type-id='type-id-19' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdelete.c' line='30' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmdump.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='type-id-63'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-23'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-28' size-in-bits='160' hash='99641d293d1da856' id='type-id-64'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='type-id-65'/>
    </array-type-def>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='type-id-66'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' hash='54bf40f701b4847a' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-17' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-54' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-70' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-66' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-63' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-71' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-72' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-73' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-74' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-67' size-in-bits='1728' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-75'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-11' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-76'/>
    <typedef-decl name='__off64_t' type-id='type-id-33' size-in-bits='64' filepath='/usr/include/bits/types.h' line='153' column='1' hash='b119fe0931d2ee10' id='type-id-72'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#4' id='type-id-70'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' hash='4cdc26b379a5c62d' id='type-id-77'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' hash='071f36dcbe00ad00' id='type-id-69'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-71'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-74'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-78'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-79'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-80'/>
    <function-decl name='_gdbm_dump_ascii' mangled-name='_gdbm_dump_ascii' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_dump_ascii' hash='6cf6c2acdbaa116a'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='54' column='1'/>
      <parameter type-id='type-id-77' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='54' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gdbm_dump_to_file' mangled-name='gdbm_dump_to_file' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_dump_to_file' hash='00998cfda48dd448'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='136' column='1'/>
      <parameter type-id='type-id-77' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='136' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='136' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gdbm_dump' mangled-name='gdbm_dump' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_dump' hash='a764cad5eccd9544'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='168' column='1'/>
      <parameter type-id='type-id-57' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='168' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='168' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='168' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='169' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmerrno.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-81' size-in-bits='2560' hash='333bbcc2c0256890' id='type-id-82'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='type-id-83'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-84' size-in-bits='1280' hash='11b843c665bbab19' id='type-id-85'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='type-id-83'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-57' const='yes' hash='ec42cf78a9d93a8c' id='type-id-81'/>
    <qualified-type-def type-id='type-id-8' const='yes' hash='8cef8df4b6728924' id='type-id-84'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' hash='3fd83b2c14ae2f2f' id='type-id-16'/>
    <function-decl name='gdbm_errno_location' mangled-name='gdbm_errno_location' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_errno_location' hash='c0e4f5f42afc96e0'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='gdbm_set_errno' mangled-name='gdbm_set_errno' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_set_errno' hash='20e4cb3b1174f0da'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='38' column='1'/>
      <parameter type-id='type-id-47' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='38' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='38' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gdbm_last_errno' mangled-name='gdbm_last_errno' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_last_errno' hash='0b8154fa7c382b73'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='57' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='gdbm_last_syserr' mangled-name='gdbm_last_syserr' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_last_syserr' hash='0b8154fa7c382b73'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmclose.c' line='30' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gdbm_needs_recovery' mangled-name='gdbm_needs_recovery' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_needs_recovery' hash='0b8154fa7c382b73'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmclose.c' line='30' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gdbm_clear_error' mangled-name='gdbm_clear_error' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_clear_error' hash='84a40ede0f784348'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='88' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <var-decl name='gdbm_errlist' type-id='type-id-82' mangled-name='gdbm_errlist' visibility='default' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='102' column='1' elf-symbol-id='gdbm_errlist'/>
    <function-decl name='gdbm_strerror' mangled-name='gdbm_strerror' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_strerror' hash='7cffa03161e7e042'>
      <parameter type-id='type-id-47' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='146' column='1'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gdbm_db_strerror' mangled-name='gdbm_db_strerror' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_db_strerror' hash='d1f6c4094bd4bda3'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='154' column='1'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <var-decl name='gdbm_syserr' type-id='type-id-85' mangled-name='gdbm_syserr' visibility='default' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='178' column='1' elf-symbol-id='gdbm_syserr'/>
    <function-decl name='gdbm_check_syserr' mangled-name='gdbm_check_syserr' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_check_syserr' hash='d628501fd2223339'>
      <parameter type-id='type-id-47' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='193' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmexists.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='gdbm_exists' mangled-name='gdbm_exists' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmexists.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_exists' hash='0b8154fa7c382b73'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdelete.c' line='30' column='1'/>
      <parameter type-id='type-id-19' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdelete.c' line='30' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmexp.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='gdbm_export_to_file' mangled-name='gdbm_export_to_file' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmexp.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_export_to_file' hash='6cf6c2acdbaa116a'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='54' column='1'/>
      <parameter type-id='type-id-77' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='54' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gdbm_export' mangled-name='gdbm_export' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmexp.c' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_export' hash='aecd7dda36ef64fa'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmexp.c' line='103' column='1'/>
      <parameter type-id='type-id-57' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmexp.c' line='103' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmexp.c' line='103' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmexp.c' line='103' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmfdesc.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='gdbm_fdesc' mangled-name='gdbm_fdesc' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmfdesc.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_fdesc' hash='0b8154fa7c382b73'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmclose.c' line='30' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmfetch.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='gdbm_fetch' mangled-name='gdbm_fetch' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmfetch.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_fetch' hash='84a40ede0f784348'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmfetch.c' line='30' column='1'/>
      <parameter type-id='type-id-19' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmfetch.c' line='30' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmimp.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='gdbm_import_from_file' mangled-name='gdbm_import_from_file' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmimp.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_import_from_file' hash='00998cfda48dd448'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='136' column='1'/>
      <parameter type-id='type-id-77' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='136' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmdump.c' line='136' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gdbm_import' mangled-name='gdbm_import' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmimp.c' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_import' hash='e1dace99dde43797'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmimp.c' line='172' column='1'/>
      <parameter type-id='type-id-57' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmimp.c' line='172' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmimp.c' line='172' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmload.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-86' size-in-bits='256' hash='1151c93389494d37' id='type-id-87'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-88'/>
    </array-type-def>
    <class-decl name='datbuf' is-struct='yes' visibility='default' size-in-bits='128' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='24' column='1' hash='a640506b05c458f3' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-4' visibility='default' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-6' visibility='default' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='27' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dump_file' is-struct='yes' visibility='default' size-in-bits='896' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='30' column='1' hash='750ef8c476913427' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fp' type-id='type-id-77' visibility='default' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='type-id-6' visibility='default' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='linebuf' type-id='type-id-17' visibility='default' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='lbsize' type-id='type-id-6' visibility='default' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lblevel' type-id='type-id-6' visibility='default' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='buffer' type-id='type-id-17' visibility='default' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bufsize' type-id='type-id-6' visibility='default' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='buflevel' type-id='type-id-6' visibility='default' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parmc' type-id='type-id-6' visibility='default' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='data' type-id='type-id-87' visibility='default' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='header' type-id='type-id-17' visibility='default' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='46' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='type-id-1'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' hash='c08c1413fbd3bf27' id='type-id-90'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' hash='5f2412f6e959b8e5' id='type-id-91'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' hash='1d8dc9c588f17208' id='type-id-92'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' hash='54c1e9f81ec7a1db' id='type-id-7'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' hash='f0221758ecf0c0cb' id='type-id-4'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' hash='d9e2f19705735211' id='type-id-93'/>
    <function-decl name='get_len' mangled-name='get_len' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_len' hash='71a86865f38f69c6'>
      <parameter type-id='type-id-57' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='230' column='1'/>
      <parameter type-id='type-id-7' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='230' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='read_record' mangled-name='read_record' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='251' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='read_record' hash='3b4e2a1483f67165'>
      <parameter type-id='type-id-92' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='251' column='1'/>
      <parameter type-id='type-id-17' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='251' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='251' column='1'/>
      <parameter type-id='type-id-91' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='251' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_load_file' mangled-name='_gdbm_load_file' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='394' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_load_file' hash='478f2b552e324178'>
      <parameter type-id='type-id-92' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='394' column='1'/>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='394' column='1'/>
      <parameter type-id='type-id-90' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='394' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='395' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='395' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gdbm_load_bdb_dump' mangled-name='gdbm_load_bdb_dump' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_load_bdb_dump' hash='69fc6f4b43b20479'>
      <parameter type-id='type-id-92' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='533' column='1'/>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='533' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='533' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gdbm_load_from_file' mangled-name='gdbm_load_from_file' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='570' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_load_from_file' hash='02de6434e5b31738'>
      <parameter type-id='type-id-90' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='570' column='1'/>
      <parameter type-id='type-id-77' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='570' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='570' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='571' column='1'/>
      <parameter type-id='type-id-93' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='572' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gdbm_load' mangled-name='gdbm_load' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='623' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_load' hash='827abdf93530b37c'>
      <parameter type-id='type-id-90' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='623' column='1'/>
      <parameter type-id='type-id-57' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='623' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='623' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='624' column='1'/>
      <parameter type-id='type-id-93' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmload.c' line='625' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmopen.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' hash='d37695ec6a739fe7' id='type-id-94'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' hash='3ba0e19217746ff9' id='type-id-15'/>
    <function-decl name='gdbm_avail_table_valid_p' mangled-name='gdbm_avail_table_valid_p' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_avail_table_valid_p' hash='6c3e2ff66d2ad599'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='82' column='1'/>
      <parameter type-id='type-id-15' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='82' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='82' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gdbm_avail_block_validate' mangled-name='gdbm_avail_block_validate' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_avail_block_validate' hash='8e24de13b40c5306'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='110' column='1'/>
      <parameter type-id='type-id-94' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='110' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gdbm_bucket_avail_table_validate' mangled-name='gdbm_bucket_avail_table_validate' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_bucket_avail_table_validate' hash='87672e9f4eb98d1a'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='122' column='1'/>
      <parameter type-id='type-id-10' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='122' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_validate_header' mangled-name='_gdbm_validate_header' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_validate_header' hash='0b8154fa7c382b73'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmclose.c' line='30' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gdbm_fd_open' mangled-name='gdbm_fd_open' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_fd_open' hash='2a44ac1f1cf35716'>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='235' column='1'/>
      <parameter type-id='type-id-57' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='235' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='235' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='236' column='1'/>
      <parameter type-id='type-id-48' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='236' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='gdbm_open' mangled-name='gdbm_open' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='680' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_open' hash='f31e78d5c8469810'>
      <parameter type-id='type-id-57' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='680' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='680' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='680' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='680' column='1'/>
      <parameter type-id='type-id-48' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='681' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_gdbm_init_cache' mangled-name='_gdbm_init_cache' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='722' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_init_cache' hash='e803fd805d96645b'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='722' column='1'/>
      <parameter type-id='type-id-6' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='722' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_cache_entry_invalidate' mangled-name='_gdbm_cache_entry_invalidate' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_cache_entry_invalidate' hash='9d232ccb97e010e8'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='756' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='756' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmreorg.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='gdbm_reorganize' mangled-name='gdbm_reorganize' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmreorg.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_reorganize' hash='0b8154fa7c382b73'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmclose.c' line='30' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmseq.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='gdbm_firstkey' mangled-name='gdbm_firstkey' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmseq.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_firstkey' hash='84a40ede0f784348'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmseq.c' line='98' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gdbm_nextkey' mangled-name='gdbm_nextkey' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmseq.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_nextkey' hash='84a40ede0f784348'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmfetch.c' line='30' column='1'/>
      <parameter type-id='type-id-19' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmfetch.c' line='30' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmsetopt.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='gdbm_setopt' mangled-name='gdbm_setopt' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmsetopt.c' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_setopt' hash='8a85c8d2ae49515a'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmsetopt.c' line='333' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmsetopt.c' line='333' column='1'/>
      <parameter type-id='type-id-20' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmsetopt.c' line='333' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmsetopt.c' line='333' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmstore.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='gdbm_store' mangled-name='gdbm_store' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmstore.c' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_store' hash='65d6498fcd4d4cda'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmstore.c' line='40' column='1'/>
      <parameter type-id='type-id-19' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmstore.c' line='40' column='1'/>
      <parameter type-id='type-id-19' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmstore.c' line='40' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmstore.c' line='40' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gdbmsync.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='gdbm_sync' mangled-name='gdbm_sync' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmsync.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_sync' hash='0b8154fa7c382b73'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmclose.c' line='30' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hash.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='_gdbm_hash' mangled-name='_gdbm_hash' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/hash.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_hash' hash='388da3fa973fde78'>
      <parameter type-id='type-id-19' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/hash.c' line='31' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_bucket_dir' mangled-name='_gdbm_bucket_dir' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/hash.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_bucket_dir' hash='65d6498fcd4d4cda'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='53' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='53' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_hash_key' mangled-name='_gdbm_hash_key' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/hash.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_hash_key' hash='91a04ea3658757a6'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/hash.c' line='54' column='1'/>
      <parameter type-id='type-id-19' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/hash.c' line='54' column='1'/>
      <parameter type-id='type-id-16' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/hash.c' line='54' column='1'/>
      <parameter type-id='type-id-16' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/hash.c' line='54' column='1'/>
      <parameter type-id='type-id-16' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/hash.c' line='54' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='lock.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='_gdbm_unlock_file' mangled-name='_gdbm_unlock_file' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/lock.c' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_unlock_file' hash='84a40ede0f784348'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='88' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_gdbm_lock_file' mangled-name='_gdbm_lock_file' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/lock.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_lock_file' hash='0b8154fa7c382b73'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmclose.c' line='30' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mmap.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <typedef-decl name='__ssize_t' type-id='type-id-33' size-in-bits='64' filepath='/usr/include/bits/types.h' line='193' column='1' hash='b119fe0931d2ee10' id='type-id-95'/>
    <typedef-decl name='ssize_t' type-id='type-id-95' size-in-bits='64' filepath='/usr/include/sys/types.h' line='108' column='1' hash='b119fe0931d2ee10' id='type-id-96'/>
    <function-decl name='_gdbm_file_size' mangled-name='_gdbm_file_size' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_file_size' hash='753cffb4e42cd027'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='60' column='1'/>
      <parameter type-id='type-id-50' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='60' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_mapped_unmap' mangled-name='_gdbm_mapped_unmap' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_mapped_unmap' hash='84a40ede0f784348'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmerrno.c' line='88' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_gdbm_internal_remap' mangled-name='_gdbm_internal_remap' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_internal_remap' hash='e803fd805d96645b'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='722' column='1'/>
      <parameter type-id='type-id-6' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmopen.c' line='722' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_mapped_remap' mangled-name='_gdbm_mapped_remap' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_mapped_remap' hash='39096baac38b83e1'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/falloc.c' line='100' column='1'/>
      <parameter type-id='type-id-12' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/falloc.c' line='100' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/falloc.c' line='100' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_mapped_init' mangled-name='_gdbm_mapped_init' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_mapped_init' hash='0b8154fa7c382b73'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmclose.c' line='30' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_mapped_read' mangled-name='_gdbm_mapped_read' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_mapped_read' hash='cdfc75951ba49395'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='235' column='1'/>
      <parameter type-id='type-id-20' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='235' column='1'/>
      <parameter type-id='type-id-6' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='235' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='_gdbm_mapped_write' mangled-name='_gdbm_mapped_write' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_mapped_write' hash='cdfc75951ba49395'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='235' column='1'/>
      <parameter type-id='type-id-20' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='235' column='1'/>
      <parameter type-id='type-id-6' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='235' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='_gdbm_mapped_lseek' mangled-name='_gdbm_mapped_lseek' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_mapped_lseek' hash='713e31f2e4824ccf'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='346' column='1'/>
      <parameter type-id='type-id-12' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='346' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='346' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='_gdbm_mapped_sync' mangled-name='_gdbm_mapped_sync' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/mmap.c' line='397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_mapped_sync' hash='0b8154fa7c382b73'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmclose.c' line='30' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='recover.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <class-decl name='gdbm_recovery_s' is-struct='yes' visibility='default' size-in-bits='704' filepath='./gdbm.h' line='137' column='1' hash='559ec41ceaa5a6b2' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='errfun' type-id='type-id-98' visibility='default' filepath='./gdbm.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-20' visibility='default' filepath='./gdbm.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_failed_keys' type-id='type-id-6' visibility='default' filepath='./gdbm.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='max_failed_buckets' type-id='type-id-6' visibility='default' filepath='./gdbm.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='max_failures' type-id='type-id-6' visibility='default' filepath='./gdbm.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='recovered_keys' type-id='type-id-6' visibility='default' filepath='./gdbm.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='recovered_buckets' type-id='type-id-6' visibility='default' filepath='./gdbm.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='failed_keys' type-id='type-id-6' visibility='default' filepath='./gdbm.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='failed_buckets' type-id='type-id-6' visibility='default' filepath='./gdbm.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='duplicate_keys' type-id='type-id-6' visibility='default' filepath='./gdbm.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='backup_name' type-id='type-id-17' visibility='default' filepath='./gdbm.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gdbm_recovery' type-id='type-id-97' size-in-bits='704' filepath='./gdbm.h' line='157' column='1' id='type-id-99'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' hash='9166198250f36df9' id='type-id-100'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-98'/>
    <function-decl name='gdbm_copy_meta' mangled-name='gdbm_copy_meta' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/recover.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_copy_meta' hash='d3ea4d16bfc1b269'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/recover.c' line='23' column='1'/>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/recover.c' line='23' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_next_bucket_dir' mangled-name='_gdbm_next_bucket_dir' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/recover.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_next_bucket_dir' hash='65d6498fcd4d4cda'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='53' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/bucket.c' line='53' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gdbm_recover' mangled-name='gdbm_recover' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/recover.c' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gdbm_recover' hash='d0ea8fc617494f59'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/recover.c' line='351' column='1'/>
      <parameter type-id='type-id-100' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/recover.c' line='351' column='1'/>
      <parameter type-id='type-id-8' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/recover.c' line='351' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='type-id-102'/>
    <function-type size-in-bits='64' hash='53885bde0aa65efe' id='type-id-101'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-57'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='update.c' comp-dir-path='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src' language='LANG_C99'>
    <function-decl name='_gdbm_end_update' mangled-name='_gdbm_end_update' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/update.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_end_update' hash='0b8154fa7c382b73'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/gdbmclose.c' line='30' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gdbm_fatal' mangled-name='_gdbm_fatal' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/update.c' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gdbm_fatal' hash='2ec77bea6761f45a'>
      <parameter type-id='type-id-9' filepath='/tmp/ben/spack-stage/spack-stage-dQKT1q/spack-src/src/update.c' line='138' column='1'/>
