<abi-corpus version='2.4' soname='libandroid.so'>
  <elf-needed>
    <dependency name='liblog.so'/>
    <dependency name='libhidlbase.so'/>
    <dependency name='libcutils.so'/>
    <dependency name='libandroidfw.so'/>
    <dependency name='libinput.so'/>
    <dependency name='libutils.so'/>
    <dependency name='libbinder.so'/>
    <dependency name='libui.so'/>
    <dependency name='libgui.so'/>
    <dependency name='libharfbuzz_ng.so'/>
    <dependency name='libsensor.so'/>
    <dependency name='libandroid_runtime.so'/>
    <dependency name='libminikin.so'/>
    <dependency name='libnetd_client.so'/>
    <dependency name='libhwui.so'/>
    <dependency name='libxml2.so'/>
    <dependency name='android.hardware.configstore@1.0.so'/>
    <dependency name='android.hardware.configstore-utils.so'/>
    <dependency name='libc++.so'/>
    <dependency name='libc.so'/>
    <dependency name='libm.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='AAssetDir_close' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAssetDir_getNextFileName' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='ASurfaceTransaction_setZOrder' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ASystemFontIterator_close' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ASystemFontIterator_next' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ASystemFontIterator_open' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_beginAsyncSection' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_beginSection' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_endAsyncSection' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_endSection' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_isEnabled' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_setCounter' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_getaddrinfofornetwork' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_res_cancel' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_res_nquery' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_res_nresult' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_res_nsend' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_setprocnetwork' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_setsocknetwork' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='32' path='frameworks/base/libs/storage/IMountService.cpp' language='LANG_C_plus_plus_14'>
    <array-type-def dimensions='1' type-id='801a266d' size-in-bits='560' hash='b477220dccc11446' id='5da7196d'>
      <subrange length='35' lower-bound='0' upper-bound='34' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='81627a4365755e9e' id='6e6845b5'/>
    </array-type-def>
    <pointer-type-def type-id='22d61b29' size-in-bits='32' hash='8548aff4a2525f6f' id='9892ee61'/>
    <pointer-type-def type-id='7807f886' size-in-bits='32' hash='f3c803b33b8e0869' id='27ec51bc'/>
    <qualified-type-def type-id='9cb9149f' const='yes' hash='51e4ee191ac727b6' id='dee60e2c'/>
    <reference-type-def kind='lvalue' type-id='dee60e2c' size-in-bits='32' hash='ca456591de8504db' id='ee2819be'/>
    <reference-type-def kind='lvalue' type-id='9cb9149f' size-in-bits='32' hash='51eb83f4246c22a9' id='705b9f3b'/>
    <reference-type-def kind='lvalue' type-id='26924198' size-in-bits='32' hash='f91cf110dd755510' id='763d7e1a'/>
    <pointer-type-def type-id='6807f016' size-in-bits='32' hash='3097e3bb64beee07' id='ba5970bc'/>
    <reference-type-def kind='lvalue' type-id='a2aa88e3' size-in-bits='32' hash='68ede6713ed430aa' id='cab8cdd7'/>
    <reference-type-def kind='rvalue' type-id='a2aa88e3' size-in-bits='32' hash='429415605225715a' id='11ec3263'/>
    <pointer-type-def type-id='a2aa88e3' size-in-bits='32' hash='55cc64ddc226d8e8' id='beb8baf3'/>
    <reference-type-def kind='lvalue' type-id='3f075162' size-in-bits='32' hash='f17d3d6ca0cb3317' id='4cb59d14'/>
    <reference-type-def kind='rvalue' type-id='3f075162' size-in-bits='32' hash='b045dffa5f2269f1' id='f3e675b6'/>
    <pointer-type-def type-id='3f075162' size-in-bits='32' hash='0c7007e09110c9c4' id='40b58a30'/>
    <qualified-type-def type-id='bf075117' const='yes' hash='22065c34e42ff9f4' id='d11f779a'/>
    <pointer-type-def type-id='d11f779a' size-in-bits='32' hash='789f30aabc84971d' id='e4896a10'/>
    <qualified-type-def type-id='6807f016' const='yes' hash='60470849cbbe3e70' id='6cf1e15d'/>
    <reference-type-def kind='lvalue' type-id='6cf1e15d' size-in-bits='32' hash='6771c41776a2ecea' id='fbc5f4a1'/>
    <qualified-type-def type-id='a2aa88e3' const='yes' hash='30fbb2fdf592e385' id='e2905de8'/>
    <reference-type-def kind='lvalue' type-id='e2905de8' size-in-bits='32' hash='6659dc36f371dd2f' id='7743ab4a'/>
    <pointer-type-def type-id='e2905de8' size-in-bits='32' hash='783e8e3735bb9a5f' id='6b439866'/>
    <qualified-type-def type-id='3f075162' const='yes' hash='8447d6fd137a1ab9' id='1a6371f3'/>
    <reference-type-def kind='lvalue' type-id='1a6371f3' size-in-bits='32' hash='a8b72e56a6dcc07f' id='5f8c324f'/>
    <pointer-type-def type-id='1a6371f3' size-in-bits='32' hash='4af8191671c3257c' id='638c389b'/>
    <qualified-type-def type-id='452328e6' const='yes' hash='bc2c1c7dafcf30f5' id='08f75d23'/>
    <pointer-type-def type-id='08f75d23' size-in-bits='32' hash='f7cec0ddf587e7ba' id='2667752b'/>
    <qualified-type-def type-id='5ddaf272' const='yes' hash='f9894aefb51ab317' id='0cbf5aab'/>
    <pointer-type-def type-id='0cbf5aab' size-in-bits='32' hash='706d0acedbbdf3eb' id='923b7913'/>
    <qualified-type-def type-id='a1aaab37' const='yes' hash='803c0d6af842de76' id='5649c4ec'/>
    <pointer-type-def type-id='5649c4ec' size-in-bits='32' hash='97c655afdeaaa318' id='9c20c3b2'/>
    <qualified-type-def type-id='e4c905b6' const='yes' hash='81eed4a104866efd' id='0f556883'/>
    <reference-type-def kind='lvalue' type-id='0f556883' size-in-bits='32' hash='a308725e4652f8e6' id='c873bbbf'/>
    <pointer-type-def type-id='0f556883' size-in-bits='32' hash='867b5826f68db805' id='cc73c20b'/>
    <qualified-type-def type-id='34e3553c' const='yes' hash='130f15159c09a055' id='9d0984bf'/>
    <reference-type-def kind='lvalue' type-id='9d0984bf' size-in-bits='32' hash='187bc90b9ded8265' id='cefbbcdb'/>
    <pointer-type-def type-id='9d0984bf' size-in-bits='32' hash='1e25a4d2095a1cb7' id='cafbb68f'/>
    <qualified-type-def type-id='1bb55f07' const='yes' hash='e3dfcfb72e1ddcb2#5' id='fc5a3b88'/>
    <reference-type-def kind='lvalue' type-id='fc5a3b88' size-in-bits='32' hash='768b1e3ba2096387#5' id='f00bf2ea'/>
    <pointer-type-def type-id='4aafb922' size-in-bits='32' hash='b46abb7b0a3bfe43' id='9aa04798'/>
    <reference-type-def kind='lvalue' type-id='452328e6' size-in-bits='32' hash='6bb7975d127dd867' id='84e43118'/>
    <pointer-type-def type-id='452328e6' size-in-bits='32' hash='ce409ad286cfd389' id='80e42acc'/>
    <pointer-type-def type-id='5ddaf272' size-in-bits='32' hash='1dc5e2cd235ab4f6' id='606e1a50'/>
    <pointer-type-def type-id='a1aaab37' size-in-bits='32' hash='c7ccefe18485dda0' id='97e1a22f'/>
    <reference-type-def kind='lvalue' type-id='e4c905b6' size-in-bits='32' hash='260eb3c792812fa8' id='55daf9c8'/>
    <pointer-type-def type-id='e4c905b6' size-in-bits='32' hash='e828b1cc69242937' id='51daf37c'/>
    <reference-type-def kind='lvalue' type-id='34e3553c' size-in-bits='32' hash='dae43022e987cee9' id='ef24a0d6'/>
    <reference-type-def kind='rvalue' type-id='34e3553c' size-in-bits='32' hash='2a158e36f508c19b' id='66a959d0'/>
    <pointer-type-def type-id='34e3553c' size-in-bits='32' hash='4da355b4eecd84e2' id='fb24b3ba'/>
    <reference-type-def kind='lvalue' type-id='1bb55f07' size-in-bits='32' hash='9cc027997a70e9c1#5' id='ff242d41'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='32' id='822cd80b'/>
    <pointer-type-def type-id='df458ae6' size-in-bits='32' id='621ed18c'/>
    <pointer-type-def type-id='edff7cb3' size-in-bits='32' id='b5a5bc13'/>
    <pointer-type-def type-id='40b6343a' size-in-bits='32' id='6d5a3b78'/>
    <reference-type-def kind='lvalue' type-id='748cb1b7' size-in-bits='32' id='d7c9afdb'/>
    <pointer-type-def type-id='748cb1b7' size-in-bits='32' id='d3c9a98f'/>
    <reference-type-def kind='lvalue' type-id='60976dc0' size-in-bits='32' id='bb0cd27a'/>
    <pointer-type-def type-id='60976dc0' size-in-bits='32' id='af0cbf96'/>
    <namespace-decl name='android'>
      <class-decl name='BpInterface&lt;android::IMountService&gt;' visibility='default' size-in-bits='224' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='86' column='1' hash='dc8c46692e2a3a2d' id='22d61b29'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bf075117'/>
        <base-class access='public' layout-offset-in-bits='32' type-id='df458ae7'/>
        <member-function access='protected' vtable-offset='2'>
          <function-decl name='onAsBinder' mangled-name='_ZN7android11BpInterfaceINS_13IMountServiceEE10onAsBinderEv' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='93' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='9892ee61' is-artificial='yes'/>
            <return type-id='b5a5bc13'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='BpMountService' visibility='default' size-in-bits='224' filepath='frameworks/base/libs/storage/IMountService.cpp' line='55' column='1' hash='0adb8cfd26d14339' id='7807f886'>
        <base-class access='public' layout-offset-in-bits='0' type-id='22d61b29'/>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='registerListener' mangled-name='_ZN7android14BpMountService16registerListenerERKNS_2spINS_21IMountServiceListenerEEE' filepath='frameworks/base/libs/storage/IMountService.cpp' line='63' column='1' visibility='default' binding='global' size-in-bits='32' hash='033988c26c3eacc1'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='7743ab4a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='5'>
          <function-decl name='unregisterListener' mangled-name='_ZN7android14BpMountService18unregisterListenerERKNS_2spINS_21IMountServiceListenerEEE' filepath='frameworks/base/libs/storage/IMountService.cpp' line='79' column='1' visibility='default' binding='global' size-in-bits='32' hash='033988c26c3eacc1'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='7743ab4a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='6'>
          <function-decl name='isUsbMassStorageConnected' mangled-name='_ZN7android14BpMountService25isUsbMassStorageConnectedEv' filepath='frameworks/base/libs/storage/IMountService.cpp' line='95' column='1' visibility='default' binding='global' size-in-bits='32' hash='78f6a3cdaf3f98f3'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='7'>
          <function-decl name='setUsbMassStorageEnabled' mangled-name='_ZN7android14BpMountService24setUsbMassStorageEnabledEb' filepath='frameworks/base/libs/storage/IMountService.cpp' line='111' column='1' visibility='default' binding='global' size-in-bits='32' hash='839073eeb99b5999'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='8'>
          <function-decl name='isUsbMassStorageEnabled' mangled-name='_ZN7android14BpMountService23isUsbMassStorageEnabledEv' filepath='frameworks/base/libs/storage/IMountService.cpp' line='127' column='1' visibility='default' binding='global' size-in-bits='32' hash='78f6a3cdaf3f98f3'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='9'>
          <function-decl name='mountVolume' mangled-name='_ZN7android14BpMountService11mountVolumeERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='143' column='1' visibility='default' binding='global' size-in-bits='32' hash='401cc094f7d8ed35'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='10'>
          <function-decl name='unmountVolume' mangled-name='_ZN7android14BpMountService13unmountVolumeERKNS_8String16Ebb' filepath='frameworks/base/libs/storage/IMountService.cpp' line='160' column='1' visibility='default' binding='global' size-in-bits='32' hash='e226098566fe87fd'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='11'>
          <function-decl name='formatVolume' mangled-name='_ZN7android14BpMountService12formatVolumeERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='179' column='1' visibility='default' binding='global' size-in-bits='32' hash='401cc094f7d8ed35'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='12'>
          <function-decl name='getStorageUsers' mangled-name='_ZN7android14BpMountService15getStorageUsersERKNS_8String16EPPi' filepath='frameworks/base/libs/storage/IMountService.cpp' line='196' column='1' visibility='default' binding='global' size-in-bits='32' hash='c0aeb1b798922da1'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='9aa04798'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='13'>
          <function-decl name='getVolumeState' mangled-name='_ZN7android14BpMountService14getVolumeStateERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='225' column='1' visibility='default' binding='global' size-in-bits='32' hash='401cc094f7d8ed35'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='14'>
          <function-decl name='createSecureContainer' mangled-name='_ZN7android14BpMountService21createSecureContainerERKNS_8String16EiS3_S3_i' filepath='frameworks/base/libs/storage/IMountService.cpp' line='242' column='1' visibility='default' binding='global' size-in-bits='32' hash='1640f5b4c846088d'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='15'>
          <function-decl name='finalizeSecureContainer' mangled-name='_ZN7android14BpMountService23finalizeSecureContainerERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='264' column='1' visibility='default' binding='global' size-in-bits='32' hash='401cc094f7d8ed35'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='16'>
          <function-decl name='destroySecureContainer' mangled-name='_ZN7android14BpMountService22destroySecureContainerERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='281' column='1' visibility='default' binding='global' size-in-bits='32' hash='401cc094f7d8ed35'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='17'>
          <function-decl name='mountSecureContainer' mangled-name='_ZN7android14BpMountService20mountSecureContainerERKNS_8String16ES3_i' filepath='frameworks/base/libs/storage/IMountService.cpp' line='298' column='1' visibility='default' binding='global' size-in-bits='32' hash='8c3ecc0de8623f46'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='18'>
          <function-decl name='unmountSecureContainer' mangled-name='_ZN7android14BpMountService22unmountSecureContainerERKNS_8String16Eb' filepath='frameworks/base/libs/storage/IMountService.cpp' line='319' column='1' visibility='default' binding='global' size-in-bits='32' hash='9f208319cc45b066'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='19'>
          <function-decl name='isSecureContainerMounted' mangled-name='_ZN7android14BpMountService24isSecureContainerMountedERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='337' column='1' visibility='default' binding='global' size-in-bits='32' hash='0fb6ef930ab1581d'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='20'>
          <function-decl name='renameSecureContainer' mangled-name='_ZN7android14BpMountService21renameSecureContainerERKNS_8String16ES3_' filepath='frameworks/base/libs/storage/IMountService.cpp' line='354' column='1' visibility='default' binding='global' size-in-bits='32' hash='62d55fb1ee036e3c'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='21'>
          <function-decl name='getSecureContainerPath' mangled-name='_ZN7android14BpMountService22getSecureContainerPathERKNS_8String16ERS1_' filepath='frameworks/base/libs/storage/IMountService.cpp' line='372' column='1' visibility='default' binding='global' size-in-bits='32' hash='a67a0af5b468a148'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='22923b4c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='22'>
          <function-decl name='getSecureContainerList' mangled-name='_ZN7android14BpMountService22getSecureContainerListERKNS_8String16ERPS1_' filepath='frameworks/base/libs/storage/IMountService.cpp' line='390' column='1' visibility='default' binding='global' size-in-bits='32' hash='3b2892980509d689'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='763d7e1a'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='23'>
          <function-decl name='shutdown' mangled-name='_ZN7android14BpMountService8shutdownERKNS_2spINS_22IMountShutdownObserverEEE' filepath='frameworks/base/libs/storage/IMountService.cpp' line='412' column='1' visibility='default' binding='global' size-in-bits='32' hash='bfc622881c5696ee'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='5f8c324f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='24'>
          <function-decl name='finishMediaUpdate' mangled-name='_ZN7android14BpMountService17finishMediaUpdateEv' filepath='frameworks/base/libs/storage/IMountService.cpp' line='429' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='25'>
          <function-decl name='mountObb' mangled-name='_ZN7android14BpMountService8mountObbERKNS_8String16ES3_S3_RKNS_2spINS_18IObbActionListenerEEEiRKNS4_INS_7ObbInfoEEE' filepath='frameworks/base/libs/storage/IMountService.cpp' line='445' column='1' visibility='default' binding='global' size-in-bits='32' hash='366f21a9b034425a'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='990ef79d'/>
            <parameter type-id='3ff5601b'/>
            <parameter type-id='0c3db078'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='26'>
          <function-decl name='unmountObb' mangled-name='_ZN7android14BpMountService10unmountObbERKNS_8String16EbRKNS_2spINS_18IObbActionListenerEEEi' filepath='frameworks/base/libs/storage/IMountService.cpp' line='467' column='1' visibility='default' binding='global' size-in-bits='32' hash='ebbfb0d88bd24f74'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <parameter type-id='990ef79d'/>
            <parameter type-id='922df12b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='27'>
          <function-decl name='isObbMounted' mangled-name='_ZN7android14BpMountService12isObbMountedERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='487' column='1' visibility='default' binding='global' size-in-bits='32' hash='0fb6ef930ab1581d'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='28'>
          <function-decl name='getMountedObbPath' mangled-name='_ZN7android14BpMountService17getMountedObbPathERKNS_8String16ERS1_' filepath='frameworks/base/libs/storage/IMountService.cpp' line='504' column='1' visibility='default' binding='global' size-in-bits='32' hash='a67a0af5b468a148'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='22923b4c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='29'>
          <function-decl name='decryptStorage' mangled-name='_ZN7android14BpMountService14decryptStorageERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='522' column='1' visibility='default' binding='global' size-in-bits='32' hash='401cc094f7d8ed35'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='30'>
          <function-decl name='encryptStorage' mangled-name='_ZN7android14BpMountService14encryptStorageERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='539' column='1' visibility='default' binding='global' size-in-bits='32' hash='401cc094f7d8ed35'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='IMountService' visibility='default' size-in-bits='96' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='32' column='1' hash='5c2013c54a5e0323' id='bf075117'>
        <base-class access='public' layout-offset-in-bits='0' type-id='40b6343b'/>
        <data-member access='public' static='yes'>
          <var-decl name='descriptor' type-id='a3cec311' mangled-name='_ZN7android13IMountService10descriptorE' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='default_impl' type-id='34e3553c' mangled-name='_ZN7android13IMountService12default_implE' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1'/>
        </data-member>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IMountService' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IMountService' mangled-name='_ZN7android13IMountServiceD0Ev' filepath='frameworks/base/libs/storage/IMountService.cpp' line='557' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IMountService' mangled-name='_ZN7android13IMountServiceD1Ev' filepath='frameworks/base/libs/storage/IMountService.cpp' line='557' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IMountService' mangled-name='_ZN7android13IMountServiceD2Ev' filepath='frameworks/base/libs/storage/IMountService.cpp' line='557' column='1' visibility='default' binding='global' size-in-bits='32' hash='d450a6b77a69de79'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='63e171df' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes' vtable-offset='3'>
          <function-decl name='getInterfaceDescriptor' mangled-name='_ZNK7android13IMountService22getInterfaceDescriptorEv' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32' hash='0f2942b388595d26'>
            <parameter type-id='e4896a10' is-artificial='yes'/>
            <return type-id='157d4f95'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='registerListener' mangled-name='_ZN7android13IMountService16registerListenerERKNS_2spINS_21IMountServiceListenerEEE' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='36' column='1' visibility='default' binding='global' size-in-bits='32' hash='033988c26c3eacc1'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='7743ab4a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='5'>
          <function-decl name='unregisterListener' mangled-name='_ZN7android13IMountService18unregisterListenerERKNS_2spINS_21IMountServiceListenerEEE' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='38' column='1' visibility='default' binding='global' size-in-bits='32' hash='033988c26c3eacc1'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='7743ab4a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='6'>
          <function-decl name='isUsbMassStorageConnected' mangled-name='_ZN7android13IMountService25isUsbMassStorageConnectedEv' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='39' column='1' visibility='default' binding='global' size-in-bits='32' hash='78f6a3cdaf3f98f3'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='7'>
          <function-decl name='setUsbMassStorageEnabled' mangled-name='_ZN7android13IMountService24setUsbMassStorageEnabledEb' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='40' column='1' visibility='default' binding='global' size-in-bits='32' hash='839073eeb99b5999'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='8'>
          <function-decl name='isUsbMassStorageEnabled' mangled-name='_ZN7android13IMountService23isUsbMassStorageEnabledEv' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='41' column='1' visibility='default' binding='global' size-in-bits='32' hash='78f6a3cdaf3f98f3'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='9'>
          <function-decl name='mountVolume' mangled-name='_ZN7android13IMountService11mountVolumeERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32' hash='401cc094f7d8ed35'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='10'>
          <function-decl name='unmountVolume' mangled-name='_ZN7android13IMountService13unmountVolumeERKNS_8String16Ebb' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32' hash='e226098566fe87fd'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='11'>
          <function-decl name='formatVolume' mangled-name='_ZN7android13IMountService12formatVolumeERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='45' column='1' visibility='default' binding='global' size-in-bits='32' hash='401cc094f7d8ed35'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='12'>
          <function-decl name='getStorageUsers' mangled-name='_ZN7android13IMountService15getStorageUsersERKNS_8String16EPPi' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='47' column='1' visibility='default' binding='global' size-in-bits='32' hash='c0aeb1b798922da1'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='9aa04798'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='13'>
          <function-decl name='getVolumeState' mangled-name='_ZN7android13IMountService14getVolumeStateERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32' hash='401cc094f7d8ed35'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='14'>
          <function-decl name='createSecureContainer' mangled-name='_ZN7android13IMountService21createSecureContainerERKNS_8String16EiS3_S3_i' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='49' column='1' visibility='default' binding='global' size-in-bits='32' hash='1640f5b4c846088d'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='15'>
          <function-decl name='finalizeSecureContainer' mangled-name='_ZN7android13IMountService23finalizeSecureContainerERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='52' column='1' visibility='default' binding='global' size-in-bits='32' hash='401cc094f7d8ed35'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='16'>
          <function-decl name='destroySecureContainer' mangled-name='_ZN7android13IMountService22destroySecureContainerERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='53' column='1' visibility='default' binding='global' size-in-bits='32' hash='401cc094f7d8ed35'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='17'>
          <function-decl name='mountSecureContainer' mangled-name='_ZN7android13IMountService20mountSecureContainerERKNS_8String16ES3_i' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='54' column='1' visibility='default' binding='global' size-in-bits='32' hash='8c3ecc0de8623f46'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='18'>
          <function-decl name='unmountSecureContainer' mangled-name='_ZN7android13IMountService22unmountSecureContainerERKNS_8String16Eb' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='57' column='1' visibility='default' binding='global' size-in-bits='32' hash='9f208319cc45b066'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='19'>
          <function-decl name='isSecureContainerMounted' mangled-name='_ZN7android13IMountService24isSecureContainerMountedERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='58' column='1' visibility='default' binding='global' size-in-bits='32' hash='0fb6ef930ab1581d'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='20'>
          <function-decl name='renameSecureContainer' mangled-name='_ZN7android13IMountService21renameSecureContainerERKNS_8String16ES3_' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='59' column='1' visibility='default' binding='global' size-in-bits='32' hash='62d55fb1ee036e3c'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='21'>
          <function-decl name='getSecureContainerPath' mangled-name='_ZN7android13IMountService22getSecureContainerPathERKNS_8String16ERS1_' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='61' column='1' visibility='default' binding='global' size-in-bits='32' hash='a67a0af5b468a148'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='22923b4c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='22'>
          <function-decl name='getSecureContainerList' mangled-name='_ZN7android13IMountService22getSecureContainerListERKNS_8String16ERPS1_' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='62' column='1' visibility='default' binding='global' size-in-bits='32' hash='3b2892980509d689'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='763d7e1a'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='23'>
          <function-decl name='shutdown' mangled-name='_ZN7android13IMountService8shutdownERKNS_2spINS_22IMountShutdownObserverEEE' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='64' column='1' visibility='default' binding='global' size-in-bits='32' hash='bfc622881c5696ee'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='5f8c324f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='24'>
          <function-decl name='finishMediaUpdate' mangled-name='_ZN7android13IMountService17finishMediaUpdateEv' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='65' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='25'>
          <function-decl name='mountObb' mangled-name='_ZN7android13IMountService8mountObbERKNS_8String16ES3_S3_RKNS_2spINS_18IObbActionListenerEEEiRKNS4_INS_7ObbInfoEEE' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='66' column='1' visibility='default' binding='global' size-in-bits='32' hash='7f673cf9a12b7977'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='990ef79d'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='0c3db078'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='26'>
          <function-decl name='unmountObb' mangled-name='_ZN7android13IMountService10unmountObbERKNS_8String16EbRKNS_2spINS_18IObbActionListenerEEEi' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='69' column='1' visibility='default' binding='global' size-in-bits='32' hash='ebbfb0d88bd24f74'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <parameter type-id='990ef79d'/>
            <parameter type-id='922df12b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='27'>
          <function-decl name='isObbMounted' mangled-name='_ZN7android13IMountService12isObbMountedERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='71' column='1' visibility='default' binding='global' size-in-bits='32' hash='0fb6ef930ab1581d'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='28'>
          <function-decl name='getMountedObbPath' mangled-name='_ZN7android13IMountService17getMountedObbPathERKNS_8String16ERS1_' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='72' column='1' visibility='default' binding='global' size-in-bits='32' hash='a67a0af5b468a148'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='22923b4c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='29'>
          <function-decl name='decryptStorage' mangled-name='_ZN7android13IMountService14decryptStorageERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='73' column='1' visibility='default' binding='global' size-in-bits='32' hash='401cc094f7d8ed35'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='30'>
          <function-decl name='encryptStorage' mangled-name='_ZN7android13IMountService14encryptStorageERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='74' column='1' visibility='default' binding='global' size-in-bits='32' hash='401cc094f7d8ed35'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::IMountServiceListener&gt;' visibility='default' size-in-bits='32' filepath='system/core/libutils/include/utils/StrongPointer.h' line='31' column='1' hash='6f6da2d4858c7c6d' id='a2aa88e3'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='d3c9a98f' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='90' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='sp&lt;android::IMountShutdownObserver&gt;' visibility='default' size-in-bits='32' filepath='system/core/libutils/include/utils/StrongPointer.h' line='31' column='1' hash='f118a44aadb5cbcb' id='3f075162'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='af0cbf96' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='90' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='BpRefBase' visibility='default' is-declaration-only='yes' id='df458ae6'/>
      <class-decl name='IBinder' visibility='default' is-declaration-only='yes' id='edff7cb3'/>
      <class-decl name='IInterface' visibility='default' is-declaration-only='yes' id='40b6343a'/>
      <class-decl name='IMountServiceListener' visibility='default' is-declaration-only='yes' id='748cb1b7'/>
      <class-decl name='IMountShutdownObserver' visibility='default' is-declaration-only='yes' id='60976dc0'/>
      <class-decl name='IObbActionListener' visibility='default' size-in-bits='96' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='27' column='1' hash='5d5dba6aaaf5eb66' id='f7c5ae1e'>
        <base-class access='public' layout-offset-in-bits='0' type-id='40b6343c'/>
        <data-member access='public' static='yes'>
          <var-decl name='descriptor' type-id='a3cec311' mangled-name='_ZN7android18IObbActionListener10descriptorE' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='default_impl' type-id='c722890a' mangled-name='_ZN7android18IObbActionListener12default_implE' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1'/>
        </data-member>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IObbActionListener' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IObbActionListener' mangled-name='_ZN7android18IObbActionListenerD0Ev' filepath='frameworks/base/libs/storage/IObbActionListener.cpp' line='37' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IObbActionListener' mangled-name='_ZN7android18IObbActionListenerD1Ev' filepath='frameworks/base/libs/storage/IObbActionListener.cpp' line='37' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IObbActionListener' mangled-name='_ZN7android18IObbActionListenerD2Ev' filepath='frameworks/base/libs/storage/IObbActionListener.cpp' line='37' column='1' visibility='default' binding='global' size-in-bits='32' hash='d450a6b77a69de79'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <parameter type-id='63e171df' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes' vtable-offset='3'>
          <function-decl name='getInterfaceDescriptor' mangled-name='_ZNK7android18IObbActionListener22getInterfaceDescriptorEv' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32' hash='0f2942b388595d26'>
            <parameter type-id='32d2f295' is-artificial='yes'/>
            <return type-id='157d4f95'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='onObbResult' mangled-name='_ZN7android18IObbActionListener11onObbResultERKNS_8String16Eii' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='32' column='1' visibility='default' binding='global' size-in-bits='32' hash='1919c44d971cd13f'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='922df12b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='ObbInfo' visibility='default' size-in-bits='288' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='27' column='1' hash='4ba9d79239cf87e2' id='65c10d3d'>
        <base-class access='public' layout-offset-in-bits='0' type-id='f8f7e309'/>
        <base-class access='public' layout-offset-in-bits='96' is-virtual='yes' type-id='12f619c0'/>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='mFileName' type-id='a3cec311' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='38' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='mPackageName' type-id='a3cec311' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='39' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='96'>
          <var-decl name='mVersion' type-id='3ff5601b' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='40' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='mFlags' type-id='3ff5601b' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='41' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='160'>
          <var-decl name='mSaltSize' type-id='b59d7dce' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='42' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='mSalt' type-id='9f7200cf' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='43' column='1'/>
        </data-member>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~ObbInfo' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='32' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~ObbInfo' mangled-name='_ZN7android7ObbInfoD0Ev' filepath='frameworks/base/libs/storage/ObbInfo.cpp' line='30' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~ObbInfo' mangled-name='_ZN7android7ObbInfoD1Ev' filepath='frameworks/base/libs/storage/ObbInfo.cpp' line='30' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~ObbInfo' mangled-name='_ZN7android7ObbInfoD2Ev' filepath='frameworks/base/libs/storage/ObbInfo.cpp' line='30' column='1' visibility='default' binding='global' size-in-bits='32' hash='d450a6b77a69de79'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <parameter type-id='63e171df' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes' vtable-offset='2'>
          <function-decl name='writeToParcel' mangled-name='_ZNK7android7ObbInfo13writeToParcelEPNS_6ParcelE' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32' hash='a1f93a033e1719c7'>
            <parameter type-id='a5f3e61a' is-artificial='yes'/>
            <parameter type-id='1a1ddb91'/>
            <return type-id='6e9756f6'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='readFromParcel' mangled-name='_ZN7android7ObbInfo14readFromParcelEPKNS_6ParcelE' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='35' column='1' visibility='default' binding='global' size-in-bits='32' hash='f31d8124ce96fd87'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <parameter type-id='79927164'/>
            <return type-id='6e9756f6'/>
          </function-decl>
        </member-function>
      </class-decl>
      <typedef-decl name='status_t' type-id='3ff5601b' size-in-bits='32' filepath='system/core/libutils/include/utils/Errors.h' line='30' column='1' hash='09d17c08f594edc7' id='6e9756f6'/>
    </namespace-decl>
    <namespace-decl name='std'>
      <namespace-decl name='__1'>
        <class-decl name='__compressed_pair&lt;android::IMountService *, std::__1::default_delete&lt;android::IMountService&gt; &gt;' visibility='default' size-in-bits='32' filepath='external/libcxx/include/memory' line='2211' column='1' hash='de9f1a901e504e0b' id='452328e6'>
          <base-class access='private' layout-offset-in-bits='0' type-id='5ddaf272'/>
          <base-class access='private' layout-offset-in-bits='0' type-id='a1aaab37'/>
        </class-decl>
        <class-decl name='unique_ptr&lt;android::IMountService, std::__1::default_delete&lt;android::IMountService&gt; &gt;' visibility='default' size-in-bits='32' filepath='external/libcxx/include/memory' line='2401' column='1' hash='5b4763caaf71184f' id='34e3553c'>
          <member-type access='private'>
            <typedef-decl name='deleter_type' type-id='e4c905b6' size-in-bits='8' filepath='external/libcxx/include/memory' line='2404' column='1' id='1bb55f07'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='91be3de9' size-in-bits='32' filepath='external/libcxx/include/memory' line='2405' column='1' hash='3ebd063f5b71295b' id='e9157ebc'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__ptr_' type-id='452328e6' visibility='default' filepath='external/libcxx/include/memory' line='2411' column='1'/>
          </data-member>
        </class-decl>
        <class-decl name='__add_lvalue_reference_impl&lt;android::IMountService, true&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='external/libcxx/include/type_traits' line='1125' column='1' hash='3f1557fe4c084f1b' id='0503b309'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='a0b91aeb' size-in-bits='32' filepath='external/libcxx/include/type_traits' line='1125' column='1' hash='258d2074e124a969' id='bb677b9a'/>
          </member-type>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;android::IMountService *, 0, false&gt;' is-struct='yes' visibility='default' size-in-bits='32' filepath='external/libcxx/include/memory' line='2134' column='1' hash='e363e79e1719320b' id='5ddaf272'>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='ee2819be' size-in-bits='32' filepath='external/libcxx/include/memory' line='2137' column='1' hash='ca456591de8504db' id='552e1b00'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='705b9f3b' size-in-bits='32' filepath='external/libcxx/include/memory' line='2136' column='1' hash='51eb83f4246c22a9' id='935477b0'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__value_' type-id='9cb9149f' visibility='default' filepath='external/libcxx/include/memory' line='2168' column='1'/>
          </data-member>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;std::__1::default_delete&lt;android::IMountService&gt;, 1, true&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='external/libcxx/include/memory' line='2172' column='1' hash='dd79f393eabf2d7e' id='a1aaab37'>
          <base-class access='private' layout-offset-in-bits='0' type-id='e4c905b6'/>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='c873bbbf' size-in-bits='32' filepath='external/libcxx/include/memory' line='2175' column='1' hash='a308725e4652f8e6' id='71d0c941'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='55daf9c8' size-in-bits='32' filepath='external/libcxx/include/memory' line='2174' column='1' hash='260eb3c792812fa8' id='01ed4df5'/>
          </member-type>
        </class-decl>
        <class-decl name='__pointer_type&lt;android::IMountService, std::__1::default_delete&lt;android::IMountService&gt; &gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='external/libcxx/include/memory' line='1029' column='1' hash='3c5b14a2312a73a8' id='5c33a3c6'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='782ab327' size-in-bits='32' filepath='external/libcxx/include/memory' line='1031' column='1' hash='3ebd063f5b71295b' id='91be3de9'/>
          </member-type>
        </class-decl>
        <class-decl name='add_lvalue_reference&lt;android::IMountService&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='external/libcxx/include/type_traits' line='1127' column='1' hash='8fce4bb9a2049fb9' id='12435004'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='bb677b9a' size-in-bits='32' filepath='external/libcxx/include/type_traits' line='1128' column='1' hash='258d2074e124a969' id='0f9f0681'/>
          </member-type>
        </class-decl>
        <class-decl name='default_delete&lt;android::IMountService&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='external/libcxx/include/memory' line='2320' column='1' hash='e6cad6dae09d3405' id='e4c905b6'/>
        <class-decl name='basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;' visibility='default' is-declaration-only='yes' id='27619c1c'/>
        <namespace-decl name='__pointer_type_imp'>
          <class-decl name='__pointer_type&lt;android::IMountService, std::__1::default_delete&lt;android::IMountService&gt;, false&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='external/libcxx/include/memory' line='1021' column='1' hash='8b249a4b1cf84f73' id='a5b82b2c'>
            <member-type access='public'>
              <typedef-decl name='type' type-id='9cb9149f' size-in-bits='32' filepath='external/libcxx/include/memory' line='1023' column='1' hash='3ebd063f5b71295b' id='782ab327'/>
            </member-type>
          </class-decl>
        </namespace-decl>
        <typedef-decl name='string' type-id='27619c1c' filepath='external/libcxx/include/iosfwd' line='211' column='1' id='2e84cb7b'/>
      </namespace-decl>
    </namespace-decl>
    <class-decl name='__sFILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='8d7b2c1e'/>
    <typedef-decl name='wctrans_t' type-id='eaa32e2f' filepath='bionic/libc/include/bits/wctype.h' line='60' column='1' id='183c72c3'/>
    <function-decl name='malloc' filepath='bionic/libc/include/malloc.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32' hash='9d519c215ecaff9e'>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='realloc' filepath='bionic/libc/include/malloc.h' line='61' column='1' visibility='default' binding='global' size-in-bits='32' hash='9d519c215ecaff9e'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='free' filepath='bionic/libc/include/malloc.h' line='79' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <typedef-decl name='FILE' type-id='8d7b2c1e' filepath='bionic/libc/include/stdio.h' line='59' column='1' id='aa12d1ba'/>
    <function-decl name='abort' filepath='bionic/libc/include/stdlib.h' line='44' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='strtol' filepath='bionic/libc/include/stdlib.h' line='75' column='1' visibility='default' binding='global' size-in-bits='32' hash='1d7d2becbf03bd8b'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9b23c9ad'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5f'/>
    </function-decl>
    <function-decl name='strtod' filepath='bionic/libc/include/stdlib.h' line='84' column='1' visibility='default' binding='global' size-in-bits='32' hash='72e5c33de920fe38'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9b23c9ad'/>
      <return type-id='a0eb0f08'/>
    </function-decl>
    <function-decl name='strtold' mangled-name='strtod' filepath='bionic/libc/include/stdlib.h' line='85' column='1' visibility='default' binding='global' size-in-bits='32' hash='9b6bc90e0bc98a46'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9b23c9ad'/>
      <return type-id='a0eb0f09'/>
    </function-decl>
    <function-decl name='strerror' filepath='bionic/libc/include/string.h' line='94' column='1' visibility='default' binding='global' size-in-bits='32' hash='e8cfd5aa2f1a6baa'>
      <parameter type-id='95e97e5e'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-type size-in-bits='32' hash='28f93d42079c2801' id='30a82da4'>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type method-class-id='65c10d3d' const='yes' size-in-bits='32' hash='a1f93a033e1719c7' id='7800ddc3'>
      <parameter type-id='a5f3e61a' is-artificial='yes'/>
      <parameter type-id='1a1ddb91'/>
      <return type-id='6e9756f6'/>
    </function-type>
    <function-type method-class-id='65c10d3d' size-in-bits='32' hash='f31d8124ce96fd87' id='ec772de4'>
      <parameter type-id='5a61729d' is-artificial='yes'/>
      <parameter type-id='79927164'/>
      <return type-id='6e9756f6'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='78f6a3cdaf3f98f3' id='4da81c6e'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='0fb6ef930ab1581d' id='3a429a52'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='157d4f95'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='a67a0af5b468a148' id='79e48c45'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='22923b4c'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type method-class-id='bf075117' const='yes' size-in-bits='32' hash='0f2942b388595d26' id='98de5d56'>
      <parameter type-id='e4896a10' is-artificial='yes'/>
      <return type-id='157d4f95'/>
    </function-type>
    <function-type method-class-id='f7c5ae1e' const='yes' size-in-bits='32' hash='0f2942b388595d26' id='3002cd03'>
      <parameter type-id='32d2f295' is-artificial='yes'/>
      <return type-id='157d4f95'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='401cc094f7d8ed35' id='8fcdba47'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='157d4f95'/>
      <return type-id='3ff5601b'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='3b2892980509d689' id='9147daf8'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='763d7e1a'/>
      <return type-id='3ff5601b'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='62d55fb1ee036e3c' id='3f99935b'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='157d4f95'/>
      <return type-id='3ff5601b'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='8c3ecc0de8623f46' id='dcb51357'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='922df12b'/>
      <return type-id='3ff5601b'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='9f208319cc45b066' id='acf1e218'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='4ab96a04'/>
      <return type-id='3ff5601b'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='e226098566fe87fd' id='c9d3f127'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='4ab96a04'/>
      <parameter type-id='4ab96a04'/>
      <return type-id='3ff5601b'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='1640f5b4c846088d' id='ec037fd7'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='922df12b'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='922df12b'/>
      <return type-id='3ff5601b'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='c0aeb1b798922da1' id='a1591e12'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='9aa04798'/>
      <return type-id='3ff5601b'/>
    </function-type>
    <function-type method-class-id='c73fabea' const='yes' size-in-bits='32' hash='9d519c215ecaff9e' id='6fad5765'>
      <parameter type-id='197d55e1' is-artificial='yes'/>
      <return type-id='b59d7dce'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='28f93d42079c2801' id='735b9074'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='7f673cf9a12b7977' id='7392516d'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='990ef79d'/>
      <parameter type-id='922df12b'/>
      <parameter type-id='0c3db078'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='ebbfb0d88bd24f74' id='e38eb461'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='4ab96a04'/>
      <parameter type-id='990ef79d'/>
      <parameter type-id='922df12b'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='033988c26c3eacc1' id='70de3849'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='7743ab4a'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='bfc622881c5696ee' id='b45faa62'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='5f8c324f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='839073eeb99b5999' id='1c886047'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='4ab96a04'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type method-class-id='bf075117' size-in-bits='32' hash='d450a6b77a69de79' id='9954ec52'>
      <parameter type-id='9cb9149f' is-artificial='yes'/>
      <parameter type-id='63e171df' is-artificial='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type method-class-id='f7c5ae1e' size-in-bits='32' hash='28f93d42079c2801' id='facc63b9'>
      <parameter type-id='c70198d4' is-artificial='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type method-class-id='f7c5ae1e' size-in-bits='32' hash='1919c44d971cd13f' id='58e4150d'>
      <parameter type-id='c70198d4' is-artificial='yes'/>
      <parameter type-id='157d4f95'/>
      <parameter type-id='922df12b'/>
      <parameter type-id='922df12b'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type method-class-id='f7c5ae1e' size-in-bits='32' hash='d450a6b77a69de79' id='f09ea7db'>
      <parameter type-id='c70198d4' is-artificial='yes'/>
      <parameter type-id='63e171df' is-artificial='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type method-class-id='65c10d3d' size-in-bits='32' hash='28f93d42079c2801' id='3cf3871e'>
      <parameter type-id='5a61729d' is-artificial='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type method-class-id='65c10d3d' size-in-bits='32' hash='d450a6b77a69de79' id='30b6456c'>
      <parameter type-id='5a61729d' is-artificial='yes'/>
      <parameter type-id='63e171df' is-artificial='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type method-class-id='c73fabea' size-in-bits='32' hash='0f2942b388595d26' id='ea5cd5f9'>
      <parameter type-id='26924198' is-artificial='yes'/>
      <parameter type-id='157d4f95'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='32' path='frameworks/base/libs/storage/IObbActionListener.cpp' language='LANG_C_plus_plus_14'>
    <array-type-def dimensions='1' type-id='801a266d' size-in-bits='608' hash='b33a7056eda8a26b' id='19b37a54'>
      <subrange length='38' lower-bound='0' upper-bound='37' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='7d1550c62dd1a20a' id='aa4ccdac'/>
    </array-type-def>
    <pointer-type-def type-id='b4c0d64f' size-in-bits='32' hash='9f776b62bfb415d1' id='36e31287'/>
    <pointer-type-def type-id='3224f91e' size-in-bits='32' hash='412c205e1b21aa4f' id='e09894a4'/>
    <pointer-type-def type-id='af342359' size-in-bits='32' hash='6c295af9877db9aa' id='e1c45961'/>
    <qualified-type-def type-id='c70198d4' const='yes' hash='9d708ab0837ff00d' id='a48c009f'/>
    <reference-type-def kind='lvalue' type-id='a48c009f' size-in-bits='32' hash='eecd5af27682fd09' id='c165233b'/>
    <reference-type-def kind='lvalue' type-id='c70198d4' size-in-bits='32' hash='90c85182015ca0ae' id='3983c4f6'/>
    <pointer-type-def type-id='6a14bf2f' size-in-bits='32' hash='fe1748048ae5fca5' id='6ec90c77'/>
    <qualified-type-def type-id='f7c5ae1e' const='yes' hash='56cb5d428fcff0df' id='79f4741d'/>
    <pointer-type-def type-id='79f4741d' size-in-bits='32' hash='5198745b0b180253' id='32d2f295'/>
    <qualified-type-def type-id='6a14bf2f' const='yes' hash='f36543eac6a60e8b' id='eae5dbc4'/>
    <reference-type-def kind='lvalue' type-id='eae5dbc4' size-in-bits='32' hash='0b15410a24e5d505' id='a9d924c6'/>
    <qualified-type-def type-id='9a8c82c0' const='yes' hash='377c43f1fdc74e01' id='589f2895'/>
    <pointer-type-def type-id='589f2895' size-in-bits='32' hash='0d52d6af87494167' id='418d24ad'/>
    <qualified-type-def type-id='15f35f71' const='yes' hash='626f4b61ea445fec' id='5d62d332'/>
    <pointer-type-def type-id='5d62d332' size-in-bits='32' hash='68b0c30771818976' id='1a924ec8'/>
    <qualified-type-def type-id='17e76a52' const='yes' hash='9566b08343695f00' id='91a7fe13'/>
    <pointer-type-def type-id='91a7fe13' size-in-bits='32' hash='ba06fbe4cf9ac42e' id='847533bb'/>
    <qualified-type-def type-id='0de0b2fb' const='yes' hash='4c050a30bd7835e9' id='990dfc58'/>
    <reference-type-def kind='lvalue' type-id='990dfc58' size-in-bits='32' hash='ec947f151753314f' id='6f047a5a'/>
    <pointer-type-def type-id='990dfc58' size-in-bits='32' hash='657c7734c5467469' id='63046776'/>
    <qualified-type-def type-id='c722890a' const='yes' hash='50b9c5de7b922aa4' id='3e775081'/>
    <reference-type-def kind='lvalue' type-id='3e775081' size-in-bits='32' hash='29c0a97d164e7f9d' id='fcd3f6e5'/>
    <pointer-type-def type-id='3e775081' size-in-bits='32' hash='a3806b5319800cfc' id='00d3fd31'/>
    <qualified-type-def type-id='4337a511' const='yes' hash='e3dfcfb72e1ddcb2#6' id='fc5a3b89'/>
    <reference-type-def kind='lvalue' type-id='fc5a3b89' size-in-bits='32' hash='768b1e3ba2096387#6' id='f00bf2eb'/>
    <reference-type-def kind='lvalue' type-id='9a8c82c0' size-in-bits='32' hash='f9c1e3d0dda3f05a' id='83c15dea'/>
    <pointer-type-def type-id='9a8c82c0' size-in-bits='32' hash='4691a7739c6da1e2' id='77c14b06'/>
    <pointer-type-def type-id='15f35f71' size-in-bits='32' hash='2feb978547aba747' id='10cb6749'/>
    <pointer-type-def type-id='17e76a52' size-in-bits='32' hash='417d2534a8f7645e' id='1e283db0'/>
    <reference-type-def kind='lvalue' type-id='0de0b2fb' size-in-bits='32' hash='9ecc4938370e2590' id='b43a7bff'/>
    <pointer-type-def type-id='0de0b2fb' size-in-bits='32' hash='e86cd83adc9fbd2d' id='b83a824b'/>
    <reference-type-def kind='lvalue' type-id='c722890a' size-in-bits='32' hash='9cf0514ac2dbba6b' id='cfba356c'/>
    <reference-type-def kind='rvalue' type-id='c722890a' size-in-bits='32' hash='526590fe8f99b81c' id='4c21e37e'/>
    <pointer-type-def type-id='c722890a' size-in-bits='32' hash='b984387fdd261180' id='d3ba3bb8'/>
    <reference-type-def kind='lvalue' type-id='4337a511' size-in-bits='32' hash='9cc027997a70e9c1#6' id='ff242d42'/>
    <pointer-type-def type-id='aa12d1bb' size-in-bits='32' id='822cd80c'/>
    <pointer-type-def type-id='df458ae7' size-in-bits='32' id='621ed18d'/>
    <pointer-type-def type-id='edff7cb4' size-in-bits='32' id='b5a5bc14'/>
    <pointer-type-def type-id='40b6343b' size-in-bits='32' id='6d5a3b79'/>
    <pointer-type-def type-id='b5977877' size-in-bits='32' id='0657c1ff'/>
    <pointer-type-def type-id='a87dbeee' size-in-bits='32' id='ce9e5ae4'/>
    <pointer-type-def type-id='259563fa' size-in-bits='32' id='e7293458'/>
    <qualified-type-def type-id='783cc678' const='yes' id='44c384ef'/>
    <qualified-type-def type-id='8fc19046' const='yes' id='d452635d'/>
    <pointer-type-def type-id='d452635d' size-in-bits='32' id='b4b29455'/>
    <qualified-type-def type-id='63080be8' const='yes' id='75a1230f'/>
    <qualified-type-def type-id='dff69842' const='yes' id='5be53127'/>
    <qualified-type-def type-id='b04db2dd' const='yes' id='00633158'/>
    <qualified-type-def type-id='7bb1d8e1' const='yes' id='0e59eb20'/>
    <qualified-type-def type-id='606d2805' const='yes' id='cbdbf7d2'/>
    <qualified-type-def type-id='359485b5' const='yes' id='53334ee2'/>
    <qualified-type-def type-id='2a92430d' const='yes' id='b80399ca'/>
    <qualified-type-def type-id='23f2d06f' const='yes' id='dcc28adc'/>
    <qualified-type-def type-id='8c662fc5' const='yes' id='4db497f2'/>
    <qualified-type-def type-id='482d220b' const='yes' id='06ffb900'/>
    <qualified-type-def type-id='6ba1fceb' const='yes' id='eb2629cc'/>
    <qualified-type-def type-id='3f8702cf' const='yes' id='37aad5fa'/>
    <qualified-type-def type-id='560c92f7' const='yes' id='12d46c22'/>
    <qualified-type-def type-id='49eccd9d' const='yes' id='f53b94fe'/>
    <qualified-type-def type-id='a3295715' const='yes' id='d73e162a'/>
    <qualified-type-def type-id='2e84cb7c' const='yes' id='17a746bd'/>
    <qualified-type-def type-id='427e4b8a' const='yes' id='1dd04bd9'/>
    <qualified-type-def type-id='82a684ba' const='yes' id='03a9204f'/>
    <qualified-type-def type-id='b54229ce' const='yes' id='e1f2fe13'/>
    <qualified-type-def type-id='ff70dc94' const='yes' id='c508b1b1'/>
    <qualified-type-def type-id='0e839744' const='yes' id='95bfe8d1'/>
    <qualified-type-def type-id='cdd69b5c' const='yes' id='fbb12461'/>
    <qualified-type-def type-id='b9fa8f40' const='yes' id='2533de45'/>
    <qualified-type-def type-id='5417a89c' const='yes' id='8fa83ea9'/>
    <qualified-type-def type-id='2f680da0' const='yes' id='224503c5'/>
    <qualified-type-def type-id='9360eadc' const='yes' id='3e9fa921'/>
    <qualified-type-def type-id='a3eca172' const='yes' id='4f54b247'/>
    <qualified-type-def type-id='444756ca' const='yes' id='4729bdff'/>
    <qualified-type-def type-id='9c9ad7b0' const='yes' id='14d1d5fd'/>
    <qualified-type-def type-id='cab02d1c' const='yes' id='99b40a09'/>
    <qualified-type-def type-id='d5fd3ca7' const='yes' id='8dba978e'/>
    <qualified-type-def type-id='4de8320f' const='yes' id='de6e0290'/>
    <qualified-type-def type-id='45e7b03b' const='yes' id='1733cb18'/>
    <qualified-type-def type-id='aa688d0f' const='yes' id='14b1b7ea'/>
    <qualified-type-def type-id='8e24268f' const='yes' id='3e60ea5a'/>
    <qualified-type-def type-id='9f0bbb87' const='yes' id='330d96aa'/>
    <qualified-type-def type-id='255041c5' const='yes' id='5ae3c360'/>
    <qualified-type-def type-id='3c4ae4e9' const='yes' id='e0150e18'/>
    <qualified-type-def type-id='46767cd5' const='yes' id='d8498116'/>
    <namespace-decl name='android'>
      <class-decl name='BnObbActionListener' visibility='default' size-in-bits='192' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='37' column='1' hash='66f8a8b821475227' id='b4c0d64f'>
        <base-class access='public' layout-offset-in-bits='0' type-id='2144ef38'/>
        <member-function access='public' vtable-offset='6'>
          <function-decl name='onTransact' mangled-name='_ZN7android19BnObbActionListener10onTransactEjRKNS_6ParcelEPS1_j' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='40' column='1' visibility='default' binding='global' size-in-bits='32' hash='c0cdb3c6fb0414b3'>
            <parameter type-id='36e31287' is-artificial='yes'/>
            <parameter type-id='8f92235e'/>
            <parameter type-id='6d925e80'/>
            <parameter type-id='1a1ddb91'/>
            <parameter type-id='8f92235e'/>
            <return type-id='6e9756f6'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='BpInterface&lt;android::IObbActionListener&gt;' visibility='default' size-in-bits='224' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='86' column='1' hash='22acd28f0b262223' id='3224f91e'>
        <base-class access='public' layout-offset-in-bits='0' type-id='f7c5ae1e'/>
        <base-class access='public' layout-offset-in-bits='32' type-id='df458ae7'/>
        <member-function access='protected' vtable-offset='2'>
          <function-decl name='onAsBinder' mangled-name='_ZN7android11BpInterfaceINS_18IObbActionListenerEE10onAsBinderEv' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='93' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='e09894a4' is-artificial='yes'/>
            <return type-id='b5a5bc14'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='BpObbActionListener' visibility='default' size-in-bits='224' filepath='frameworks/base/libs/storage/IObbActionListener.cpp' line='27' column='1' hash='00db99e20a8370c8' id='af342359'>
        <base-class access='public' layout-offset-in-bits='0' type-id='3224f91e'/>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='onObbResult' mangled-name='_ZN7android19BpObbActionListener11onObbResultERKNS_8String16Eii' filepath='frameworks/base/libs/storage/IObbActionListener.cpp' line='33' column='1' visibility='default' binding='global' size-in-bits='32' hash='1919c44d971cd13f'>
            <parameter type-id='e1c45961' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='922df12b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='BpRefBase' visibility='default' is-declaration-only='yes' id='df458ae7'/>
      <class-decl name='IBinder' visibility='default' is-declaration-only='yes' id='edff7cb4'/>
      <class-decl name='IInterface' visibility='default' is-declaration-only='yes' id='40b6343b'/>
      <class-decl name='IPCThreadState' visibility='default' is-declaration-only='yes' id='b5977877'/>
      <class-decl name='Parcelable' visibility='default' size-in-bits='32' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='35' column='1' hash='eae88e16f65c374b' id='f8f7e309'>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~Parcelable' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='37' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~Parcelable' mangled-name='_ZN7android10ParcelableD0Ev' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='37' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~Parcelable' mangled-name='_ZN7android10ParcelableD2Ev' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='37' column='1' visibility='default' binding='global' size-in-bits='32' hash='28f93d42079c2801'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes' vtable-offset='2'>
          <function-decl name='writeToParcel' mangled-name='_ZNK7android10Parcelable13writeToParcelEPNS_6ParcelE' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='47' column='1' visibility='default' binding='global' size-in-bits='32' hash='a1f93a033e1719c7'>
            <parameter type-id='6a9db9a0' is-artificial='yes'/>
            <parameter type-id='1a1ddb91'/>
            <return type-id='6e9756f6'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='readFromParcel' mangled-name='_ZN7android10Parcelable14readFromParcelEPKNS_6ParcelE' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='54' column='1' visibility='default' binding='global' size-in-bits='32' hash='f31d8124ce96fd87'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <parameter type-id='79927164'/>
            <return type-id='6e9756f6'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes' vtable-offset='4'>
          <function-decl name='isStable' mangled-name='_ZNK7android10Parcelable8isStableEv' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='60' column='1' visibility='default' binding='global' size-in-bits='32' hash='78f6a3cdaf3f98f3'>
            <parameter type-id='6a9db9a0' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='TextOutput' visibility='default' is-declaration-only='yes' id='32215dca'/>
      <namespace-decl name='base'>
        <typedef-decl name='unique_fd' type-id='bd6f4e31' size-in-bits='32' filepath='system/libbase/include/android-base/unique_fd.h' line='178' column='1' id='ca770154'/>
      </namespace-decl>
      <class-decl name='flat_binder_object' is-struct='yes' visibility='default' is-declaration-only='yes' id='8fc19046'/>
    </namespace-decl>
    <namespace-decl name='std'>
      <namespace-decl name='__1'>
        <class-decl name='__compressed_pair&lt;android::IObbActionListener *, std::__1::default_delete&lt;android::IObbActionListener&gt; &gt;' visibility='default' size-in-bits='32' filepath='external/libcxx/include/memory' line='2211' column='1' hash='77e60eab77d2f8ab' id='9a8c82c0'>
          <base-class access='private' layout-offset-in-bits='0' type-id='15f35f71'/>
          <base-class access='private' layout-offset-in-bits='0' type-id='17e76a52'/>
        </class-decl>
        <class-decl name='unique_ptr&lt;android::IObbActionListener, std::__1::default_delete&lt;android::IObbActionListener&gt; &gt;' visibility='default' size-in-bits='32' filepath='external/libcxx/include/memory' line='2401' column='1' hash='01dd7a25e6f404ab' id='c722890a'>
          <member-type access='private'>
            <typedef-decl name='deleter_type' type-id='0de0b2fb' size-in-bits='8' filepath='external/libcxx/include/memory' line='2404' column='1' id='4337a511'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='3ac420f3' size-in-bits='32' filepath='external/libcxx/include/memory' line='2405' column='1' hash='88d73b1acd44a67f' id='670db6be'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__ptr_' type-id='9a8c82c0' visibility='default' filepath='external/libcxx/include/memory' line='2411' column='1'/>
          </data-member>
        </class-decl>
        <class-decl name='__add_lvalue_reference_impl&lt;android::IObbActionListener, true&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='external/libcxx/include/type_traits' line='1125' column='1' hash='0923826da3ef0df1' id='9ce38486'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='bb0185f0' size-in-bits='32' filepath='external/libcxx/include/type_traits' line='1125' column='1' hash='1267d3592ce73b17' id='608b97af'/>
          </member-type>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;android::IObbActionListener *, 0, false&gt;' is-struct='yes' visibility='default' size-in-bits='32' filepath='external/libcxx/include/memory' line='2134' column='1' hash='f359093e77e5207a' id='15f35f71'>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='c165233b' size-in-bits='32' filepath='external/libcxx/include/memory' line='2137' column='1' hash='eecd5af27682fd09' id='6df490d3'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='3983c4f6' size-in-bits='32' filepath='external/libcxx/include/memory' line='2136' column='1' hash='90c85182015ca0ae' id='43aaeec3'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__value_' type-id='c70198d4' visibility='default' filepath='external/libcxx/include/memory' line='2168' column='1'/>
          </data-member>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;std::__1::default_delete&lt;android::IObbActionListener&gt;, 1, true&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='external/libcxx/include/memory' line='2172' column='1' hash='396afa6904d9fe2f' id='17e76a52'>
          <base-class access='private' layout-offset-in-bits='0' type-id='0de0b2fb'/>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='6f047a5a' size-in-bits='32' filepath='external/libcxx/include/memory' line='2175' column='1' hash='ec947f151753314f' id='d750daf8'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='b43a7bff' size-in-bits='32' filepath='external/libcxx/include/memory' line='2174' column='1' hash='9ecc4938370e2590' id='f7172ed8'/>
          </member-type>
        </class-decl>
        <class-decl name='__pointer_type&lt;android::IObbActionListener, std::__1::default_delete&lt;android::IObbActionListener&gt; &gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='external/libcxx/include/memory' line='1029' column='1' hash='4b73f220fa48eec9' id='4ef6f3a4'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='1e232805' size-in-bits='32' filepath='external/libcxx/include/memory' line='1031' column='1' hash='88d73b1acd44a67f' id='3ac420f3'/>
          </member-type>
        </class-decl>
        <class-decl name='add_lvalue_reference&lt;android::IObbActionListener&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='external/libcxx/include/type_traits' line='1127' column='1' hash='740158bc83bf800a' id='12c60191'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='608b97af' size-in-bits='32' filepath='external/libcxx/include/type_traits' line='1128' column='1' hash='1267d3592ce73b17' id='6f181d72'/>
          </member-type>
        </class-decl>
        <class-decl name='default_delete&lt;android::IObbActionListener&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='external/libcxx/include/memory' line='2320' column='1' hash='f9ab39cc2403a9f6' id='0de0b2fb'/>
        <class-decl name='basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;' visibility='default' is-declaration-only='yes' id='27619c1d'/>
        <class-decl name='optional&lt;android::String16&gt;' visibility='default' is-declaration-only='yes' id='63080be8'/>
        <class-decl name='optional&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='dff69842'/>
        <class-decl name='optional&lt;std::__1::vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='b04db2dd'/>
        <class-decl name='optional&lt;std::__1::vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='7bb1d8e1'/>
        <class-decl name='optional&lt;std::__1::vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='606d2805'/>
        <class-decl name='optional&lt;std::__1::vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='359485b5'/>
        <class-decl name='optional&lt;std::__1::vector&lt;double, std::__1::allocator&lt;double&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='2a92430d'/>
        <class-decl name='optional&lt;std::__1::vector&lt;float, std::__1::allocator&lt;float&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='23f2d06f'/>
        <class-decl name='optional&lt;std::__1::vector&lt;int, std::__1::allocator&lt;int&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='8c662fc5'/>
        <class-decl name='optional&lt;std::__1::vector&lt;long long, std::__1::allocator&lt;long long&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='482d220b'/>
        <class-decl name='optional&lt;std::__1::vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='6ba1fceb'/>
        <class-decl name='optional&lt;std::__1::vector&lt;std::__1::optional&lt;android::String16&gt;, std::__1::allocator&lt;std::__1::optional&lt;android::String16&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='3f8702cf'/>
        <class-decl name='optional&lt;std::__1::vector&lt;std::__1::optional&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt;, std::__1::allocator&lt;std::__1::optional&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='560c92f7'/>
        <class-decl name='optional&lt;std::__1::vector&lt;unsigned char, std::__1::allocator&lt;unsigned char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='49eccd9d'/>
        <class-decl name='optional&lt;std::__1::vector&lt;unsigned long long, std::__1::allocator&lt;unsigned long long&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='a3295715'/>
        <class-decl name='unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt;' visibility='default' is-declaration-only='yes' id='427e4b8a'/>
        <class-decl name='unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' size-in-bits='32' filepath='external/libcxx/include/memory' line='2401' column='1' hash='18003c3011d9cdfc' id='ee11ffd6'>
          <member-type access='private'>
            <typedef-decl name='deleter_type' type-id='523e1257' size-in-bits='8' filepath='external/libcxx/include/memory' line='2404' column='1' id='87233a23'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='538091a9' size-in-bits='32' filepath='external/libcxx/include/memory' line='2405' column='1' id='0136fab8'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__ptr_' type-id='dc8bc990' visibility='default' filepath='external/libcxx/include/memory' line='2411' column='1'/>
          </data-member>
        </class-decl>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='82a684ba'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='b54229ce'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='ff70dc94'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='0e839744'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;double, std::__1::allocator&lt;double&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;double, std::__1::allocator&lt;double&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='cdd69b5c'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;float, std::__1::allocator&lt;float&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;float, std::__1::allocator&lt;float&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='b9fa8f40'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;int, std::__1::allocator&lt;int&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;int, std::__1::allocator&lt;int&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='5417a89c'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;long long, std::__1::allocator&lt;long long&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;long long, std::__1::allocator&lt;long long&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='2f680da0'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='9360eadc'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='a3eca172'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='444756ca'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;unsigned char, std::__1::allocator&lt;unsigned char&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;unsigned char, std::__1::allocator&lt;unsigned char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='9c9ad7b0'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;unsigned long long, std::__1::allocator&lt;unsigned long long&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;unsigned long long, std::__1::allocator&lt;unsigned long long&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='cab02d1c'/>
        <class-decl name='vector&lt;android::String16, std::__1::allocator&lt;android::String16&gt; &gt;' visibility='default' is-declaration-only='yes' id='d5fd3ca7'/>
        <class-decl name='vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='4de8320f'/>
        <class-decl name='vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='45e7b03b'/>
        <class-decl name='vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt;' visibility='default' is-declaration-only='yes' id='aa688d0f'/>
        <class-decl name='vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt;' visibility='default' is-declaration-only='yes' id='8e24268f'/>
        <class-decl name='vector&lt;double, std::__1::allocator&lt;double&gt; &gt;' visibility='default' is-declaration-only='yes' id='9f0bbb87'/>
        <class-decl name='vector&lt;float, std::__1::allocator&lt;float&gt; &gt;' visibility='default' is-declaration-only='yes' id='255041c5'/>
        <class-decl name='vector&lt;int, std::__1::allocator&lt;int&gt; &gt;' visibility='default' size-in-bits='96' filepath='external/libcxx/include/vector' line='470' column='1' hash='189111e72ed7823d' id='21156a1f'>
          <base-class access='private' layout-offset-in-bits='0' type-id='ccc1a701'/>
          <member-type access='private'>
            <typedef-decl name='allocator_type' type-id='fe392671' size-in-bits='8' filepath='external/libcxx/include/vector' line='479' column='1' id='56f28cc0'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_pointer' type-id='ccad1293' size-in-bits='32' filepath='external/libcxx/include/vector' line='486' column='1' hash='ef757f31dcad8445' id='eab552d7'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reference' type-id='0ed56687' size-in-bits='32' filepath='external/libcxx/include/vector' line='482' column='1' hash='c7887eaeb279961f' id='a9e34b1b'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='73ca7213' size-in-bits='32' filepath='external/libcxx/include/vector' line='485' column='1' hash='e51b662ac2a28f93' id='ca253657'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='58649207' size-in-bits='32' filepath='external/libcxx/include/vector' line='481' column='1' hash='cdff542d0f812be1' id='68329a9b'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='size_type' type-id='4519a764' size-in-bits='32' filepath='external/libcxx/include/vector' line='483' column='1' hash='e66b43f97c38e87a' id='c7871c78'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='95e97e5e' size-in-bits='32' filepath='external/libcxx/include/vector' line='478' column='1' hash='09d17c08f594edc7' id='21d18d18'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_iterator' type-id='27a9a4b2' filepath='external/libcxx/include/vector' line='488' column='1' id='83e002e4'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reverse_iterator' type-id='d9249d9b' filepath='external/libcxx/include/vector' line='490' column='1' id='2564d967'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='iterator' type-id='a55d0f63' filepath='external/libcxx/include/vector' line='487' column='1' id='c1032564'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reverse_iterator' type-id='f6e567a6' filepath='external/libcxx/include/vector' line='489' column='1' id='a339cbe7'/>
          </member-type>
        </class-decl>
        <class-decl name='vector&lt;long long, std::__1::allocator&lt;long long&gt; &gt;' visibility='default' size-in-bits='96' filepath='external/libcxx/include/vector' line='470' column='1' hash='d104a4797e60f2db' id='1e253049'>
          <base-class access='private' layout-offset-in-bits='0' type-id='721e3983'/>
          <member-type access='private'>
            <typedef-decl name='allocator_type' type-id='f4b76f72' size-in-bits='8' filepath='external/libcxx/include/vector' line='479' column='1' id='3b3f6d46'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_pointer' type-id='0518e5f1' size-in-bits='32' filepath='external/libcxx/include/vector' line='486' column='1' hash='aa94fdaca09f7333' id='d986b775'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reference' type-id='cc0c668d' size-in-bits='32' filepath='external/libcxx/include/vector' line='482' column='1' hash='14e56267565252b6' id='5d912f41'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='2a5e9835' size-in-bits='32' filepath='external/libcxx/include/vector' line='485' column='1' hash='f1187c111f8fe0d4' id='81c398b9'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='959ee201' size-in-bits='32' filepath='external/libcxx/include/vector' line='481' column='1' hash='f94c286a02f44cfa' id='642663f5'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='size_type' type-id='f3dbad4e' size-in-bits='32' filepath='external/libcxx/include/vector' line='483' column='1' hash='e66b43f97c38e87a' id='48b8e292'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='95e97e60' size-in-bits='64' filepath='external/libcxx/include/vector' line='478' column='1' hash='5ae7f9eec1fc43d6' id='7f6e0a92'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_iterator' type-id='2d3a5701' filepath='external/libcxx/include/vector' line='488' column='1' id='9aea7a46'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reverse_iterator' type-id='0a83870c' filepath='external/libcxx/include/vector' line='490' column='1' id='0d624ef5'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='iterator' type-id='efded478' filepath='external/libcxx/include/vector' line='487' column='1' id='99bfba62'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reverse_iterator' type-id='bab30871' filepath='external/libcxx/include/vector' line='489' column='1' id='a8d2cb89'/>
          </member-type>
        </class-decl>
        <class-decl name='vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt;' visibility='default' is-declaration-only='yes' id='3c4ae4e9'/>
        <class-decl name='vector&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::allocator&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='46767cd5'/>
        <class-decl name='vector&lt;unsigned char, std::__1::allocator&lt;unsigned char&gt; &gt;' visibility='default' size-in-bits='96' filepath='external/libcxx/include/vector' line='470' column='1' hash='9a42af590966c081' id='b05cdcb7'>
          <base-class access='private' layout-offset-in-bits='0' type-id='d5b8afe1'/>
          <member-type access='private'>
            <typedef-decl name='allocator_type' type-id='28ac9f25' size-in-bits='8' filepath='external/libcxx/include/vector' line='479' column='1' id='61c54ac4'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_pointer' type-id='413a012f' size-in-bits='32' filepath='external/libcxx/include/vector' line='486' column='1' hash='a08d47b345bf64aa' id='9da97f83'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reference' type-id='8b583b33' size-in-bits='32' filepath='external/libcxx/include/vector' line='482' column='1' hash='69d16db03af4d9b5' id='b7731497'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='c59bbd7f' size-in-bits='32' filepath='external/libcxx/include/vector' line='485' column='1' hash='3de15ce4de5e6fc6' id='628edda3'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='35ba8be3' size-in-bits='32' filepath='external/libcxx/include/vector' line='481' column='1' hash='6ce9e571b8c35900' id='374cd9b7'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='size_type' type-id='26dd3530' size-in-bits='32' filepath='external/libcxx/include/vector' line='483' column='1' hash='e66b43f97c38e87a' id='d5277a54'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='002ac4a6' size-in-bits='8' filepath='external/libcxx/include/vector' line='478' column='1' hash='6ebac62b3366db68' id='58b97fd4'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_iterator' type-id='5ec92c0a' filepath='external/libcxx/include/vector' line='488' column='1' id='35ddcf48'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_iterator' type-id='5ec92c0b' filepath='external/libcxx/include/vector' line='488' column='1' id='35ddcf49'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reverse_iterator' type-id='5f2bceeb' filepath='external/libcxx/include/vector' line='490' column='1' id='88519a53'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reverse_iterator' type-id='5f2bceec' filepath='external/libcxx/include/vector' line='490' column='1' id='88519a54'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='iterator' type-id='68fdf037' filepath='external/libcxx/include/vector' line='487' column='1' id='b239ece8'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='iterator' type-id='68fdf038' filepath='external/libcxx/include/vector' line='487' column='1' id='b239ece9'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reverse_iterator' type-id='b0b63972' filepath='external/libcxx/include/vector' line='489' column='1' id='ef32aa33'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reverse_iterator' type-id='b0b63973' filepath='external/libcxx/include/vector' line='489' column='1' id='ef32aa34'/>
          </member-type>
        </class-decl>
        <class-decl name='vector&lt;unsigned long long, std::__1::allocator&lt;unsigned long long&gt; &gt;' visibility='default' size-in-bits='96' filepath='external/libcxx/include/vector' line='470' column='1' hash='e1bc81a7ad44aad9' id='2d13208f'>
          <base-class access='private' layout-offset-in-bits='0' type-id='fd1a2199'/>
          <member-type access='private'>
            <typedef-decl name='allocator_type' type-id='d83d0edf' size-in-bits='8' filepath='external/libcxx/include/vector' line='479' column='1' id='c8801c48'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_pointer' type-id='89bd90bb' size-in-bits='32' filepath='external/libcxx/include/vector' line='486' column='1' hash='201e3bbd9a2fbb8a' id='ca75396f'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reference' type-id='9ea2182f' size-in-bits='32' filepath='external/libcxx/include/vector' line='482' column='1' hash='6510d8e54593f930' id='d662e673'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='bae2992b' size-in-bits='32' filepath='external/libcxx/include/vector' line='485' column='1' hash='4205c85b1e765dae' id='29f224bf'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='3796997f' size-in-bits='32' filepath='external/libcxx/include/vector' line='481' column='1' hash='1c986c77a5f160f9' id='d7aaab23'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='size_type' type-id='5f167a8c' size-in-bits='32' filepath='external/libcxx/include/vector' line='483' column='1' hash='e66b43f97c38e87a' id='02ffc270'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='f0981eeb' size-in-bits='64' filepath='external/libcxx/include/vector' line='478' column='1' hash='ebdfc4685a1e82df' id='b4e634f0'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_iterator' type-id='82d2f516' filepath='external/libcxx/include/vector' line='488' column='1' id='1a75b53c'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reverse_iterator' type-id='8ae647e9' filepath='external/libcxx/include/vector' line='490' column='1' id='5bd8044f'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='iterator' type-id='998e238d' filepath='external/libcxx/include/vector' line='487' column='1' id='81f2f90c'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reverse_iterator' type-id='83076282' filepath='external/libcxx/include/vector' line='489' column='1' id='c7ab0ebf'/>
          </member-type>
        </class-decl>
        <namespace-decl name='__pointer_type_imp'>
          <class-decl name='__pointer_type&lt;android::IObbActionListener, std::__1::default_delete&lt;android::IObbActionListener&gt;, false&gt;' is-struct='yes' visibility='default' size-in-bits='8' filepath='external/libcxx/include/memory' line='1021' column='1' hash='ea34ef1b31535808' id='123fea2e'>
            <member-type access='public'>
              <typedef-decl name='type' type-id='c70198d4' size-in-bits='32' filepath='external/libcxx/include/memory' line='1023' column='1' hash='88d73b1acd44a67f' id='1e232805'/>
            </member-type>
          </class-decl>
        </namespace-decl>
        <typedef-decl name='string' type-id='27619c1d' filepath='external/libcxx/include/iosfwd' line='211' column='1' id='2e84cb7c'/>
      </namespace-decl>
    </namespace-decl>
    <pointer-type-def type-id='63080be8' size-in-bits='32' id='82a8162e'/>
    <pointer-type-def type-id='dff69842' size-in-bits='32' id='b83994e0'/>
    <pointer-type-def type-id='b04db2dd' size-in-bits='32' id='1465dabd'/>
    <pointer-type-def type-id='7bb1d8e1' size-in-bits='32' id='adb8b339'/>
    <pointer-type-def type-id='606d2805' size-in-bits='32' id='0cc07935'/>
    <pointer-type-def type-id='359485b5' size-in-bits='32' id='a499e5c5'/>
    <pointer-type-def type-id='2a92430d' size-in-bits='32' id='4ed8b0dd'/>
    <pointer-type-def type-id='23f2d06f' size-in-bits='32' id='6ae37fb7'/>
    <pointer-type-def type-id='8c662fc5' size-in-bits='32' id='2fde1255'/>
    <pointer-type-def type-id='482d220b' size-in-bits='32' id='47d1f2cb'/>
    <pointer-type-def type-id='6ba1fceb' size-in-bits='32' id='0d40426b'/>
    <pointer-type-def type-id='3f8702cf' size-in-bits='32' id='8ca5b7e7'/>
    <pointer-type-def type-id='560c92f7' size-in-bits='32' id='be42202f'/>
    <pointer-type-def type-id='49eccd9d' size-in-bits='32' id='37ed344d'/>
    <pointer-type-def type-id='a3295715' size-in-bits='32' id='307ae6a5'/>
    <pointer-type-def type-id='2e84cb7c' size-in-bits='32' id='77721b56'/>
    <pointer-type-def type-id='427e4b8a' size-in-bits='32' id='f79cba78'/>
    <pointer-type-def type-id='82a684ba' size-in-bits='32' id='21b84758'/>
    <pointer-type-def type-id='b54229ce' size-in-bits='32' id='2cc2a2b4'/>
    <pointer-type-def type-id='ff70dc94' size-in-bits='32' id='fbd34862'/>
    <pointer-type-def type-id='0e839744' size-in-bits='32' id='d32daf72'/>
    <pointer-type-def type-id='cdd69b5c' size-in-bits='32' id='a1bcde0a'/>
    <pointer-type-def type-id='b9fa8f40' size-in-bits='32' id='38ec2026'/>
    <pointer-type-def type-id='5417a89c' size-in-bits='32' id='f0e86b2a'/>
    <pointer-type-def type-id='2f680da0' size-in-bits='32' id='efee7846'/>
    <pointer-type-def type-id='9360eadc' size-in-bits='32' id='719a934a'/>
    <pointer-type-def type-id='a3eca172' size-in-bits='32' id='46ab91d0'/>
    <pointer-type-def type-id='444756ca' size-in-bits='32' id='56fab488'/>
    <pointer-type-def type-id='9c9ad7b0' size-in-bits='32' id='f160fb56'/>
    <pointer-type-def type-id='cab02d1c' size-in-bits='32' id='bd7ee60a'/>
    <pointer-type-def type-id='d5fd3ca7' size-in-bits='32' id='35865e6f'/>
    <pointer-type-def type-id='4de8320f' size-in-bits='32' id='82ceaaa7'/>
    <pointer-type-def type-id='45e7b03b' size-in-bits='32' id='40eba30b'/>
    <pointer-type-def type-id='aa688d0f' size-in-bits='32' id='4dcecd77'/>
    <pointer-type-def type-id='8e24268f' size-in-bits='32' id='763f4b97'/>
    <pointer-type-def type-id='9f0bbb87' size-in-bits='32' id='f84d584f'/>
    <pointer-type-def type-id='255041c5' size-in-bits='32' id='afa37b15'/>
    <pointer-type-def type-id='3c4ae4e9' size-in-bits='32' id='892d0ff1'/>
    <pointer-type-def type-id='46767cd5' size-in-bits='32' id='9d474d15'/>
    <class-decl name='__sFILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='8d7b2c1f'/>
    <class-decl name='native_handle' is-struct='yes' visibility='default' size-in-bits='96' filepath='system/core/libcutils/include/cutils/native_handle.h' line='34' column='1' hash='ef15da297b06eb78' id='3181ea79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='95e97e5e' visibility='default' filepath='system/core/libcutils/include/cutils/native_handle.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='numFds' type-id='95e97e5e' visibility='default' filepath='system/core/libcutils/include/cutils/native_handle.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='numInts' type-id='95e97e5e' visibility='default' filepath='system/core/libcutils/include/cutils/native_handle.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='data' type-id='1fdc7fa6' visibility='default' filepath='system/core/libcutils/include/cutils/native_handle.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wctrans_t' type-id='eaa32e2f' filepath='bionic/libc/include/bits/wctype.h' line='60' column='1' id='183c72c4'/>
    <typedef-decl name='FILE' type-id='8d7b2c1f' filepath='bionic/libc/include/stdio.h' line='59' column='1' id='aa12d1bb'/>
    <function-type method-class-id='b4c0d64f' size-in-bits='32' hash='c0cdb3c6fb0414b3' id='5916a086'>
      <parameter type-id='36e31287' is-artificial='yes'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='6d925e80'/>
      <parameter type-id='1a1ddb91'/>
      <parameter type-id='8f92235e'/>
      <return type-id='6e9756f6'/>
    </function-type>
    <function-type method-class-id='f8f7e309' const='yes' size-in-bits='32' hash='a1f93a033e1719c7' id='a2b8ed4f'>
      <parameter type-id='6a9db9a0' is-artificial='yes'/>
      <parameter type-id='1a1ddb91'/>
      <return type-id='6e9756f6'/>
    </function-type>
    <function-type method-class-id='f8f7e309' size-in-bits='32' hash='f31d8124ce96fd87' id='1546df38'>
      <parameter type-id='f7891b51' is-artificial='yes'/>
      <parameter type-id='79927164'/>
      <return type-id='6e9756f6'/>
    </function-type>
    <function-type method-class-id='f8f7e309' const='yes' size-in-bits='32' hash='78f6a3cdaf3f98f3' id='ff801c86'>
      <parameter type-id='6a9db9a0' is-artificial='yes'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type method-class-id='f8f7e309' size-in-bits='32' hash='28f93d42079c2801' id='e4473514'>
      <parameter type-id='f7891b51' is-artificial='yes'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='32' path='frameworks/base/libs/storage/ObbInfo.cpp' language='LANG_C_plus_plus_14'>
    <qualified-type-def type-id='65c10d3d' const='yes' hash='b5b27a65e7a683ea' id='dda33994'/>
    <pointer-type-def type-id='dda33994' size-in-bits='32' hash='c4c36d0300fc2853' id='a5f3e61a'/>
    <pointer-type-def type-id='aa12d1bc' size-in-bits='32' id='822cd80d'/>
    <pointer-type-def type-id='edff7cb5' size-in-bits='32' id='b5a5bc15'/>
    <pointer-type-def type-id='b5977878' size-in-bits='32' id='0657c200'/>
    <pointer-type-def type-id='a87dbeee' size-in-bits='32' id='ce9e5ae5'/>
    <pointer-type-def type-id='259563fa' size-in-bits='32' id='e7293459'/>
    <qualified-type-def type-id='783cc678' const='yes' id='44c384f0'/>
    <qualified-type-def type-id='8fc19047' const='yes' id='d452635e'/>
    <pointer-type-def type-id='d452635e' size-in-bits='32' id='b4b29456'/>
    <qualified-type-def type-id='63080be9' const='yes' id='75a12310'/>
    <qualified-type-def type-id='dff69843' const='yes' id='5be53128'/>
    <qualified-type-def type-id='b04db2de' const='yes' id='00633159'/>
    <qualified-type-def type-id='7bb1d8e2' const='yes' id='0e59eb21'/>
    <qualified-type-def type-id='606d2806' const='yes' id='cbdbf7d3'/>
    <qualified-type-def type-id='359485b6' const='yes' id='53334ee3'/>
    <qualified-type-def type-id='2a92430e' const='yes' id='b80399cb'/>
    <qualified-type-def type-id='23f2d070' const='yes' id='dcc28add'/>
    <qualified-type-def type-id='8c662fc6' const='yes' id='4db497f3'/>
    <qualified-type-def type-id='482d220c' const='yes' id='06ffb901'/>
    <qualified-type-def type-id='6ba1fcec' const='yes' id='eb2629cd'/>
    <qualified-type-def type-id='3f8702d0' const='yes' id='37aad5fb'/>
    <qualified-type-def type-id='560c92f8' const='yes' id='12d46c23'/>
    <qualified-type-def type-id='49eccd9e' const='yes' id='f53b94ff'/>
    <qualified-type-def type-id='a3295716' const='yes' id='d73e162b'/>
    <qualified-type-def type-id='2e84cb7d' const='yes' id='17a746be'/>
    <qualified-type-def type-id='427e4b8b' const='yes' id='1dd04bda'/>
    <qualified-type-def type-id='82a684bb' const='yes' id='03a92050'/>
    <qualified-type-def type-id='b54229cf' const='yes' id='e1f2fe14'/>
    <qualified-type-def type-id='ff70dc95' const='yes' id='c508b1b2'/>
    <qualified-type-def type-id='0e839745' const='yes' id='95bfe8d2'/>
    <qualified-type-def type-id='cdd69b5d' const='yes' id='fbb12462'/>
    <qualified-type-def type-id='b9fa8f41' const='yes' id='2533de46'/>
    <qualified-type-def type-id='5417a89d' const='yes' id='8fa83eaa'/>
    <qualified-type-def type-id='2f680da1' const='yes' id='224503c6'/>
    <qualified-type-def type-id='9360eadd' const='yes' id='3e9fa922'/>
    <qualified-type-def type-id='a3eca173' const='yes' id='4f54b248'/>
    <qualified-type-def type-id='444756cb' const='yes' id='4729be00'/>
    <qualified-type-def type-id='9c9ad7b1' const='yes' id='14d1d5fe'/>
    <qualified-type-def type-id='cab02d1d' const='yes' id='99b40a0a'/>
    <qualified-type-def type-id='d5fd3ca8' const='yes' id='8dba978f'/>
    <qualified-type-def type-id='4de83210' const='yes' id='de6e0291'/>
    <qualified-type-def type-id='45e7b03c' const='yes' id='1733cb19'/>
    <qualified-type-def type-id='aa688d10' const='yes' id='14b1b7eb'/>
    <qualified-type-def type-id='8e242690' const='yes' id='3e60ea5b'/>
    <qualified-type-def type-id='9f0bbb88' const='yes' id='330d96ab'/>
    <qualified-type-def type-id='255041c6' const='yes' id='5ae3c361'/>
    <qualified-type-def type-id='3c4ae4ea' const='yes' id='e0150e19'/>
    <qualified-type-def type-id='46767cd6' const='yes' id='d8498117'/>
    <namespace-decl name='android'>
      <class-decl name='IBinder' visibility='default' is-declaration-only='yes' id='edff7cb5'/>
      <class-decl name='IPCThreadState' visibility='default' is-declaration-only='yes' id='b5977878'/>
      <class-decl name='TextOutput' visibility='default' is-declaration-only='yes' id='32215dcb'/>
      <namespace-decl name='base'>
      </namespace-decl>
      <class-decl name='flat_binder_object' is-struct='yes' visibility='default' is-declaration-only='yes' id='8fc19047'/>
    </namespace-decl>
    <namespace-decl name='std'>
      <namespace-decl name='__1'>
        <class-decl name='basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;' visibility='default' is-declaration-only='yes' id='27619c1e'/>
        <class-decl name='optional&lt;android::String16&gt;' visibility='default' is-declaration-only='yes' id='63080be9'/>
        <class-decl name='optional&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='dff69843'/>
        <class-decl name='optional&lt;std::__1::vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='b04db2de'/>
        <class-decl name='optional&lt;std::__1::vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='7bb1d8e2'/>
        <class-decl name='optional&lt;std::__1::vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='606d2806'/>
        <class-decl name='optional&lt;std::__1::vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='359485b6'/>
        <class-decl name='optional&lt;std::__1::vector&lt;double, std::__1::allocator&lt;double&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='2a92430e'/>
        <class-decl name='optional&lt;std::__1::vector&lt;float, std::__1::allocator&lt;float&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='23f2d070'/>
        <class-decl name='optional&lt;std::__1::vector&lt;int, std::__1::allocator&lt;int&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='8c662fc6'/>
        <class-decl name='optional&lt;std::__1::vector&lt;long long, std::__1::allocator&lt;long long&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='482d220c'/>
        <class-decl name='optional&lt;std::__1::vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='6ba1fcec'/>
        <class-decl name='optional&lt;std::__1::vector&lt;std::__1::optional&lt;android::String16&gt;, std::__1::allocator&lt;std::__1::optional&lt;android::String16&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='3f8702d0'/>
        <class-decl name='optional&lt;std::__1::vector&lt;std::__1::optional&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt;, std::__1::allocator&lt;std::__1::optional&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='560c92f8'/>
        <class-decl name='optional&lt;std::__1::vector&lt;unsigned char, std::__1::allocator&lt;unsigned char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='49eccd9e'/>
        <class-decl name='optional&lt;std::__1::vector&lt;unsigned long long, std::__1::allocator&lt;unsigned long long&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='a3295716'/>
        <class-decl name='unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt;' visibility='default' is-declaration-only='yes' id='427e4b8b'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='82a684bb'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='b54229cf'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='ff70dc95'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='0e839745'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;double, std::__1::allocator&lt;double&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;double, std::__1::allocator&lt;double&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='cdd69b5d'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;float, std::__1::allocator&lt;float&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;float, std::__1::allocator&lt;float&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='b9fa8f41'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;int, std::__1::allocator&lt;int&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;int, std::__1::allocator&lt;int&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='5417a89d'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;long long, std::__1::allocator&lt;long long&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;long long, std::__1::allocator&lt;long long&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='2f680da1'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='9360eadd'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='a3eca173'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='444756cb'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;unsigned char, std::__1::allocator&lt;unsigned char&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;unsigned char, std::__1::allocator&lt;unsigned char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='9c9ad7b1'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;unsigned long long, std::__1::allocator&lt;unsigned long long&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;unsigned long long, std::__1::allocator&lt;unsigned long long&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='cab02d1d'/>
        <class-decl name='vector&lt;android::String16, std::__1::allocator&lt;android::String16&gt; &gt;' visibility='default' is-declaration-only='yes' id='d5fd3ca8'/>
        <class-decl name='vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='4de83210'/>
        <class-decl name='vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='45e7b03c'/>
        <class-decl name='vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt;' visibility='default' is-declaration-only='yes' id='aa688d10'/>
        <class-decl name='vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt;' visibility='default' is-declaration-only='yes' id='8e242690'/>
        <class-decl name='vector&lt;double, std::__1::allocator&lt;double&gt; &gt;' visibility='default' is-declaration-only='yes' id='9f0bbb88'/>
        <class-decl name='vector&lt;float, std::__1::allocator&lt;float&gt; &gt;' visibility='default' is-declaration-only='yes' id='255041c6'/>
        <class-decl name='vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt;' visibility='default' is-declaration-only='yes' id='3c4ae4ea'/>
        <class-decl name='vector&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::allocator&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='46767cd6'/>
        <typedef-decl name='string' type-id='27619c1e' filepath='external/libcxx/include/iosfwd' line='211' column='1' id='2e84cb7d'/>
      </namespace-decl>
    </namespace-decl>
    <pointer-type-def type-id='63080be9' size-in-bits='32' id='82a8162f'/>
    <pointer-type-def type-id='dff69843' size-in-bits='32' id='b83994e1'/>
    <pointer-type-def type-id='b04db2de' size-in-bits='32' id='1465dabe'/>
    <pointer-type-def type-id='7bb1d8e2' size-in-bits='32' id='adb8b33a'/>
    <pointer-type-def type-id='606d2806' size-in-bits='32' id='0cc07936'/>
    <pointer-type-def type-id='359485b6' size-in-bits='32' id='a499e5c6'/>
    <pointer-type-def type-id='2a92430e' size-in-bits='32' id='4ed8b0de'/>
    <pointer-type-def type-id='23f2d070' size-in-bits='32' id='6ae37fb8'/>
    <pointer-type-def type-id='8c662fc6' size-in-bits='32' id='2fde1256'/>
    <pointer-type-def type-id='482d220c' size-in-bits='32' id='47d1f2cc'/>
    <pointer-type-def type-id='6ba1fcec' size-in-bits='32' id='0d40426c'/>
    <pointer-type-def type-id='3f8702d0' size-in-bits='32' id='8ca5b7e8'/>
    <pointer-type-def type-id='560c92f8' size-in-bits='32' id='be422030'/>
    <pointer-type-def type-id='49eccd9e' size-in-bits='32' id='37ed344e'/>
    <pointer-type-def type-id='a3295716' size-in-bits='32' id='307ae6a6'/>
    <pointer-type-def type-id='2e84cb7d' size-in-bits='32' id='77721b57'/>
    <pointer-type-def type-id='427e4b8b' size-in-bits='32' id='f79cba79'/>
    <pointer-type-def type-id='82a684bb' size-in-bits='32' id='21b84759'/>
    <pointer-type-def type-id='b54229cf' size-in-bits='32' id='2cc2a2b5'/>
    <pointer-type-def type-id='ff70dc95' size-in-bits='32' id='fbd34863'/>
    <pointer-type-def type-id='0e839745' size-in-bits='32' id='d32daf73'/>
    <pointer-type-def type-id='cdd69b5d' size-in-bits='32' id='a1bcde0b'/>
    <pointer-type-def type-id='b9fa8f41' size-in-bits='32' id='38ec2027'/>
    <pointer-type-def type-id='5417a89d' size-in-bits='32' id='f0e86b2b'/>
    <pointer-type-def type-id='2f680da1' size-in-bits='32' id='efee7847'/>
    <pointer-type-def type-id='9360eadd' size-in-bits='32' id='719a934b'/>
    <pointer-type-def type-id='a3eca173' size-in-bits='32' id='46ab91d1'/>
    <pointer-type-def type-id='444756cb' size-in-bits='32' id='56fab489'/>
    <pointer-type-def type-id='9c9ad7b1' size-in-bits='32' id='f160fb57'/>
    <pointer-type-def type-id='cab02d1d' size-in-bits='32' id='bd7ee60b'/>
    <pointer-type-def type-id='d5fd3ca8' size-in-bits='32' id='35865e70'/>
    <pointer-type-def type-id='4de83210' size-in-bits='32' id='82ceaaa8'/>
    <pointer-type-def type-id='45e7b03c' size-in-bits='32' id='40eba30c'/>
    <pointer-type-def type-id='aa688d10' size-in-bits='32' id='4dcecd78'/>
    <pointer-type-def type-id='8e242690' size-in-bits='32' id='763f4b98'/>
    <pointer-type-def type-id='9f0bbb88' size-in-bits='32' id='f84d5850'/>
    <pointer-type-def type-id='255041c6' size-in-bits='32' id='afa37b16'/>
    <pointer-type-def type-id='3c4ae4ea' size-in-bits='32' id='892d0ff2'/>
    <pointer-type-def type-id='46767cd6' size-in-bits='32' id='9d474d16'/>
    <class-decl name='__sFILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='8d7b2c20'/>
    <typedef-decl name='wctrans_t' type-id='eaa32e2f' filepath='bionic/libc/include/bits/wctype.h' line='60' column='1' id='183c72c5'/>
    <typedef-decl name='FILE' type-id='8d7b2c20' filepath='bionic/libc/include/stdio.h' line='59' column='1' id='aa12d1bc'/>
  </abi-instr>
  <abi-instr address-size='32' path='frameworks/base/native/android/asset_manager.cpp' language='LANG_C_plus_plus_14'>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' hash='4ee7381753f6ca11' id='7ff19f0f'/>
    <array-type-def dimensions='1' type-id='1b3b87e1' size-in-bits='512' hash='ba54f34584bab9df' id='224e4514'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='71ad5e8a' size-in-bits='unknown' hash='4835c8912888775c' id='86626492'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='2d5c5fc5' size-in-bits='512' hash='8aa802e6868e2dbc' id='98ae5868'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <type-decl name='char16_t' size-in-bits='16' hash='5fef4c2ad66dfe2e' id='801a266d'/>
    <type-decl name='char32_t' size-in-bits='32' hash='b4c1d1e47e03fb87' id='a846fc93'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='16' hash='079f95133f6f2c28' id='49f79167'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32' hash='932523ac2c3bfb84' id='8e0573fd'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='64' hash='e1c8b625c73024c4' id='8e100159'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <class-decl name='_jarray' visibility='default' size-in-bits='8' filepath='libnativehelper/include_jni/jni.h' line='49' column='1' hash='4e7e5aaebfea0375' id='440aaf49'>
      <base-class access='public' layout-offset-in-bits='0' type-id='baffb083'/>
    </class-decl>
    <class-decl name='_jobject' visibility='default' size-in-bits='8' filepath='libnativehelper/include_jni/jni.h' line='46' column='1' hash='196a3ce7f3ed869e' id='baffb083'/>
    <array-type-def dimensions='1' type-id='bfebf634' size-in-bits='unknown' hash='b8c6ce859630a8b2' id='b51730a0'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='031f2035'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' hash='e9e9b320886d9aa6' id='a0eb0f08'/>
    <enum-decl name='jobjectRefType' size-in-bits='32' alignment-in-bits='32' filepath='libnativehelper/include_jni/jni.h' line='121' column='1' hash='de66c02dea2456b4' id='4f771c8a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='JNIInvalidRefType' value='0'/>
      <enumerator name='JNILocalRefType' value='1'/>
      <enumerator name='JNIGlobalRefType' value='2'/>
      <enumerator name='JNIWeakGlobalRefType' value='3'/>
    </enum-decl>
    <type-decl name='float' size-in-bits='32' hash='d7ec3bf03d3c5690' id='a6c45d85'/>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='3ff5601b' size-in-bits='32' hash='d92ec14877998fd7' id='e4652d73'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <type-decl name='long double' size-in-bits='64' hash='2758d848d714000f#2' id='a0eb0f09'/>
    <type-decl name='long int' size-in-bits='32' hash='bfe66886a48d6d55#2' id='95e97e5f'/>
    <type-decl name='long long int' size-in-bits='64' hash='5ae7f9eec1fc43d6#3' id='95e97e60'/>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#4' id='95e97e61'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='28577a57'/>
    <array-type-def dimensions='1' type-id='06725de7' size-in-bits='96' hash='e0ce9e8b4927bc3c' id='69cdedfe'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='1a8dd50d' size-in-bits='80' hash='d76727158c5c92f0' id='dafbcf1a'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='53010e10'/>
    </array-type-def>
    <class-decl name='AAsset' is-struct='yes' visibility='default' size-in-bits='32' filepath='frameworks/base/native/android/asset_manager.cpp' line='50' column='1' hash='17d279728d178c75' id='1fc4034c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mAsset' type-id='ac070eda' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='51' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='AAssetDir' is-struct='yes' visibility='default' size-in-bits='96' filepath='frameworks/base/native/android/asset_manager.cpp' line='39' column='1' hash='4ed285fec3d73e56' id='ea9788c3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mAssetDir' type-id='6a6c3f8a' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mCurFileIndex' type-id='b59d7dce' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mCachedFileName' type-id='bacf3393' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='AAssetManager' is-struct='yes' visibility='default' size-in-bits='8' filepath='frameworks/base/libs/androidfw/include/androidfw/AssetManager.h' line='36' column='1' hash='3322bac3c2406039' id='7907d453'/>
    <class-decl name='JNINativeInterface' is-struct='yes' visibility='default' size-in-bits='7456' filepath='libnativehelper/include_jni/jni.h' line='149' column='1' hash='321558a9f2d2f961' id='ad414f12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved0' type-id='eaa32e2f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved1' type-id='eaa32e2f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reserved2' type-id='eaa32e2f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='reserved3' type-id='eaa32e2f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='GetVersion' type-id='7e62d932' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='DefineClass' type-id='93fe72f9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='FindClass' type-id='0701e7a2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='FromReflectedMethod' type-id='302207a0' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='FromReflectedField' type-id='b4201f3f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ToReflectedMethod' type-id='e6deb706' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='GetSuperclass' type-id='96a2b59f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='IsAssignableFrom' type-id='51a12745' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ToReflectedField' type-id='fcfbd023' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='Throw' type-id='ed039044' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ThrowNew' type-id='66017941' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='ExceptionOccurred' type-id='ebe3c60d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ExceptionDescribe' type-id='e45dd401' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='ExceptionClear' type-id='e45dd401' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='FatalError' type-id='7a98879a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='PushLocalFrame' type-id='d48cb67f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='PopLocalFrame' type-id='9c119f0f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='NewGlobalRef' type-id='9c119f0f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='DeleteGlobalRef' type-id='dcb938f6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='DeleteLocalRef' type-id='dcb938f6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='IsSameObject' type-id='e089ff87' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='NewLocalRef' type-id='9c119f0f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='EnsureLocalCapacity' type-id='d48cb67f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='AllocObject' type-id='73cc2298' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='NewObject' type-id='d7458144' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='NewObjectV' type-id='f58e29c4' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='NewObjectA' type-id='e4ddaae2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='GetObjectClass' type-id='b769f8ce' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='IsInstanceOf' type-id='edf75eb0' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='GetMethodID' type-id='84ed917f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='CallObjectMethod' type-id='e4dd1d6b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='CallObjectMethodV' type-id='25d63ceb' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='CallObjectMethodA' type-id='2e9f47d5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='CallBooleanMethod' type-id='d45ba39e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='CallBooleanMethodV' type-id='e6dd1f9e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='CallBooleanMethodA' type-id='214c5f44' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='CallByteMethod' type-id='d3e60ade' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='CallByteMethodV' type-id='ac58975e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='CallByteMethodA' type-id='483faa04' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='CallCharMethod' type-id='4eccfcec' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='CallCharMethodV' type-id='ebd01c4c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='CallCharMethodA' type-id='ae8575aa' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='CallShortMethod' type-id='3792de44' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='CallShortMethodV' type-id='609456c4' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='CallShortMethodA' type-id='e44a6fe2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='CallIntMethod' type-id='10997527' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='CallIntMethodV' type-id='72203d5f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='CallIntMethodA' type-id='6efc86e1' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='CallLongMethod' type-id='b9c24b8a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='CallLongMethodV' type-id='52583992' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='CallLongMethodA' type-id='571d8fb0' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='CallFloatMethod' type-id='09928654' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='CallFloatMethodV' type-id='5ee3c214' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='CallFloatMethodA' type-id='9f32ba72' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='CallDoubleMethod' type-id='b76bba71' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='CallDoubleMethodV' type-id='cb41d9c1' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='CallDoubleMethodA' type-id='99520b7b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='CallVoidMethod' type-id='9dfb2c96' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='CallVoidMethodV' type-id='d88d0f96' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='CallVoidMethodA' type-id='46effcdc' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='CallNonvirtualObjectMethod' type-id='2d40e32d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='CallNonvirtualObjectMethodV' type-id='3155ce35' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='CallNonvirtualObjectMethodA' type-id='3aa77c87' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='CallNonvirtualBooleanMethod' type-id='365ad2dc' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='CallNonvirtualBooleanMethodV' type-id='14a5b6bc' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='CallNonvirtualBooleanMethodA' type-id='03b4d21a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='CallNonvirtualByteMethod' type-id='19f8581c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='CallNonvirtualByteMethodV' type-id='c45ae27c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='CallNonvirtualByteMethodA' type-id='95eb11da' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='CallNonvirtualCharMethod' type-id='a0a864ea' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='CallNonvirtualCharMethodV' type-id='e08f90b2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='CallNonvirtualCharMethodA' type-id='3d1c1990' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='CallNonvirtualShortMethod' type-id='8243b832' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2464'>
        <var-decl name='CallNonvirtualShortMethodV' type-id='2e6fa23a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='CallNonvirtualShortMethodA' type-id='6835b638' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='CallNonvirtualIntMethod' type-id='4d7ba689' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='CallNonvirtualIntMethodV' type-id='0d9ebbb9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='CallNonvirtualIntMethodA' type-id='a594cd33' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='CallNonvirtualLongMethod' type-id='a97276f8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='CallNonvirtualLongMethodV' type-id='a5f29b60' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='CallNonvirtualLongMethodA' type-id='d8865276' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='CallNonvirtualFloatMethod' type-id='0a890a42' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='CallNonvirtualFloatMethodV' type-id='ff165b8a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='CallNonvirtualFloatMethodA' type-id='47e937c8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='CallNonvirtualDoubleMethod' type-id='47bd5aa3' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='CallNonvirtualDoubleMethodV' type-id='bcb23543' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='CallNonvirtualDoubleMethodA' type-id='974e7d0d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2912'>
        <var-decl name='CallNonvirtualVoidMethod' type-id='52490c64' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='CallNonvirtualVoidMethodV' type-id='02597924' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2976'>
        <var-decl name='CallNonvirtualVoidMethodA' type-id='cb345202' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='GetFieldID' type-id='a316ff5e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3040'>
        <var-decl name='GetObjectField' type-id='de6ab93a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='GetBooleanField' type-id='4a3ee6bf' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='GetByteField' type-id='5750967f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='GetCharField' type-id='002b51d9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='GetShortField' type-id='502b46a1' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='GetIntField' type-id='5203f86e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3232'>
        <var-decl name='GetLongField' type-id='8a93d1c3' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='GetFloatField' type-id='9202a511' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3296'>
        <var-decl name='GetDoubleField' type-id='cf64aecc' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='SetObjectField' type-id='93ed7c54' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3360'>
        <var-decl name='SetBooleanField' type-id='f9ae2915' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='SetByteField' type-id='2f2ff64f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3424'>
        <var-decl name='SetCharField' type-id='963c2d49' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='SetShortField' type-id='8220f20b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3488'>
        <var-decl name='SetIntField' type-id='d2bd2fda' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='SetLongField' type-id='fa4898ab' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3552'>
        <var-decl name='SetFloatField' type-id='03105c2f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='SetDoubleField' type-id='87524436' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3616'>
        <var-decl name='GetStaticMethodID' type-id='84ed917f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='CallStaticObjectMethod' type-id='d7458144' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3680'>
        <var-decl name='CallStaticObjectMethodV' type-id='f58e29c4' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='CallStaticObjectMethodA' type-id='e4ddaae2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3744'>
        <var-decl name='CallStaticBooleanMethod' type-id='cf23ae6b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='CallStaticBooleanMethodV' type-id='fe34ddeb' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3808'>
        <var-decl name='CallStaticBooleanMethodA' type-id='6500e0d5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='CallStaticByteMethod' type-id='9672ceab' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3872'>
        <var-decl name='CallStaticByteMethodV' type-id='68dff1ab' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='CallStaticByteMethodA' type-id='e1233a95' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3936'>
        <var-decl name='CallStaticCharMethod' type-id='74c6bbc1' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='CallStaticCharMethodV' type-id='c99edb51' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4000'>
        <var-decl name='CallStaticCharMethodA' type-id='9aa3a30b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='CallStaticShortMethod' type-id='7613d7f9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4064'>
        <var-decl name='CallStaticShortMethodV' type-id='cb27a9e9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='CallStaticShortMethodA' type-id='6fa6efa3' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='CallStaticIntMethod' type-id='03edf0e8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='CallStaticIntMethodV' type-id='4186fd90' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='CallStaticIntMethodA' type-id='b733d2a6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='CallStaticLongMethod' type-id='ac0692ef' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='CallStaticLongMethodV' type-id='69e037a7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='CallStaticLongMethodA' type-id='930f7049' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4320'>
        <var-decl name='CallStaticFloatMethod' type-id='22bf7509' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='CallStaticFloatMethodV' type-id='64f0f239' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4384'>
        <var-decl name='CallStaticFloatMethodA' type-id='ffa14fb3' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='CallStaticDoubleMethod' type-id='9a728e42' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4448'>
        <var-decl name='CallStaticDoubleMethodV' type-id='b5141f8a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='CallStaticDoubleMethodA' type-id='37d8dbc8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='CallStaticVoidMethod' type-id='23df0f63' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='CallStaticVoidMethodV' type-id='54ed3183' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4576'>
        <var-decl name='CallStaticVoidMethodA' type-id='4ddca04d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='GetStaticFieldID' type-id='a316ff5e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4640'>
        <var-decl name='GetStaticObjectField' type-id='fda9c1a1' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='GetStaticBooleanField' type-id='9c44123a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4704'>
        <var-decl name='GetStaticByteField' type-id='95e124fa' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='352' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='GetStaticCharField' type-id='2c2f7dfc' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4768'>
        <var-decl name='GetStaticShortField' type-id='92632084' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='GetStaticIntField' type-id='cdbc23ed' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4832'>
        <var-decl name='GetStaticLongField' type-id='3e4a17a6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='GetStaticFloatField' type-id='cd849574' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4896'>
        <var-decl name='GetStaticDoubleField' type-id='e2ca7deb' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='SetStaticObjectField' type-id='4e3962d3' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4960'>
        <var-decl name='SetStaticBooleanField' type-id='276cdb48' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='SetStaticByteField' type-id='cc949b48' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5024'>
        <var-decl name='SetStaticCharField' type-id='13ff5ed6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='SetStaticShortField' type-id='f595227e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5088'>
        <var-decl name='SetStaticIntField' type-id='4cf405ef' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='SetStaticLongField' type-id='2ee87a2c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5152'>
        <var-decl name='SetStaticFloatField' type-id='033b4c5a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='SetStaticDoubleField' type-id='4effcdf5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5216'>
        <var-decl name='NewString' type-id='242c266a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='GetStringLength' type-id='79969dbf' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5280'>
        <var-decl name='GetStringChars' type-id='6ff55ba7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='ReleaseStringChars' type-id='7f5a3d5b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5344'>
        <var-decl name='NewStringUTF' type-id='64bd18fd' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='GetStringUTFLength' type-id='79969dbf' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5408'>
        <var-decl name='GetStringUTFChars' type-id='c53ff811' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='ReleaseStringUTFChars' type-id='e00b6cf9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5472'>
        <var-decl name='GetArrayLength' type-id='7dba8e29' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='NewObjectArray' type-id='5b4efdbb' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5536'>
        <var-decl name='GetObjectArrayElement' type-id='e14e5747' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='SetObjectArrayElement' type-id='57fbc9df' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5600'>
        <var-decl name='NewBooleanArray' type-id='0b42cefb' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='NewByteArray' type-id='39b8aabb' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5664'>
        <var-decl name='NewCharArray' type-id='99291eb1' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='NewShortArray' type-id='887705e9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5728'>
        <var-decl name='NewIntArray' type-id='e1012f14' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='NewLongArray' type-id='2175e977' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5792'>
        <var-decl name='NewFloatArray' type-id='0ec38739' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='NewDoubleArray' type-id='7ba19e0e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5856'>
        <var-decl name='GetBooleanArrayElements' type-id='595531d6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='GetByteArrayElements' type-id='3c0f7990' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5920'>
        <var-decl name='GetCharArrayElements' type-id='181adbb0' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='GetShortArrayElements' type-id='54b2e682' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5984'>
        <var-decl name='GetIntArrayElements' type-id='049544dc' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='GetLongArrayElements' type-id='a04487d0' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6048'>
        <var-decl name='GetFloatArrayElements' type-id='f59e8a46' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='GetDoubleArrayElements' type-id='9d6db3c8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6112'>
        <var-decl name='ReleaseBooleanArrayElements' type-id='4ba42953' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='ReleaseByteArrayElements' type-id='c92c39bd' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6176'>
        <var-decl name='ReleaseCharArrayElements' type-id='5721b4d5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='ReleaseShortArrayElements' type-id='dd48378b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6240'>
        <var-decl name='ReleaseIntArrayElements' type-id='f0699eed' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='ReleaseLongArrayElements' type-id='27cc1a95' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6304'>
        <var-decl name='ReleaseFloatArrayElements' type-id='6a6a41af' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='ReleaseDoubleArrayElements' type-id='349137e5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6368'>
        <var-decl name='GetBooleanArrayRegion' type-id='fcef0014' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='GetByteArrayRegion' type-id='6c42c76e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6432'>
        <var-decl name='GetCharArrayRegion' type-id='4c985d6a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='GetShortArrayRegion' type-id='57269ef0' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='425' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6496'>
        <var-decl name='GetIntArrayRegion' type-id='b903acea' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='GetLongArrayRegion' type-id='46cfa96e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6560'>
        <var-decl name='GetFloatArrayRegion' type-id='d238e9f8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='GetDoubleArrayRegion' type-id='f0756a0a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6624'>
        <var-decl name='SetBooleanArrayRegion' type-id='9578bd3d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='SetByteArrayRegion' type-id='963f4759' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6688'>
        <var-decl name='SetCharArrayRegion' type-id='1b5bab1d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='441' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='SetShortArrayRegion' type-id='1167e98d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6752'>
        <var-decl name='SetIntArrayRegion' type-id='67616213' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='SetLongArrayRegion' type-id='fa7b64f1' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6816'>
        <var-decl name='SetFloatArrayRegion' type-id='47cf6701' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='SetDoubleArrayRegion' type-id='bc788285' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6880'>
        <var-decl name='RegisterNatives' type-id='384bcd95' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='UnregisterNatives' type-id='c4a66594' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6944'>
        <var-decl name='MonitorEnter' type-id='99b71f83' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='MonitorExit' type-id='99b71f83' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='458' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7008'>
        <var-decl name='GetJavaVM' type-id='5a6d41b9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7040'>
        <var-decl name='GetStringRegion' type-id='954e4e32' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7072'>
        <var-decl name='GetStringUTFRegion' type-id='d30f44a2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='GetPrimitiveArrayCritical' type-id='a9defe9a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7136'>
        <var-decl name='ReleasePrimitiveArrayCritical' type-id='0caa0dcf' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7168'>
        <var-decl name='GetStringCritical' type-id='6ff55ba7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7200'>
        <var-decl name='ReleaseStringCritical' type-id='7f5a3d5b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='NewWeakGlobalRef' type-id='1d2b5c3c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7264'>
        <var-decl name='DeleteWeakGlobalRef' type-id='c2029967' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='ExceptionCheck' type-id='cf6ba1d9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7328'>
        <var-decl name='NewDirectByteBuffer' type-id='394cbbe6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='475' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='GetDirectBufferAddress' type-id='d4993206' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7392'>
        <var-decl name='GetDirectBufferCapacity' type-id='0350b462' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='GetObjectRefType' type-id='25acc26a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='480' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_JNIEnv' is-struct='yes' visibility='default' size-in-bits='32' filepath='libnativehelper/include_jni/jni.h' line='489' column='1' hash='d34c154a989b6a06' id='c9459134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='functions' type-id='e48f1427' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='491' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ldiv_t' is-struct='yes' naming-typedef-id='30397bf8' visibility='default' size-in-bits='64' filepath='bionic/libc/include/stdlib.h' line='136' column='1' hash='e280ca1fccd52fa3' id='9b5926fd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='95e97e5f' visibility='default' filepath='bionic/libc/include/stdlib.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='95e97e5f' visibility='default' filepath='bionic/libc/include/stdlib.h' line='138' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lldiv_t' is-struct='yes' naming-typedef-id='f5fa3b34' visibility='default' size-in-bits='128' filepath='bionic/libc/include/stdlib.h' line='143' column='1' hash='564e04be97ca0408' id='649cba4b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='95e97e60' visibility='default' filepath='bionic/libc/include/stdlib.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='95e97e60' visibility='default' filepath='bionic/libc/include/stdlib.h' line='145' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pthread_mutex_t' is-struct='yes' naming-typedef-id='7a6844eb' visibility='default' size-in-bits='32' filepath='bionic/libc/include/bits/pthread_types.h' line='72' column='1' hash='d37b84b20adc4bcd' id='92fa54c8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__private' type-id='e4652d73' visibility='default' filepath='bionic/libc/include/bits/pthread_types.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' is-struct='yes' visibility='default' size-in-bits='352' filepath='bionic/libc/include/time.h' line='46' column='1' hash='9bc9726f4e23dcfd' id='dddf6ca2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='tm_gmtoff' type-id='95e97e5f' visibility='default' filepath='bionic/libc/include/time.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_zone' type-id='80f4b756' visibility='default' filepath='bionic/libc/include/time.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='AAsset' type-id='1fc4034c' size-in-bits='32' filepath='frameworks/native/include/android/asset_manager.h' line='73' column='1' id='d27ea7e1'/>
    <typedef-decl name='AAssetDir' type-id='ea9788c3' size-in-bits='96' filepath='frameworks/native/include/android/asset_manager.h' line='64' column='1' id='e6c9fab0'/>
    <typedef-decl name='AAssetManager' type-id='7907d453' size-in-bits='8' filepath='frameworks/native/include/android/asset_manager.h' line='54' column='1' id='f41387f0'/>
    <typedef-decl name='JNIEnv' type-id='c9459134' size-in-bits='32' filepath='libnativehelper/include_jni/jni.h' line='139' column='1' id='d357872a'/>
    <typedef-decl name='JNINativeMethod' type-id='92fa54c8' size-in-bits='32' filepath='libnativehelper/include_jni/jni.h' line='132' column='1' id='b7b5d51d'/>
    <typedef-decl name='__builtin_va_list' type-id='30357e0a' size-in-bits='32' id='7f896fb4'/>
    <typedef-decl name='__int16_t' type-id='95e97e61' size-in-bits='16' filepath='bionic/libc/include/stdint.h' line='38' column='1' hash='6c2352eccdcd3eea' id='03896e23'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' size-in-bits='32' filepath='bionic/libc/include/stdint.h' line='40' column='1' hash='09d17c08f594edc7' id='33f57a65'/>
    <typedef-decl name='__int64_t' type-id='95e97e60' size-in-bits='64' filepath='bionic/libc/include/stdint.h' line='46' column='1' hash='5ae7f9eec1fc43d6' id='0c9942d2'/>
    <typedef-decl name='__int8_t' type-id='28577a57' size-in-bits='8' filepath='bionic/libc/include/stdint.h' line='36' column='1' hash='3c595c3350588f18' id='2171a512'/>
    <typedef-decl name='__kernel_clock_t' type-id='6a11bd61' size-in-bits='32' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='80' column='1' hash='bfe66886a48d6d55' id='880ebc01'/>
    <typedef-decl name='__kernel_loff_t' type-id='95e97e60' size-in-bits='64' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='76' column='1' hash='5ae7f9eec1fc43d6' id='537a730e'/>
    <typedef-decl name='__kernel_long_t' type-id='95e97e5f' size-in-bits='32' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='23' column='1' hash='bfe66886a48d6d55' id='6a11bd61'/>
    <typedef-decl name='__kernel_off_t' type-id='6a11bd61' size-in-bits='32' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='75' column='1' hash='bfe66886a48d6d55' id='8dda407a'/>
    <typedef-decl name='__kernel_ssize_t' type-id='95e97e5e' size-in-bits='32' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='62' column='1' hash='09d17c08f594edc7' id='b6b3ebaf'/>
    <typedef-decl name='__kernel_time_t' type-id='6a11bd61' size-in-bits='32' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='78' column='1' hash='bfe66886a48d6d55' id='f7d92306'/>
    <typedef-decl name='__time_t' type-id='f7d92306' size-in-bits='32' filepath='bionic/libc/include/sys/types.h' line='95' column='1' hash='bfe66886a48d6d55' id='65eda9c0'/>
    <typedef-decl name='__uint16_t' type-id='f0981eec' size-in-bits='16' filepath='bionic/libc/include/stdint.h' line='39' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' size-in-bits='32' filepath='bionic/libc/include/stdint.h' line='41' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='bionic/libc/include/stdint.h' line='37' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='clock_t' type-id='880ebc01' size-in-bits='32' filepath='bionic/libc/include/sys/types.h' line='54' column='1' hash='bfe66886a48d6d55' id='4c3a2c61'/>
    <typedef-decl name='fpos_t' type-id='ad707ada' size-in-bits='32' filepath='bionic/libc/include/stdio.h' line='55' column='1' hash='bfe66886a48d6d55' id='e322b6ef'/>
    <typedef-decl name='int16_t' type-id='03896e23' size-in-bits='16' filepath='bionic/libc/include/stdint.h' line='61' column='1' hash='6c2352eccdcd3eea' id='23bd8cb5'/>
    <typedef-decl name='int32_t' type-id='33f57a65' size-in-bits='32' filepath='bionic/libc/include/stdint.h' line='64' column='1' hash='09d17c08f594edc7' id='3ff5601b'/>
    <typedef-decl name='int64_t' type-id='0c9942d2' size-in-bits='64' filepath='bionic/libc/include/stdint.h' line='67' column='1' hash='5ae7f9eec1fc43d6' id='9da381c4'/>
    <typedef-decl name='int8_t' type-id='2171a512' size-in-bits='8' filepath='bionic/libc/include/stdint.h' line='58' column='1' hash='3c595c3350588f18' id='ee31ee44'/>
    <typedef-decl name='jarray' type-id='85c463b1' size-in-bits='32' filepath='libnativehelper/include_jni/jni.h' line='64' column='1' hash='579e5322e07609b1' id='65b69bb3'/>
    <typedef-decl name='jboolean' type-id='b96825af' size-in-bits='8' filepath='libnativehelper/include_jni/jni.h' line='30' column='1' hash='6ebac62b3366db68' id='cc6e09ca'/>
    <typedef-decl name='jbyte' type-id='ee31ee44' size-in-bits='8' filepath='libnativehelper/include_jni/jni.h' line='31' column='1' hash='3c595c3350588f18' id='adf18958'/>
    <typedef-decl name='jchar' type-id='149c6638' size-in-bits='16' filepath='libnativehelper/include_jni/jni.h' line='32' column='1' hash='d7723bb93a30b11d' id='8dfe2e06'/>
    <typedef-decl name='jdouble' type-id='a0eb0f08' size-in-bits='64' filepath='libnativehelper/include_jni/jni.h' line='37' column='1' hash='e9e9b320886d9aa6' id='973e3c3f'/>
    <typedef-decl name='jfloat' type-id='a6c45d85' size-in-bits='32' filepath='libnativehelper/include_jni/jni.h' line='36' column='1' hash='d7ec3bf03d3c5690' id='1a7fe6b0'/>
    <typedef-decl name='jint' type-id='3ff5601b' size-in-bits='32' filepath='libnativehelper/include_jni/jni.h' line='34' column='1' hash='09d17c08f594edc7' id='0b9c02cb'/>
    <typedef-decl name='jlong' type-id='9da381c4' size-in-bits='64' filepath='libnativehelper/include_jni/jni.h' line='35' column='1' hash='5ae7f9eec1fc43d6' id='c8745fdc'/>
    <typedef-decl name='jobject' type-id='478e3663' size-in-bits='32' filepath='libnativehelper/include_jni/jni.h' line='61' column='1' hash='fae782d08847e688' id='96f3d089'/>
    <typedef-decl name='jobjectRefType' type-id='4f771c8a' size-in-bits='32' alignment-in-bits='32' filepath='libnativehelper/include_jni/jni.h' line='126' column='1' hash='de66c02dea2456b4' id='c36bf49e'/>
    <typedef-decl name='jshort' type-id='23bd8cb5' size-in-bits='16' filepath='libnativehelper/include_jni/jni.h' line='33' column='1' hash='6c2352eccdcd3eea' id='9a10f134'/>
    <typedef-decl name='jsize' type-id='0b9c02cb' size-in-bits='32' filepath='libnativehelper/include_jni/jni.h' line='40' column='1' hash='09d17c08f594edc7' id='2c2f1adb'/>
    <typedef-decl name='jweak' type-id='478e3663' size-in-bits='32' filepath='libnativehelper/include_jni/jni.h' line='75' column='1' hash='fae782d08847e688' id='6c9a8402'/>
    <typedef-decl name='ldiv_t' type-id='9b5926fd' size-in-bits='64' filepath='bionic/libc/include/stdlib.h' line='139' column='1' id='30397bf8'/>
    <typedef-decl name='lldiv_t' type-id='649cba4b' size-in-bits='128' filepath='bionic/libc/include/stdlib.h' line='146' column='1' id='f5fa3b34'/>
    <typedef-decl name='loff_t' type-id='537a730e' size-in-bits='64' filepath='bionic/libc/include/sys/types.h' line='106' column='1' hash='5ae7f9eec1fc43d6' id='69bf7bee'/>
    <typedef-decl name='mbstate_t' type-id='a76d8e48' size-in-bits='32' filepath='bionic/libc/include/bits/mbstate_t.h' line='47' column='1' id='3d7d8cbf'/>
    <typedef-decl name='nsecs_t' type-id='9da381c4' size-in-bits='64' filepath='system/core/libutils/include/utils/Timers.h' line='32' column='1' hash='5ae7f9eec1fc43d6' id='00f5ef57'/>
    <typedef-decl name='off64_t' type-id='69bf7bee' size-in-bits='64' filepath='bionic/libc/include/sys/types.h' line='107' column='1' hash='5ae7f9eec1fc43d6' id='05d4c620'/>
    <typedef-decl name='off_t' type-id='8dda407a' size-in-bits='32' filepath='bionic/libc/include/sys/types.h' line='105' column='1' hash='bfe66886a48d6d55' id='ad707ada'/>
    <typedef-decl name='pthread_mutex_t' type-id='92fa54c8' size-in-bits='32' filepath='bionic/libc/include/bits/pthread_types.h' line='78' column='1' id='7a6844eb'/>
    <typedef-decl name='ptrdiff_t' type-id='95e97e5e' size-in-bits='32' filepath='prebuilts/clang/host/linux-x86/clang-r383902b/lib64/clang/11.0.2/include/stddef.h' line='35' column='1' hash='09d17c08f594edc7' id='fc84bffe'/>
    <typedef-decl name='size_t' type-id='f0981eed' size-in-bits='32' filepath='prebuilts/clang/host/linux-x86/clang-r383902b/lib64/clang/11.0.2/include/stddef.h' line='46' column='1' hash='e66b43f97c38e87a' id='b59d7dce'/>
    <typedef-decl name='size_type' type-id='b59d7dce' size-in-bits='32' filepath='external/libcxx/include/array' line='139' column='1' hash='e66b43f97c38e87a' id='143a6b6e'/>
    <typedef-decl name='ssize_t' type-id='b6b3ebaf' size-in-bits='32' filepath='bionic/libc/include/sys/types.h' line='128' column='1' hash='09d17c08f594edc7' id='79a0948f'/>
    <typedef-decl name='time_t' type-id='65eda9c0' size-in-bits='32' filepath='bionic/libc/include/sys/types.h' line='96' column='1' hash='bfe66886a48d6d55' id='c9d12d66'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='bionic/libc/include/stdint.h' line='62' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='bionic/libc/include/stdint.h' line='65' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='bionic/libc/include/stdint.h' line='59' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <typedef-decl name='va_list' type-id='7f896fb4' size-in-bits='32' filepath='prebuilts/clang/host/linux-x86/clang-r383902b/lib64/clang/11.0.2/include/stdarg.h' line='14' column='1' id='2aee9912'/>
    <typedef-decl name='wctype_t' type-id='95e97e5f' size-in-bits='32' filepath='bionic/libc/include/bits/wctype.h' line='56' column='1' hash='bfe66886a48d6d55' id='ba50424d'/>
    <typedef-decl name='wint_t' type-id='f0981eed' size-in-bits='32' filepath='bionic/libc/include/bits/wctype.h' line='36' column='1' hash='e66b43f97c38e87a' id='6dd37369'/>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='unknown' hash='d71ea9da2a27c259' id='1e7b9b2b'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2048' hash='e6dda4fc6d697382' id='62946659'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='128' hash='db96c40792853cfe' id='92a46553'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='2048' hash='11dd84713e685d57' id='f411cbcf'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='32' hash='c4e0e9d960d68e21' id='09001d3c'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='16fe7105'/>
    </array-type-def>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eed'/>
    <array-type-def dimensions='1' type-id='807869d3' size-in-bits='512' hash='a925a9393b43fec7' id='ba25cd2e'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='7ff19f0f' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <type-decl name='unsigned long int' size-in-bits='32' hash='55dfcdcafc0c15e8#2' id='f0981eee'/>
    <type-decl name='unsigned long long int' size-in-bits='64' hash='ebdfc4685a1e82df#3' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#4' id='f0981eec'/>
    <type-decl name='wchar_t' size-in-bits='32' hash='4b224bc24abb5f1b' id='c523b9f1'/>
    <pointer-type-def type-id='1fc4034c' size-in-bits='32' hash='c755b9b0a6747381' id='57d98aaa'/>
    <pointer-type-def type-id='d27ea7e1' size-in-bits='32' hash='c755b9b0a6747381#2' id='57d98aab'/>
    <pointer-type-def type-id='ea9788c3' size-in-bits='32' hash='704fe637f1bd3466' id='1cdc10c3'/>
    <pointer-type-def type-id='e6c9fab0' size-in-bits='32' hash='704fe637f1bd3466#2' id='1cdc10c4'/>
    <pointer-type-def type-id='f41387f0' size-in-bits='32' hash='33456b0c433ec2e6' id='081c2b23'/>
    <pointer-type-def type-id='d357872a' size-in-bits='32' hash='5e65067842422c70' id='fae49a1f'/>
    <pointer-type-def type-id='c9459134' size-in-bits='32' hash='a19f4fac881e2fa5' id='71bed232'/>
    <pointer-type-def type-id='440aaf49' size-in-bits='32' hash='579e5322e07609b1' id='85c463b1'/>
    <pointer-type-def type-id='baffb083' size-in-bits='32' hash='fae782d08847e688' id='478e3663'/>
    <pointer-type-def type-id='27450c90' size-in-bits='32' hash='644e79ecb5b723f8' id='ad326464'/>
    <pointer-type-def type-id='32d026f1' size-in-bits='32' hash='b8d36adfbc064ac7' id='2ef969b9'/>
    <reference-type-def kind='lvalue' type-id='7c0ac937' size-in-bits='32' hash='0ad27d6f62e412ea' id='439855fb'/>
    <pointer-type-def type-id='7c0ac937' size-in-bits='32' hash='205fcab0df245aa3' id='3f984faf'/>
    <reference-type-def kind='lvalue' type-id='01b8bd0d' size-in-bits='32' hash='0a69f9a8b186ce53' id='b8660f99'/>
    <pointer-type-def type-id='01b8bd0d' size-in-bits='32' hash='eb05e7d1b38fcb15' id='c466227d'/>
    <qualified-type-def type-id='c466227d' const='yes' hash='9d61e1f0a0df814d' id='4fda6452'/>
    <reference-type-def kind='lvalue' type-id='4fda6452' size-in-bits='32' hash='374169887b0fadf4' id='28cc229c'/>
    <reference-type-def kind='lvalue' type-id='c466227d' size-in-bits='32' hash='14a37f2407043ee2' id='87c81541'/>
    <reference-type-def kind='lvalue' type-id='238d5c19' size-in-bits='32' hash='168db7f22ae9dcd6' id='173b8195'/>
    <pointer-type-def type-id='238d5c19' size-in-bits='32' hash='af077af8f86cd8ba' id='1b3b87e1'/>
    <reference-type-def kind='lvalue' type-id='1bec9f14' size-in-bits='32' hash='8f37e9ee0b3a8abb' id='45e7ebae'/>
    <pointer-type-def type-id='1bec9f14' size-in-bits='32' hash='3f0bb235cf2d735f' id='41e7e562'/>
    <qualified-type-def type-id='41e7e562' const='yes' hash='36b32db5e6ccef51' id='a6d138ed'/>
    <reference-type-def kind='lvalue' type-id='a6d138ed' size-in-bits='32' hash='3a16c5872ba89967' id='665c6791'/>
    <reference-type-def kind='lvalue' type-id='41e7e562' size-in-bits='32' hash='6fe7eb8dfd6ba639' id='040dea0c'/>
    <pointer-type-def type-id='9337857f' size-in-bits='32' hash='138095b6f5574099' id='7ba678e7'/>
    <pointer-type-def type-id='0eedf0a9' size-in-bits='32' hash='14e7cfc9568363d9' id='be739c71'/>
    <pointer-type-def type-id='0c7d43ed' size-in-bits='32' hash='3b079f53a81ef798' id='737dcd4d'/>
    <pointer-type-def type-id='aaa6ccca' size-in-bits='32' hash='7723584938a4cb86' id='399793f8'/>
    <reference-type-def kind='lvalue' type-id='1ae556e8' size-in-bits='32' hash='d15eaecbf1da8a15' id='80661af2'/>
    <pointer-type-def type-id='1ae556e8' size-in-bits='32' hash='d28afb08f6feea1d' id='8466213e'/>
    <pointer-type-def type-id='a1e4e0c1' size-in-bits='32' hash='f2c977b1edcea076' id='f617f949'/>
    <pointer-type-def type-id='e5242f33' size-in-bits='32' hash='1699c9dee2efa68d' id='cc64c693'/>
    <reference-type-def kind='lvalue' type-id='83ab4f39' size-in-bits='32' hash='8e15d9edc3cbaf37' id='4ce6d775'/>
    <pointer-type-def type-id='83ab4f39' size-in-bits='32' hash='0926c44073800128' id='50e6ddc1'/>
    <reference-type-def kind='lvalue' type-id='406f4753' size-in-bits='32' hash='ddd074eb46dd44e6' id='665e3247'/>
    <pointer-type-def type-id='406f4753' size-in-bits='32' hash='29309e0a51b8e760' id='5a5e1f63'/>
    <pointer-type-def type-id='081066a5' size-in-bits='32' hash='aa692e5a9e018b6e' id='fb5b9575'/>
    <reference-type-def kind='lvalue' type-id='f8926d95' size-in-bits='32' hash='78f35789e2026957' id='03ec3711'/>
    <pointer-type-def type-id='f8926d95' size-in-bits='32' hash='af7fc7befa67c7b8' id='ffec30c5'/>
    <qualified-type-def type-id='ffec30c5' const='yes' hash='75f1cf77f3fc05c7' id='6e0d67ba'/>
    <reference-type-def kind='lvalue' type-id='6e0d67ba' size-in-bits='32' hash='4d1d00c08f6fd4cc' id='db1a1a94'/>
    <reference-type-def kind='lvalue' type-id='ffec30c5' size-in-bits='32' hash='45dde93dceb32e78' id='c3d0f559'/>
    <pointer-type-def type-id='28543e70' size-in-bits='32' hash='807322eedaa3ca01' id='a4a0d016'/>
    <pointer-type-def type-id='0bab9a0f' size-in-bits='32' hash='6802bd5a31ec2e2f' id='1ecbd0c7'/>
    <reference-type-def kind='lvalue' type-id='c73fabea' size-in-bits='32' hash='15ab0d7a06f9cca1' id='22923b4c'/>
    <pointer-type-def type-id='c73fabea' size-in-bits='32' hash='7cc8ffed58ef1f29' id='26924198'/>
    <reference-type-def kind='lvalue' type-id='bacf3393' size-in-bits='32' hash='a8c37ecfb885b08e' id='26b0aa17'/>
    <pointer-type-def type-id='bacf3393' size-in-bits='32' hash='5d7654023c9fd2c6' id='1ab09733'/>
    <pointer-type-def type-id='90bf4c40' size-in-bits='32' hash='28003e521eb8aa31' id='23d76c96'/>
    <reference-type-def kind='lvalue' type-id='36a9bc13' size-in-bits='32' hash='5775b16e71d303c8' id='8cf76667'/>
    <reference-type-def kind='lvalue' type-id='3beaa405' size-in-bits='32' hash='a2cd11bd59703f23' id='315c6611'/>
    <reference-type-def kind='rvalue' type-id='3beaa405' size-in-bits='32' hash='4a43ef17e2744786' id='eb74e895'/>
    <pointer-type-def type-id='3beaa405' size-in-bits='32' hash='00fe60d58756d383' id='2d5c5fc5'/>
    <reference-type-def kind='lvalue' type-id='a84c031d' size-in-bits='32' hash='29887572d1402c6e' id='2aa915e1'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='32' hash='6812f8e849bfc813' id='26a90f95'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='32' hash='272e68812b5eb507' id='9b23c9ad'/>
    <reference-type-def kind='lvalue' type-id='801a266d' size-in-bits='32' hash='c46ccfb70aedca07' id='f42a4811'/>
    <pointer-type-def type-id='801a266d' size-in-bits='32' hash='405532b81db01358' id='f02a41c5'/>
    <pointer-type-def type-id='f02a41c5' size-in-bits='32' hash='639f91199f1bdd81' id='0185cb3d'/>
    <qualified-type-def type-id='ad414f12' const='yes' hash='82b136cdd964579f' id='bebf8fb7'/>
    <pointer-type-def type-id='bebf8fb7' size-in-bits='32' hash='52b1e2f678f4aa2b' id='e48f1427'/>
    <qualified-type-def type-id='b7b5d51d' const='yes' hash='fe58ff22548f6bc9' id='f62c522d'/>
    <pointer-type-def type-id='f62c522d' size-in-bits='32' hash='684b87d3dec42857' id='8ec52105'/>
    <qualified-type-def type-id='32d026f1' const='yes' hash='7b0c01d8b77a65c1' id='3478aa1e'/>
    <reference-type-def kind='lvalue' type-id='3478aa1e' size-in-bits='32' hash='ea5a26d67aea326e' id='d1f3f628'/>
    <pointer-type-def type-id='3478aa1e' size-in-bits='32' hash='be950933e2113f95' id='cdf3efdc'/>
    <qualified-type-def type-id='7c0ac937' const='yes' hash='a987fe35acd78a2c' id='8e56f572'/>
    <reference-type-def kind='lvalue' type-id='8e56f572' size-in-bits='32' hash='65f3a55e81b37b13' id='66e4333c'/>
    <pointer-type-def type-id='8e56f572' size-in-bits='32' hash='0f314ccadb85768d' id='6ae43988'/>
    <qualified-type-def type-id='01b8bd0d' const='yes' hash='35c62554e25af2fe' id='da1ad926'/>
    <reference-type-def kind='lvalue' type-id='da1ad926' size-in-bits='32' hash='374dfdd2e8471278' id='58439b00'/>
    <pointer-type-def type-id='da1ad926' size-in-bits='32' hash='ae4c6efc669ecd61' id='6443ade4'/>
    <qualified-type-def type-id='238d5c19' const='yes' hash='fe6cf649e8bd9cd6' id='124b0ffa'/>
    <reference-type-def kind='lvalue' type-id='124b0ffa' size-in-bits='32' hash='0e70b697b402206c' id='a829f754'/>
    <qualified-type-def type-id='1bec9f14' const='yes' hash='9051cd60df35b8af' id='f541dc79'/>
    <reference-type-def kind='lvalue' type-id='f541dc79' size-in-bits='32' hash='670c188162c06aef' id='75ade98d'/>
    <pointer-type-def type-id='f541dc79' size-in-bits='32' hash='0abec579f6640b1e' id='69add6a9'/>
    <qualified-type-def type-id='9337857f' const='yes' hash='e2d786e6ecb21d9f' id='e900403c'/>
    <pointer-type-def type-id='e900403c' size-in-bits='32' hash='6c8d00ef680cc8b2' id='e164e2a2'/>
    <qualified-type-def type-id='0eedf0a9' const='yes' hash='5d2460f268b4e36a' id='8875171c'/>
    <pointer-type-def type-id='8875171c' size-in-bits='32' hash='ae3ac37687b1195a' id='06538a02'/>
    <qualified-type-def type-id='0c7d43ed' const='yes' hash='9447084f9d7ada83' id='ded9b194'/>
    <pointer-type-def type-id='ded9b194' size-in-bits='32' hash='b17c190448d1a9ab' id='8eb2ce1a'/>
    <qualified-type-def type-id='aaa6ccca' const='yes' hash='32347ec45be08219' id='3f8580c7'/>
    <reference-type-def kind='lvalue' type-id='3f8580c7' size-in-bits='32' hash='9b49605dd81badfc' id='e029e233'/>
    <pointer-type-def type-id='3f8580c7' size-in-bits='32' hash='694c1cb3e0a7c39a' id='ec29f517'/>
    <qualified-type-def type-id='1ae556e8' const='yes' hash='a4bf554e2e4e7fec' id='cd945871'/>
    <reference-type-def kind='lvalue' type-id='cd945871' size-in-bits='32' hash='d50a8bcb865f2e68' id='f78710f5'/>
    <qualified-type-def type-id='4a84961d' const='yes' hash='3de3c2ab8eadaf5e' id='e6f5b684'/>
    <pointer-type-def type-id='e6f5b684' size-in-bits='32' hash='a6e993088bd383d2' id='42ce93ea'/>
    <qualified-type-def type-id='a1e4e0c1' const='yes' hash='1e3198e2ad561ac5' id='cfec3230'/>
    <reference-type-def kind='lvalue' type-id='cfec3230' size-in-bits='32' hash='03687d88b44015bf' id='66d2d8a2'/>
    <pointer-type-def type-id='cfec3230' size-in-bits='32' hash='0a888130dff15870' id='6ad2deee'/>
    <qualified-type-def type-id='e5242f33' const='yes' hash='960798bd8332f844' id='3ee779f2'/>
    <reference-type-def kind='lvalue' type-id='3ee779f2' size-in-bits='32' hash='71dee0eda84d0cc9' id='da64c8bc'/>
    <pointer-type-def type-id='3ee779f2' size-in-bits='32' hash='6e3347e37977f089' id='de64cf08'/>
    <qualified-type-def type-id='83ab4f39' const='yes' hash='a8b1dd400541555e' id='ddef579c'/>
    <reference-type-def kind='lvalue' type-id='ddef579c' size-in-bits='32' hash='bf3dd4b51c7be729' id='19c719ce'/>
    <pointer-type-def type-id='ddef579c' size-in-bits='32' hash='eb0f0c8f84c36bf7' id='15c71382'/>
    <qualified-type-def type-id='406f4753' const='yes' hash='0dc52836fd6f7fbf' id='a3f5ae0e'/>
    <reference-type-def kind='lvalue' type-id='a3f5ae0e' size-in-bits='32' hash='33fb711aff87ed1e' id='43c128f8'/>
    <qualified-type-def type-id='5da8e894' const='yes' hash='371f16e1ee037327' id='d7426f71'/>
    <pointer-type-def type-id='d7426f71' size-in-bits='32' hash='4df5eebc26cd2035' id='38954c41'/>
    <qualified-type-def type-id='081066a5' const='yes' hash='5d1de3313aa8d7bf' id='364e3bf4'/>
    <pointer-type-def type-id='364e3bf4' size-in-bits='32' hash='6aace5a5ea787d65' id='5b283e7a'/>
    <qualified-type-def type-id='1ccfdeff' const='yes' hash='0bdabe85b41456b9' id='8897c276'/>
    <reference-type-def kind='lvalue' type-id='8897c276' size-in-bits='32' hash='e8873db6a15e9309' id='56e6e3f0'/>
    <qualified-type-def type-id='f8926d95' const='yes' hash='e2f87bb90c378d1e' id='d1018ac0'/>
    <reference-type-def kind='lvalue' type-id='d1018ac0' size-in-bits='32' hash='bb48da174ad405b8' id='eb6da812'/>
    <pointer-type-def type-id='d1018ac0' size-in-bits='32' hash='09d06fae0a4a02e7' id='ef6dae5e'/>
    <qualified-type-def type-id='24d11571' const='yes' hash='4bd0c864cc61a627' id='c12c73fe'/>
    <pointer-type-def type-id='c12c73fe' size-in-bits='32' hash='1c869d1c998482ba' id='ecfa56bc'/>
    <qualified-type-def type-id='4504256f' const='yes' hash='75922314e4cf06dc' id='acf3e156'/>
    <pointer-type-def type-id='acf3e156' size-in-bits='32' hash='d8b19e5deab1d105' id='bfebf634'/>
    <qualified-type-def type-id='bfebf634' const='yes' hash='fa268c6b46787a8e' id='d3e0387f'/>
    <reference-type-def kind='lvalue' type-id='d3e0387f' size-in-bits='32' hash='fbeab364a23f1b66' id='e2f8b41b'/>
    <pointer-type-def type-id='d3e0387f' size-in-bits='32' hash='bd010753fb48a762' id='def8adcf'/>
    <reference-type-def kind='lvalue' type-id='bfebf634' size-in-bits='32' hash='7c016d30317dbaaf' id='32745e56'/>
    <pointer-type-def type-id='bfebf634' size-in-bits='32' hash='7d78947a186ad3fd' id='3e74713a'/>
    <qualified-type-def type-id='3e74713a' const='yes' hash='33b15c1a132171fb' id='ab189805'/>
    <reference-type-def kind='lvalue' type-id='ab189805' size-in-bits='32' hash='c84160ab4d32f644' id='7ab77f19'/>
    <reference-type-def kind='lvalue' type-id='3e74713a' size-in-bits='32' hash='8df31480fd000acc' id='6d4e0f14'/>
    <qualified-type-def type-id='667ba238' const='yes' hash='9e0e590154b26b09' id='d6321531'/>
    <pointer-type-def type-id='d6321531' size-in-bits='32' hash='6969508be823d140' id='4bd73981'/>
    <qualified-type-def type-id='28543e70' const='yes' hash='13db3043168cd35d' id='c4bcb085'/>
    <reference-type-def kind='lvalue' type-id='c4bcb085' size-in-bits='32' hash='715f8cabd008fb0a' id='580a1099'/>
    <qualified-type-def type-id='66278e1e' const='yes' hash='a09acc2dcba125de' id='7eb311c3'/>
    <pointer-type-def type-id='7eb311c3' size-in-bits='32' hash='6cce1e46efe2e1c2' id='5ce531cb'/>
    <qualified-type-def type-id='0bab9a0f' const='yes' hash='0b6258f7ff9eeca4' id='03c8f004'/>
    <reference-type-def kind='lvalue' type-id='03c8f004' size-in-bits='32' hash='10e191c2ecb4920c' id='17520586'/>
    <qualified-type-def type-id='c73fabea' const='yes' hash='b4b28e2a8033405d' id='a3cec311'/>
    <reference-type-def kind='lvalue' type-id='a3cec311' size-in-bits='32' hash='71c0f16a5ee78876' id='157d4f95'/>
    <pointer-type-def type-id='a3cec311' size-in-bits='32' hash='1bdec5163e4d82c5' id='197d55e1'/>
    <qualified-type-def type-id='bacf3393' const='yes' hash='275cc6018862b9e9' id='745c9152'/>
    <reference-type-def kind='lvalue' type-id='745c9152' size-in-bits='32' hash='dafd126432356dba' id='a1b8f99c'/>
    <pointer-type-def type-id='745c9152' size-in-bits='32' hash='f81563a2b4d93b43' id='a5b8ffe8'/>
    <qualified-type-def type-id='90bf4c40' const='yes' hash='628f519d11193ae0' id='f36454e9'/>
    <pointer-type-def type-id='f36454e9' size-in-bits='32' hash='0c538c4c8c7643e4' id='e9f16ef9'/>
    <qualified-type-def type-id='36a9bc13' const='yes' hash='eda2421c3d53d6c4' id='a231f7f4'/>
    <pointer-type-def type-id='a231f7f4' size-in-bits='32' hash='dd06fc32666d7985' id='32a9327a'/>
    <qualified-type-def type-id='3beaa405' const='yes' hash='9a88c3070a4d3d1d' id='36819e5e'/>
    <reference-type-def kind='lvalue' type-id='36819e5e' size-in-bits='32' hash='ef51575b86cc6756' id='460c76e8'/>
    <pointer-type-def type-id='36819e5e' size-in-bits='32' hash='bf7be0d87c274fbf' id='420c709c'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <reference-type-def kind='lvalue' type-id='9b45d938' size-in-bits='32' hash='67f9246fe318fa47' id='8cf4ca3a'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='32' hash='1b788021282f0875' id='80f4b756'/>
    <pointer-type-def type-id='9a362d2a' size-in-bits='32' hash='7f3fe83f3743e59d' id='c53ff811'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='32' hash='525e320272e9b7e6' id='7d3cd834'/>
    <qualified-type-def type-id='801a266d' const='yes' hash='825416199df8114c' id='e7c31614'/>
    <reference-type-def kind='lvalue' type-id='e7c31614' size-in-bits='32' hash='8c0535c5e0231200' id='0a1bf0b6'/>
    <pointer-type-def type-id='e7c31614' size-in-bits='32' hash='02f547f00895a570' id='161c039a'/>
    <qualified-type-def type-id='a846fc93' const='yes' hash='7d0a5530e3bfc18a' id='eb5b5ff2'/>
    <pointer-type-def type-id='eb5b5ff2' size-in-bits='32' hash='51cffec5164ff206' id='58d7e108'/>
    <qualified-type-def type-id='a6c45d85' const='yes' hash='03855f78902f9a2e' id='73f3791e'/>
    <reference-type-def kind='lvalue' type-id='73f3791e' size-in-bits='32' hash='91addc5dbafb61bf' id='c047d328'/>
    <qualified-type-def type-id='e322b6ef' const='yes' hash='1a5c3fea40c28461' id='59d28eff'/>
    <pointer-type-def type-id='59d28eff' size-in-bits='32' hash='9e275115f087b322' id='3b76d94f'/>
    <qualified-type-def type-id='95e97e5e' const='yes' hash='8cef8df4b6728924' id='2448a865'/>
    <reference-type-def kind='lvalue' type-id='2448a865' size-in-bits='32' hash='c66c09c71e902291' id='6160e179'/>
    <pointer-type-def type-id='2448a865' size-in-bits='32' hash='ef757f31dcad8445' id='6d60f45d'/>
    <qualified-type-def type-id='cc6e09ca' const='yes' hash='8eec8d875479b7d9' id='5fa8a65a'/>
    <pointer-type-def type-id='5fa8a65a' size-in-bits='32' hash='7b5b1a1f86bdb534' id='067e0250'/>
    <qualified-type-def type-id='adf18958' const='yes' hash='24bdd0e11c990841' id='3ebf19c8'/>
    <pointer-type-def type-id='3ebf19c8' size-in-bits='32' hash='3e67606c94fce6a6' id='a8d5bec6'/>
    <qualified-type-def type-id='8dfe2e06' const='yes' hash='e177a710df61ef36' id='9bf2d596'/>
    <pointer-type-def type-id='9bf2d596' size-in-bits='32' hash='23cc7af66ebd5538' id='3b4676f4'/>
    <pointer-type-def type-id='138afd90' size-in-bits='32' hash='7f3fe83f3743e59d' id='6ff55ba7'/>
    <qualified-type-def type-id='973e3c3f' const='yes' hash='503452879ed99aa7' id='8bac99cf'/>
    <pointer-type-def type-id='8bac99cf' size-in-bits='32' hash='864c0c8107bcddc3' id='c5b6437f'/>
    <qualified-type-def type-id='1a7fe6b0' const='yes' hash='115d23bb58615bcb' id='af8c6a20'/>
    <pointer-type-def type-id='af8c6a20' size-in-bits='32' hash='3872d3897812e7df' id='640aedbe'/>
    <qualified-type-def type-id='0b9c02cb' const='yes' hash='d9266377fc2f7a1c' id='897a51fb'/>
    <pointer-type-def type-id='897a51fb' size-in-bits='32' hash='ba296276fe0bc2a0' id='3c8ecc03'/>
    <qualified-type-def type-id='c8745fdc' const='yes' hash='e02c57f28b6044a9' id='7c1d680c'/>
    <pointer-type-def type-id='7c1d680c' size-in-bits='32' hash='526138134d4886d2' id='884af3d2'/>
    <qualified-type-def type-id='9a10f134' const='yes' hash='3a01781baedcd0cd' id='c17f92e4'/>
    <pointer-type-def type-id='c17f92e4' size-in-bits='32' hash='ff2d05f0ddcc7d9b' id='69d41a4a'/>
    <qualified-type-def type-id='3d7d8cbf' const='yes' hash='7a7d79fc3b615322' id='7411c98f'/>
    <pointer-type-def type-id='7411c98f' size-in-bits='32' hash='2a1e21f19fc00424' id='5d006ebf'/>
    <qualified-type-def type-id='b59d7dce' const='yes' hash='22247acf8c14fff3' id='d0fa5dde'/>
    <qualified-type-def type-id='c3e90ce7' const='yes' hash='7c2449e12e779217' id='f49e9570'/>
    <pointer-type-def type-id='f49e9570' size-in-bits='32' hash='2461c07466210823' id='6fa51cae'/>
    <qualified-type-def type-id='60f5da7d' const='yes' hash='a725183971ddafe3' id='69dda76c'/>
    <reference-type-def kind='lvalue' type-id='69dda76c' size-in-bits='32' hash='dd207c39862dc53f' id='f1ee597e'/>
    <pointer-type-def type-id='69dda76c' size-in-bits='32' hash='b080e5e53cdfb2b1' id='edee5332'/>
    <qualified-type-def type-id='36028ca6' const='yes' hash='57ec43ee63203035#6' id='127172da'/>
    <reference-type-def kind='lvalue' type-id='127172da' size-in-bits='32' hash='cf7393dc5ded56e4#6' id='049802b4'/>
    <qualified-type-def type-id='97941460' const='yes' hash='7a01998debb6194c' id='ef733b59'/>
    <reference-type-def kind='lvalue' type-id='ef733b59' size-in-bits='32' hash='ad3f70def2fbe3df' id='7166a8ed'/>
    <pointer-type-def type-id='ef733b59' size-in-bits='32' hash='769f27193b9ad449' id='65669609'/>
    <qualified-type-def type-id='2b91c1c3' const='yes' hash='57ec43ee63203035#7' id='127172db'/>
    <reference-type-def kind='lvalue' type-id='127172db' size-in-bits='32' hash='cf7393dc5ded56e4#7' id='049802b5'/>
    <qualified-type-def type-id='64fb4db3' const='yes' hash='1d7b2cfd9ad846a0' id='ac63f41a'/>
    <reference-type-def kind='lvalue' type-id='ac63f41a' size-in-bits='32' hash='15e5f17eb60cc7fb' id='9d597a74'/>
    <pointer-type-def type-id='ac63f41a' size-in-bits='32' hash='1a4f6ea5898aca35' id='91596790'/>
    <qualified-type-def type-id='88715d90' const='yes' hash='57ec43ee63203035#9' id='127172dc'/>
    <reference-type-def kind='lvalue' type-id='127172dc' size-in-bits='32' hash='cf7393dc5ded56e4#9' id='049802b6'/>
    <qualified-type-def type-id='c8491dd8' const='yes' hash='1f51cc86e620e7c8' id='cce517cd'/>
    <reference-type-def kind='lvalue' type-id='cce517cd' size-in-bits='32' hash='dc3a50eccae5753d' id='77a4a6f1'/>
    <pointer-type-def type-id='cce517cd' size-in-bits='32' hash='aff73a42453576b6' id='73a4a0a5'/>
    <qualified-type-def type-id='cb386317' const='yes' hash='57ec43ee63203035#10' id='127172dd'/>
    <reference-type-def kind='lvalue' type-id='127172dd' size-in-bits='32' hash='cf7393dc5ded56e4#10' id='049802b7'/>
    <qualified-type-def type-id='ba4fbcc4' const='yes' hash='145d63d7d3eb4454' id='e5685f15'/>
    <pointer-type-def type-id='e5685f15' size-in-bits='32' hash='603a85991aa09be1' id='624df02d'/>
    <qualified-type-def type-id='2ef4b79c' const='yes' hash='175b277bc3744451' id='015c2579'/>
    <pointer-type-def type-id='015c2579' size-in-bits='32' hash='d7de0683130be8cf' id='770ec1a9'/>
    <qualified-type-def type-id='37dd8aae' const='yes' hash='c0da5b563b26803b' id='67f2d1ad'/>
    <pointer-type-def type-id='67f2d1ad' size-in-bits='32' hash='7c7f098da8c8a604' id='2a3fd785'/>
    <qualified-type-def type-id='e015e2ec' const='yes' hash='a3871e5a079fa1e7' id='c6f082e7'/>
    <pointer-type-def type-id='c6f082e7' size-in-bits='32' hash='1142775283f5bcc2' id='f99de8b7'/>
    <qualified-type-def type-id='f045688c' const='yes' hash='2ac42cf92263cbfc' id='d14d7547'/>
    <pointer-type-def type-id='d14d7547' size-in-bits='32' hash='1c8ab2655462661b' id='e9efda97'/>
    <qualified-type-def type-id='94df1ca8' const='yes' hash='fd691a503d814cd6' id='1afeb553'/>
    <pointer-type-def type-id='1afeb553' size-in-bits='32' hash='081a0310ef6efc0c' id='f7f7ad7b'/>
    <qualified-type-def type-id='43b7c228' const='yes' hash='81f042ee3591644d' id='8b04234b'/>
    <pointer-type-def type-id='8b04234b' size-in-bits='32' hash='eb9ec0fe4b6454dd' id='3883b1b3'/>
    <qualified-type-def type-id='1988293c' const='yes' hash='f7a398a32f1b9f88' id='f6040e8d'/>
    <pointer-type-def type-id='f6040e8d' size-in-bits='32' hash='8bc74b0df8a6bd30' id='ef6310e5'/>
    <qualified-type-def type-id='c01a67f4' const='yes' hash='35fce90b58584b1d' id='09a4ff6d'/>
    <pointer-type-def type-id='09a4ff6d' size-in-bits='32' hash='b55d2afde77a4ddc' id='75bddcc5'/>
    <qualified-type-def type-id='ec22f6fc' const='yes' hash='e87521197b4c736a' id='24105c05'/>
    <pointer-type-def type-id='24105c05' size-in-bits='32' hash='4b18dcb32715ad4f' id='f4c11dfd'/>
    <qualified-type-def type-id='58870df2' const='yes' hash='73c1780e7cd40b15' id='75d6bfad'/>
    <pointer-type-def type-id='75d6bfad' size-in-bits='32' hash='3f8265631ea9ab2d' id='080f8185'/>
    <qualified-type-def type-id='d22df4cd' const='yes' hash='5a4cc8b72531f6ba' id='22034760'/>
    <pointer-type-def type-id='22034760' size-in-bits='32' hash='8a6f8fe4742a00ac' id='d529397e'/>
    <qualified-type-def type-id='2622dfea' const='yes' hash='d5305c068558a750' id='c65b3cdf'/>
    <pointer-type-def type-id='c65b3cdf' size-in-bits='32' hash='eebef8f96c2b5ffc' id='36a0f5af'/>
    <qualified-type-def type-id='39b8e88f' const='yes' hash='8bec773dea1e2c44' id='cf5e3b94'/>
    <pointer-type-def type-id='cf5e3b94' size-in-bits='32' hash='eef545e8deb47dbd' id='2f580c1a'/>
    <qualified-type-def type-id='97d0af14' const='yes' hash='2e48a3d3243fc81b' id='b1012a03'/>
    <pointer-type-def type-id='b1012a03' size-in-bits='32' hash='14a6028c1df0b581' id='cdd55e8b'/>
    <qualified-type-def type-id='7d3bb31a' const='yes' hash='f23dc8d149b54a3b' id='a006bbcf'/>
    <pointer-type-def type-id='a006bbcf' size-in-bits='32' hash='b2bc434944620941' id='cf99c97f'/>
    <qualified-type-def type-id='5fea02b3' const='yes' hash='b57c0f59e9c1accf' id='c60b39d6'/>
    <pointer-type-def type-id='c60b39d6' size-in-bits='32' hash='8edc4d498f8b16ae' id='bfac47b4'/>
    <qualified-type-def type-id='063dbdb6' const='yes' hash='dcfdc53904485fad' id='b6f04613'/>
    <pointer-type-def type-id='b6f04613' size-in-bits='32' hash='0d5e1d38cb52c586' id='353e8bbb'/>
    <qualified-type-def type-id='45b74b57' const='yes' hash='74fee25a865fd182' id='71926ae2'/>
    <pointer-type-def type-id='71926ae2' size-in-bits='32' hash='9a6a78787505d537' id='917e18d8'/>
    <qualified-type-def type-id='ffcdd1b2' const='yes' hash='c0226ee467a2ae2c' id='6ac16f07'/>
    <pointer-type-def type-id='6ac16f07' size-in-bits='32' hash='359c720b94ccc5bd' id='3b8203d7'/>
    <qualified-type-def type-id='cd354cef' const='yes' hash='eeff0789962810a2' id='7496d49a'/>
    <pointer-type-def type-id='7496d49a' size-in-bits='32' hash='dc212d801494eb37' id='3970d110'/>
    <qualified-type-def type-id='7dee695e' const='yes' hash='e19e4f66a17f6283' id='3c3515cb'/>
    <pointer-type-def type-id='3c3515cb' size-in-bits='32' hash='6fcfa3c712d7f0fe' id='a8917133'/>
    <qualified-type-def type-id='f03ebc7b' const='yes' hash='8a9596eba82af800' id='276c3586'/>
    <pointer-type-def type-id='276c3586' size-in-bits='32' hash='dff69f87c3e9216c' id='bb587dc4'/>
    <qualified-type-def type-id='678452de' const='yes' hash='24c553ac3c9a63b3' id='977f3b95'/>
    <pointer-type-def type-id='977f3b95' size-in-bits='32' hash='9e32c5ae1cb178b5' id='3c4b0dad'/>
    <qualified-type-def type-id='8d3c18f6' const='yes' hash='dd874edec66a77f1' id='87af503d'/>
    <pointer-type-def type-id='87af503d' size-in-bits='32' hash='387c103523e1773f' id='affb1435'/>
    <qualified-type-def type-id='c24f72a3' const='yes' hash='8ed345b503f42ee6' id='8469f184'/>
    <pointer-type-def type-id='8469f184' size-in-bits='32' hash='fb53d273db2d2f8b' id='20c774ea'/>
    <qualified-type-def type-id='e8967c46' const='yes' hash='e8104e29b87b11be' id='2d9d9a2b'/>
    <pointer-type-def type-id='2d9d9a2b' size-in-bits='32' hash='25163a1865352b40' id='d0196f93'/>
    <qualified-type-def type-id='e83f8f8d' const='yes' hash='cda74f0282018f69' id='da7f0da8'/>
    <pointer-type-def type-id='da7f0da8' size-in-bits='32' hash='10543ab26dab82ec' id='780243a6'/>
    <qualified-type-def type-id='057d9591' const='yes' hash='bf6e23aa2565f5fe' id='fe8749ec'/>
    <pointer-type-def type-id='fe8749ec' size-in-bits='32' hash='d15911642286085f' id='74f922b2'/>
    <qualified-type-def type-id='7312e504' const='yes' hash='17c6a978f134dd28' id='125981d9'/>
    <pointer-type-def type-id='125981d9' size-in-bits='32' hash='86ed9d35c6945a40' id='d5e79189'/>
    <qualified-type-def type-id='49a21e67' const='yes' hash='92d536847a9d7302' id='72ff7e9a'/>
    <pointer-type-def type-id='72ff7e9a' size-in-bits='32' hash='1dc8ab655410e0d6' id='b8346f10'/>
    <qualified-type-def type-id='8b54feb4' const='yes' hash='e301094336a89ce0' id='1f0a3e4d'/>
    <pointer-type-def type-id='1f0a3e4d' size-in-bits='32' hash='4ad907cdf982ca86' id='44203c25'/>
    <qualified-type-def type-id='227041e1' const='yes' hash='d92d9e2f05677e85' id='6cd37428'/>
    <pointer-type-def type-id='6cd37428' size-in-bits='32' hash='27fe6ab70dec44c2' id='52df9f26'/>
    <qualified-type-def type-id='9c4a3aff' const='yes' hash='ff9eb0dc1db5178a' id='12249962'/>
    <pointer-type-def type-id='12249962' size-in-bits='32' hash='04de586717193a5b' id='d79d4c58'/>
    <qualified-type-def type-id='22e56ec2' const='yes' hash='7c1c833b0fedaa69' id='f2757f09'/>
    <pointer-type-def type-id='f2757f09' size-in-bits='32' hash='07eda465b0d29c2f' id='d1f72419'/>
    <qualified-type-def type-id='b5df5bdc' const='yes' hash='f6e8330ecebaa9e0' id='345edb2f'/>
    <pointer-type-def type-id='345edb2f' size-in-bits='32' hash='cad677d143929e23' id='7652c8df'/>
    <qualified-type-def type-id='3b4d4373' const='yes' hash='8dba124de118e5e9' id='df0e4d26'/>
    <pointer-type-def type-id='df0e4d26' size-in-bits='32' hash='3a500d26f901cded' id='2f8349e4'/>
    <qualified-type-def type-id='277bc372' const='yes' hash='6208de6df0a89480' id='11f3caa3'/>
    <pointer-type-def type-id='11f3caa3' size-in-bits='32' hash='55c2960d51c36d88' id='cbc7d5ab'/>
    <qualified-type-def type-id='aa3451ec' const='yes' hash='c26c2d8cb856dac0' id='f3e176c1'/>
    <pointer-type-def type-id='f3e176c1' size-in-bits='32' hash='d251d29086846081' id='d6ee33f1'/>
    <qualified-type-def type-id='e4d4d078' const='yes' hash='da1f69276cbd6df2' id='8e013285'/>
    <pointer-type-def type-id='8e013285' size-in-bits='32' hash='ef433d7642d71de3' id='3ae2c97d'/>
    <qualified-type-def type-id='63c7c233' const='yes' hash='2b7318c3091fd5a6' id='76ba5c4c'/>
    <pointer-type-def type-id='76ba5c4c' size-in-bits='32' hash='b515ce6316c389d1' id='4d5f7492'/>
    <qualified-type-def type-id='7c4db7cf' const='yes' hash='73d9145e4ac91186' id='d319d718'/>
    <pointer-type-def type-id='d319d718' size-in-bits='32' hash='58f6ac09c1c1508b' id='83adc3b6'/>
    <qualified-type-def type-id='6932bb90' const='yes' hash='81530f5c5090f9ee' id='087cb129'/>
    <pointer-type-def type-id='087cb129' size-in-bits='32' hash='e1429479baf6103e' id='5f4aa7b9'/>
    <qualified-type-def type-id='9884ef0e' const='yes' hash='bc4e52a5357924c4' id='2f73bc05'/>
    <pointer-type-def type-id='2f73bc05' size-in-bits='32' hash='2b876fc814046c26' id='e2313dfd'/>
    <qualified-type-def type-id='cd94fd85' const='yes' hash='963f62678f049f2d' id='58db0cca'/>
    <pointer-type-def type-id='58db0cca' size-in-bits='32' hash='c39d069a99cf8d90' id='c0d544a0'/>
    <qualified-type-def type-id='77d669a5' const='yes' hash='22d7f5fe53f306b9' id='0ee51430'/>
    <pointer-type-def type-id='0ee51430' size-in-bits='32' hash='7ffdd3b53e1e8968' id='8c9ea4ee'/>
    <qualified-type-def type-id='a885088e' const='yes' hash='fe6927c880f050fe' id='5be8d6e7'/>
    <pointer-type-def type-id='5be8d6e7' size-in-bits='32' hash='304352d1bde76952' id='7c8a24b7'/>
    <qualified-type-def type-id='7b346a3f' const='yes' hash='45b60404ce9861e4' id='0c18ac26'/>
    <pointer-type-def type-id='0c18ac26' size-in-bits='32' hash='e4d41819248f8e65' id='16d6d6e4'/>
    <qualified-type-def type-id='ff06e1a2' const='yes' hash='7b6b63793703543d' id='0cdc9f13'/>
    <pointer-type-def type-id='0cdc9f13' size-in-bits='32' hash='f0a84a44edf13cab' id='784ea6bb'/>
    <qualified-type-def type-id='c230c56f' const='yes' hash='2b8b3a17fe171401' id='65c590da'/>
    <pointer-type-def type-id='65c590da' size-in-bits='32' hash='3f0219208ff6ec00' id='260329d0'/>
    <qualified-type-def type-id='a3175723' const='yes' hash='caaf45a3af1e674c' id='f98533c0'/>
    <pointer-type-def type-id='f98533c0' size-in-bits='32' hash='23d3bac430f656a4' id='b6b0b95e'/>
    <qualified-type-def type-id='c6d12234' const='yes' hash='810cfa26f7ab5da5' id='6ec1638d'/>
    <pointer-type-def type-id='6ec1638d' size-in-bits='32' hash='0d7c4b1122ef7b29' id='016fdfe5'/>
    <qualified-type-def type-id='6fb577ee' const='yes' hash='dbbb061f3f604749' id='7ea2111d'/>
    <pointer-type-def type-id='7ea2111d' size-in-bits='32' hash='e1d797eae6ef8ec0' id='90211995'/>
    <qualified-type-def type-id='7873fb6d' const='yes' hash='325c96f9b7e8e805' id='7ea4faa4'/>
    <pointer-type-def type-id='7ea4faa4' size-in-bits='32' hash='11d61639e7e4f72e' id='ebb66d8a'/>
    <qualified-type-def type-id='34bedffd' const='yes' hash='48a1f73ea1a98812' id='1f86947e'/>
    <pointer-type-def type-id='1f86947e' size-in-bits='32' hash='0ab3d5f9c50a488f' id='f4db803c'/>
    <qualified-type-def type-id='37ff4804' const='yes' hash='3a625f52a769f40e' id='35bcf4e5'/>
    <pointer-type-def type-id='35bcf4e5' size-in-bits='32' hash='3c9011b90b92d6e0' id='677561dd'/>
    <qualified-type-def type-id='225e915e' const='yes' hash='f5d34eb8be37ddb7' id='b1eb09e5'/>
    <pointer-type-def type-id='b1eb09e5' size-in-bits='32' hash='2a379d275a044571' id='e40070dd'/>
    <qualified-type-def type-id='1d6097d7' const='yes' hash='1f64cadebf79aa43' id='96975fe0'/>
    <pointer-type-def type-id='96975fe0' size-in-bits='32' hash='6348417f53bcb346' id='da4bcafe'/>
    <qualified-type-def type-id='9e7f15b0' const='yes' hash='7714785f60afd24b' id='6c45eba1'/>
    <pointer-type-def type-id='6c45eba1' size-in-bits='32' hash='fad17bb92fdbdf6b' id='fd11cbd1'/>
    <qualified-type-def type-id='70ed5ac7' const='yes' hash='7d4dfdb45ce9eb4f' id='30307126'/>
    <pointer-type-def type-id='30307126' size-in-bits='32' hash='b1410a7e775ee991' id='e841f5e4'/>
    <qualified-type-def type-id='7068a110' const='yes' hash='a9250ecb36e05ac6' id='ef66f589'/>
    <pointer-type-def type-id='ef66f589' size-in-bits='32' hash='3f8fefb9dedb3f4a' id='8214af99'/>
    <qualified-type-def type-id='e771cfad' const='yes' hash='6369343711e2cd40' id='648520a6'/>
    <pointer-type-def type-id='648520a6' size-in-bits='32' hash='e41bef7d09561656' id='c9923c64'/>
    <qualified-type-def type-id='3efb2c0e' const='yes' hash='e06c91714bf978e6' id='9b0b4955'/>
    <pointer-type-def type-id='9b0b4955' size-in-bits='32' hash='1c1a6310ca5b92cb' id='91c4b2ed'/>
    <qualified-type-def type-id='8288923d' const='yes' hash='125fbe10aea4738a' id='059b4a0a'/>
    <pointer-type-def type-id='059b4a0a' size-in-bits='32' hash='82ee4b663468f2d1' id='f375b060'/>
    <qualified-type-def type-id='5a2afa10' const='yes' hash='62f6ae238a79a3f4' id='ea081829'/>
    <pointer-type-def type-id='ea081829' size-in-bits='32' hash='2cd1f7c8e4aecaf2' id='6dbdccb9'/>
    <qualified-type-def type-id='f9da37d1' const='yes' hash='f6741f2b6b1f429e' id='c4e41a24'/>
    <pointer-type-def type-id='c4e41a24' size-in-bits='32' hash='9e0855c735898d06' id='0115040a'/>
    <qualified-type-def type-id='5e03174f' const='yes' hash='3df846451e524f36' id='54209a76'/>
    <pointer-type-def type-id='54209a76' size-in-bits='32' hash='99998ed8f01a90ce' id='cb52fed4'/>
    <qualified-type-def type-id='56dccc53' const='yes' hash='6f8dd03352a902ea' id='19234ae2'/>
    <pointer-type-def type-id='19234ae2' size-in-bits='32' hash='a5076641ae64a481' id='5a8eb8d8'/>
    <qualified-type-def type-id='02c104af' const='yes' hash='551dcbd6e78bc042' id='e025c302'/>
    <pointer-type-def type-id='e025c302' size-in-bits='32' hash='0b71b4aee7f5f29a' id='037237f8'/>
    <qualified-type-def type-id='bae33ff3' const='yes' hash='c40394e5a0d81b7f' id='d3fde2a2'/>
    <pointer-type-def type-id='d3fde2a2' size-in-bits='32' hash='20f5b755fd4c38cc' id='40ab9c18'/>
    <qualified-type-def type-id='d9fbed1c' const='yes' hash='35701b275d170ac2' id='21ccd5f1'/>
    <pointer-type-def type-id='21ccd5f1' size-in-bits='32' hash='d53c12b79dbeb9da' id='1074a7c1'/>
    <qualified-type-def type-id='ed8c4278' const='yes' hash='7ccdb2f7499ecf37' id='ac6cb785'/>
    <pointer-type-def type-id='ac6cb785' size-in-bits='32' hash='2a601af2ef4cf741' id='1e25287d'/>
    <qualified-type-def type-id='f2c63883' const='yes' hash='1ab91f70cf390c76' id='6afdde7c'/>
    <pointer-type-def type-id='6afdde7c' size-in-bits='32' hash='287fa3690cdbb599' id='c3a50162'/>
    <qualified-type-def type-id='51ebade8' const='yes' hash='05f78123c561494e' id='1689900b'/>
    <pointer-type-def type-id='1689900b' size-in-bits='32' hash='31b320af4e05a0f9' id='9b8de3f3'/>
    <qualified-type-def type-id='62ec4a33' const='yes' hash='8464f08391dd2b81' id='6d3d4e7e'/>
    <pointer-type-def type-id='6d3d4e7e' size-in-bits='32' hash='8f1cdfc304d66ef7' id='4b824e3c'/>
    <qualified-type-def type-id='1adfd3e6' const='yes' hash='8ffead91144c9846' id='eb12177b'/>
    <pointer-type-def type-id='eb12177b' size-in-bits='32' hash='a065a0f01a527efb' id='5e7ab483'/>
    <qualified-type-def type-id='95757501' const='yes' hash='ebeed7ffe14721d7' id='50003bd4'/>
    <pointer-type-def type-id='50003bd4' size-in-bits='32' hash='cf8d4d2fb65f9b8d' id='ee5e70da'/>
    <qualified-type-def type-id='b284e6e2' const='yes' hash='450f9a154bc8f251' id='3ee218a3'/>
    <pointer-type-def type-id='3ee218a3' size-in-bits='32' hash='072d3244ff3a2e54' id='86ec9fab'/>
    <qualified-type-def type-id='2a699f96' const='yes' hash='712851e853e5f958' id='c014b171'/>
    <pointer-type-def type-id='c014b171' size-in-bits='32' hash='72d13920ae151d15' id='bb933241'/>
    <qualified-type-def type-id='579722ef' const='yes' hash='6fb0443ac0c2725a' id='0adb7b58'/>
    <pointer-type-def type-id='0adb7b58' size-in-bits='32' hash='ef02bb07837a8e7a' id='89835476'/>
    <qualified-type-def type-id='adb0d72c' const='yes' hash='96dff99860a5993d' id='1b4f6e3b'/>
    <pointer-type-def type-id='1b4f6e3b' size-in-bits='32' hash='f90accb3e25d71b6' id='0f0a44c3'/>
    <qualified-type-def type-id='6e3f46eb' const='yes' hash='3990dc8242654f91' id='3e21fc54'/>
    <pointer-type-def type-id='3e21fc54' size-in-bits='32' hash='1f5dfca272150945' id='4d807a5a'/>
    <qualified-type-def type-id='fcbd9376' const='yes' hash='2a7c634575af5670' id='c9adb00b'/>
    <pointer-type-def type-id='c9adb00b' size-in-bits='32' hash='447434d2e198e216' id='9d6c43f3'/>
    <qualified-type-def type-id='dd0abe4a' const='yes' hash='a2b6e67ed73acdf1' id='080132d3'/>
    <pointer-type-def type-id='080132d3' size-in-bits='32' hash='d797db8704720475' id='92e33dfb'/>
    <qualified-type-def type-id='0713c6a2' const='yes' hash='efa9282f87869626' id='456e0be5'/>
    <pointer-type-def type-id='456e0be5' size-in-bits='32' hash='5b78f1186d2239b5' id='1b3c96dd'/>
    <qualified-type-def type-id='8d9552b9' const='yes' hash='b56fe9cee9434d86' id='b7cd56ac'/>
    <pointer-type-def type-id='b7cd56ac' size-in-bits='32' hash='15de7926e5794ade' id='de3f34f2'/>
    <qualified-type-def type-id='20704346' const='yes' hash='4636eac1507113c7' id='24afc245'/>
    <pointer-type-def type-id='24afc245' size-in-bits='32' hash='000d69fecb7daa8c' id='2faf14bd'/>
    <qualified-type-def type-id='abfeb1fe' const='yes' hash='b943be1e97766dd2' id='6bf2fba5'/>
    <pointer-type-def type-id='6bf2fba5' size-in-bits='32' hash='fdb4b424b5d3b92e' id='7e82021d'/>
    <qualified-type-def type-id='8051cbec' const='yes' hash='1604887dad4be5da' id='9fae01b1'/>
    <pointer-type-def type-id='9fae01b1' size-in-bits='32' hash='b987d1faf4e9b436' id='f9ec8701'/>
    <qualified-type-def type-id='488eea75' const='yes' hash='b8a1be2f6df986da' id='bf476b8e'/>
    <reference-type-def kind='lvalue' type-id='bf476b8e' size-in-bits='32' hash='0ac0b6f6c0f0890d' id='c56e7978'/>
    <pointer-type-def type-id='bf476b8e' size-in-bits='32' hash='5baa1d3ac2f14900' id='c16e732c'/>
    <qualified-type-def type-id='1c507e8b' const='yes' hash='1c7ced63afa63e9e' id='e0629c3e'/>
    <pointer-type-def type-id='e0629c3e' size-in-bits='32' hash='04cd13fb94524d50' id='4f3bb37c'/>
    <qualified-type-def type-id='6e0a00e4' const='yes' hash='8d5e4a71fcdc0fd1#2' id='3656e13e'/>
    <reference-type-def kind='lvalue' type-id='3656e13e' size-in-bits='32' hash='29e23999aedd96cb#2' id='a2c458c8'/>
    <qualified-type-def type-id='4ee99380' const='yes' hash='fe5b43aae755f7f1#5' id='47f81694'/>
    <reference-type-def kind='lvalue' type-id='47f81694' size-in-bits='32' hash='25b0e5eaef922a7b#5' id='fd8bba36'/>
    <qualified-type-def type-id='61dc8fcd' const='yes' hash='fe5b43aae755f7f1#7' id='47f81695'/>
    <reference-type-def kind='lvalue' type-id='47f81695' size-in-bits='32' hash='25b0e5eaef922a7b#7' id='fd8bba37'/>
    <qualified-type-def type-id='a8372230' const='yes' hash='2c64359ccf1b3b17#7' id='d386a90c'/>
    <reference-type-def kind='lvalue' type-id='d386a90c' size-in-bits='32' hash='3d7a8ca7e00d4e99#7' id='26fc4d1e'/>
    <qualified-type-def type-id='cd3d9869' const='yes' hash='51111b43de38136e#3' id='af954a65'/>
    <reference-type-def kind='lvalue' type-id='af954a65' size-in-bits='32' hash='27edeffceaa76ad4#3' id='ab03e779'/>
    <qualified-type-def type-id='beafe2f0' const='yes' hash='fe5b43aae755f7f1#8' id='47f81696'/>
    <reference-type-def kind='lvalue' type-id='47f81696' size-in-bits='32' hash='25b0e5eaef922a7b#8' id='fd8bba38'/>
    <qualified-type-def type-id='7194074a' const='yes' hash='f3a08c23c8f5e3e0' id='078f62bd'/>
    <reference-type-def kind='lvalue' type-id='078f62bd' size-in-bits='32' hash='62effcdf34d311ff' id='81b83a01'/>
    <pointer-type-def type-id='078f62bd' size-in-bits='32' hash='bd952fcf88a54537' id='7db833b5'/>
    <qualified-type-def type-id='568a771a' const='yes' hash='3f8a6c46e282230d' id='a96f9975'/>
    <reference-type-def kind='lvalue' type-id='a96f9975' size-in-bits='32' hash='ef471394f8691a1b' id='0dae5da9'/>
    <pointer-type-def type-id='a96f9975' size-in-bits='32' hash='67dfa784146bac65' id='19ae708d'/>
    <qualified-type-def type-id='602ad079' const='yes' hash='3079b8084758d884' id='ade0f876'/>
    <reference-type-def kind='lvalue' type-id='ade0f876' size-in-bits='32' hash='189fd80c120e884a' id='0926e5f0'/>
    <pointer-type-def type-id='ade0f876' size-in-bits='32' hash='14aaaf8dbd567d7f' id='1526f8d4'/>
    <qualified-type-def type-id='581cf3d8' const='yes' hash='8ad2c84167c54c66' id='cec93afb'/>
    <reference-type-def kind='lvalue' type-id='cec93afb' size-in-bits='32' hash='830b2fdcde9b77ec' id='63c7a9e7'/>
    <pointer-type-def type-id='cec93afb' size-in-bits='32' hash='aa56433b9fea5169' id='57c79703'/>
    <qualified-type-def type-id='f76a9935' const='yes' hash='095de7d1f2230fb0' id='93f1ab6e'/>
    <reference-type-def kind='lvalue' type-id='93f1ab6e' size-in-bits='32' hash='c951f08a4694d786' id='2d70a258'/>
    <pointer-type-def type-id='93f1ab6e' size-in-bits='32' hash='45904522814c5851' id='29709c0c'/>
    <qualified-type-def type-id='0b8a9bd4' const='yes' hash='87e53ca94afb97ee' id='88613de9'/>
    <reference-type-def kind='lvalue' type-id='88613de9' size-in-bits='32' hash='b74686426793ee29' id='80144cdd'/>
    <pointer-type-def type-id='88613de9' size-in-bits='32' hash='4d1e4f72ccd098ac' id='741439f9'/>
    <qualified-type-def type-id='000c67ad' const='yes' hash='5e76480908d1c761#6' id='5cde35bc'/>
    <reference-type-def kind='lvalue' type-id='5cde35bc' size-in-bits='32' hash='78410c554881fcc9#6' id='cbce616e'/>
    <qualified-type-def type-id='313519b3' const='yes' hash='57ec43ee63203035#16' id='127172de'/>
    <reference-type-def kind='lvalue' type-id='127172de' size-in-bits='32' hash='cf7393dc5ded56e4#16' id='049802b8'/>
    <qualified-type-def type-id='2bc53136' const='yes' hash='66dd8b1fef1514e5#6' id='dcfea06b'/>
    <reference-type-def kind='lvalue' type-id='dcfea06b' size-in-bits='32' hash='16c0b81dde088128#6' id='31d65937'/>
    <qualified-type-def type-id='b6dd31e7' const='yes' hash='4740258e5b97dbf3#6' id='ec805554'/>
    <reference-type-def kind='lvalue' type-id='ec805554' size-in-bits='32' hash='9748ee8197743f3a#6' id='c0068276'/>
    <qualified-type-def type-id='b069d066' const='yes' hash='641475e474d81598' id='f4e4a967'/>
    <reference-type-def kind='lvalue' type-id='f4e4a967' size-in-bits='32' hash='d5eca144b5f6d176' id='c4f67153'/>
    <pointer-type-def type-id='f4e4a967' size-in-bits='32' hash='0a490990c4c5c64d' id='d0f68437'/>
    <qualified-type-def type-id='ddf0159f' const='yes' hash='5e76480908d1c761#7' id='5cde35bd'/>
    <reference-type-def kind='lvalue' type-id='5cde35bd' size-in-bits='32' hash='78410c554881fcc9#7' id='cbce616f'/>
    <qualified-type-def type-id='60bf8975' const='yes' hash='57ec43ee63203035#17' id='127172df'/>
    <reference-type-def kind='lvalue' type-id='127172df' size-in-bits='32' hash='cf7393dc5ded56e4#17' id='049802b9'/>
    <qualified-type-def type-id='a36ba8bc' const='yes' hash='66dd8b1fef1514e5#7' id='dcfea06c'/>
    <reference-type-def kind='lvalue' type-id='dcfea06c' size-in-bits='32' hash='16c0b81dde088128#7' id='31d65938'/>
    <qualified-type-def type-id='1ccf4229' const='yes' hash='4740258e5b97dbf3#7' id='ec805555'/>
    <reference-type-def kind='lvalue' type-id='ec805555' size-in-bits='32' hash='9748ee8197743f3a#7' id='c0068277'/>
    <qualified-type-def type-id='16cfbc82' const='yes' hash='bd0edfbc0ecb7ceb' id='83b16c13'/>
    <reference-type-def kind='lvalue' type-id='83b16c13' size-in-bits='32' hash='3ae2dcf7834329e1' id='854d576f'/>
    <pointer-type-def type-id='83b16c13' size-in-bits='32' hash='6d640cf3171e6851' id='894d5dbb'/>
    <qualified-type-def type-id='bbda45fb' const='yes' hash='5e76480908d1c761#9' id='5cde35be'/>
    <reference-type-def kind='lvalue' type-id='5cde35be' size-in-bits='32' hash='78410c554881fcc9#9' id='cbce6170'/>
    <qualified-type-def type-id='59a35081' const='yes' hash='57ec43ee63203035#19' id='127172e0'/>
    <reference-type-def kind='lvalue' type-id='127172e0' size-in-bits='32' hash='cf7393dc5ded56e4#19' id='049802ba'/>
    <qualified-type-def type-id='4d712c30' const='yes' hash='66dd8b1fef1514e5#9' id='dcfea06d'/>
    <reference-type-def kind='lvalue' type-id='dcfea06d' size-in-bits='32' hash='16c0b81dde088128#9' id='31d65939'/>
    <qualified-type-def type-id='86683135' const='yes' hash='4740258e5b97dbf3#9' id='ec805556'/>
    <reference-type-def kind='lvalue' type-id='ec805556' size-in-bits='32' hash='9748ee8197743f3a#9' id='c0068278'/>
    <qualified-type-def type-id='d6a92829' const='yes' hash='9cb37b6a13dd22dd' id='c956a398'/>
    <reference-type-def kind='lvalue' type-id='c956a398' size-in-bits='32' hash='148dcbea3b5606c1' id='b163c41a'/>
    <pointer-type-def type-id='c956a398' size-in-bits='32' hash='4ec547a48ec28286' id='a563b136'/>
    <qualified-type-def type-id='2e0a8ef4' const='yes' hash='2c64359ccf1b3b17#14' id='d386a90d'/>
    <reference-type-def kind='lvalue' type-id='d386a90d' size-in-bits='32' hash='3d7a8ca7e00d4e99#14' id='26fc4d1f'/>
    <qualified-type-def type-id='47800e14' const='yes' hash='5e76480908d1c761#10' id='5cde35bf'/>
    <reference-type-def kind='lvalue' type-id='5cde35bf' size-in-bits='32' hash='78410c554881fcc9#10' id='cbce6171'/>
    <qualified-type-def type-id='07ec7282' const='yes' hash='57ec43ee63203035#20' id='127172e1'/>
    <reference-type-def kind='lvalue' type-id='127172e1' size-in-bits='32' hash='cf7393dc5ded56e4#20' id='049802bb'/>
    <qualified-type-def type-id='52fb1fd3' const='yes' hash='66dd8b1fef1514e5#10' id='dcfea06e'/>
    <reference-type-def kind='lvalue' type-id='dcfea06e' size-in-bits='32' hash='16c0b81dde088128#10' id='31d6593a'/>
    <qualified-type-def type-id='71b7128c' const='yes' hash='4740258e5b97dbf3#10' id='ec805557'/>
    <reference-type-def kind='lvalue' type-id='ec805557' size-in-bits='32' hash='9748ee8197743f3a#10' id='c0068279'/>
    <qualified-type-def type-id='2c8660ce' const='yes' hash='cc1a6ead0e15e693' id='66c45ba7'/>
    <reference-type-def kind='lvalue' type-id='66c45ba7' size-in-bits='32' hash='71960b4c532b9186' id='481c0c13'/>
    <pointer-type-def type-id='66c45ba7' size-in-bits='32' hash='5758e8f9ae9be68a' id='541c1ef7'/>
    <qualified-type-def type-id='92024495' const='yes' hash='7202a7387e23353e' id='20ab0c9e'/>
    <reference-type-def kind='lvalue' type-id='20ab0c9e' size-in-bits='32' hash='58e4af864e4f91db' id='254505a8'/>
    <pointer-type-def type-id='20ab0c9e' size-in-bits='32' hash='2fe1fcd3aa4cdb96' id='2144ff5c'/>
    <qualified-type-def type-id='16537306' const='yes' hash='d70ee02c95754a34' id='5cdd9e9d'/>
    <reference-type-def kind='lvalue' type-id='5cdd9e9d' size-in-bits='32' hash='36b25376f630b877' id='ebe0e061'/>
    <pointer-type-def type-id='5cdd9e9d' size-in-bits='32' hash='4f43ce0667ad914d' id='e7e0da15'/>
    <qualified-type-def type-id='60e02119' const='yes' hash='ec2c575b2c09fa4b' id='ac679f16'/>
    <reference-type-def kind='lvalue' type-id='ac679f16' size-in-bits='32' hash='c8ea3d6b05704f14' id='971f9890'/>
    <pointer-type-def type-id='ac679f16' size-in-bits='32' hash='d2d77c70513d3c8b' id='a31fab74'/>
    <qualified-type-def type-id='9a771f60' const='yes' hash='fe241d5bebfe36ef' id='c1918efd'/>
    <reference-type-def kind='lvalue' type-id='c1918efd' size-in-bits='32' hash='fa33f319f1c980a5' id='9323e2c1'/>
    <pointer-type-def type-id='c1918efd' size-in-bits='32' hash='e4922f8dda963a50' id='8f23dc75'/>
    <qualified-type-def type-id='966331d7' const='yes' hash='3c81753affe4e2ba' id='29a768f2'/>
    <reference-type-def kind='lvalue' type-id='29a768f2' size-in-bits='32' hash='e59d94076ef44529' id='668a05bc'/>
    <pointer-type-def type-id='29a768f2' size-in-bits='32' hash='79edbe12b2e00c02' id='6a8a0c08'/>
    <qualified-type-def type-id='6a81bf9f' const='yes' hash='1859c2215ef2b5a1' id='adeba43c'/>
    <reference-type-def kind='lvalue' type-id='adeba43c' size-in-bits='32' hash='a0e20406f98276e9' id='e3f354ee'/>
    <pointer-type-def type-id='adeba43c' size-in-bits='32' hash='9fb54e704d2f1691' id='dff34ea2'/>
    <qualified-type-def type-id='9db4a8b6' const='yes' hash='57ec43ee63203035#21' id='127172e2'/>
    <reference-type-def kind='lvalue' type-id='127172e2' size-in-bits='32' hash='cf7393dc5ded56e4#21' id='049802bc'/>
    <qualified-type-def type-id='10e7e929' const='yes' hash='d186bac7bd04b5d2#3' id='2bf9e425'/>
    <reference-type-def kind='lvalue' type-id='2bf9e425' size-in-bits='32' hash='b0bae0eb804b9cb6#3' id='3d61f0b9'/>
    <qualified-type-def type-id='b38d4802' const='yes' hash='bb121a8bfcc8692b#9' id='3656e13f'/>
    <reference-type-def kind='lvalue' type-id='3656e13f' size-in-bits='32' hash='4be839be89a60d7e#9' id='a2c458c9'/>
    <qualified-type-def type-id='a104f5a1' const='yes' hash='addccc5ebf7e121a' id='b482634e'/>
    <reference-type-def kind='lvalue' type-id='b482634e' size-in-bits='32' hash='b0d06f2f6b82b2dd' id='91427cb8'/>
    <pointer-type-def type-id='b482634e' size-in-bits='32' hash='f243c8363a122db1' id='8d42766c'/>
    <qualified-type-def type-id='3b178084' const='yes' hash='57ec43ee63203035#22' id='127172e3'/>
    <reference-type-def kind='lvalue' type-id='127172e3' size-in-bits='32' hash='cf7393dc5ded56e4#22' id='049802bd'/>
    <qualified-type-def type-id='1cdac963' const='yes' hash='acab78ccd64216a9#4' id='2bf9e426'/>
    <reference-type-def kind='lvalue' type-id='2bf9e426' size-in-bits='32' hash='b0df660767854bf6#4' id='3d61f0ba'/>
    <qualified-type-def type-id='bb1f0094' const='yes' hash='9025f9e61356ecd8#10' id='3656e140'/>
    <reference-type-def kind='lvalue' type-id='3656e140' size-in-bits='32' hash='56e3663e96c6e340#10' id='a2c458ca'/>
    <qualified-type-def type-id='97ba1631' const='yes' hash='e19b33d9fcdf4a75' id='bada66f6'/>
    <reference-type-def kind='lvalue' type-id='bada66f6' size-in-bits='32' hash='dcc757cd5145c6f3' id='f5cfd970'/>
    <pointer-type-def type-id='bada66f6' size-in-bits='32' hash='f7a96a992c893017' id='01cfec54'/>
    <qualified-type-def type-id='2d95a82c' const='yes' hash='57ec43ee63203035#23' id='127172e4'/>
    <reference-type-def kind='lvalue' type-id='127172e4' size-in-bits='32' hash='cf7393dc5ded56e4#23' id='049802be'/>
    <qualified-type-def type-id='951e44e5' const='yes' hash='c484da14dc7589d8' id='3b165ce2'/>
    <reference-type-def kind='lvalue' type-id='3b165ce2' size-in-bits='32' hash='53d81d693acb1b86' id='c834088c'/>
    <pointer-type-def type-id='3b165ce2' size-in-bits='32' hash='4233152fa9b0ecd7' id='cc340ed8'/>
    <qualified-type-def type-id='36d323f8' const='yes' hash='57ec43ee63203035#24' id='127172e5'/>
    <reference-type-def kind='lvalue' type-id='127172e5' size-in-bits='32' hash='cf7393dc5ded56e4#24' id='049802bf'/>
    <qualified-type-def type-id='86513975' const='yes' hash='25bc3b652fc8df82' id='fe79fb3a'/>
    <reference-type-def kind='lvalue' type-id='fe79fb3a' size-in-bits='32' hash='8b6795b8f3ebbffa' id='b6064d14'/>
    <pointer-type-def type-id='fe79fb3a' size-in-bits='32' hash='9c6824159771fc3c' id='aa063a30'/>
    <qualified-type-def type-id='324852f0' const='yes' hash='57ec43ee63203035#27' id='127172e6'/>
    <reference-type-def kind='lvalue' type-id='127172e6' size-in-bits='32' hash='cf7393dc5ded56e4#27' id='049802c0'/>
    <qualified-type-def type-id='1a4295c7' const='yes' hash='441ebeb826d8a0ab#7' id='2bf9e427'/>
    <reference-type-def kind='lvalue' type-id='2bf9e427' size-in-bits='32' hash='a5eb9d4aa01b9166#7' id='3d61f0bb'/>
    <qualified-type-def type-id='79281988' const='yes' hash='fe64642f7b9f10b2#13' id='3656e141'/>
    <reference-type-def kind='lvalue' type-id='3656e141' size-in-bits='32' hash='92a3a6ec17d8083e#13' id='a2c458cb'/>
    <qualified-type-def type-id='cc5cd419' const='yes' hash='7a70efb8e6fff8f0' id='9c8ba446'/>
    <reference-type-def kind='lvalue' type-id='9c8ba446' size-in-bits='32' hash='d6cce7c19fb9488e' id='cfd3c320'/>
    <pointer-type-def type-id='9c8ba446' size-in-bits='32' hash='fc90d93700636095' id='dbd3d604'/>
    <qualified-type-def type-id='c879823c' const='yes' hash='57ec43ee63203035#30' id='127172e7'/>
    <reference-type-def kind='lvalue' type-id='127172e7' size-in-bits='32' hash='cf7393dc5ded56e4#30' id='049802c1'/>
    <qualified-type-def type-id='dfecc261' const='yes' hash='786ee48164214e64' id='39f98ad6'/>
    <reference-type-def kind='lvalue' type-id='39f98ad6' size-in-bits='32' hash='59a7f7a309446dee' id='33d5b7d0'/>
    <pointer-type-def type-id='39f98ad6' size-in-bits='32' hash='5a6c9be0166d26c7' id='3fd5cab4'/>
    <qualified-type-def type-id='352fcd0c' const='yes' hash='57ec43ee63203035#31' id='127172e8'/>
    <reference-type-def kind='lvalue' type-id='127172e8' size-in-bits='32' hash='cf7393dc5ded56e4#31' id='049802c2'/>
    <qualified-type-def type-id='be2111ab' const='yes' hash='bc797522b9ea42d4#10' id='2bf9e428'/>
    <reference-type-def kind='lvalue' type-id='2bf9e428' size-in-bits='32' hash='c127013b545c33ee#10' id='3d61f0bc'/>
    <qualified-type-def type-id='296c784c' const='yes' hash='02dcf5e6feeed328#16' id='3656e142'/>
    <reference-type-def kind='lvalue' type-id='3656e142' size-in-bits='32' hash='a6859441533fa59e#16' id='a2c458cc'/>
    <qualified-type-def type-id='4bafa653' const='yes' hash='51237f1856959954' id='204d3172'/>
    <reference-type-def kind='lvalue' type-id='204d3172' size-in-bits='32' hash='93b5a530b5777746' id='2d84a73c'/>
    <pointer-type-def type-id='204d3172' size-in-bits='32' hash='d9d79fbc4dd6059a' id='3184ad88'/>
    <qualified-type-def type-id='19917da8' const='yes' hash='57ec43ee63203035#32' id='127172e9'/>
    <reference-type-def kind='lvalue' type-id='127172e9' size-in-bits='32' hash='cf7393dc5ded56e4#32' id='049802c3'/>
    <qualified-type-def type-id='5a1a385f' const='yes' hash='33b284518799f3da#11' id='2bf9e429'/>
    <reference-type-def kind='lvalue' type-id='2bf9e429' size-in-bits='32' hash='7ef96bfe06c28633#11' id='3d61f0bd'/>
    <qualified-type-def type-id='c8be4550' const='yes' hash='38476c2abed6f0e2#17' id='3656e143'/>
    <reference-type-def kind='lvalue' type-id='3656e143' size-in-bits='32' hash='eb0f06372272961d#17' id='a2c458cd'/>
    <qualified-type-def type-id='ccc1a701' const='yes' hash='6eba6a67cb20f904' id='6ba820fe'/>
    <reference-type-def kind='lvalue' type-id='6ba820fe' size-in-bits='32' hash='f7dfa8c9659a9054' id='51abb408'/>
    <pointer-type-def type-id='6ba820fe' size-in-bits='32' hash='0ed6d3eb095a7a4a' id='4dabadbc'/>
    <qualified-type-def type-id='d5ff43f4' const='yes' hash='57ec43ee63203035#33' id='127172ea'/>
    <reference-type-def kind='lvalue' type-id='127172ea' size-in-bits='32' hash='cf7393dc5ded56e4#33' id='049802c4'/>
    <qualified-type-def type-id='73ca7213' const='yes' hash='71c672fd0e6155ea#12' id='2bf9e42a'/>
    <reference-type-def kind='lvalue' type-id='2bf9e42a' size-in-bits='32' hash='f6f3a239ba09b913#12' id='3d61f0be'/>
    <qualified-type-def type-id='098dee04' const='yes' hash='c3daca1b62f72164#18' id='3656e144'/>
    <reference-type-def kind='lvalue' type-id='3656e144' size-in-bits='32' hash='c7887eaeb279961f#18' id='a2c458ce'/>
    <qualified-type-def type-id='c99d6d34' const='yes' hash='20853120a9f50574' id='86a0d7d7'/>
    <pointer-type-def type-id='86a0d7d7' size-in-bits='32' hash='58d5ed58576127d5' id='ec340347'/>
    <qualified-type-def type-id='a122f21c' const='yes' hash='52013c6344ac73e7' id='bd903223'/>
    <pointer-type-def type-id='bd903223' size-in-bits='32' hash='1e360620fe31f42a' id='72fec42b'/>
    <qualified-type-def type-id='4f878678' const='yes' hash='058a7e8651511413' id='dc7f3811'/>
    <reference-type-def kind='lvalue' type-id='dc7f3811' size-in-bits='32' hash='ace6fca7a0a7cc4f' id='53457e95'/>
    <pointer-type-def type-id='dc7f3811' size-in-bits='32' hash='589bc8d421f2c235' id='574584e1'/>
    <qualified-type-def type-id='fb2b2135' const='yes' hash='49a99f02da4be126' id='3ecc6a56'/>
    <reference-type-def kind='lvalue' type-id='3ecc6a56' size-in-bits='32' hash='111bd25f1e78a39a' id='4bcb8e50'/>
    <pointer-type-def type-id='3ecc6a56' size-in-bits='32' hash='19ee2a0d65fa98c6' id='57cba134'/>
    <qualified-type-def type-id='f96f37f4' const='yes' hash='ee9e30bebf8756c7' id='3c42718b'/>
    <reference-type-def kind='lvalue' type-id='3c42718b' size-in-bits='32' hash='229bd808cc1d6d37' id='8998f357'/>
    <pointer-type-def type-id='3c42718b' size-in-bits='32' hash='736525a26e532f11' id='7d98e073'/>
    <qualified-type-def type-id='dbb0c32e' const='yes' hash='365958342fc55df7' id='0145e9ad'/>
    <reference-type-def kind='lvalue' type-id='0145e9ad' size-in-bits='32' hash='8a640dc802e48f09' id='8c0ea5d1'/>
    <pointer-type-def type-id='0145e9ad' size-in-bits='32' hash='4293acfb95861cc7' id='880e9f85'/>
    <qualified-type-def type-id='bc83a16a' const='yes' hash='a8c5179b7591339a' id='e1d417f9'/>
    <reference-type-def kind='lvalue' type-id='e1d417f9' size-in-bits='32' hash='e48e9aa9ce8e0612' id='5fe1940d'/>
    <pointer-type-def type-id='e1d417f9' size-in-bits='32' hash='7cfc4d62f92bca4d' id='53e18129'/>
    <qualified-type-def type-id='443bd0ae' const='yes' hash='f63362316cde50a7' id='94a71cf9'/>
    <reference-type-def kind='lvalue' type-id='94a71cf9' size-in-bits='32' hash='197c56ffd5cb7f51' id='e212730d'/>
    <pointer-type-def type-id='94a71cf9' size-in-bits='32' hash='48c5daeea38317df' id='d6126029'/>
    <qualified-type-def type-id='c7b95082' const='yes' hash='902ffeb42efa2254' id='1377b429'/>
    <reference-type-def kind='lvalue' type-id='1377b429' size-in-bits='32' hash='a1a3eab50cb2d749' id='b470739d'/>
    <pointer-type-def type-id='1377b429' size-in-bits='32' hash='5906930b6b9adb8a' id='a87060b9'/>
    <qualified-type-def type-id='c566fa15' const='yes' hash='09901734fc5e66cd' id='8b38c90e'/>
    <reference-type-def kind='lvalue' type-id='8b38c90e' size-in-bits='32' hash='b90582e58281dd05' id='5264a9f8'/>
    <pointer-type-def type-id='8b38c90e' size-in-bits='32' hash='ff95122fd5d3536a' id='4e64a3ac'/>
    <qualified-type-def type-id='35484ac1' const='yes' hash='6345cebe0749c0c0' id='e0298922'/>
    <reference-type-def kind='lvalue' type-id='e0298922' size-in-bits='32' hash='6043c538f7fd39a9' id='e562b14c'/>
    <pointer-type-def type-id='e0298922' size-in-bits='32' hash='14255450d60f2f6f' id='e962b798'/>
    <qualified-type-def type-id='9d7cc6de' const='yes' hash='a727fe81152149be' id='ea3375d3'/>
    <reference-type-def kind='lvalue' type-id='ea3375d3' size-in-bits='32' hash='26b2f416c1edb759' id='a402b0af'/>
    <pointer-type-def type-id='ea3375d3' size-in-bits='32' hash='eee0f574baf604a7' id='a802b6fb'/>
    <qualified-type-def type-id='fe392671' const='yes' hash='8664d0b0f7414ec9' id='c9b609d0'/>
    <reference-type-def kind='lvalue' type-id='c9b609d0' size-in-bits='32' hash='3cf4189fe2bc6da3' id='7f91ae42'/>
    <pointer-type-def type-id='c9b609d0' size-in-bits='32' hash='33b2d92ae1f255bf' id='8391b48e'/>
    <qualified-type-def type-id='48b06606' const='yes' hash='2ce4cee5cd2b8ead' id='5fef81e5'/>
    <reference-type-def kind='lvalue' type-id='5fef81e5' size-in-bits='32' hash='1c930c0de80e00cd' id='c90945f9'/>
    <pointer-type-def type-id='5fef81e5' size-in-bits='32' hash='9b0ae5a2b5c7d08a' id='d50958dd'/>
    <qualified-type-def type-id='251e995b' const='yes' hash='d143f2576cc10f75' id='5245b2d0'/>
    <reference-type-def kind='lvalue' type-id='5245b2d0' size-in-bits='32' hash='ad7862a40a41a9e5' id='79b8b942'/>
    <pointer-type-def type-id='5245b2d0' size-in-bits='32' hash='1aa84c195b179c17' id='7db8bf8e'/>
    <qualified-type-def type-id='619f09b0' const='yes' hash='d00dddd4f198d12f' id='db7a342b'/>
    <reference-type-def kind='lvalue' type-id='db7a342b' size-in-bits='32' hash='1da86ebdff6dccbe' id='8e5ff077'/>
    <pointer-type-def type-id='db7a342b' size-in-bits='32' hash='069865e6dc739111' id='825fdd93'/>
    <qualified-type-def type-id='500299ab' const='yes' hash='d729099e14bd36ad' id='062c8fe8'/>
    <reference-type-def kind='lvalue' type-id='062c8fe8' size-in-bits='32' hash='afc7f1484a67fad2' id='8626614a'/>
    <pointer-type-def type-id='062c8fe8' size-in-bits='32' hash='8db180fcfb3701f2' id='7a264e66'/>
    <qualified-type-def type-id='089fe5a3' const='yes' hash='4712320cfd067502' id='7588d14e'/>
    <reference-type-def kind='lvalue' type-id='7588d14e' size-in-bits='32' hash='e408acb31b00eead' id='6e61a6b8'/>
    <pointer-type-def type-id='7588d14e' size-in-bits='32' hash='6273c44eaa28175b' id='6a61a06c'/>
    <qualified-type-def type-id='f6626d42' const='yes' hash='7f302637cca9872b' id='17bb75ff'/>
    <reference-type-def kind='lvalue' type-id='17bb75ff' size-in-bits='32' hash='a27c3d5c60b9d5f7' id='351a849b'/>
    <pointer-type-def type-id='17bb75ff' size-in-bits='32' hash='7d6e50773e3b802e' id='311a7e4f'/>
    <qualified-type-def type-id='bf1e7ced' const='yes' hash='14e7e00e233dea0c' id='001b74d0'/>
    <reference-type-def kind='lvalue' type-id='001b74d0' size-in-bits='32' hash='b771b213f9133e21' id='21391f42'/>
    <pointer-type-def type-id='001b74d0' size-in-bits='32' hash='cf7a13762bcf701e' id='2539258e'/>
    <qualified-type-def type-id='1b40f38a' const='yes' hash='d1a7c2a1b688b637' id='2538414b'/>
    <reference-type-def kind='lvalue' type-id='2538414b' size-in-bits='32' hash='2881b839abf5736b' id='048efe97'/>
    <pointer-type-def type-id='2538414b' size-in-bits='32' hash='6dffc726e72e0fcd' id='f88eebb3'/>
    <qualified-type-def type-id='30745bfb' const='yes' hash='e8314d9c7073626a' id='db87b3f2'/>
    <pointer-type-def type-id='db87b3f2' size-in-bits='32' hash='99ab7a8756cc21e1' id='6ea01d08'/>
    <qualified-type-def type-id='82ce69b4' const='yes' hash='6af3c614cb48a957' id='49a750c1'/>
    <pointer-type-def type-id='49a750c1' size-in-bits='32' hash='1bf513b211d80d60' id='dd6461f1'/>
    <qualified-type-def type-id='7a1975f9' const='yes' hash='be8c3deba546635a' id='3f098f6c'/>
    <pointer-type-def type-id='3f098f6c' size-in-bits='32' hash='a1bb3556b5300b2a' id='820c8b32'/>
    <qualified-type-def type-id='d05727fd' const='yes' hash='aba06f8f776075d7' id='412f8662'/>
    <pointer-type-def type-id='412f8662' size-in-bits='32' hash='77e5c97dfec99894' id='e5d06358'/>
    <qualified-type-def type-id='9d7dd6fe' const='yes' hash='5c180ba383d6d8a6' id='26f80b51'/>
    <pointer-type-def type-id='26f80b51' size-in-bits='32' hash='62821c1add44bb01' id='d37a12a1'/>
    <qualified-type-def type-id='84f52bff' const='yes' hash='0be64e3bbd0a379f' id='5fc9545c'/>
    <pointer-type-def type-id='5fc9545c' size-in-bits='32' hash='77a19b58fae18605' id='3feff5c2'/>
    <qualified-type-def type-id='d784bbd4' const='yes' hash='cf60a85996bf5323' id='370afc1f'/>
    <pointer-type-def type-id='370afc1f' size-in-bits='32' hash='68c223746094f851' id='db4b076f'/>
    <qualified-type-def type-id='f5a6c2c2' const='yes' hash='57ec43ee63203035#43' id='127172eb'/>
    <reference-type-def kind='lvalue' type-id='127172eb' size-in-bits='32' hash='cf7393dc5ded56e4#43' id='049802c5'/>
    <qualified-type-def type-id='d3f9cf63' const='yes' hash='57ec43ee63203035#44' id='127172ec'/>
    <reference-type-def kind='lvalue' type-id='127172ec' size-in-bits='32' hash='cf7393dc5ded56e4#44' id='049802c6'/>
    <qualified-type-def type-id='e283594e' const='yes' hash='57ec43ee63203035#45' id='127172ed'/>
    <reference-type-def kind='lvalue' type-id='127172ed' size-in-bits='32' hash='cf7393dc5ded56e4#45' id='049802c7'/>
    <qualified-type-def type-id='e53cc294' const='yes' hash='57ec43ee63203035#46' id='127172ee'/>
    <reference-type-def kind='lvalue' type-id='127172ee' size-in-bits='32' hash='cf7393dc5ded56e4#46' id='049802c8'/>
    <qualified-type-def type-id='2a25b660' const='yes' hash='57ec43ee63203035#49' id='127172ef'/>
    <reference-type-def kind='lvalue' type-id='127172ef' size-in-bits='32' hash='cf7393dc5ded56e4#49' id='049802c9'/>
    <qualified-type-def type-id='e8b5bb94' const='yes' hash='57ec43ee63203035#53' id='127172f0'/>
    <reference-type-def kind='lvalue' type-id='127172f0' size-in-bits='32' hash='cf7393dc5ded56e4#53' id='049802ca'/>
    <qualified-type-def type-id='32e47c40' const='yes' hash='57ec43ee63203035#54' id='127172f1'/>
    <reference-type-def kind='lvalue' type-id='127172f1' size-in-bits='32' hash='cf7393dc5ded56e4#54' id='049802cb'/>
    <qualified-type-def type-id='f4c79cc7' const='yes' hash='57ec43ee63203035#55' id='127172f2'/>
    <reference-type-def kind='lvalue' type-id='127172f2' size-in-bits='32' hash='cf7393dc5ded56e4#55' id='049802cc'/>
    <qualified-type-def type-id='c446d2cb' const='yes' hash='57ec43ee63203035#56' id='127172f3'/>
    <reference-type-def kind='lvalue' type-id='127172f3' size-in-bits='32' hash='cf7393dc5ded56e4#56' id='049802cd'/>
    <qualified-type-def type-id='56b4dd50' const='yes' hash='57ec43ee63203035#57' id='127172f4'/>
    <reference-type-def kind='lvalue' type-id='127172f4' size-in-bits='32' hash='cf7393dc5ded56e4#57' id='049802ce'/>
    <qualified-type-def type-id='d48b26bb' const='yes' hash='57ec43ee63203035#58' id='127172f5'/>
    <reference-type-def kind='lvalue' type-id='127172f5' size-in-bits='32' hash='cf7393dc5ded56e4#58' id='049802cf'/>
    <qualified-type-def type-id='384a7181' const='yes' hash='57ec43ee63203035#74' id='127172f6'/>
    <reference-type-def kind='lvalue' type-id='127172f6' size-in-bits='32' hash='cf7393dc5ded56e4#74' id='049802d0'/>
    <qualified-type-def type-id='8b095b74' const='yes' hash='57ec43ee63203035#75' id='127172f7'/>
    <reference-type-def kind='lvalue' type-id='127172f7' size-in-bits='32' hash='cf7393dc5ded56e4#75' id='049802d1'/>
    <qualified-type-def type-id='c4c47537' const='yes' hash='57ec43ee63203035#77' id='127172f8'/>
    <reference-type-def kind='lvalue' type-id='127172f8' size-in-bits='32' hash='cf7393dc5ded56e4#77' id='049802d2'/>
    <qualified-type-def type-id='e5f05e18' const='yes' hash='57ec43ee63203035#78' id='127172f9'/>
    <reference-type-def kind='lvalue' type-id='127172f9' size-in-bits='32' hash='cf7393dc5ded56e4#78' id='049802d3'/>
    <qualified-type-def type-id='2848c8a1' const='yes' hash='57ec43ee63203035#82' id='127172fa'/>
    <reference-type-def kind='lvalue' type-id='127172fa' size-in-bits='32' hash='cf7393dc5ded56e4#82' id='049802d4'/>
    <qualified-type-def type-id='9e02975e' const='yes' hash='57ec43ee63203035#83' id='127172fb'/>
    <reference-type-def kind='lvalue' type-id='127172fb' size-in-bits='32' hash='cf7393dc5ded56e4#83' id='049802d5'/>
    <qualified-type-def type-id='a5d1359b' const='yes' hash='57ec43ee63203035#85' id='127172fc'/>
    <reference-type-def kind='lvalue' type-id='127172fc' size-in-bits='32' hash='cf7393dc5ded56e4#85' id='049802d6'/>
    <qualified-type-def type-id='6fe64836' const='yes' hash='57ec43ee63203035#89' id='127172fd'/>
    <reference-type-def kind='lvalue' type-id='127172fd' size-in-bits='32' hash='cf7393dc5ded56e4#89' id='049802d7'/>
    <qualified-type-def type-id='155e8fd8' const='yes' hash='6b827efbaf1317d7' id='caec6cbf'/>
    <pointer-type-def type-id='caec6cbf' size-in-bits='32' hash='063f67346a177a25' id='072eee8f'/>
    <qualified-type-def type-id='70799029' const='yes' hash='452a98dd388be9f7#26' id='3656e145'/>
    <reference-type-def kind='lvalue' type-id='3656e145' size-in-bits='32' hash='69d16db03af4d9b5#26' id='a2c458cf'/>
    <pointer-type-def type-id='3656e145' size-in-bits='32' hash='5856a4d127a7adf4' id='9ec4527c'/>
    <qualified-type-def type-id='4da3c689' const='yes' hash='21183bce86e954d3' id='e5a3737c'/>
    <reference-type-def kind='lvalue' type-id='e5a3737c' size-in-bits='32' hash='a92dd93ef0fe37bf' id='da4e96ae'/>
    <qualified-type-def type-id='97219ec5' const='yes' hash='704f5e5efff62eb9#27' id='3656e146'/>
    <pointer-type-def type-id='3656e146' size-in-bits='32' hash='b8589766f2c1b8c2#2' id='9ec4527d'/>
    <qualified-type-def type-id='cea92a70' const='yes' hash='5d889335cf778f29' id='0be3de7b'/>
    <reference-type-def kind='lvalue' type-id='0be3de7b' size-in-bits='32' hash='8b558d5422a1ef83' id='14b70c67'/>
    <pointer-type-def type-id='0be3de7b' size-in-bits='32' hash='17cec3642ede9fd5' id='08b6f983'/>
    <qualified-type-def type-id='ca9cbb0d' const='yes' hash='21183bce86e954d3' id='14ee82e4'/>
    <reference-type-def kind='lvalue' type-id='14ee82e4' size-in-bits='32' hash='a92dd93ef0fe37bf' id='b577d766'/>
    <qualified-type-def type-id='b9c5d5a9' const='yes' hash='57ec43ee63203035#92' id='127172fe'/>
    <reference-type-def kind='lvalue' type-id='127172fe' size-in-bits='32' hash='cf7393dc5ded56e4#92' id='049802d8'/>
    <qualified-type-def type-id='1a8dd50d' const='yes' hash='105a3f9065775d15#28' id='3656e147'/>
    <reference-type-def kind='lvalue' type-id='3656e147' size-in-bits='32' hash='cc94ef3749207f2d#27' id='a2c458d0'/>
    <pointer-type-def type-id='3656e147' size-in-bits='32' hash='ba25028ed02f26a5#3' id='9ec4527e'/>
    <qualified-type-def type-id='501d9695' const='yes' hash='0b2346aac903da5f' id='11376d86'/>
    <reference-type-def kind='lvalue' type-id='11376d86' size-in-bits='32' hash='c5d941fd995a7270' id='ba4192e0'/>
    <pointer-type-def type-id='11376d86' size-in-bits='32' hash='bb2a0f5e86633064' id='c641a5c4'/>
    <qualified-type-def type-id='5bec325c' const='yes' hash='105a3f9065775d15#29' id='3656e148'/>
    <pointer-type-def type-id='3656e148' size-in-bits='32' hash='ba25028ed02f26a5#4' id='9ec4527f'/>
    <qualified-type-def type-id='a82808e9' const='yes' hash='0d301f00e830e5eb' id='2c9ebcad'/>
    <reference-type-def kind='lvalue' type-id='2c9ebcad' size-in-bits='32' hash='9349270139bb794b' id='c8e2ced1'/>
    <pointer-type-def type-id='2c9ebcad' size-in-bits='32' hash='13c47f2cf302224c' id='c4e2c885'/>
    <qualified-type-def type-id='983adb98' const='yes' hash='9524484f733c288f' id='05fc47b4'/>
    <reference-type-def kind='lvalue' type-id='05fc47b4' size-in-bits='32' hash='f7cbe43b530b11ac' id='fe24aad6'/>
    <qualified-type-def type-id='d81eed6b' const='yes' hash='3d6e5f4227b229be' id='9e890de2'/>
    <reference-type-def kind='lvalue' type-id='9e890de2' size-in-bits='32' hash='bd4c7254aa8d3f07' id='55c0ab8c'/>
    <pointer-type-def type-id='9e890de2' size-in-bits='32' hash='728bb0d385529cee' id='59c0b1d8'/>
    <qualified-type-def type-id='afb20d38' const='yes' hash='049b90055bb27abe' id='036f5893'/>
    <reference-type-def kind='lvalue' type-id='036f5893' size-in-bits='32' hash='61eaf5240b294064' id='1d48a4ef'/>
    <pointer-type-def type-id='036f5893' size-in-bits='32' hash='7ae0113a1387d60b' id='2148ab3b'/>
    <qualified-type-def type-id='3c207afe' const='yes' hash='117c74fda2e9706a' id='42021ec3'/>
    <reference-type-def kind='lvalue' type-id='42021ec3' size-in-bits='32' hash='cd26d8e8ce3e6ccf' id='ce56a27f'/>
    <pointer-type-def type-id='42021ec3' size-in-bits='32' hash='dcfeadb59af12de7' id='d256a8cb'/>
    <qualified-type-def type-id='f9e4b3e7' const='yes' hash='525742f63fbcd039' id='78c34362'/>
    <reference-type-def kind='lvalue' type-id='78c34362' size-in-bits='32' hash='16dc2882525c196f' id='5f62e40c'/>
    <pointer-type-def type-id='78c34362' size-in-bits='32' hash='0a1aeea7ddeb0e57' id='6362ea58'/>
    <qualified-type-def type-id='60662a11' const='yes' hash='b1e60a9a7f1aba14' id='1458d402'/>
    <reference-type-def kind='lvalue' type-id='1458d402' size-in-bits='32' hash='ae9f9aea5f5b88fa' id='2bd5f4ac'/>
    <pointer-type-def type-id='1458d402' size-in-bits='32' hash='ee8e54eea052e48a' id='2fd5faf8'/>
    <qualified-type-def type-id='21d7352a' const='yes' hash='951e77d45f5b903a' id='05623813'/>
    <reference-type-def kind='lvalue' type-id='05623813' size-in-bits='32' hash='175500704c3e0271' id='ae9e7b6f'/>
    <pointer-type-def type-id='05623813' size-in-bits='32' hash='e0a9951edfab3fb6' id='b29e81bb'/>
    <qualified-type-def type-id='99463423' const='yes' hash='6c338751a97068ae' id='84e91272'/>
    <reference-type-def kind='lvalue' type-id='84e91272' size-in-bits='32' hash='1792294c1005d0af' id='8ee7da3c'/>
    <pointer-type-def type-id='84e91272' size-in-bits='32' hash='c54656ae81f4795e' id='92e7e088'/>
    <qualified-type-def type-id='f4edc297' const='yes' hash='a170d88ecb4db43a' id='0542114e'/>
    <pointer-type-def type-id='0542114e' size-in-bits='32' hash='602421de7e0602e5' id='ab01606c'/>
    <qualified-type-def type-id='249572b2' const='yes' hash='f4e2d682d4887045' id='236fe7b5'/>
    <pointer-type-def type-id='236fe7b5' size-in-bits='32' hash='8cec3a133bfbe249' id='68299f4d'/>
    <qualified-type-def type-id='33591497' const='yes' hash='7468727c2510d48c' id='ef041530'/>
    <reference-type-def kind='lvalue' type-id='ef041530' size-in-bits='32' hash='85883528550314b7' id='596d31a2'/>
    <qualified-type-def type-id='199fc21a' const='yes' hash='f436fd31ff8be8b5' id='07053001'/>
    <reference-type-def kind='lvalue' type-id='07053001' size-in-bits='32' hash='d6d0d72e458dcb3a' id='342acd65'/>
    <qualified-type-def type-id='6efd2fac' const='yes' hash='5935a4a73c78abd5' id='0b53cd55'/>
    <reference-type-def kind='lvalue' type-id='0b53cd55' size-in-bits='32' hash='997282d14814a1b7' id='47ec6c09'/>
    <pointer-type-def type-id='0b53cd55' size-in-bits='32' hash='c9797307ad2a4a30' id='53ec7eed'/>
    <qualified-type-def type-id='53ec7eed' const='yes' hash='36e4004f23aeea1c' id='83417942'/>
    <reference-type-def kind='lvalue' type-id='83417942' size-in-bits='32' hash='62ebe432bb289605' id='0412186c'/>
    <reference-type-def kind='lvalue' type-id='53ec7eed' size-in-bits='32' hash='6610a232489d4330' id='e84b9991'/>
    <qualified-type-def type-id='222ea3df' const='yes' hash='b356dabc2f3ace8d' id='aade6091'/>
    <reference-type-def kind='lvalue' type-id='aade6091' size-in-bits='32' hash='4768afadfb024748' id='b3124015'/>
    <qualified-type-def type-id='ac070eda' const='yes' hash='029537b957f606a6' id='a94d5121'/>
    <pointer-type-def type-id='a94d5121' size-in-bits='32' hash='08002059733492a3' id='8fb69451'/>
    <qualified-type-def type-id='5f48c471' const='yes' hash='e3dfcfb72e1ddcb2#3' id='fc5a3b8a'/>
    <reference-type-def kind='lvalue' type-id='fc5a3b8a' size-in-bits='32' hash='768b1e3ba2096387#3' id='f00bf2ec'/>
    <qualified-type-def type-id='6a6c3f8a' const='yes' hash='615a729a7b292ce0' id='181848a1'/>
    <pointer-type-def type-id='181848a1' size-in-bits='32' hash='a75e6a24c0ddc848' id='793a32d1'/>
    <qualified-type-def type-id='8997c6b1' const='yes' hash='e3dfcfb72e1ddcb2#4' id='fc5a3b8b'/>
