<abi-corpus version='2.4' soname='libGLU.so.1'>
  <elf-needed>
    <dependency name='libGL.so.1'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='gluBeginCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBeginPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBeginSurface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBeginTrim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild1DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild1DMipmaps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild2DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild2DMipmaps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluBuild3DMipmapLevels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='gluEndCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluEndPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluEndSurface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluEndTrim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluErrorString' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluGetNurbsProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluGetString' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluGetTessProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluLoadSamplingMatrices' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluLookAt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNewNurbsRenderer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNewQuadric' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNewTess' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNextContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCallbackData' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCallbackDataEXT' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluNurbsSurface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluOrtho2D' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPartialDisk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPerspective' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPickMatrix' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluProject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluPwlCurve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricDrawStyle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricNormals' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricOrientation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluQuadricTexture' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluScaleImage' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluSphere' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessBeginContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessBeginPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessCallback' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessEndContour' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessEndPolygon' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessNormal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessProperty' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluTessVertex' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluUnProject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gluUnProject4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='libnurbs/interface/bezierPatchMesh.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='bezierPatch' is-struct='yes' visibility='default' size-in-bits='384' filepath='libnurbs/interface/bezierPatch.h' line='36' column='1' hash='d203fe57ab48cffc' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='umin' type-id='type-id-2' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vmin' type-id='type-id-2' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='umax' type-id='type-id-2' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vmax' type-id='type-id-2' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='vorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dimension' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ctlpoints' type-id='type-id-4' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next' type-id='type-id-5' visibility='default' filepath='libnurbs/interface/bezierPatch.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bezierPatchMesh' is-struct='yes' visibility='default' size-in-bits='960' filepath='libnurbs/interface/bezierPatchMesh.h' line='39' column='1' hash='44b8e12f6ca8acd3' id='type-id-6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bpatch' type-id='type-id-7' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bpatch_normal' type-id='type-id-7' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bpatch_texcoord' type-id='type-id-7' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bpatch_color' type-id='type-id-7' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='UVarray' type-id='type-id-4' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='length_array' type-id='type-id-8' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='type_array' type-id='type-id-9' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='size_UVarray' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='index_UVarray' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='size_length_array' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='index_length_array' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='counter' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='type' type-id='type-id-10' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='vertex_array' type-id='type-id-4' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='normal_array' type-id='type-id-4' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='color_array' type-id='type-id-4' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='texcoord_array' type-id='type-id-4' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='next' type-id='type-id-11' visibility='default' filepath='libnurbs/interface/bezierPatchMesh.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bezierPatch' type-id='type-id-1' size-in-bits='384' filepath='libnurbs/interface/bezierPatch.h' line='65' column='1' id='type-id-12'/>
    <typedef-decl name='bezierPatchMesh' type-id='type-id-6' size-in-bits='960' filepath='libnurbs/interface/bezierPatchMesh.h' line='66' column='1' id='type-id-13'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' hash='c1f3555c52d20679' id='type-id-9'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' hash='4f16043562680025' id='type-id-5'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' hash='4f16043562680025#2' id='type-id-7'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' hash='24cf0de04a1708da' id='type-id-11'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' hash='24cf0de04a1708da#2' id='type-id-14'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' hash='5022839615992ac0' id='type-id-4'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' hash='3fd83b2c14ae2f2f' id='type-id-8'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glcurveval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='5120' hash='ce922d9abf7a8a27' id='type-id-16'>
      <subrange length='160' lower-bound='0' upper-bound='159' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='dd8476b5115dfea8' id='type-id-18'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='1280' hash='60df066dd1909539' id='type-id-19'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='type-id-20'/>
    </array-type-def>
    <class-decl name='OpenGLCurveEvaluator' visibility='default' size-in-bits='27584' filepath='libnurbs/interface/glcurveval.h' line='66' column='1' hash='e8c87979939c52ba' id='type-id-21'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-22'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='em_vertex' type-id='type-id-23' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='102' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6656'>
        <var-decl name='em_normal' type-id='type-id-23' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='103' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='13248'>
        <var-decl name='em_color' type-id='type-id-23' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='104' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19840'>
        <var-decl name='em_texcoord' type-id='type-id-23' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='105' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26432'>
        <var-decl name='vertex_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26464'>
        <var-decl name='normal_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='107' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26496'>
        <var-decl name='color_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='108' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26528'>
        <var-decl name='texcoord_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26560'>
        <var-decl name='global_grid_u0' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26592'>
        <var-decl name='global_grid_u1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26624'>
        <var-decl name='global_grid_nu' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='113' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26688'>
        <var-decl name='beginCallBackN' type-id='type-id-24' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26752'>
        <var-decl name='endCallBackN' type-id='type-id-25' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26816'>
        <var-decl name='vertexCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26880'>
        <var-decl name='normalCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26944'>
        <var-decl name='colorCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27008'>
        <var-decl name='texcoordCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='133' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27072'>
        <var-decl name='beginCallBackData' type-id='type-id-27' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='135' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27136'>
        <var-decl name='endCallBackData' type-id='type-id-28' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='136' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27200'>
        <var-decl name='vertexCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27264'>
        <var-decl name='normalCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='138' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27328'>
        <var-decl name='colorCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='139' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27392'>
        <var-decl name='texcoordCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27456'>
        <var-decl name='userData' type-id='type-id-30' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='142' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27520'>
        <var-decl name='output_triangles' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='154' column='1'/>
      </data-member>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~OpenGLCurveEvaluator' filepath='libnurbs/interface/glcurveval.cc' line='78' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <parameter type-id='type-id-3' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='9'>
        <function-decl name='domain1f' mangled-name='_ZN20OpenGLCurveEvaluator8domain1fEff' filepath='libnurbs/interface/glcurveval.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64' hash='db8105e6b583cbd0'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='10'>
        <function-decl name='range1f' mangled-name='_ZN20OpenGLCurveEvaluator7range1fElPfS0_' filepath='libnurbs/interface/glcurveval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64' hash='ca180d896c71b6c7'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN20OpenGLCurveEvaluator6enableEl' filepath='libnurbs/interface/glcurveval.cc' line='137' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN20OpenGLCurveEvaluator7disableEl' filepath='libnurbs/interface/glcurveval.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='13'>
        <function-decl name='bgnmap1f' mangled-name='_ZN20OpenGLCurveEvaluator8bgnmap1fEl' filepath='libnurbs/interface/glcurveval.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='14'>
        <function-decl name='map1f' mangled-name='_ZN20OpenGLCurveEvaluator5map1fElffllPf' filepath='libnurbs/interface/glcurveval.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64' hash='f98f6f059a92e1c7'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='15'>
        <function-decl name='mapgrid1f' mangled-name='_ZN20OpenGLCurveEvaluator9mapgrid1fElff' filepath='libnurbs/interface/glcurveval.cc' line='147' column='1' visibility='default' binding='global' size-in-bits='64' hash='3298e9f33f58ace5'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='16'>
        <function-decl name='mapmesh1f' mangled-name='_ZN20OpenGLCurveEvaluator9mapmesh1fElll' filepath='libnurbs/interface/glcurveval.cc' line='262' column='1' visibility='default' binding='global' size-in-bits='64' hash='2461ca6254ad53d2'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='17'>
        <function-decl name='evalcoord1f' mangled-name='_ZN20OpenGLCurveEvaluator11evalcoord1fElf' filepath='libnurbs/interface/glcurveval.cc' line='296' column='1' visibility='default' binding='global' size-in-bits='64' hash='abf64f704bd8df76'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='18'>
        <function-decl name='endmap1f' mangled-name='_ZN20OpenGLCurveEvaluator8endmap1fEv' filepath='libnurbs/interface/glcurveval.cc' line='184' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='19'>
        <function-decl name='bgnline' mangled-name='_ZN20OpenGLCurveEvaluator7bgnlineEv' filepath='libnurbs/interface/glcurveval.cc' line='105' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='20'>
        <function-decl name='endline' mangled-name='_ZN20OpenGLCurveEvaluator7endlineEv' filepath='libnurbs/interface/glcurveval.cc' line='114' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-31' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='curveEvalMachine' is-struct='yes' visibility='default' size-in-bits='6592' filepath='libnurbs/interface/glcurveval.h' line='55' column='1' hash='a602d5b1accda201' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uprime' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='k' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='u1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='u2' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ustride' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='uorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ctlpoints' type-id='type-id-16' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='ucoeff' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glcurveval.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='REAL' type-id='type-id-2' size-in-bits='32' filepath='libnurbs/internals/types.h' line='41' column='1' hash='d7ec3bf03d3c5690' id='type-id-15'/>
    <typedef-decl name='curveEvalMachine' type-id='type-id-35' size-in-bits='6592' filepath='libnurbs/interface/glcurveval.h' line='64' column='1' id='type-id-23'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' hash='b03786f72e5829cf' id='type-id-37'/>
    <qualified-type-def type-id='type-id-37' const='yes' hash='4faf346980fe02bf' id='type-id-38'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' hash='b91559f9593fd13e' id='type-id-31'/>
    <qualified-type-def type-id='type-id-31' const='yes' hash='5b363d9db8c8ec1e' id='type-id-39'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' hash='93d591affbbd5f40' id='type-id-34'/>
    <qualified-type-def type-id='type-id-40' const='yes' hash='af53eb456940121e' id='type-id-41'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' hash='ee073772e477e208' id='type-id-42'/>
    <qualified-type-def type-id='type-id-3' const='yes' hash='8cef8df4b6728924' id='type-id-43'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' hash='d911b498457b3672' id='type-id-44'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-26'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-29'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-48'/>
    <class-decl name='CachingEvaluator' visibility='default' size-in-bits='64' filepath='libnurbs/internals/cachingeval.h' line='39' column='1' hash='3b4a36132c0975c1' id='type-id-36'>
      <member-type access='private'>
        <enum-decl name='ServiceMode' size-in-bits='32' alignment-in-bits='32' filepath='libnurbs/internals/cachingeval.h' line='42' column='1' hash='f2f9e3a9fba1efaa' id='type-id-49'>
          <underlying-type type-id='type-id-50'/>
          <enumerator name='play' value='0'/>
          <enumerator name='record' value='1'/>
          <enumerator name='playAndRecord' value='2'/>
        </enum-decl>
      </member-type>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~CachingEvaluator' filepath='libnurbs/internals/cachingeval.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <function-decl name='canRecord' mangled-name='_ZN16CachingEvaluator9canRecordEv' filepath='libnurbs/internals/cachingeval.cc' line='43' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <function-decl name='canPlayAndRecord' mangled-name='_ZN16CachingEvaluator16canPlayAndRecordEv' filepath='libnurbs/internals/cachingeval.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <function-decl name='createHandle' mangled-name='_ZN16CachingEvaluator12createHandleEi' filepath='libnurbs/internals/cachingeval.cc' line='55' column='1' visibility='default' binding='global' size-in-bits='64' hash='d628501fd2223339'>
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <function-decl name='beginOutput' mangled-name='_ZN16CachingEvaluator11beginOutputENS_11ServiceModeEi' filepath='libnurbs/internals/cachingeval.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64' hash='4fc416ef3d7eda10'>
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='6'>
        <function-decl name='endOutput' mangled-name='_ZN16CachingEvaluator9endOutputEv' filepath='libnurbs/internals/cachingeval.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='7'>
        <function-decl name='discardRecording' mangled-name='_ZN16CachingEvaluator16discardRecordingEi' filepath='libnurbs/internals/cachingeval.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='8'>
        <function-decl name='playRecording' mangled-name='_ZN16CachingEvaluator13playRecordingEi' filepath='libnurbs/internals/cachingeval.cc' line='76' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <parameter type-id='type-id-37' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='BasicCurveEvaluator' visibility='default' size-in-bits='64' filepath='libnurbs/internals/basiccrveval.h' line='43' column='1' hash='c931bb487f51cb63' id='type-id-22'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-36'/>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~BasicCurveEvaluator' filepath='libnurbs/internals/basiccrveval.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <parameter type-id='type-id-3' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='9'>
        <function-decl name='domain1f' mangled-name='_ZN19BasicCurveEvaluator8domain1fEff' filepath='libnurbs/internals/basiccrveval.cc' line='45' column='1' visibility='default' binding='global' size-in-bits='64' hash='db8105e6b583cbd0'>
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='10'>
        <function-decl name='range1f' mangled-name='_ZN19BasicCurveEvaluator7range1fElPfS0_' filepath='libnurbs/internals/basiccrveval.cc' line='53' column='1' visibility='default' binding='global' size-in-bits='64' hash='ca180d896c71b6c7'>
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN19BasicCurveEvaluator6enableEl' filepath='libnurbs/internals/basiccrveval.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN19BasicCurveEvaluator7disableEl' filepath='libnurbs/internals/basiccrveval.cc' line='69' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='13'>
        <function-decl name='bgnmap1f' mangled-name='_ZN19BasicCurveEvaluator8bgnmap1fEl' filepath='libnurbs/internals/basiccrveval.cc' line='77' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='14'>
        <function-decl name='map1f' mangled-name='_ZN19BasicCurveEvaluator5map1fElffllPf' filepath='libnurbs/internals/basiccrveval.cc' line='85' column='1' visibility='default' binding='global' size-in-bits='64' hash='f98f6f059a92e1c7'>
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='15'>
        <function-decl name='mapgrid1f' mangled-name='_ZN19BasicCurveEvaluator9mapgrid1fElff' filepath='libnurbs/internals/basiccrveval.cc' line='93' column='1' visibility='default' binding='global' size-in-bits='64' hash='3298e9f33f58ace5'>
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='16'>
        <function-decl name='mapmesh1f' mangled-name='_ZN19BasicCurveEvaluator9mapmesh1fElll' filepath='libnurbs/internals/basiccrveval.cc' line='101' column='1' visibility='default' binding='global' size-in-bits='64' hash='2461ca6254ad53d2'>
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='17'>
        <function-decl name='evalcoord1f' mangled-name='_ZN19BasicCurveEvaluator11evalcoord1fElf' filepath='libnurbs/internals/basiccrveval.cc' line='109' column='1' visibility='default' binding='global' size-in-bits='64' hash='abf64f704bd8df76'>
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='18'>
        <function-decl name='endmap1f' mangled-name='_ZN19BasicCurveEvaluator8endmap1fEv' filepath='libnurbs/internals/basiccrveval.cc' line='117' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='19'>
        <function-decl name='bgnline' mangled-name='_ZN19BasicCurveEvaluator7bgnlineEv' filepath='libnurbs/internals/basiccrveval.cc' line='125' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='20'>
        <function-decl name='endline' mangled-name='_ZN19BasicCurveEvaluator7endlineEv' filepath='libnurbs/internals/basiccrveval.cc' line='133' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-51' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='CurveMap' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-47'/>
    <function-type size-in-bits='64' hash='6884924904df04e1' id='type-id-45'>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' hash='6884924904df04e1' id='type-id-46'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' hash='2bb88322482ae81c' id='type-id-52'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' hash='2bb88322482ae81c' id='type-id-53'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-54'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-36' size-in-bits='64' hash='388da3fa973fde78' id='type-id-55'>
      <parameter type-id='type-id-37' is-artificial='yes'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type method-class-id='type-id-36' size-in-bits='64' hash='d628501fd2223339' id='type-id-56'>
      <parameter type-id='type-id-37' is-artificial='yes'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-57'>
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='db8105e6b583cbd0' id='type-id-58'>
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='52c0efb08d2aa513#2' id='type-id-59'>
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='abf64f704bd8df76' id='type-id-60'>
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='ca180d896c71b6c7' id='type-id-61'>
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='3298e9f33f58ace5' id='type-id-62'>
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='f98f6f059a92e1c7' id='type-id-63'>
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-22' size-in-bits='64' hash='2461ca6254ad53d2' id='type-id-64'>
      <parameter type-id='type-id-51' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-36' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-65'>
      <parameter type-id='type-id-37' is-artificial='yes'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-36' size-in-bits='64' hash='4fc416ef3d7eda10' id='type-id-66'>
      <parameter type-id='type-id-37' is-artificial='yes'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-36' size-in-bits='64' hash='388da3fa973fde78' id='type-id-67'>
      <parameter type-id='type-id-37' is-artificial='yes'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-68'>
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='db8105e6b583cbd0' id='type-id-69'>
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='52c0efb08d2aa513#2' id='type-id-70'>
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='abf64f704bd8df76' id='type-id-71'>
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='ca180d896c71b6c7' id='type-id-72'>
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='3298e9f33f58ace5' id='type-id-73'>
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='f98f6f059a92e1c7' id='type-id-74'>
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-21' size-in-bits='64' hash='2461ca6254ad53d2' id='type-id-75'>
      <parameter type-id='type-id-31' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-32'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glinterface.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' hash='bf5246f21513cdf0' id='type-id-77'/>
    <qualified-type-def type-id='type-id-77' const='yes' hash='be54080c8a86045a' id='type-id-78'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' hash='19b75571e9e881e2' id='type-id-80'/>
    <qualified-type-def type-id='type-id-80' const='yes' hash='f816f5cb4243b052' id='type-id-81'/>
    <class-decl name='GLUnurbs' is-struct='yes' visibility='default' size-in-bits='1149440' filepath='libnurbs/interface/glrenderer.h' line='49' column='1' hash='76ef5da3535f3fd1' id='type-id-76'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-82'/>
      <data-member access='public' layout-offset-in-bits='47616'>
        <var-decl name='errorCallback' type-id='type-id-83' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='71' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47680'>
        <var-decl name='autoloadmode' type-id='type-id-84' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47744'>
        <var-decl name='surfaceEvaluator' type-id='type-id-79' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1121792'>
        <var-decl name='curveEvaluator' type-id='type-id-21' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1149376'>
        <var-decl name='callbackFlag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glrenderer.h' line='143' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='bgnrender' mangled-name='_ZN8GLUnurbs9bgnrenderEv' filepath='libnurbs/interface/glrenderer.cc' line='107' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-77' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='endrender' mangled-name='_ZN8GLUnurbs9endrenderEv' filepath='libnurbs/interface/glrenderer.cc' line='115' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-77' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='errorHandler' mangled-name='_ZN8GLUnurbs12errorHandlerEi' filepath='libnurbs/interface/glrenderer.cc' line='120' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <parameter type-id='type-id-77' is-artificial='yes'/>
          <parameter type-id='type-id-3' filepath='libnurbs/interface/glrenderer.h' line='72' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='OpenGLSurfaceEvaluator' is-struct='yes' visibility='default' size-in-bits='1074048' filepath='libnurbs/interface/glsurfeval.h' line='100' column='1' hash='c36d377fe52f4bde' id='type-id-79'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-85'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='vertexCache' type-id='type-id-86' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='180' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='tmeshing' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='181' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='288'>
        <var-decl name='which' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='182' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='vcount' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='183' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <var-decl name='gl_polygon_mode' type-id='type-id-87' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='185' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='global_bpm' type-id='type-id-14' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='output_triangles' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='189' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='beginCallBackN' type-id='type-id-24' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='endCallBackN' type-id='type-id-25' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='vertexCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='normalCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='832'>
        <var-decl name='colorCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='896'>
        <var-decl name='texcoordCallBackN' type-id='type-id-26' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='198' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='960'>
        <var-decl name='beginCallBackData' type-id='type-id-27' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='200' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1024'>
        <var-decl name='endCallBackData' type-id='type-id-28' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='201' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <var-decl name='vertexCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='202' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1152'>
        <var-decl name='normalCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='203' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1216'>
        <var-decl name='colorCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='204' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1280'>
        <var-decl name='texcoordCallBackData' type-id='type-id-29' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='205' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1344'>
        <var-decl name='userData' type-id='type-id-30' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='215' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <var-decl name='LOD_eval_level' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1440'>
        <var-decl name='global_uorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='231' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='global_vorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1504'>
        <var-decl name='global_uprime' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='233' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1536'>
        <var-decl name='global_vprime' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='234' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1568'>
        <var-decl name='global_vprime_BV' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='235' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1600'>
        <var-decl name='global_uprime_BU' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1632'>
        <var-decl name='global_uorder_BV' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <var-decl name='global_vorder_BV' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='238' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1696'>
        <var-decl name='global_uorder_BU' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='239' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1728'>
        <var-decl name='global_vorder_BU' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='240' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1760'>
        <var-decl name='global_ucoeff' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3040'>
        <var-decl name='global_vcoeff' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='243' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4320'>
        <var-decl name='global_ucoeffDeriv' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='244' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5600'>
        <var-decl name='global_vcoeffDeriv' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6880'>
        <var-decl name='global_BV' type-id='type-id-88' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='247' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='12000'>
        <var-decl name='global_PBV' type-id='type-id-88' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='248' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='17120'>
        <var-decl name='global_BU' type-id='type-id-88' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='249' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='22240'>
        <var-decl name='global_PBU' type-id='type-id-88' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='250' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27392'>
        <var-decl name='global_baseData' type-id='type-id-34' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27456'>
        <var-decl name='global_ev_k' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='253' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27488'>
        <var-decl name='global_ev_u1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='254' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27520'>
        <var-decl name='global_ev_u2' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='255' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27552'>
        <var-decl name='global_ev_ustride' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='256' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27584'>
        <var-decl name='global_ev_uorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='257' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27616'>
        <var-decl name='global_ev_v1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='258' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27648'>
        <var-decl name='global_ev_v2' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='259' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27680'>
        <var-decl name='global_ev_vstride' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='260' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27712'>
        <var-decl name='global_ev_vorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='261' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='27744'>
        <var-decl name='global_ev_ctlPoints' type-id='type-id-89' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='262' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232544'>
        <var-decl name='global_grid_u0' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='264' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232576'>
        <var-decl name='global_grid_u1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='265' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232608'>
        <var-decl name='global_grid_nu' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='266' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232640'>
        <var-decl name='global_grid_v0' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='267' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232672'>
        <var-decl name='global_grid_v1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='268' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232704'>
        <var-decl name='global_grid_nv' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='269' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='232736'>
        <var-decl name='em_vertex' type-id='type-id-90' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='349' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='443008'>
        <var-decl name='em_normal' type-id='type-id-90' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='350' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='653280'>
        <var-decl name='em_color' type-id='type-id-90' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='351' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='863552'>
        <var-decl name='em_texcoord' type-id='type-id-90' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='352' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073824'>
        <var-decl name='auto_normal_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='354' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073856'>
        <var-decl name='callback_auto_normal' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='356' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073888'>
        <var-decl name='vertex_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='357' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073920'>
        <var-decl name='normal_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='358' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073952'>
        <var-decl name='color_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='359' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1073984'>
        <var-decl name='texcoord_flag' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='360' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~OpenGLSurfaceEvaluator' filepath='libnurbs/interface/glsurfeval.cc' line='162' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-3' filepath='libnurbs/interface/glsurfeval.h' line='153' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='range2f' mangled-name='_ZN22OpenGLSurfaceEvaluator7range2fElPfS0_' filepath='libnurbs/interface/glsurfeval.cc' line='258' column='1' visibility='default' binding='global' size-in-bits='64' hash='ca180d896c71b6c7'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='domain2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8domain2fEffff' filepath='libnurbs/interface/glsurfeval.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64' hash='595ddbe8c066a980'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN22OpenGLSurfaceEvaluator6enableEl' filepath='libnurbs/interface/glsurfeval.cc' line='185' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN22OpenGLSurfaceEvaluator7disableEl' filepath='libnurbs/interface/glsurfeval.cc' line='175' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='bgnmap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8bgnmap2fEl' filepath='libnurbs/interface/glsurfeval.cc' line='739' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='map2f' mangled-name='_ZN22OpenGLSurfaceEvaluator5map2fElffllffllPf' filepath='libnurbs/interface/glsurfeval.cc' line='872' column='1' visibility='default' binding='global' size-in-bits='64' hash='da2f515917f7594c#2'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='mapgrid2f' mangled-name='_ZN22OpenGLSurfaceEvaluator9mapgrid2fElfflff' filepath='libnurbs/interface/glsurfeval.cc' line='195' column='1' visibility='default' binding='global' size-in-bits='64' hash='28fdc77ce91afc79#2'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='mapmesh2f' mangled-name='_ZN22OpenGLSurfaceEvaluator9mapmesh2fElllll' filepath='libnurbs/interface/glsurfeval.cc' line='946' column='1' visibility='default' binding='global' size-in-bits='64' hash='de43da37f022a5b9'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='evalcoord2f' mangled-name='_ZN22OpenGLSurfaceEvaluator11evalcoord2fElff' filepath='libnurbs/interface/glsurfeval.cc' line='1042' column='1' visibility='default' binding='global' size-in-bits='64' hash='3298e9f33f58ace5'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='evalpoint2i' mangled-name='_ZN22OpenGLSurfaceEvaluator11evalpoint2iEll' filepath='libnurbs/interface/glsurfeval.cc' line='1059' column='1' visibility='default' binding='global' size-in-bits='64' hash='b1dcd91100b153bb#2'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='endmap2f' mangled-name='_ZN22OpenGLSurfaceEvaluator8endmap2fEv' filepath='libnurbs/interface/glsurfeval.cc' line='801' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='polymode' mangled-name='_ZN22OpenGLSurfaceEvaluator8polymodeEl' filepath='libnurbs/interface/glsurfeval.cc' line='219' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <function-decl name='bgnline' mangled-name='_ZN22OpenGLSurfaceEvaluator7bgnlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='240' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='endline' mangled-name='_ZN22OpenGLSurfaceEvaluator7endlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='249' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='bgnclosedline' mangled-name='_ZN22OpenGLSurfaceEvaluator13bgnclosedlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='268' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <function-decl name='endclosedline' mangled-name='_ZN22OpenGLSurfaceEvaluator13endclosedlineEv' filepath='libnurbs/interface/glsurfeval.cc' line='277' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='bgntmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator8bgntmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <function-decl name='swaptmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator9swaptmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='305' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <function-decl name='endtmesh' mangled-name='_ZN22OpenGLSurfaceEvaluator8endtmeshEv' filepath='libnurbs/interface/glsurfeval.cc' line='312' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='bgnqstrip' mangled-name='_ZN22OpenGLSurfaceEvaluator9bgnqstripEv' filepath='libnurbs/interface/glsurfeval.cc' line='712' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <function-decl name='endqstrip' mangled-name='_ZN22OpenGLSurfaceEvaluator9endqstripEv' filepath='libnurbs/interface/glsurfeval.cc' line='725' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <function-decl name='bgntfan' mangled-name='_ZN22OpenGLSurfaceEvaluator7bgntfanEv' filepath='libnurbs/interface/glsurfeval.cc' line='324' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <function-decl name='endtfan' mangled-name='_ZN22OpenGLSurfaceEvaluator7endtfanEv' filepath='libnurbs/interface/glsurfeval.cc' line='334' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <function-decl name='evalUStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator10evalUStripEifPfifS0_' filepath='libnurbs/interface/glsurfeval.cc' line='343' column='1' visibility='default' binding='global' size-in-bits='64' hash='6f354a9a7516a40e'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-3'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <function-decl name='evalVStrip' mangled-name='_ZN22OpenGLSurfaceEvaluator10evalVStripEifPfifS0_' filepath='libnurbs/interface/glsurfeval.cc' line='530' column='1' visibility='default' binding='global' size-in-bits='64' hash='6f354a9a7516a40e'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-3'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='34'>
        <function-decl name='inDoEvalCoord2NOGE' mangled-name='_ZN22OpenGLSurfaceEvaluator18inDoEvalCoord2NOGEEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='283' column='1' visibility='default' binding='global' size-in-bits='64' hash='5a26a3f664666a50'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='35'>
        <function-decl name='inDoEvalCoord2NOGE_BU' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoEvalCoord2NOGE_BUEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' hash='5a26a3f664666a50'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='36'>
        <function-decl name='inDoEvalCoord2NOGE_BV' mangled-name='_ZN22OpenGLSurfaceEvaluator21inDoEvalCoord2NOGE_BVEffPfS0_' filepath='libnurbs/interface/glsurfeval.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64' hash='5a26a3f664666a50'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='37'>
        <function-decl name='inPreEvaluateBV_intfac' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateBV_intfacEf' filepath='libnurbs/interface/glsurfeval.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64' hash='922f765c4b66cc08'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='38'>
        <function-decl name='inPreEvaluateBU_intfac' mangled-name='_ZN22OpenGLSurfaceEvaluator22inPreEvaluateBU_intfacEf' filepath='libnurbs/interface/glsurfeval.h' line='321' column='1' visibility='default' binding='global' size-in-bits='64' hash='922f765c4b66cc08'>
          <parameter type-id='type-id-80' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <function-decl name='gluNewNurbsRenderer' mangled-name='gluNewNurbsRenderer' filepath='libnurbs/interface/glinterface.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNewNurbsRenderer' hash='7e3eaf60ff8967c6'>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='gluDeleteNurbsRenderer' mangled-name='gluDeleteNurbsRenderer' filepath='libnurbs/interface/glinterface.cc' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluDeleteNurbsRenderer' hash='7e3eaf60ff8967c6'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='gluBeginSurface' mangled-name='gluBeginSurface' filepath='libnurbs/interface/glinterface.cc' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginSurface' hash='7e3eaf60ff8967c6'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='gluBeginCurve' mangled-name='gluBeginCurve' filepath='libnurbs/interface/glinterface.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginCurve' hash='7e3eaf60ff8967c6'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='gluEndCurve' mangled-name='gluEndCurve' filepath='libnurbs/interface/glinterface.cc' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndCurve' hash='7e3eaf60ff8967c6'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='gluEndSurface' mangled-name='gluEndSurface' filepath='libnurbs/interface/glinterface.cc' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndSurface' hash='7e3eaf60ff8967c6'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='gluBeginTrim' mangled-name='gluBeginTrim' filepath='libnurbs/interface/glinterface.cc' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluBeginTrim' hash='7e3eaf60ff8967c6'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='gluEndTrim' mangled-name='gluEndTrim' filepath='libnurbs/interface/glinterface.cc' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluEndTrim' hash='7e3eaf60ff8967c6'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='75' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='gluPwlCurve' mangled-name='gluPwlCurve' filepath='libnurbs/interface/glinterface.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluPwlCurve' hash='b89d3b28bad786b2'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <parameter type-id='type-id-4' filepath='libnurbs/interface/glinterface.cc' line='150' column='1'/>
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='151' column='1'/>
      <parameter type-id='type-id-10' filepath='libnurbs/interface/glinterface.cc' line='151' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='gluNurbsCurve' mangled-name='gluNurbsCurve' filepath='libnurbs/interface/glinterface.cc' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCurve' hash='f50221bdf8aaff31'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='type-id-4' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='173' column='1'/>
      <parameter type-id='type-id-4' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <parameter type-id='type-id-10' filepath='libnurbs/interface/glinterface.cc' line='174' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='gluNurbsSurface' mangled-name='gluNurbsSurface' filepath='libnurbs/interface/glinterface.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsSurface' hash='4f9eef60fbfae42d'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <parameter type-id='type-id-92' filepath='libnurbs/interface/glinterface.cc' line='199' column='1'/>
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='200' column='1'/>
      <parameter type-id='type-id-92' filepath='libnurbs/interface/glinterface.cc' line='200' column='1'/>
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='201' column='1'/>
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='201' column='1'/>
      <parameter type-id='type-id-92' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <parameter type-id='type-id-91' filepath='libnurbs/interface/glinterface.cc' line='202' column='1'/>
      <parameter type-id='type-id-10' filepath='libnurbs/interface/glinterface.cc' line='203' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='gluLoadSamplingMatrices' mangled-name='gluLoadSamplingMatrices' filepath='libnurbs/interface/glinterface.cc' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluLoadSamplingMatrices' hash='67f81c4135ac4ac1'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='235' column='1'/>
      <parameter type-id='type-id-42' filepath='libnurbs/interface/glinterface.cc' line='235' column='1'/>
      <parameter type-id='type-id-42' filepath='libnurbs/interface/glinterface.cc' line='236' column='1'/>
      <parameter type-id='type-id-93' filepath='libnurbs/interface/glinterface.cc' line='237' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='gluNurbsProperty' mangled-name='gluNurbsProperty' filepath='libnurbs/interface/glinterface.cc' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsProperty' hash='211625c25b1418ba'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <parameter type-id='type-id-10' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <parameter type-id='type-id-40' filepath='libnurbs/interface/glinterface.cc' line='243' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='gluGetNurbsProperty' mangled-name='gluGetNurbsProperty' filepath='libnurbs/interface/glinterface.cc' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluGetNurbsProperty' hash='cd7b84c102b682c9'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <parameter type-id='type-id-10' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <parameter type-id='type-id-92' filepath='libnurbs/interface/glinterface.cc' line='359' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='gluNurbsCallback' mangled-name='gluNurbsCallback' filepath='libnurbs/interface/glinterface.cc' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallback' hash='b315c08e6afa5c4b'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <parameter type-id='type-id-10' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <parameter type-id='type-id-94' filepath='libnurbs/interface/glinterface.cc' line='430' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='gluNurbsCallbackDataEXT' mangled-name='gluNurbsCallbackDataEXT' filepath='libnurbs/interface/glinterface.cc' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallbackDataEXT' hash='7e3eaf60ff8967c6'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <parameter type-id='type-id-30' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='gluNurbsCallbackData' mangled-name='gluNurbsCallbackData' filepath='libnurbs/interface/glinterface.cc' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gluNurbsCallbackData' hash='7e3eaf60ff8967c6'>
      <parameter type-id='type-id-77' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <parameter type-id='type-id-30' filepath='libnurbs/interface/glinterface.cc' line='459' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-type method-class-id='type-id-76' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-95'>
      <parameter type-id='type-id-77' is-artificial='yes'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-76' size-in-bits='64' hash='388da3fa973fde78' id='type-id-96'>
      <parameter type-id='type-id-77' is-artificial='yes'/>
      <parameter type-id='type-id-3' filepath='libnurbs/interface/glrenderer.h' line='72' column='1'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-97'>
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='922f765c4b66cc08' id='type-id-98'>
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='5a26a3f664666a50' id='type-id-99'>
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='595ddbe8c066a980' id='type-id-100'>
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='6f354a9a7516a40e' id='type-id-101'>
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='52c0efb08d2aa513#2' id='type-id-102'>
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='ca180d896c71b6c7' id='type-id-103'>
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='3298e9f33f58ace5' id='type-id-104'>
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='28fdc77ce91afc79#2' id='type-id-105'>
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='da2f515917f7594c#2' id='type-id-106'>
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='b1dcd91100b153bb#2' id='type-id-107'>
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-79' size-in-bits='64' hash='de43da37f022a5b9' id='type-id-108'>
      <parameter type-id='type-id-80' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-32'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glrenderer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-40' size-in-bits='128' hash='30d5881e91c9cd09' id='type-id-109'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-110'/>
    </array-type-def>
    <typedef-decl name='errorCallbackType' type-id='type-id-24' size-in-bits='64' filepath='libnurbs/interface/glrenderer.h' line='46' column='1' hash='fd7a63c0c6c822c4' id='type-id-83'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' hash='0f799f9d7d871c20' id='type-id-111'/>
    <class-decl name='NurbsTessellator' visibility='default' size-in-bits='47616' filepath='libnurbs/internals/nurbstess.h' line='53' column='1' hash='bbfc714e32d3042e' id='type-id-82'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='renderhints' type-id='type-id-112' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='104' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='maplist' type-id='type-id-113' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='105' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3008'>
        <var-decl name='backend' type-id='type-id-114' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3648'>
        <var-decl name='subdivider' type-id='type-id-115' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='24064'>
        <var-decl name='jumpbuffer' type-id='type-id-116' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='135' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='24128'>
        <var-decl name='o_pwlcurvePool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='136' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='26624'>
        <var-decl name='o_nurbscurvePool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='137' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='29120'>
        <var-decl name='o_curvePool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='138' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='31616'>
        <var-decl name='o_trimPool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='139' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='34112'>
        <var-decl name='o_surfacePool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='140' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='36608'>
        <var-decl name='o_nurbssurfacePool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='141' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='39104'>
        <var-decl name='propertyPool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='142' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='41600'>
        <var-decl name='quiltPool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='144' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='44096'>
        <var-decl name='extTrimVertexPool' type-id='type-id-118' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='146' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46720'>
        <var-decl name='inSurface' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='148' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46752'>
        <var-decl name='inCurve' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='149' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46784'>
        <var-decl name='inTrim' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='150' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46816'>
        <var-decl name='isCurveModified' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='151' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46848'>
        <var-decl name='isTrimModified' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='152' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46880'>
        <var-decl name='isSurfaceModified' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='153' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46912'>
        <var-decl name='isDataValid' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='154' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46944'>
        <var-decl name='numTrims' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='155' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='46976'>
        <var-decl name='playBack' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='156' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47040'>
        <var-decl name='nextTrim' type-id='type-id-119' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='158' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47104'>
        <var-decl name='nextCurve' type-id='type-id-120' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='159' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47168'>
        <var-decl name='nextNurbscurve' type-id='type-id-121' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='160' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47232'>
        <var-decl name='nextPwlcurve' type-id='type-id-122' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='161' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47296'>
        <var-decl name='nextNurbssurface' type-id='type-id-123' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='162' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47360'>
        <var-decl name='currentSurface' type-id='type-id-124' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='164' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47424'>
        <var-decl name='currentTrim' type-id='type-id-125' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='165' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47488'>
        <var-decl name='currentCurve' type-id='type-id-126' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='166' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='47552'>
        <var-decl name='dl' type-id='type-id-127' visibility='default' filepath='libnurbs/internals/nurbstess.h' line='168' column='1'/>
      </data-member>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~NurbsTessellator' filepath='libnurbs/internals/nurbsinterfac.cc' line='88' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <parameter type-id='type-id-128' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='2'>
        <function-decl name='bgnrender' mangled-name='_ZN16NurbsTessellator9bgnrenderEv' filepath='libnurbs/internals/nurbstess.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-128' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <function-decl name='endrender' mangled-name='_ZN16NurbsTessellator9endrenderEv' filepath='libnurbs/internals/nurbstess.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-128' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <function-decl name='makeobj' mangled-name='_ZN16NurbsTessellator7makeobjEi' filepath='libnurbs/internals/nurbstess.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <parameter type-id='type-id-128' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <function-decl name='closeobj' mangled-name='_ZN16NurbsTessellator8closeobjEv' filepath='libnurbs/internals/nurbstess.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-128' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='6'>
        <function-decl name='errorHandler' mangled-name='_ZN16NurbsTessellator12errorHandlerEi' filepath='libnurbs/internals/nurbstess.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <parameter type-id='type-id-128' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <function-type method-class-id='type-id-82' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-129'>
      <parameter type-id='type-id-128' is-artificial='yes'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-82' size-in-bits='64' hash='388da3fa973fde78' id='type-id-130'>
      <parameter type-id='type-id-128' is-artificial='yes'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-32'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/glsurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-91' size-in-bits='64' hash='df69d46a77f6fb57' id='type-id-87'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-131'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='64' hash='172869b0f34e848f' id='type-id-132'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-131'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='96' hash='63a51e8a60f761fe' id='type-id-133'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-134'/>
    </array-type-def>
    <array-type-def dimensions='2' type-id='type-id-15' size-in-bits='5120' hash='242ce12a4ae26fc1' id='type-id-88'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='type-id-20'/>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-110'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='204800' hash='681ba3623c4f0d48' id='type-id-89'>
      <subrange length='6400' lower-bound='0' upper-bound='6399' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='3f44e66942978c4d' id='type-id-135'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-136' size-in-bits='192' hash='92476f5f25008493' id='type-id-86'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-134'/>
    </array-type-def>
    <class-decl name='StoredVertex' visibility='default' size-in-bits='256' filepath='libnurbs/interface/glsurfeval.h' line='84' column='1' hash='fb3da055512c436c' id='type-id-137'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='95' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='coord' type-id='type-id-132' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='96' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='point' type-id='type-id-138' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='128' hash='6eb4544bb476592b#2' id='type-id-138'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-131'/>
    </array-type-def>
    <class-decl name='surfEvalMachine' is-struct='yes' visibility='default' size-in-bits='210272' filepath='libnurbs/interface/glsurfeval.h' line='63' column='1' hash='d6c83745c0c47ccb' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uprime' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vprime' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='k' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='u1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='u2' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='ustride' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='uorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='v1' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='v2' type-id='type-id-15' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='vstride' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='vorder' type-id='type-id-3' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='ctlPoints' type-id='type-id-89' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='205152'>
        <var-decl name='ucoeff' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='206432'>
        <var-decl name='vcoeff' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='207712'>
        <var-decl name='ucoeffDeriv' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208992'>
        <var-decl name='vcoeffDeriv' type-id='type-id-19' visibility='default' filepath='libnurbs/interface/glsurfeval.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='surfEvalMachine' type-id='type-id-139' size-in-bits='210272' filepath='libnurbs/interface/glsurfeval.h' line='80' column='1' id='type-id-90'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' hash='e033cae97beb5ed2' id='type-id-140'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' hash='268680ca59389c6b' id='type-id-136'/>
    <qualified-type-def type-id='type-id-136' const='yes' hash='1ab0b1205c0b330c' id='type-id-141'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' hash='9e72b4c5212f5be5' id='type-id-142'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-144'/>
    <class-decl name='BasicSurfaceEvaluator' visibility='default' size-in-bits='64' filepath='libnurbs/internals/basicsurfeval.h' line='43' column='1' hash='eea24f113fefc500' id='type-id-85'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-36'/>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~BasicSurfaceEvaluator' filepath='libnurbs/internals/basicsurfeval.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-3' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='9'>
        <function-decl name='range2f' mangled-name='_ZN21BasicSurfaceEvaluator7range2fElPfS0_' filepath='libnurbs/internals/basicsurfeval.cc' line='65' column='1' visibility='default' binding='global' size-in-bits='64' hash='ca180d896c71b6c7'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='10'>
        <function-decl name='domain2f' mangled-name='_ZN21BasicSurfaceEvaluator8domain2fEffff' filepath='libnurbs/internals/basicsurfeval.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64' hash='595ddbe8c066a980'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='11'>
        <function-decl name='enable' mangled-name='_ZN21BasicSurfaceEvaluator6enableEl' filepath='libnurbs/internals/basicsurfeval.cc' line='74' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='12'>
        <function-decl name='disable' mangled-name='_ZN21BasicSurfaceEvaluator7disableEl' filepath='libnurbs/internals/basicsurfeval.cc' line='82' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='13'>
        <function-decl name='bgnmap2f' mangled-name='_ZN21BasicSurfaceEvaluator8bgnmap2fEl' filepath='libnurbs/internals/basicsurfeval.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='14'>
        <function-decl name='map2f' mangled-name='_ZN21BasicSurfaceEvaluator5map2fElffllffllPf' filepath='libnurbs/internals/basicsurfeval.cc' line='106' column='1' visibility='default' binding='global' size-in-bits='64' hash='da2f515917f7594c'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='15'>
        <function-decl name='mapgrid2f' mangled-name='_ZN21BasicSurfaceEvaluator9mapgrid2fElfflff' filepath='libnurbs/internals/basicsurfeval.cc' line='116' column='1' visibility='default' binding='global' size-in-bits='64' hash='28fdc77ce91afc79'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='16'>
        <function-decl name='mapmesh2f' mangled-name='_ZN21BasicSurfaceEvaluator9mapmesh2fElllll' filepath='libnurbs/internals/basicsurfeval.cc' line='124' column='1' visibility='default' binding='global' size-in-bits='64' hash='de43da37f022a5b9'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='17'>
        <function-decl name='evalcoord2f' mangled-name='_ZN21BasicSurfaceEvaluator11evalcoord2fElff' filepath='libnurbs/internals/basicsurfeval.cc' line='132' column='1' visibility='default' binding='global' size-in-bits='64' hash='3298e9f33f58ace5'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='18'>
        <function-decl name='evalpoint2i' mangled-name='_ZN21BasicSurfaceEvaluator11evalpoint2iEll' filepath='libnurbs/internals/basicsurfeval.cc' line='140' column='1' visibility='default' binding='global' size-in-bits='64' hash='b1dcd91100b153bb'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='19'>
        <function-decl name='endmap2f' mangled-name='_ZN21BasicSurfaceEvaluator8endmap2fEv' filepath='libnurbs/internals/basicsurfeval.cc' line='98' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='20'>
        <function-decl name='polymode' mangled-name='_ZN21BasicSurfaceEvaluator8polymodeEl' filepath='libnurbs/internals/basicsurfeval.cc' line='57' column='1' visibility='default' binding='global' size-in-bits='64' hash='52c0efb08d2aa513#2'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-33'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='21'>
        <function-decl name='bgnline' mangled-name='_ZN21BasicSurfaceEvaluator7bgnlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='148' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='22'>
        <function-decl name='endline' mangled-name='_ZN21BasicSurfaceEvaluator7endlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='156' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='23'>
        <function-decl name='bgnclosedline' mangled-name='_ZN21BasicSurfaceEvaluator13bgnclosedlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='24'>
        <function-decl name='endclosedline' mangled-name='_ZN21BasicSurfaceEvaluator13endclosedlineEv' filepath='libnurbs/internals/basicsurfeval.cc' line='172' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='25'>
        <function-decl name='bgntmesh' mangled-name='_ZN21BasicSurfaceEvaluator8bgntmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='194' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='26'>
        <function-decl name='swaptmesh' mangled-name='_ZN21BasicSurfaceEvaluator9swaptmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='202' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='27'>
        <function-decl name='endtmesh' mangled-name='_ZN21BasicSurfaceEvaluator8endtmeshEv' filepath='libnurbs/internals/basicsurfeval.cc' line='210' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='28'>
        <function-decl name='bgnqstrip' mangled-name='_ZN21BasicSurfaceEvaluator9bgnqstripEv' filepath='libnurbs/internals/basicsurfeval.cc' line='218' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='29'>
        <function-decl name='endqstrip' mangled-name='_ZN21BasicSurfaceEvaluator9endqstripEv' filepath='libnurbs/internals/basicsurfeval.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='30'>
        <function-decl name='bgntfan' mangled-name='_ZN21BasicSurfaceEvaluator7bgntfanEv' filepath='libnurbs/internals/basicsurfeval.cc' line='180' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='31'>
        <function-decl name='endtfan' mangled-name='_ZN21BasicSurfaceEvaluator7endtfanEv' filepath='libnurbs/internals/basicsurfeval.cc' line='188' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='32'>
        <function-decl name='evalUStrip' mangled-name='_ZN21BasicSurfaceEvaluator10evalUStripEifPfifS0_' filepath='libnurbs/internals/basicsurfeval.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64' hash='6f354a9a7516a40e'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-3'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='33'>
        <function-decl name='evalVStrip' mangled-name='_ZN21BasicSurfaceEvaluator10evalVStripEifPfifS0_' filepath='libnurbs/internals/basicsurfeval.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' hash='6f354a9a7516a40e'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-3'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='34'>
        <function-decl name='inDoEvalCoord2NOGE' mangled-name='_ZN21BasicSurfaceEvaluator18inDoEvalCoord2NOGEEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' hash='5a26a3f664666a50'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='35'>
        <function-decl name='inDoEvalCoord2NOGE_BU' mangled-name='_ZN21BasicSurfaceEvaluator21inDoEvalCoord2NOGE_BUEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' hash='5a26a3f664666a50'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='36'>
        <function-decl name='inDoEvalCoord2NOGE_BV' mangled-name='_ZN21BasicSurfaceEvaluator21inDoEvalCoord2NOGE_BVEffPfS0_' filepath='libnurbs/internals/basicsurfeval.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64' hash='5a26a3f664666a50'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='37'>
        <function-decl name='inPreEvaluateBV_intfac' mangled-name='_ZN21BasicSurfaceEvaluator22inPreEvaluateBV_intfacEf' filepath='libnurbs/internals/basicsurfeval.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64' hash='922f765c4b66cc08'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='38'>
        <function-decl name='inPreEvaluateBU_intfac' mangled-name='_ZN21BasicSurfaceEvaluator22inPreEvaluateBU_intfacEf' filepath='libnurbs/internals/basicsurfeval.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' hash='922f765c4b66cc08'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='SurfaceMap' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-143'/>
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-146'>
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='922f765c4b66cc08' id='type-id-147'>
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='5a26a3f664666a50' id='type-id-148'>
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='595ddbe8c066a980' id='type-id-149'>
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='6f354a9a7516a40e' id='type-id-150'>
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='52c0efb08d2aa513#2' id='type-id-151'>
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='ca180d896c71b6c7' id='type-id-152'>
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='3298e9f33f58ace5' id='type-id-153'>
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='28fdc77ce91afc79' id='type-id-154'>
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='da2f515917f7594c' id='type-id-155'>
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='b1dcd91100b153bb' id='type-id-156'>
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-85' size-in-bits='64' hash='de43da37f022a5b9' id='type-id-157'>
      <parameter type-id='type-id-145' is-artificial='yes'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-32'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/incurveeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/interface/insurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-158'/>
    <array-type-def dimensions='1' type-id='type-id-159' size-in-bits='2048' hash='967be61c43ecd18f' id='type-id-160'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-161'/>
    </array-type-def>
    <class-decl name='Buffer' visibility='default' size-in-bits='64' filepath='libnurbs/internals/bufpool.h' line='45' column='1' hash='dabb8e345199e496' id='type-id-162'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-163' visibility='default' filepath='libnurbs/internals/bufpool.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Pool' visibility='default' size-in-bits='2496' filepath='libnurbs/internals/bufpool.h' line='50' column='1' hash='1474a5075d7d2ac2' id='type-id-117'>
      <member-type access='protected'>
        <enum-decl name='Magic' size-in-bits='32' alignment-in-bits='32' filepath='libnurbs/internals/bufpool.h' line='70' column='1' hash='930824abf210575b' id='type-id-164'>
          <underlying-type type-id='type-id-50'/>
          <enumerator name='is_allocated' value='62369'/>
          <enumerator name='is_free' value='61858'/>
        </enum-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='freelist' type-id='type-id-163' visibility='default' filepath='libnurbs/internals/bufpool.h' line='62' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='blocklist' type-id='type-id-160' visibility='default' filepath='libnurbs/internals/bufpool.h' line='63' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2112'>
        <var-decl name='nextblock' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='64' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2176'>
        <var-decl name='curblock' type-id='type-id-159' visibility='default' filepath='libnurbs/internals/bufpool.h' line='65' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2240'>
        <var-decl name='buffersize' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='66' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2272'>
        <var-decl name='nextsize' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='67' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2304'>
        <var-decl name='nextfree' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='68' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2336'>
        <var-decl name='initsize' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/bufpool.h' line='69' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2368'>
        <var-decl name='name' type-id='type-id-165' visibility='default' filepath='libnurbs/internals/bufpool.h' line='71' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2432'>
        <var-decl name='magic' type-id='type-id-164' visibility='default' filepath='libnurbs/internals/bufpool.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PooledObj' visibility='default' size-in-bits='8' filepath='libnurbs/internals/bufpool.h' line='118' column='1' hash='c7d200bffa9b2d36' id='type-id-166'/>
    <class-decl name='PwlArc' visibility='default' size-in-bits='192' filepath='libnurbs/internals/pwlarc.h' line='44' column='1' hash='2cc8dba217ae295b' id='type-id-167'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pts' type-id='type-id-168' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='npts' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/pwlarc.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='arc_side' size-in-bits='32' alignment-in-bits='32' filepath='libnurbs/internals/arc.h' line='52' column='1' hash='60b6cd228bb84059' id='type-id-169'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='arc_none' value='0'/>
      <enumerator name='arc_right' value='1'/>
      <enumerator name='arc_top' value='2'/>
      <enumerator name='arc_left' value='3'/>
      <enumerator name='arc_bottom' value='4'/>
    </enum-decl>
    <class-decl name='Arc' is-struct='yes' visibility='default' size-in-bits='448' filepath='libnurbs/internals/arc.h' line='55' column='1' hash='60098f6f8ef2d5b9' id='type-id-170'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='public' static='yes'>
        <var-decl name='bezier_tag' type-id='type-id-43' mangled-name='_ZN3Arc10bezier_tagE' visibility='default' filepath='libnurbs/internals/arc.cc' line='52' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='arc_tag' type-id='type-id-43' mangled-name='_ZN3Arc7arc_tagE' visibility='default' filepath='libnurbs/internals/arc.cc' line='53' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='tail_tag' type-id='type-id-43' mangled-name='_ZN3Arc8tail_tagE' visibility='default' filepath='libnurbs/internals/arc.cc' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='type-id-171' visibility='default' filepath='libnurbs/internals/arc.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-171' visibility='default' filepath='libnurbs/internals/arc.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='link' type-id='type-id-171' visibility='default' filepath='libnurbs/internals/arc.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bezierArc' type-id='type-id-172' visibility='default' filepath='libnurbs/internals/arc.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pwlArc' type-id='type-id-173' visibility='default' filepath='libnurbs/internals/arc.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/arc.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nuid' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/arc.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='TrimVertex' is-struct='yes' visibility='default' size-in-bits='128' filepath='libnurbs/internals/trimvertex.h' line='43' column='1' hash='c48342ca8a15d373#2' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='param' type-id='type-id-132' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nuid' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Arc_ptr' type-id='type-id-175' size-in-bits='64' filepath='libnurbs/internals/arc.h' line='50' column='1' hash='7592de82c2146a26' id='type-id-171'/>
    <typedef-decl name='size_t' type-id='type-id-17' size-in-bits='64' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/include/stddef.h' line='211' column='1' hash='8fdc5eea2983a729' id='type-id-176'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' hash='7592de82c2146a26' id='type-id-175'/>
    <qualified-type-def type-id='type-id-175' const='yes' hash='bd90a587757f73df' id='type-id-177'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' hash='67e107d55067cf98' id='type-id-178'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' hash='77eaa23958eb0b5f' id='type-id-172'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' hash='939b08df96ab7482' id='type-id-163'/>
    <reference-type-def kind='lvalue' type-id='type-id-117' size-in-bits='64' hash='c81ffa3102ef3c83' id='type-id-180'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' hash='32f8cd54243ee538' id='type-id-181'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' hash='555e3033b4a1e61b' id='type-id-182'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' hash='74ff07819dae74db' id='type-id-173'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' hash='ff6cddff133e642c#2' id='type-id-168'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-159'/>
    <qualified-type-def type-id='type-id-158' const='yes' hash='3e50fd33f9bb78d9' id='type-id-183'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' hash='c44743f354f6a443' id='type-id-165'/>
    <class-decl name='BezierArc' is-struct='yes' visibility='default' size-in-bits='256' filepath='libnurbs/internals/bezierarc.h' line='43' column='1' hash='df8c7971f3b76a9f' id='type-id-179'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cpts' type-id='type-id-34' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='order' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='stride' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mapdesc' type-id='type-id-184' visibility='default' filepath='libnurbs/internals/bezierarc.h' line='48' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arcsorter.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='128' hash='a4b6ed908a82d30e' id='type-id-185'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-110'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-186' size-in-bits='1600' hash='4b439ea14699207c#2' id='type-id-187'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-188'/>
    </array-type-def>
    <class-decl name='ArcSdirSorter' visibility='default' size-in-bits='192' filepath='libnurbs/internals/arcsorter.h' line='57' column='1' hash='3df63754bb94d40b' id='type-id-189'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-190'/>
      <member-function access='private' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN13ArcSdirSorter5qscmpEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='93' column='1' visibility='default' binding='global' size-in-bits='64' hash='c4d8735456ba2786'>
          <parameter type-id='type-id-191' is-artificial='yes'/>
          <parameter type-id='type-id-159'/>
          <parameter type-id='type-id-159'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='ArcSorter' visibility='default' size-in-bits='192' filepath='libnurbs/internals/arcsorter.h' line='44' column='1' hash='e5552dc0a9d3b79b' id='type-id-190'>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-192'/>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='subdivider' type-id='type-id-193' visibility='default' filepath='libnurbs/internals/arcsorter.h' line='50' column='1'/>
      </data-member>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN9ArcSorter5qscmpEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='53' column='1' visibility='default' binding='global' size-in-bits='64' hash='c4d8735456ba2786'>
          <parameter type-id='type-id-194' is-artificial='yes'/>
          <parameter type-id='type-id-159'/>
          <parameter type-id='type-id-159'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='3'>
        <function-decl name='qsexc' mangled-name='_ZN9ArcSorter5qsexcEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='66' column='1' visibility='default' binding='global' size-in-bits='64' hash='6faa8831d3af3ad4'>
          <parameter type-id='type-id-194' is-artificial='yes'/>
          <parameter type-id='type-id-159'/>
          <parameter type-id='type-id-159'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='4'>
        <function-decl name='qstexc' mangled-name='_ZN9ArcSorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/arcsorter.cc' line='76' column='1' visibility='default' binding='global' size-in-bits='64' hash='9895045035709c6f'>
          <parameter type-id='type-id-194' is-artificial='yes'/>
          <parameter type-id='type-id-159'/>
          <parameter type-id='type-id-159'/>
          <parameter type-id='type-id-159'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='ArcTdirSorter' visibility='default' size-in-bits='192' filepath='libnurbs/internals/arcsorter.h' line='65' column='1' hash='9db04392235eae57' id='type-id-195'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-190'/>
      <member-function access='private' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN13ArcTdirSorter5qscmpEPcS0_' filepath='libnurbs/internals/arcsorter.cc' line='138' column='1' visibility='default' binding='global' size-in-bits='64' hash='c4d8735456ba2786'>
          <parameter type-id='type-id-196' is-artificial='yes'/>
          <parameter type-id='type-id-159'/>
          <parameter type-id='type-id-159'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='ArcTessellator' visibility='default' size-in-bits='128' filepath='libnurbs/internals/arctess.h' line='47' column='1' hash='ac296043e3188846' id='type-id-197'>
      <data-member access='public' static='yes'>
        <var-decl name='gl_Bernstein' type-id='type-id-198' mangled-name='_ZN14ArcTessellator12gl_BernsteinE' visibility='default' filepath='libnurbs/internals/arctess.cc' line='504' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pwlarcpool' type-id='type-id-180' visibility='default' filepath='libnurbs/internals/arctess.h' line='61' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='trimvertexpool' type-id='type-id-199' visibility='default' filepath='libnurbs/internals/arctess.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Bin' visibility='default' size-in-bits='128' filepath='libnurbs/internals/bin.h' line='44' column='1' hash='30e025f22d78beee' id='type-id-200'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-171' visibility='default' filepath='libnurbs/internals/bin.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='current' type-id='type-id-171' visibility='default' filepath='libnurbs/internals/bin.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Flist' visibility='default' size-in-bits='320' filepath='libnurbs/internals/flist.h' line='42' column='1' hash='ed01e75ad9680649' id='type-id-201'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pts' type-id='type-id-34' visibility='default' filepath='libnurbs/internals/flist.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='npts' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/flist.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='start' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/flist.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='end' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/flist.h' line='47' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='sorter' type-id='type-id-202' visibility='default' filepath='libnurbs/internals/flist.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Subdivider' visibility='default' size-in-bits='20416' filepath='libnurbs/internals/subdivider.h' line='55' column='1' hash='e07e7a27aef7650b' id='type-id-115'>
      <member-type access='private'>
        <enum-decl name='dir' size-in-bits='32' alignment-in-bits='32' filepath='libnurbs/internals/subdivider.h' line='105' column='1' hash='ba4254643f3a6fa0' id='type-id-203'>
          <underlying-type type-id='type-id-50'/>
          <enumerator name='down' value='0'/>
          <enumerator name='same' value='1'/>
          <enumerator name='up' value='2'/>
          <enumerator name='none' value='3'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='slicer' type-id='type-id-204' visibility='default' filepath='libnurbs/internals/subdivider.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8064'>
        <var-decl name='arctessellator' type-id='type-id-197' visibility='default' filepath='libnurbs/internals/subdivider.h' line='113' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8192'>
        <var-decl name='arcpool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/subdivider.h' line='114' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='10688'>
        <var-decl name='bezierarcpool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/subdivider.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='13184'>
        <var-decl name='pwlarcpool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/subdivider.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='15680'>
        <var-decl name='trimvertexpool' type-id='type-id-118' visibility='default' filepath='libnurbs/internals/subdivider.h' line='117' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18304'>
        <var-decl name='jumpbuffer' type-id='type-id-116' visibility='default' filepath='libnurbs/internals/subdivider.h' line='119' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18368'>
        <var-decl name='renderhints' type-id='type-id-205' visibility='default' filepath='libnurbs/internals/subdivider.h' line='120' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18432'>
        <var-decl name='backend' type-id='type-id-206' visibility='default' filepath='libnurbs/internals/subdivider.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18496'>
        <var-decl name='initialbin' type-id='type-id-200' visibility='default' filepath='libnurbs/internals/subdivider.h' line='123' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18624'>
        <var-decl name='pjarc' type-id='type-id-171' visibility='default' filepath='libnurbs/internals/subdivider.h' line='124' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18688'>
        <var-decl name='s_index' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/subdivider.h' line='125' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18720'>
        <var-decl name='t_index' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/subdivider.h' line='126' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18752'>
        <var-decl name='qlist' type-id='type-id-207' visibility='default' filepath='libnurbs/internals/subdivider.h' line='127' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='18816'>
        <var-decl name='spbrkpts' type-id='type-id-201' visibility='default' filepath='libnurbs/internals/subdivider.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19136'>
        <var-decl name='tpbrkpts' type-id='type-id-201' visibility='default' filepath='libnurbs/internals/subdivider.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19456'>
        <var-decl name='smbrkpts' type-id='type-id-201' visibility='default' filepath='libnurbs/internals/subdivider.h' line='130' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='19776'>
        <var-decl name='tmbrkpts' type-id='type-id-201' visibility='default' filepath='libnurbs/internals/subdivider.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20096'>
        <var-decl name='stepsizes' type-id='type-id-185' visibility='default' filepath='libnurbs/internals/subdivider.h' line='132' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20224'>
        <var-decl name='showDegenerate' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/subdivider.h' line='133' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20256'>
        <var-decl name='isArcTypeBezier' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/subdivider.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20288'>
        <var-decl name='domain_distance_u_rate' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/subdivider.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20320'>
        <var-decl name='domain_distance_v_rate' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/subdivider.h' line='189' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='20352'>
        <var-decl name='is_domain_distance_sampling' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/subdivider.h' line='190' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='JumpBuffer' is-struct='yes' visibility='default' size-in-bits='1600' filepath='libnurbs/internals/mysetjmp.h' line='56' column='1' hash='cf8628326d01df27' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-209' visibility='default' filepath='libnurbs/internals/mysetjmp.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='TrimVertexPool' is-struct='yes' visibility='default' size-in-bits='2624' filepath='libnurbs/internals/trimvertpool.h' line='45' column='1' hash='07f257573fda4c2d#2' id='type-id-118'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2496'>
        <var-decl name='vlist' type-id='type-id-210' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2560'>
        <var-decl name='nextvlistslot' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2592'>
        <var-decl name='vlistsize' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/trimvertpool.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__jmp_buf_tag' is-struct='yes' visibility='default' size-in-bits='1600' filepath='/usr/include/setjmp.h' line='36' column='1' hash='0d7cc580e71a7367#2' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__jmpbuf' type-id='type-id-211' visibility='default' filepath='/usr/include/setjmp.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='__mask_was_saved' type-id='type-id-3' visibility='default' filepath='/usr/include/setjmp.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='__saved_mask' type-id='type-id-212' visibility='default' filepath='/usr/include/setjmp.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='jmp_buf' type-id='type-id-187' size-in-bits='1600' filepath='/usr/include/setjmp.h' line='49' column='1' hash='4b439ea14699207c#2' id='type-id-209'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' hash='a84f0a141ff2344f' id='type-id-213'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' hash='d8b5445e1c581e3f' id='type-id-191'/>
    <qualified-type-def type-id='type-id-191' const='yes' hash='ea0470eda9dd8edf' id='type-id-214'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' hash='d6d8f16e6889ba55' id='type-id-194'/>
    <qualified-type-def type-id='type-id-194' const='yes' hash='fd752c57ff01e362' id='type-id-215'/>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' hash='8805da223a64fd2e' id='type-id-196'/>
    <qualified-type-def type-id='type-id-196' const='yes' hash='ab3c4482c342be15' id='type-id-216'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' hash='559d33674b51c9b6' id='type-id-217'/>
    <reference-type-def kind='lvalue' type-id='type-id-114' size-in-bits='64' hash='78c5321939a1837b' id='type-id-206'/>
    <reference-type-def kind='lvalue' type-id='type-id-200' size-in-bits='64' hash='a2b468a5cde17cb2' id='type-id-218'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' hash='1a12c542dbb32903' id='type-id-219'/>
    <reference-type-def kind='lvalue' type-id='type-id-220' size-in-bits='64' hash='7f67e6037c9bf5ce' id='type-id-221'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' hash='caff59106cfcf0d0' id='type-id-222'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' hash='43c270a68427de26' id='type-id-116'/>
    <reference-type-def kind='lvalue' type-id='type-id-223' size-in-bits='64' hash='94baa2e3cbd25cf3' id='type-id-224'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' hash='37bd09d8ed3141bd#2' id='type-id-207'/>
    <reference-type-def kind='lvalue' type-id='type-id-112' size-in-bits='64' hash='a8b3a211c33d5daa' id='type-id-205'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' hash='2de42bda4f3d6ff1' id='type-id-226'/>
    <qualified-type-def type-id='type-id-226' const='yes' hash='e0206004930aa7c7' id='type-id-227'/>
    <reference-type-def kind='lvalue' type-id='type-id-115' size-in-bits='64' hash='27fdeca5734a3272' id='type-id-193'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' hash='85290dc3d0ec3f5e' id='type-id-228'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' hash='964a41fa3f251240#2' id='type-id-210'/>
    <reference-type-def kind='lvalue' type-id='type-id-118' size-in-bits='64' hash='871189a2a73bfe6b' id='type-id-199'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' hash='96a9052532590d45#2' id='type-id-229'/>
    <qualified-type-def type-id='type-id-15' const='yes' hash='f8b423684ef46369' id='type-id-230'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' hash='f2756299d11b5293' id='type-id-231'/>
    <class-decl name='FlistSorter' visibility='default' size-in-bits='128' filepath='libnurbs/internals/flistsorter.h' line='42' column='1' hash='4a25006e8d053432' id='type-id-202'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-192'/>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~FlistSorter' filepath='libnurbs/internals/flistsorter.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <parameter type-id='type-id-232' is-artificial='yes'/>
          <parameter type-id='type-id-3' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN11FlistSorter5qscmpEPcS0_' filepath='libnurbs/internals/flistsorter.cc' line='54' column='1' visibility='default' binding='global' size-in-bits='64' hash='c4d8735456ba2786'>
          <parameter type-id='type-id-232' is-artificial='yes'/>
          <parameter type-id='type-id-159'/>
          <parameter type-id='type-id-159'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='qsexc' mangled-name='_ZN11FlistSorter5qsexcEPcS0_' filepath='libnurbs/internals/flistsorter.cc' line='62' column='1' visibility='default' binding='global' size-in-bits='64' hash='6faa8831d3af3ad4'>
          <parameter type-id='type-id-232' is-artificial='yes'/>
          <parameter type-id='type-id-159'/>
          <parameter type-id='type-id-159'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='qstexc' mangled-name='_ZN11FlistSorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/flistsorter.cc' line='72' column='1' visibility='default' binding='global' size-in-bits='64' hash='9895045035709c6f'>
          <parameter type-id='type-id-232' is-artificial='yes'/>
          <parameter type-id='type-id-159'/>
          <parameter type-id='type-id-159'/>
          <parameter type-id='type-id-159'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Slicer' visibility='default' size-in-bits='8064' filepath='libnurbs/internals/slicer.h' line='49' column='1' hash='371b7154561f514b' id='type-id-204'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-233'/>
      <base-class access='public' layout-offset-in-bits='128' type-id='type-id-234'/>
      <data-member access='private' layout-offset-in-bits='5248'>
        <var-decl name='backend' type-id='type-id-206' visibility='default' filepath='libnurbs/internals/slicer.h' line='72' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5312'>
        <var-decl name='oneOverDu' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/slicer.h' line='73' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5344'>
        <var-decl name='du' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/slicer.h' line='74' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5376'>
        <var-decl name='dv' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/slicer.h' line='74' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5408'>
        <var-decl name='isolines' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/slicer.h' line='75' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5440'>
        <var-decl name='ulinear' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/slicer.h' line='81' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5472'>
        <var-decl name='vlinear' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/slicer.h' line='82' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Sorter' visibility='default' size-in-bits='128' filepath='libnurbs/internals/sorter.h' line='36' column='1' hash='59bd41271eb043fb' id='type-id-192'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='es' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/sorter.h' line='49' column='1'/>
      </data-member>
      <member-function access='private' destructor='yes' vtable-offset='-1'>
        <function-decl name='~Sorter' filepath='libnurbs/internals/sorter.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='qscmp' mangled-name='_ZN6Sorter5qscmpEPcS0_' filepath='libnurbs/internals/sorter.cc' line='56' column='1' visibility='default' binding='global' size-in-bits='64' hash='c4d8735456ba2786'>
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <parameter type-id='type-id-159'/>
          <parameter type-id='type-id-159'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='qsexc' mangled-name='_ZN6Sorter5qsexcEPcS0_' filepath='libnurbs/internals/sorter.cc' line='64' column='1' visibility='default' binding='global' size-in-bits='64' hash='6faa8831d3af3ad4'>
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <parameter type-id='type-id-159'/>
          <parameter type-id='type-id-159'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='qstexc' mangled-name='_ZN6Sorter6qstexcEPcS0_S0_' filepath='libnurbs/internals/sorter.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64' hash='9895045035709c6f'>
          <parameter type-id='type-id-226' is-artificial='yes'/>
          <parameter type-id='type-id-159'/>
          <parameter type-id='type-id-159'/>
          <parameter type-id='type-id-159'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Backend' visibility='default' size-in-bits='640' filepath='libnurbs/internals/backend.h' line='46' column='1' hash='291169213eae5d36' id='type-id-114'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='curveEvaluator' type-id='type-id-235' visibility='default' filepath='libnurbs/internals/backend.h' line='48' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='surfaceEvaluator' type-id='type-id-236' visibility='default' filepath='libnurbs/internals/backend.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='wireframetris' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/backend.h' line='105' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='wireframequads' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/backend.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='npts' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/backend.h' line='107' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='mesh' type-id='type-id-237' visibility='default' filepath='libnurbs/internals/backend.h' line='108' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='608'>
        <var-decl name='meshindex' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/backend.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Curvelist' visibility='default' size-in-bits='256' filepath='libnurbs/internals/curvelist.h' line='47' column='1' hash='de324befef678d0d' id='type-id-220'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='curve' type-id='type-id-238' visibility='default' filepath='libnurbs/internals/curvelist.h' line='57' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='range' type-id='type-id-239' visibility='default' filepath='libnurbs/internals/curvelist.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='needsSubdivision' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/curvelist.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='stepsize' type-id='type-id-2' visibility='default' filepath='libnurbs/internals/curvelist.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Patchlist' visibility='default' size-in-bits='640' filepath='libnurbs/internals/patchlist.h' line='45' column='1' hash='f1007cf4aca570c8' id='type-id-223'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='patch' type-id='type-id-240' visibility='default' filepath='libnurbs/internals/patchlist.h' line='63' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='notInBbox' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/patchlist.h' line='64' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='needsSampling' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/patchlist.h' line='65' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='pspec' type-id='type-id-241' visibility='default' filepath='libnurbs/internals/patchlist.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Quilt' is-struct='yes' visibility='default' size-in-bits='896' filepath='libnurbs/internals/quilt.h' line='64' column='1' hash='d7e35441ed9bce86#2' id='type-id-225'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mapdesc' type-id='type-id-184' visibility='default' filepath='libnurbs/internals/quilt.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cpts' type-id='type-id-34' visibility='default' filepath='libnurbs/internals/quilt.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='qspec' type-id='type-id-242' visibility='default' filepath='libnurbs/internals/quilt.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='eqspec' type-id='type-id-243' visibility='default' filepath='libnurbs/internals/quilt.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='next' type-id='type-id-207' visibility='default' filepath='libnurbs/internals/quilt.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Renderhints' is-struct='yes' visibility='default' size-in-bits='256' filepath='libnurbs/internals/renderhints.h' line='41' column='1' hash='cea3038128ac762e#2' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='display_method' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/renderhints.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='errorchecking' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/renderhints.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subdivisions' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/renderhints.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tmp1' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/renderhints.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='displaydomain' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/renderhints.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='maxsubdivisions' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/renderhints.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='wiretris' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/renderhints.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='wirequads' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/renderhints.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <function-type method-class-id='type-id-189' size-in-bits='64' hash='c4d8735456ba2786' id='type-id-244'>
      <parameter type-id='type-id-191' is-artificial='yes'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type method-class-id='type-id-190' size-in-bits='64' hash='c4d8735456ba2786' id='type-id-245'>
      <parameter type-id='type-id-194' is-artificial='yes'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type method-class-id='type-id-195' size-in-bits='64' hash='c4d8735456ba2786' id='type-id-246'>
      <parameter type-id='type-id-196' is-artificial='yes'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type method-class-id='type-id-202' size-in-bits='64' hash='c4d8735456ba2786' id='type-id-247'>
      <parameter type-id='type-id-232' is-artificial='yes'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type method-class-id='type-id-192' size-in-bits='64' hash='c4d8735456ba2786' id='type-id-248'>
      <parameter type-id='type-id-226' is-artificial='yes'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type method-class-id='type-id-190' size-in-bits='64' hash='6faa8831d3af3ad4' id='type-id-249'>
      <parameter type-id='type-id-194' is-artificial='yes'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-190' size-in-bits='64' hash='9895045035709c6f' id='type-id-250'>
      <parameter type-id='type-id-194' is-artificial='yes'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-202' size-in-bits='64' hash='6faa8831d3af3ad4' id='type-id-251'>
      <parameter type-id='type-id-232' is-artificial='yes'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-202' size-in-bits='64' hash='9895045035709c6f' id='type-id-252'>
      <parameter type-id='type-id-232' is-artificial='yes'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-192' size-in-bits='64' hash='6faa8831d3af3ad4' id='type-id-253'>
      <parameter type-id='type-id-226' is-artificial='yes'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type method-class-id='type-id-192' size-in-bits='64' hash='9895045035709c6f' id='type-id-254'>
      <parameter type-id='type-id-226' is-artificial='yes'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-32'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/arctess.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='3' type-id='type-id-15' size-in-bits='unknown' hash='e76496ec7939223d' id='type-id-198'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-255'/>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='e7b8d3aa178b54e4' id='type-id-256'/>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='e7b8d3aa178b54e4' id='type-id-256'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-217' const='yes' hash='210778ca2e0f5b63' id='type-id-257'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' hash='03638f3000f2014f#2' id='type-id-184'/>
    <qualified-type-def type-id='type-id-181' const='yes' hash='c8cfb5c78016b51a' id='type-id-259'/>
    <qualified-type-def type-id='type-id-173' const='yes' hash='a6ba35a4449d6d01' id='type-id-260'/>
    <class-decl name='Mapdesc' is-struct='yes' visibility='default' size-in-bits='3392' filepath='libnurbs/internals/mapdesc.h' line='49' column='1' hash='fc4ab9039f5be164#2' id='type-id-258'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pixel_tolerance' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='error_tolerance' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='object_space_error_tolerance' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='clampfactor' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='minsavings' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='maxrate' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='maxsrate' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='maxtrate' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bboxsize' type-id='type-id-261' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='type' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='isrational' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='544'>
        <var-decl name='ncoords' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='117' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='hcoords' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='118' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='608'>
        <var-decl name='inhcoords' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='119' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='mask' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='120' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='672'>
        <var-decl name='bmat' type-id='type-id-262' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='cmat' type-id='type-id-262' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='122' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2272'>
        <var-decl name='smat' type-id='type-id-262' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='123' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3072'>
        <var-decl name='s_steps' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='124' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3104'>
        <var-decl name='t_steps' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='125' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3136'>
        <var-decl name='sampling_method' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='126' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3168'>
        <var-decl name='culling_method' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='127' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3200'>
        <var-decl name='bbox_subdividing' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3264'>
        <var-decl name='next' type-id='type-id-184' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3328'>
        <var-decl name='backend' type-id='type-id-206' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='130' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/backend.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='2' type-id='type-id-15' size-in-bits='384' hash='afb9d7011d6c1248' id='type-id-237'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-134'/>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-110'/>
    </array-type-def>
    <class-decl name='GridTrimVertex' visibility='default' size-in-bits='384' filepath='libnurbs/internals/gridtrimvertex.h' line='45' column='1' hash='16d695ecc5d006e8' id='type-id-263'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='dummyt' type-id='type-id-264' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='dummyg' type-id='type-id-265' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='48' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='t' type-id='type-id-266' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='g' type-id='type-id-267' visibility='default' filepath='libnurbs/internals/gridtrimvertex.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='TrimVertex' visibility='default' size-in-bits='128' filepath='libnurbs/internals/trimvertex.h' line='43' column='1' hash='c48342ca8a15d373' id='type-id-264'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='param' type-id='type-id-132' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='nuid' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/trimvertex.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='GridVertex' is-struct='yes' visibility='default' size-in-bits='128' filepath='libnurbs/internals/gridvertex.h' line='39' column='1' hash='75bd81e6b709a8fc' id='type-id-265'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gparam' type-id='type-id-138' visibility='default' filepath='libnurbs/internals/gridvertex.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' hash='3d13b03f14cff06a' id='type-id-268'/>
    <qualified-type-def type-id='type-id-268' const='yes' hash='3e5f9aa6c8adf93c' id='type-id-269'/>
    <reference-type-def kind='lvalue' type-id='type-id-22' size-in-bits='64' hash='646bc7330120c357' id='type-id-235'/>
    <reference-type-def kind='lvalue' type-id='type-id-85' size-in-bits='64' hash='9769dc3ef09d2dfb' id='type-id-236'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' hash='69f5480fce10c1f1' id='type-id-270'/>
    <qualified-type-def type-id='type-id-270' const='yes' hash='4cfac5020b98363e' id='type-id-271'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' hash='0cd4a41bc60dd063' id='type-id-267'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' hash='ff6cddff133e642c' id='type-id-266'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/basiccrveval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' hash='e50390d871b09e56' id='type-id-51'/>
    <qualified-type-def type-id='type-id-51' const='yes' hash='9316c4e4919e6cf1' id='type-id-272'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/basicsurfeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' hash='3e1877a24326b79b' id='type-id-145'/>
    <qualified-type-def type-id='type-id-145' const='yes' hash='a286e5fd6e4325bc' id='type-id-273'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/bin.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-219' const='yes' hash='27aa61e0bd28d68c' id='type-id-274'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/bufpool.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/cachingeval.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/ccw.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-228' const='yes' hash='d6b267934edb6333' id='type-id-275'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/coveandtiler.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='CoveAndTiler' visibility='default' size-in-bits='2688' filepath='libnurbs/internals/coveandtiler.h' line='46' column='1' hash='4f1df80d680fd431' id='type-id-233'>
      <base-class access='public' layout-offset-in-bits='192' is-virtual='yes' type-id='type-id-276'/>
      <data-member access='public' static='yes'>
        <var-decl name='MAXSTRIPSIZE' type-id='type-id-43' mangled-name='_ZN12CoveAndTiler12MAXSTRIPSIZEE' visibility='default' filepath='libnurbs/internals/coveandtiler.cc' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='backend' type-id='type-id-206' visibility='default' filepath='libnurbs/internals/coveandtiler.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Jarcloc' visibility='default' size-in-bits='192' filepath='libnurbs/internals/jarcloc.h' line='41' column='1' hash='0eb1c79a74ee08df' id='type-id-277'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='arc' type-id='type-id-171' visibility='default' filepath='libnurbs/internals/jarcloc.h' line='43' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='p' type-id='type-id-266' visibility='default' filepath='libnurbs/internals/jarcloc.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='plast' type-id='type-id-266' visibility='default' filepath='libnurbs/internals/jarcloc.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='TrimRegion' visibility='default' size-in-bits='2560' filepath='libnurbs/internals/trimregion.h' line='46' column='1' hash='422b68d80547409e' id='type-id-276'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='left' type-id='type-id-278' visibility='default' filepath='libnurbs/internals/trimregion.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='832'>
        <var-decl name='right' type-id='type-id-278' visibility='default' filepath='libnurbs/internals/trimregion.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <var-decl name='top' type-id='type-id-279' visibility='default' filepath='libnurbs/internals/trimregion.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1984'>
        <var-decl name='bot' type-id='type-id-279' visibility='default' filepath='libnurbs/internals/trimregion.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2304'>
        <var-decl name='uarray' type-id='type-id-280' visibility='default' filepath='libnurbs/internals/trimregion.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2496'>
        <var-decl name='oneOverDu' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/trimregion.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Trimline' visibility='default' size-in-bits='832' filepath='libnurbs/internals/trimline.h' line='46' column='1' hash='b6e3a9af3841f11a' id='type-id-278'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pts' type-id='type-id-281' visibility='default' filepath='libnurbs/internals/trimline.h' line='48' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='numverts' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/trimline.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='i' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/trimline.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/trimline.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='jarcl' type-id='type-id-277' visibility='default' filepath='libnurbs/internals/trimline.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='t' type-id='type-id-264' visibility='default' filepath='libnurbs/internals/trimline.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='b' type-id='type-id-264' visibility='default' filepath='libnurbs/internals/trimline.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='tinterp' type-id='type-id-266' visibility='default' filepath='libnurbs/internals/trimline.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='binterp' type-id='type-id-266' visibility='default' filepath='libnurbs/internals/trimline.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Uarray' visibility='default' size-in-bits='192' filepath='libnurbs/internals/uarray.h' line='44' column='1' hash='61fe088e9976fa38' id='type-id-280'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/uarray.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='ulines' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/uarray.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='uarray' type-id='type-id-34' visibility='default' filepath='libnurbs/internals/uarray.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Gridline' is-struct='yes' visibility='default' size-in-bits='320' filepath='libnurbs/internals/gridline.h' line='39' column='1' hash='67020be818a3d99b' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='v' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/gridline.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vval' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/gridline.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vindex' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/gridline.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ustart' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/gridline.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='uend' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/gridline.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' hash='43a83375c36f045a' id='type-id-282'/>
    <qualified-type-def type-id='type-id-282' const='yes' hash='571b72d7552ab9b1' id='type-id-283'/>
    <reference-type-def kind='lvalue' type-id='type-id-263' size-in-bits='64' hash='454cd70a67ed3172' id='type-id-284'/>
    <reference-type-def kind='lvalue' type-id='type-id-265' size-in-bits='64' hash='708958d555016dd0' id='type-id-285'/>
    <qualified-type-def type-id='type-id-267' const='yes' hash='22c895ea93c41451' id='type-id-286'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' hash='66ab13957b849a9e' id='type-id-287'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' hash='8d45282821c8ddc4' id='type-id-288'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' hash='964a41fa3f251240' id='type-id-281'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' hash='7aa8a89fec61bd0a' id='type-id-289'/>
    <qualified-type-def type-id='type-id-289' const='yes' hash='18260f538ce83fdb' id='type-id-290'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' hash='26bb112677d1205a' id='type-id-291'/>
    <qualified-type-def type-id='type-id-292' const='yes' hash='52c4b44d191c43e5' id='type-id-293'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/curve.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-294' size-in-bits='640' hash='6744a540e8dd783a' id='type-id-242'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-131'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='3840' hash='c42532f87de6f864' id='type-id-295'>
      <subrange length='120' lower-bound='0' upper-bound='119' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='c13a015dfac3e71d' id='type-id-296'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='160' hash='8ec6aa0cab893377' id='type-id-261'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='type-id-297'/>
    </array-type-def>
    <array-type-def dimensions='2' type-id='type-id-15' size-in-bits='800' hash='ed8021aa46eaf1df' id='type-id-298'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='type-id-297'/>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='type-id-297'/>
    </array-type-def>
    <class-decl name='Curve' visibility='default' size-in-bits='8128' filepath='libnurbs/internals/curve.h' line='46' column='1' hash='3399d7cc6a3a38ac' id='type-id-299'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-300' visibility='default' filepath='libnurbs/internals/curve.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='mapdesc' type-id='type-id-184' visibility='default' filepath='libnurbs/internals/curve.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='stride' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/curve.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='order' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/curve.h' line='55' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='cullval' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/curve.h' line='56' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='needsSampling' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/curve.h' line='57' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='cpts' type-id='type-id-295' visibility='default' filepath='libnurbs/internals/curve.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4096'>
        <var-decl name='spts' type-id='type-id-295' visibility='default' filepath='libnurbs/internals/curve.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7936'>
        <var-decl name='stepsize' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/curve.h' line='60' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7968'>
        <var-decl name='minstepsize' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/curve.h' line='61' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8000'>
        <var-decl name='range' type-id='type-id-133' visibility='default' filepath='libnurbs/internals/curve.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='128' hash='b3db84c58df322c1' id='type-id-301'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-110'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='64' hash='8198620b8b558cae' id='type-id-302'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-131'/>
    </array-type-def>
    <class-decl name='Quiltspec' is-struct='yes' visibility='default' size-in-bits='320' filepath='libnurbs/internals/quilt.h' line='51' column='1' hash='f6d49659f6f074b6' id='type-id-294'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stride' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/quilt.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='width' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/quilt.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/quilt.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='order' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/quilt.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='index' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/quilt.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='bdry' type-id='type-id-302' visibility='default' filepath='libnurbs/internals/quilt.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='step_size' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/quilt.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='breakpoints' type-id='type-id-303' visibility='default' filepath='libnurbs/internals/quilt.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Knot' type-id='type-id-15' size-in-bits='32' filepath='libnurbs/internals/types.h' line='45' column='1' hash='d7ec3bf03d3c5690' id='type-id-304'/>
    <typedef-decl name='Maxmatrix' type-id='type-id-298' size-in-bits='800' filepath='libnurbs/internals/mapdesc.h' line='45' column='1' hash='ed8021aa46eaf1df' id='type-id-262'/>
    <typedef-decl name='Quilt_ptr' type-id='type-id-207' size-in-bits='64' filepath='libnurbs/internals/quilt.h' line='90' column='1' hash='37bd09d8ed3141bd#2' id='type-id-305'/>
    <typedef-decl name='Quiltspec_ptr' type-id='type-id-306' size-in-bits='64' filepath='libnurbs/internals/quilt.h' line='62' column='1' hash='654081573a898bb4' id='type-id-243'/>
    <reference-type-def kind='lvalue' type-id='type-id-299' size-in-bits='64' hash='4adf16ffce66e572' id='type-id-307'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' hash='424f37f9dde4d90f' id='type-id-300'/>
    <qualified-type-def type-id='type-id-300' const='yes' hash='b73ac08c78f4e8d8' id='type-id-308'/>
    <reference-type-def kind='lvalue' type-id='type-id-201' size-in-bits='64' hash='a261777afdcc774b' id='type-id-309'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' hash='26236de9c59bd1bd' id='type-id-303'/>
    <reference-type-def kind='lvalue' type-id='type-id-310' size-in-bits='64' hash='cdd6ae6ed0360485' id='type-id-311'/>
    <qualified-type-def type-id='type-id-184' const='yes' hash='1c52f06814e3760c#2' id='type-id-312'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' hash='654081573a898bb4' id='type-id-306'/>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' hash='89b0d8f1abea2dd9' id='type-id-313'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' hash='45efac4d992e75fb' id='type-id-314'/>
    <class-decl name='Knotvector' is-struct='yes' visibility='default' size-in-bits='256' filepath='libnurbs/internals/knotvector.h' line='41' column='1' hash='5799971307a8a8b4' id='type-id-310'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='order' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/knotvector.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='knotcount' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/knotvector.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stride' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/knotvector.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='knotlist' type-id='type-id-303' visibility='default' filepath='libnurbs/internals/knotvector.h' line='51' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/curvelist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='Quilt' visibility='default' size-in-bits='896' filepath='libnurbs/internals/quilt.h' line='64' column='1' hash='d7e35441ed9bce86' id='type-id-315'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='mapdesc' type-id='type-id-184' visibility='default' filepath='libnurbs/internals/quilt.h' line='67' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='cpts' type-id='type-id-34' visibility='default' filepath='libnurbs/internals/quilt.h' line='68' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='qspec' type-id='type-id-242' visibility='default' filepath='libnurbs/internals/quilt.h' line='69' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='eqspec' type-id='type-id-243' visibility='default' filepath='libnurbs/internals/quilt.h' line='70' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='832'>
        <var-decl name='next' type-id='type-id-316' visibility='default' filepath='libnurbs/internals/quilt.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='96' hash='d8f42ca158d6c0e9' id='type-id-239'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-134'/>
    </array-type-def>
    <class-decl name='Curve' is-struct='yes' visibility='default' size-in-bits='8128' filepath='libnurbs/internals/curve.h' line='46' column='1' hash='3399d7cc6a3a38ac#2' id='type-id-317'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-238' visibility='default' filepath='libnurbs/internals/curve.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='mapdesc' type-id='type-id-184' visibility='default' filepath='libnurbs/internals/curve.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='stride' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/curve.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='order' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/curve.h' line='55' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='cullval' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/curve.h' line='56' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='needsSampling' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/curve.h' line='57' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='cpts' type-id='type-id-295' visibility='default' filepath='libnurbs/internals/curve.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4096'>
        <var-decl name='spts' type-id='type-id-295' visibility='default' filepath='libnurbs/internals/curve.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7936'>
        <var-decl name='stepsize' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/curve.h' line='60' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7968'>
        <var-decl name='minstepsize' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/curve.h' line='61' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8000'>
        <var-decl name='range' type-id='type-id-133' visibility='default' filepath='libnurbs/internals/curve.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' hash='424f37f9dde4d90f#2' id='type-id-238'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' hash='fd01c8b0d7e239c5' id='type-id-318'/>
    <qualified-type-def type-id='type-id-318' const='yes' hash='0bfd23aa95cb0cf5' id='type-id-319'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' hash='37bd09d8ed3141bd' id='type-id-316'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/curvesub.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='Curvelist' is-struct='yes' visibility='default' size-in-bits='256' filepath='libnurbs/internals/curvelist.h' line='47' column='1' hash='de324befef678d0d#2' id='type-id-320'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='curve' type-id='type-id-300' visibility='default' filepath='libnurbs/internals/curvelist.h' line='57' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='range' type-id='type-id-239' visibility='default' filepath='libnurbs/internals/curvelist.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='needsSubdivision' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/curvelist.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='stepsize' type-id='type-id-2' visibility='default' filepath='libnurbs/internals/curvelist.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' hash='fd01c8b0d7e239c5#2' id='type-id-321'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' hash='afd977a73e5ec6c4#2' id='type-id-322'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/dataTransform.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/displaylist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='DisplayList' visibility='default' size-in-bits='2688' filepath='libnurbs/internals/displaylist.h' line='65' column='1' hash='7c5999b391a964b6' id='type-id-323'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='nodes' type-id='type-id-324' visibility='default' filepath='libnurbs/internals/displaylist.h' line='73' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='dlnodePool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/displaylist.h' line='74' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2560'>
        <var-decl name='lastNode' type-id='type-id-325' visibility='default' filepath='libnurbs/internals/displaylist.h' line='75' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2624'>
        <var-decl name='nt' type-id='type-id-128' visibility='default' filepath='libnurbs/internals/displaylist.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Dlnode' is-struct='yes' visibility='default' size-in-bits='384' filepath='libnurbs/internals/displaylist.h' line='48' column='1' hash='550892298ee4e5bf' id='type-id-326'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='work' type-id='type-id-327' visibility='default' filepath='libnurbs/internals/displaylist.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='arg' type-id='type-id-30' visibility='default' filepath='libnurbs/internals/displaylist.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cleanup' type-id='type-id-327' visibility='default' filepath='libnurbs/internals/displaylist.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next' type-id='type-id-324' visibility='default' filepath='libnurbs/internals/displaylist.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PFVS' is-struct='yes' naming-typedef-id='type-id-327' visibility='default' size-in-bits='128' filepath='libnurbs/internals/displaylist.h' line='46' column='1' hash='7c51ef9ab8e9b029' id='type-id-328'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pfn' type-id='type-id-329' visibility='default' filepath='libnurbs/internals/displaylist.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__delta' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/displaylist.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PFVS' type-id='type-id-328' size-in-bits='128' filepath='libnurbs/internals/displaylist.h' line='46' column='1' id='type-id-327'/>
    <pointer-type-def type-id='type-id-323' size-in-bits='64' hash='e9493a6ae9acc988' id='type-id-127'/>
    <qualified-type-def type-id='type-id-127' const='yes' hash='c54453ea0606ab9f' id='type-id-330'/>
    <pointer-type-def type-id='type-id-326' size-in-bits='64' hash='7dc43162f5ba781d' id='type-id-324'/>
    <qualified-type-def type-id='type-id-324' const='yes' hash='e7636da420b12cb7' id='type-id-331'/>
    <pointer-type-def type-id='type-id-324' size-in-bits='64' hash='dd1f61c64efb8845' id='type-id-325'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' hash='47fa197d9ea9d904' id='type-id-128'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' hash='fd7a63c0c6c822c4#2' id='type-id-329'/>
    <function-type method-class-id='type-id-82' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-332'>
      <parameter type-id='type-id-128' is-artificial='yes'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-32'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/flist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-222' const='yes' hash='2e6d74de17d13c4d' id='type-id-333'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' hash='f84d9519f0153462' id='type-id-232'/>
    <qualified-type-def type-id='type-id-232' const='yes' hash='d24d948e6ce0b28c' id='type-id-334'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/flistsorter.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/hull.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='Hull' visibility='default' size-in-bits='4800' filepath='libnurbs/internals/hull.h' line='47' column='1' hash='80ae61600d33301c' id='type-id-335'>
      <base-class access='public' layout-offset-in-bits='192' is-virtual='yes' type-id='type-id-276'/>
      <member-type access='private'>
        <class-decl name='Side' is-struct='yes' visibility='default' size-in-bits='256' filepath='libnurbs/internals/hull.h' line='55' column='1' hash='a33001b625912ca4' id='type-id-336'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='left' type-id='type-id-289' visibility='default' filepath='libnurbs/internals/hull.h' line='56' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='line' type-id='type-id-337' visibility='default' filepath='libnurbs/internals/hull.h' line='57' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='right' type-id='type-id-289' visibility='default' filepath='libnurbs/internals/hull.h' line='58' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='index' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/hull.h' line='59' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='lower' type-id='type-id-336' visibility='default' filepath='libnurbs/internals/hull.h' line='62' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='upper' type-id='type-id-336' visibility='default' filepath='libnurbs/internals/hull.h' line='63' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='fakeleft' type-id='type-id-278' visibility='default' filepath='libnurbs/internals/hull.h' line='64' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <var-decl name='fakeright' type-id='type-id-278' visibility='default' filepath='libnurbs/internals/hull.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' hash='5f43ad1a6e57329c' id='type-id-337'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' hash='0e771f8234f2edd5' id='type-id-338'/>
    <qualified-type-def type-id='type-id-338' const='yes' hash='59d81c72e2ca4ccb' id='type-id-339'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/intersect.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/knotvector.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='type-id-310' size-in-bits='64' hash='2b485465e190b3a1' id='type-id-340'/>
    <qualified-type-def type-id='type-id-340' const='yes' hash='965df215d7fced52' id='type-id-341'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/mapdesc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='Mapdesc' visibility='default' size-in-bits='3392' filepath='libnurbs/internals/mapdesc.h' line='49' column='1' hash='fc4ab9039f5be164' id='type-id-342'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='pixel_tolerance' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='104' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='error_tolerance' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='105' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='object_space_error_tolerance' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='clampfactor' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='107' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='minsavings' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='108' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='maxrate' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='maxsrate' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='110' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='maxtrate' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='bboxsize' type-id='type-id-261' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='112' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='type' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='isrational' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='544'>
        <var-decl name='ncoords' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='117' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='hcoords' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='118' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='608'>
        <var-decl name='inhcoords' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='119' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='mask' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='120' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='672'>
        <var-decl name='bmat' type-id='type-id-262' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='cmat' type-id='type-id-262' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='122' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2272'>
        <var-decl name='smat' type-id='type-id-262' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='123' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3072'>
        <var-decl name='s_steps' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='124' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3104'>
        <var-decl name='t_steps' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='125' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3136'>
        <var-decl name='sampling_method' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='126' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3168'>
        <var-decl name='culling_method' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='127' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3200'>
        <var-decl name='bbox_subdividing' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='128' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3264'>
        <var-decl name='next' type-id='type-id-343' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='129' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3328'>
        <var-decl name='backend' type-id='type-id-206' visibility='default' filepath='libnurbs/internals/mapdesc.h' line='130' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' hash='03638f3000f2014f' id='type-id-343'/>
    <qualified-type-def type-id='type-id-343' const='yes' hash='1c52f06814e3760c' id='type-id-344'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/mapdescv.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/maplist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='Maplist' visibility='default' size-in-bits='2688' filepath='libnurbs/internals/maplist.h' line='46' column='1' hash='d151a4e6ecbf6bdf' id='type-id-113'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='mapdescPool' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/maplist.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2496'>
        <var-decl name='maps' type-id='type-id-184' visibility='default' filepath='libnurbs/internals/maplist.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2560'>
        <var-decl name='lastmap' type-id='type-id-345' visibility='default' filepath='libnurbs/internals/maplist.h' line='60' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2624'>
        <var-decl name='backend' type-id='type-id-206' visibility='default' filepath='libnurbs/internals/maplist.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' hash='214883184ee500cb' id='type-id-345'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' hash='89001d688147b2a3' id='type-id-346'/>
    <qualified-type-def type-id='type-id-346' const='yes' hash='f69ffe7fbad848ff' id='type-id-347'/>
    <qualified-type-def type-id='type-id-182' const='yes' hash='bd1e9c10b196e66f' id='type-id-348'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/mesher.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-270' size-in-bits='128' hash='8cda91b611cf68c8' id='type-id-349'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-131'/>
    </array-type-def>
    <class-decl name='Mesher' visibility='default' size-in-bits='7680' filepath='libnurbs/internals/mesher.h' line='47' column='1' hash='17bd6be0a2dc5abd' id='type-id-234'>
      <base-class access='public' layout-offset-in-bits='192' is-virtual='yes' type-id='type-id-276'/>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-335'/>
      <data-member access='public' static='yes'>
        <var-decl name='ZERO' type-id='type-id-350' mangled-name='_ZN6Mesher4ZEROE' visibility='default' filepath='libnurbs/internals/mesher.cc' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2240'>
        <var-decl name='backend' type-id='type-id-206' visibility='default' filepath='libnurbs/internals/mesher.h' line='56' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2304'>
        <var-decl name='p' type-id='type-id-117' visibility='default' filepath='libnurbs/internals/mesher.h' line='58' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4800'>
        <var-decl name='stacksize' type-id='type-id-351' visibility='default' filepath='libnurbs/internals/mesher.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4864'>
        <var-decl name='vdata' type-id='type-id-352' visibility='default' filepath='libnurbs/internals/mesher.h' line='60' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='4928'>
        <var-decl name='last' type-id='type-id-349' visibility='default' filepath='libnurbs/internals/mesher.h' line='61' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5056'>
        <var-decl name='itop' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mesher.h' line='62' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5088'>
        <var-decl name='lastedge' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/mesher.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' hash='10d4010ef4f9db93' id='type-id-352'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' hash='5dcd2dd16a737b49' id='type-id-353'/>
    <qualified-type-def type-id='type-id-353' const='yes' hash='d1665ae320cd68dd' id='type-id-354'/>
    <qualified-type-def type-id='type-id-2' const='yes' hash='03855f78902f9a2e' id='type-id-350'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/monoTriangulationBackend.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-355' size-in-bits='64' hash='fe6eb11407b3222b' id='type-id-356'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-131'/>
    </array-type-def>
    <class-decl name='primStream' visibility='default' size-in-bits='384' filepath='libnurbs/nurbtess/primitiveStream.h' line='44' column='1' hash='902f7d43b4f36397' id='type-id-357'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='lengths' type-id='type-id-358' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='types' type-id='type-id-358' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='vertices' type-id='type-id-359' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='47' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='index_lengths' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='size_lengths' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='index_vertices' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='288'>
        <var-decl name='size_vertices' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='counter' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/primitiveStream.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='reflexChain' visibility='default' size-in-bits='192' filepath='libnurbs/nurbtess/monoTriangulation.h' line='43' column='1' hash='bbbb9f1cdb830c1f' id='type-id-361'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='queue' type-id='type-id-362' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='isIncreasing' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='index_queue' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='size_queue' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='vertexArray' visibility='default' size-in-bits='128' filepath='libnurbs/nurbtess/monoTriangulation.h' line='77' column='1' hash='07712def89ea3356' id='type-id-363'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='array' type-id='type-id-364' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='78' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='index' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='79' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='size' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/monoTriangulation.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Int' type-id='type-id-3' size-in-bits='32' filepath='libnurbs/nurbtess/definitions.h' line='37' column='1' hash='09d17c08f594edc7' id='type-id-360'/>
    <typedef-decl name='Real' type-id='type-id-2' size-in-bits='32' filepath='libnurbs/nurbtess/definitions.h' line='36' column='1' hash='d7ec3bf03d3c5690' id='type-id-355'/>
    <typedef-decl name='Real2' type-id='type-id-356' size-in-bits='64' filepath='libnurbs/nurbtess/definitions.h' line='38' column='1' hash='fe6eb11407b3222b' id='type-id-365'/>
    <pointer-type-def type-id='type-id-360' size-in-bits='64' hash='6e500ac02a2baf88' id='type-id-358'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' hash='b788aa62c2402d33' id='type-id-366'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' hash='2a9c1e76348e753e' id='type-id-359'/>
    <pointer-type-def type-id='type-id-359' size-in-bits='64' hash='d8ffc479c7efb1e9' id='type-id-364'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' hash='7ef6336c037a4b6c' id='type-id-362'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' hash='299fa010e2459667' id='type-id-367'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' hash='13d407d5469d7b47' id='type-id-368'/>
    <qualified-type-def type-id='type-id-368' const='yes' hash='42aa5952be2389bc' id='type-id-369'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' hash='8529fc7ef5ba55c8' id='type-id-370'/>
    <qualified-type-def type-id='type-id-370' const='yes' hash='cd1babc2019c4716' id='type-id-371'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/monotonizer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/nurbsinterfac.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <enum-decl name='Curvetype' size-in-bits='32' alignment-in-bits='32' filepath='libnurbs/internals/reader.h' line='42' column='1' hash='23d6cd6c52be310c' id='type-id-372'>
      <underlying-type type-id='type-id-50'/>
      <enumerator name='ct_nurbscurve' value='0'/>
      <enumerator name='ct_pwlcurve' value='1'/>
      <enumerator name='ct_none' value='2'/>
    </enum-decl>
    <class-decl name='O_curve' is-struct='yes' visibility='default' size-in-bits='384' filepath='libnurbs/internals/reader.h' line='55' column='1' hash='328302ae739c56df' id='type-id-373'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='libnurbs/internals/reader.h' line='56' column='1' hash='9c5fe6e96caa0252' id='type-id-374'>
          <data-member access='public'>
            <var-decl name='o_nurbscurve' type-id='type-id-375' visibility='default' filepath='libnurbs/internals/reader.h' line='57' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='o_pwlcurve' type-id='type-id-376' visibility='default' filepath='libnurbs/internals/reader.h' line='58' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='curve' type-id='type-id-374' visibility='default' filepath='libnurbs/internals/reader.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='curvetype' type-id='type-id-372' visibility='default' filepath='libnurbs/internals/reader.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-126' visibility='default' filepath='libnurbs/internals/reader.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='owner' type-id='type-id-124' visibility='default' filepath='libnurbs/internals/reader.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='used' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/reader.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='save' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/reader.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nuid' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/reader.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='O_nurbscurve' is-struct='yes' visibility='default' size-in-bits='384' filepath='libnurbs/internals/reader.h' line='70' column='1' hash='bbfb998a440829e4' id='type-id-377'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bezier_curves' type-id='type-id-207' visibility='default' filepath='libnurbs/internals/reader.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/reader.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tesselation' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/reader.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='method' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/reader.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next' type-id='type-id-375' visibility='default' filepath='libnurbs/internals/reader.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='used' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/reader.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='save' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/reader.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='owner' type-id='type-id-126' visibility='default' filepath='libnurbs/internals/reader.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='O_nurbssurface' is-struct='yes' visibility='default' size-in-bits='320' filepath='libnurbs/internals/reader.h' line='101' column='1' hash='e7b07ce49d971940' id='type-id-378'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bezier_patches' type-id='type-id-207' visibility='default' filepath='libnurbs/internals/reader.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/reader.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='owner' type-id='type-id-124' visibility='default' filepath='libnurbs/internals/reader.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next' type-id='type-id-379' visibility='default' filepath='libnurbs/internals/reader.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='save' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/reader.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='used' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/reader.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='O_pwlcurve' is-struct='yes' visibility='default' size-in-bits='320' filepath='libnurbs/internals/reader.h' line='83' column='1' hash='72464fa5a254a078' id='type-id-380'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pts' type-id='type-id-168' visibility='default' filepath='libnurbs/internals/reader.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='npts' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/reader.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-376' visibility='default' filepath='libnurbs/internals/reader.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='used' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/reader.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='save' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/reader.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='owner' type-id='type-id-126' visibility='default' filepath='libnurbs/internals/reader.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='O_surface' is-struct='yes' visibility='default' size-in-bits='256' filepath='libnurbs/internals/reader.h' line='112' column='1' hash='2020a2ef93ad7140' id='type-id-381'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='o_nurbssurface' type-id='type-id-379' visibility='default' filepath='libnurbs/internals/reader.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='o_trim' type-id='type-id-125' visibility='default' filepath='libnurbs/internals/reader.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='save' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/reader.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nuid' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/reader.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='O_trim' is-struct='yes' visibility='default' size-in-bits='192' filepath='libnurbs/internals/reader.h' line='94' column='1' hash='26834b513fce1b67' id='type-id-382'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='o_curve' type-id='type-id-126' visibility='default' filepath='libnurbs/internals/reader.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-125' visibility='default' filepath='libnurbs/internals/reader.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='save' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/reader.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Property' is-struct='yes' visibility='default' size-in-bits='192' filepath='libnurbs/internals/reader.h' line='120' column='1' hash='fbb97f093c1274f2' id='type-id-383'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-166'/>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/reader.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/reader.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/reader.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='save' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/reader.h' line='124' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-128' const='yes' hash='5abc9dd9fe127e61' id='type-id-384'/>
    <pointer-type-def type-id='type-id-373' size-in-bits='64' hash='81c929153f8d440f' id='type-id-126'/>
    <qualified-type-def type-id='type-id-126' const='yes' hash='f09776b426ae38bd' id='type-id-385'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' hash='df1d48588ca9d1be' id='type-id-120'/>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' hash='3802f905c71feac3' id='type-id-375'/>
    <qualified-type-def type-id='type-id-375' const='yes' hash='04d8ef52ca07e3f2' id='type-id-386'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' hash='000bf8b662fada53' id='type-id-121'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' hash='990f9ed7e85750ea' id='type-id-379'/>
    <qualified-type-def type-id='type-id-379' const='yes' hash='9b0854fe63130437' id='type-id-387'/>
    <pointer-type-def type-id='type-id-379' size-in-bits='64' hash='5bc480515a2bba80' id='type-id-123'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' hash='c8415d4825292651' id='type-id-376'/>
    <pointer-type-def type-id='type-id-376' size-in-bits='64' hash='4916e33c9dbc7cd2' id='type-id-122'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' hash='c8536704aa75b1d0' id='type-id-124'/>
    <qualified-type-def type-id='type-id-124' const='yes' hash='99a1cfd03baf5fab' id='type-id-388'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' hash='0bd8cc4d8c5a46ae' id='type-id-125'/>
    <qualified-type-def type-id='type-id-125' const='yes' hash='002acac46393d2ba' id='type-id-389'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' hash='db1c80a4aae76d5b' id='type-id-119'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' hash='a707d8e6b92a1f22' id='type-id-390'/>
    <qualified-type-def type-id='type-id-390' const='yes' hash='b7412c33c54c64a9' id='type-id-391'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/nurbstess.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/patch.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-392' size-in-bits='640' hash='6cbd7a2d412ca4ff' id='type-id-393'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-131'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='92160' hash='3871054fd513f857' id='type-id-394'>
      <subrange length='2880' lower-bound='0' upper-bound='2879' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='3baf6fd680ad225c' id='type-id-395'/>
    </array-type-def>
    <array-type-def dimensions='2' type-id='type-id-15' size-in-bits='320' hash='6997d5c2b4c4cd84' id='type-id-396'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-131'/>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='type-id-297'/>
    </array-type-def>
    <class-decl name='Patch' visibility='default' size-in-bits='277696' filepath='libnurbs/internals/patch.h' line='62' column='1' hash='af178d0a5ec5e111' id='type-id-397'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='mapdesc' type-id='type-id-184' visibility='default' filepath='libnurbs/internals/patch.h' line='82' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-240' visibility='default' filepath='libnurbs/internals/patch.h' line='83' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='cullval' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/patch.h' line='84' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='notInBbox' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/patch.h' line='85' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='needsSampling' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/patch.h' line='86' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='cpts' type-id='type-id-394' visibility='default' filepath='libnurbs/internals/patch.h' line='87' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='92384'>
        <var-decl name='spts' type-id='type-id-394' visibility='default' filepath='libnurbs/internals/patch.h' line='88' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='184544'>
        <var-decl name='bpts' type-id='type-id-394' visibility='default' filepath='libnurbs/internals/patch.h' line='89' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='276704'>
        <var-decl name='pspec' type-id='type-id-393' visibility='default' filepath='libnurbs/internals/patch.h' line='90' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='277344'>
        <var-decl name='bb' type-id='type-id-396' visibility='default' filepath='libnurbs/internals/patch.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Patchspec' is-struct='yes' visibility='default' size-in-bits='320' filepath='libnurbs/internals/patch.h' line='54' column='1' hash='dcb2ef2ec9aa8153' id='type-id-392'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-398'/>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='order' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/patch.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='stride' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/patch.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Pspec' is-struct='yes' visibility='default' size-in-bits='256' filepath='libnurbs/internals/patch.h' line='46' column='1' hash='e6005a3494682fe1' id='type-id-398'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='range' type-id='type-id-133' visibility='default' filepath='libnurbs/internals/patch.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='sidestep' type-id='type-id-132' visibility='default' filepath='libnurbs/internals/patch.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='stepsize' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/patch.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='minstepsize' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/patch.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='needsSubdivision' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/patch.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <reference-type-def kind='lvalue' type-id='type-id-397' size-in-bits='64' hash='c213726a45105eb6' id='type-id-399'/>
    <pointer-type-def type-id='type-id-397' size-in-bits='64' hash='f95a9807c9ccb85d' id='type-id-240'/>
    <qualified-type-def type-id='type-id-240' const='yes' hash='e5d00996f5540f8e' id='type-id-400'/>
    <pointer-type-def type-id='type-id-392' size-in-bits='64' hash='11f2597cee07fca6' id='type-id-401'/>
    <qualified-type-def type-id='type-id-401' const='yes' hash='268e8e8417316e7f' id='type-id-402'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/patchlist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-398' size-in-bits='512' hash='f55a3d9204338490' id='type-id-241'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-17' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-131'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' hash='d361c5e380aabeb9' id='type-id-403'/>
    <qualified-type-def type-id='type-id-403' const='yes' hash='dc3313ff0b57d3b1' id='type-id-404'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/quilt.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='Flist' is-struct='yes' visibility='default' size-in-bits='320' filepath='libnurbs/internals/flist.h' line='42' column='1' hash='ed01e75ad9680649#2' id='type-id-405'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pts' type-id='type-id-34' visibility='default' filepath='libnurbs/internals/flist.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='npts' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/flist.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='start' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/flist.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='end' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/flist.h' line='47' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='sorter' type-id='type-id-202' visibility='default' filepath='libnurbs/internals/flist.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-405' size-in-bits='64' hash='caff59106cfcf0d0#2' id='type-id-406'/>
    <qualified-type-def type-id='type-id-316' const='yes' hash='277e7b5b40177c5b' id='type-id-407'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/reader.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-376' const='yes' hash='ab2fe8457df85c7f' id='type-id-408'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/renderhints.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='Renderhints' visibility='default' size-in-bits='256' filepath='libnurbs/internals/renderhints.h' line='41' column='1' hash='cea3038128ac762e' id='type-id-409'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='display_method' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/renderhints.h' line='49' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='errorchecking' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/renderhints.h' line='50' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='subdivisions' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/renderhints.h' line='51' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='tmp1' type-id='type-id-15' visibility='default' filepath='libnurbs/internals/renderhints.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='displaydomain' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/renderhints.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='maxsubdivisions' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/renderhints.h' line='55' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='wiretris' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/renderhints.h' line='56' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='224'>
        <var-decl name='wirequads' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/renderhints.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-409' size-in-bits='64' hash='afd977a73e5ec6c4' id='type-id-410'/>
    <qualified-type-def type-id='type-id-410' const='yes' hash='3b85edbc9cfa17ac' id='type-id-411'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/slicer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='gridBoundaryChain' visibility='default' size-in-bits='320' filepath='libnurbs/nurbtess/gridWrap.h' line='96' column='1' hash='5cda8fd509a999e6' id='type-id-412'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='grid' type-id='type-id-413' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='97' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='firstVlineIndex' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='98' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='nVlines' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='99' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='ulineIndices' type-id='type-id-358' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='100' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='innerIndices' type-id='type-id-358' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='101' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='vertices' type-id='type-id-362' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='gridWrap' visibility='default' size-in-bits='384' filepath='libnurbs/nurbtess/gridWrap.h' line='42' column='1' hash='fe263e6a77d293d7' id='type-id-414'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='n_ulines' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='43' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='n_vlines' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='44' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='u_min' type-id='type-id-355' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='u_max' type-id='type-id-355' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='45' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='v_min' type-id='type-id-355' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='v_max' type-id='type-id-355' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='46' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='u_values' type-id='type-id-359' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='52' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='v_values' type-id='type-id-359' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='53' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='is_uniform' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/gridWrap.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rectBlock' visibility='default' size-in-bits='192' filepath='libnurbs/nurbtess/rectBlock.h' line='39' column='1' hash='9d3452ae86253a6e' id='type-id-415'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='upGridLineIndex' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='40' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='lowGridLineIndex' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='41' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='leftIndices' type-id='type-id-358' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='42' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='rightIndices' type-id='type-id-358' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rectBlockArray' visibility='default' size-in-bits='128' filepath='libnurbs/nurbtess/rectBlock.h' line='61' column='1' hash='54134432538ef1ed' id='type-id-416'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='array' type-id='type-id-417' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='62' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='n_elements' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='63' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='size' type-id='type-id-360' visibility='default' filepath='libnurbs/nurbtess/rectBlock.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' hash='9b8d3d8bcdefa7e2' id='type-id-418'/>
    <qualified-type-def type-id='type-id-418' const='yes' hash='599932b487ead0c3' id='type-id-419'/>
    <qualified-type-def type-id='type-id-288' const='yes' hash='fa73522a4dfb61ff' id='type-id-420'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' hash='6a252c4bf72f6dc5' id='type-id-421'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' hash='34261b078642d8ed' id='type-id-413'/>
    <qualified-type-def type-id='type-id-413' const='yes' hash='3be1f4e7b2e703c3' id='type-id-422'/>
    <qualified-type-def type-id='type-id-367' const='yes' hash='710d159fddc0d3e7' id='type-id-423'/>
    <pointer-type-def type-id='type-id-415' size-in-bits='64' hash='482dd3f5b66c5813' id='type-id-424'/>
    <qualified-type-def type-id='type-id-424' const='yes' hash='042d89e4d5066b45' id='type-id-425'/>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' hash='111a3196adcc79bf' id='type-id-417'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' hash='da11d2cf69896f91' id='type-id-426'/>
    <qualified-type-def type-id='type-id-426' const='yes' hash='a0bf59fed8fa104f' id='type-id-427'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/sorter.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/splitarcs.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/subdivider.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='libnurbs/internals/tobezier.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-T0fsxk/Mesa-8.0.5/src/glu/sgi' language='LANG_C_plus_plus'>
    <class-decl name='Breakpt' is-struct='yes' visibility='default' size-in-bits='96' filepath='libnurbs/internals/tobezier.cc' line='48' column='1' hash='28a3912243c89857' id='type-id-428'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-304' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='multi' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='def' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='51' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Knotspec' is-struct='yes' visibility='default' size-in-bits='1152' filepath='libnurbs/internals/tobezier.cc' line='54' column='1' hash='1decd84a3143565e' id='type-id-429'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='order' type-id='type-id-33' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='inkbegin' type-id='type-id-430' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='inkend' type-id='type-id-430' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='outkbegin' type-id='type-id-430' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='outkend' type-id='type-id-430' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='kleft' type-id='type-id-430' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='kright' type-id='type-id-430' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='kfirst' type-id='type-id-430' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='klast' type-id='type-id-430' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sbegin' type-id='type-id-430' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='bbegin' type-id='type-id-431' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='bend' type-id='type-id-431' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ncoords' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='prestride' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='poststride' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='preoffset' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='postoffset' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='prewidth' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='postwidth' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='istransformed' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='next' type-id='type-id-432' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='kspectotrans' type-id='type-id-432' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Splinespec' is-struct='yes' visibility='default' size-in-bits='192' filepath='libnurbs/internals/tobezier.cc' line='95' column='1' hash='9d9a177a68dfa102' id='type-id-433'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kspec' type-id='type-id-432' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dim' type-id='type-id-3' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='outcpts' type-id='type-id-34' visibility='default' filepath='libnurbs/internals/tobezier.cc' line='100' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Knot_ptr' type-id='type-id-34' size-in-bits='64' filepath='libnurbs/internals/types.h' line='45' column='1' hash='93d591affbbd5f40' id='type-id-430'/>
    <typedef-decl name='Quilt_ptr' type-id='type-id-316' size-in-bits='64' filepath='libnurbs/internals/quilt.h' line='90' column='1' hash='37bd09d8ed3141bd' id='type-id-434'/>
    <pointer-type-def type-id='type-id-428' size-in-bits='64' hash='5d91d086e3468894' id='type-id-431'/>
    <pointer-type-def type-id='type-id-429' size-in-bits='64' hash='76cde14a5a154d90' id='type-id-432'/>
