<abi-corpus version='2.4' soname='libtsan.so.0'>
  <elf-needed>
    <dependency name='librt.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='AnnotateBenignRace' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AnnotateBenignRaceSized' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AnnotateCondVarSignal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AnnotateCondVarSignalAll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AnnotateCondVarWait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AnnotateEnableRaceDetection' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AnnotateExpectRace' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='strptime' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strrchr' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strstr' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strtoimax' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strtoumax' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='sysinfo' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tcgetattr' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tempnam' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='textdomain' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='time' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='times' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tmpnam' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tmpnam_r' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='unlink' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='usleep' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='valloc' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vfscanf' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vscanf' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vsscanf' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wait' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wait3' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wait4' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='waitid' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='waitpid' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wcsnrtombs' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wcsrtombs' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wcstombs' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wordexp' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='write' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='writev' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='__asan_cplus_demangle_builtin_types' size='1056' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__asan_cplus_demangle_operators' size='1488' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='../../.././libsanitizer/interception/interception_linux.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/interception' language='LANG_C_plus_plus'>
    <namespace-decl name='__interception'>
      <typedef-decl name='uptr' type-id='type-id-1' size-in-bits='64' filepath='../../.././libsanitizer/interception/interception.h' line='230' column='1' hash='8fdc5eea2983a729' id='type-id-2'/>
    </namespace-decl>
    <function-decl name='dlsym' filepath='/usr/include/dlfcn.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='dlvsym' filepath='/usr/include/dlfcn.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' hash='3d5693612af11c46'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/interception/interception_type_test.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/interception' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <class-decl name='backtrace_state' is-struct='yes' visibility='default' size-in-bits='576' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='127' column='1' hash='5f90f130eeca0aa2' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='filename' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='threaded' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lock' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fileline_fn' type-id='type-id-7' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fileline_data' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='syminfo_fn' type-id='type-id-8' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='syminfo_data' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='fileline_initialization_failed' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='lock_alloc' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='freelist' type-id='type-id-9' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='150' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='backtrace_vector' is-struct='yes' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='221' column='1' hash='09d3890156946272' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-11' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='alc' type-id='type-id-11' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='228' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__compar_fn_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/stdlib.h' line='742' column='1' hash='fd7a63c0c6c822c4' id='type-id-13'/>
    <typedef-decl name='fileline' type-id='type-id-14' size-in-bits='64' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='114' column='1' hash='fd7a63c0c6c822c4' id='type-id-7'/>
    <typedef-decl name='syminfo' type-id='type-id-15' size-in-bits='64' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='121' column='1' hash='fd7a63c0c6c822c4' id='type-id-8'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' hash='962b3ac2ad96cea1' id='type-id-9'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' hash='e20b7416447a373f' id='type-id-17'/>
    <qualified-type-def type-id='type-id-18' const='yes' hash='645f4d0d44563fc6' id='type-id-19'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' hash='61acb54cba0b002f' id='type-id-20'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' hash='2ed8a3d03c253656' id='type-id-21'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-14'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-12'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-15'/>
    <class-decl name='backtrace_freelist_struct' is-struct='yes' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='55' column='1' hash='a5bef354f231c1c0' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-9' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-11' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='60' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='__asan_backtrace_dwarf_add' mangled-name='__asan_backtrace_dwarf_add' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2958' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_dwarf_add' hash='d192e3646ecf0d2b'>
      <parameter type-id='type-id-25' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2958' column='1'/>
      <parameter type-id='type-id-26' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2959' column='1'/>
      <parameter type-id='type-id-20' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2960' column='1'/>
      <parameter type-id='type-id-11' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2961' column='1'/>
      <parameter type-id='type-id-20' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2962' column='1'/>
      <parameter type-id='type-id-11' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2963' column='1'/>
      <parameter type-id='type-id-20' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2964' column='1'/>
      <parameter type-id='type-id-11' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2965' column='1'/>
      <parameter type-id='type-id-20' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2966' column='1'/>
      <parameter type-id='type-id-11' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2967' column='1'/>
      <parameter type-id='type-id-20' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2968' column='1'/>
      <parameter type-id='type-id-11' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2969' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2970' column='1'/>
      <parameter type-id='type-id-27' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2971' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2972' column='1'/>
      <parameter type-id='type-id-21' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2972' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64' hash='9e970561a213ee08'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-4'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='bsearch' filepath='/usr/include/stdlib.h' line='755' column='1' visibility='default' binding='global' size-in-bits='64' hash='3aa907ea60dd12ba'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-type size-in-bits='64' hash='a53129547db92175' id='type-id-22'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-23'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='99adda500fb55b43' id='type-id-24'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' hash='32bf556e228a1834' id='type-id-32'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='7cffa03161e7e042' id='type-id-33'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' hash='55702965ae6729b3' id='type-id-34'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-31'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <function-decl name='__asan_backtrace_initialize' mangled-name='__asan_backtrace_initialize' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='921' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_initialize' hash='7965a1d45f912d2c'>
      <parameter type-id='type-id-25' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='921' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='921' column='1'/>
      <parameter type-id='type-id-27' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='922' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='923' column='1'/>
      <parameter type-id='type-id-21' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' line='923' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dl_iterate_phdr' filepath='/usr/include/link.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64' hash='a7f99494147764a8'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' hash='093f0dafedf26cc2' id='type-id-36'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <function-decl name='__asan_backtrace_pcinfo' mangled-name='__asan_backtrace_pcinfo' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_pcinfo' hash='a53129547db92175'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__asan_backtrace_syminfo' mangled-name='__asan_backtrace_syminfo' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_syminfo' hash='a53129547db92175'>
      <parameter type-id='type-id-25' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='182' column='1'/>
      <parameter type-id='type-id-26' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='182' column='1'/>
      <parameter type-id='type-id-30' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='183' column='1'/>
      <parameter type-id='type-id-27' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='184' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='184' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <function-decl name='__asan_backtrace_alloc' mangled-name='__asan_backtrace_alloc' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_alloc' hash='1d0853aa6ff6f603'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='__asan_backtrace_free' mangled-name='__asan_backtrace_free' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_free' hash='1d0853aa6ff6f603'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='__asan_backtrace_vector_grow' mangled-name='__asan_backtrace_vector_grow' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_vector_grow' hash='1573068df6b94a79'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='__asan_backtrace_vector_finish' mangled-name='__asan_backtrace_vector_finish' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='258' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_vector_finish' hash='dcc5e4bb0fe68a26'>
      <parameter type-id='type-id-25' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='259' column='1'/>
      <parameter type-id='type-id-17' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='260' column='1'/>
      <parameter type-id='type-id-27' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='261' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='262' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='__asan_backtrace_vector_release' mangled-name='__asan_backtrace_vector_release' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='275' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_vector_release' hash='38539ea9528f701e'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/bits/errno.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64' hash='c0e4f5f42afc96e0'>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='getpagesize' filepath='/usr/include/unistd.h' line='992' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <class-decl name='backtrace_view' is-struct='yes' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='169' column='1' hash='1f6ceb699c7e823e' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='base' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-11' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='176' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__off_t' type-id='type-id-40' size-in-bits='64' filepath='/usr/include/bits/types.h' line='141' column='1' hash='b119fe0931d2ee10' id='type-id-41'/>
    <typedef-decl name='off_t' type-id='type-id-41' size-in-bits='64' filepath='/usr/include/sys/types.h' line='87' column='1' hash='b119fe0931d2ee10' id='type-id-42'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' hash='5387604c747fa524' id='type-id-43'/>
    <function-decl name='__asan_backtrace_get_view' mangled-name='__asan_backtrace_get_view' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_get_view' hash='999a2fb4eb8dd177'>
      <parameter type-id='type-id-25' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='53' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
      <parameter type-id='type-id-42' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
      <parameter type-id='type-id-11' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
      <parameter type-id='type-id-27' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='55' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='56' column='1'/>
      <parameter type-id='type-id-43' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='56' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__asan_backtrace_release_view' mangled-name='__asan_backtrace_release_view' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_release_view' hash='6dbcc950976f383f'>
      <parameter type-id='type-id-25' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='87' column='1'/>
      <parameter type-id='type-id-43' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='88' column='1'/>
      <parameter type-id='type-id-27' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='89' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='90' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <function-decl name='__asan_backtrace_open' mangled-name='__asan_backtrace_open' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_open' hash='1dbeb0d6e7e24b8e'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__asan_backtrace_close' mangled-name='__asan_backtrace_close' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_close' hash='96b11b1183f0257f'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fcntl' filepath='/usr/include/fcntl.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' hash='a9fd86e6e981c3b5'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/sort.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <function-decl name='__asan_backtrace_qsort' mangled-name='__asan_backtrace_qsort' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/sort.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_qsort' hash='3aa907ea60dd12ba'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-31'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <function-decl name='__asan_backtrace_create_state' mangled-name='__asan_backtrace_create_state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_create_state' hash='df03b86c45b33536'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='46' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='46' column='1'/>
      <parameter type-id='type-id-27' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='47' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='48' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='8448' hash='f92bf1b332a3fd5b' id='type-id-45'>
      <subrange length='33' lower-bound='0' upper-bound='32' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='7263f41a68bc1ea3' id='type-id-47'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='11904' hash='1ccde43f962b9ca5' id='type-id-49'>
      <subrange length='62' lower-bound='0' upper-bound='61' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='09ae24aae7a18a68' id='type-id-50'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-51' size-in-bits='8448' hash='a0463f1f41510dd1' id='type-id-52'>
      <subrange length='33' lower-bound='0' upper-bound='32' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='7263f41a68bc1ea3' id='type-id-47'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='11904' hash='0414f3cd7fee4a72' id='type-id-54'>
      <subrange length='62' lower-bound='0' upper-bound='61' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='09ae24aae7a18a68' id='type-id-50'/>
    </array-type-def>
    <enum-decl name='d_builtin_type_print' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='51' column='1' hash='704c20194e2ea276' id='type-id-55'>
      <underlying-type type-id='type-id-56'/>
      <enumerator name='D_PRINT_DEFAULT' value='0'/>
      <enumerator name='D_PRINT_INT' value='1'/>
      <enumerator name='D_PRINT_UNSIGNED' value='2'/>
      <enumerator name='D_PRINT_LONG' value='3'/>
      <enumerator name='D_PRINT_UNSIGNED_LONG' value='4'/>
      <enumerator name='D_PRINT_LONG_LONG' value='5'/>
      <enumerator name='D_PRINT_UNSIGNED_LONG_LONG' value='6'/>
      <enumerator name='D_PRINT_BOOL' value='7'/>
      <enumerator name='D_PRINT_FLOAT' value='8'/>
      <enumerator name='D_PRINT_VOID' value='9'/>
    </enum-decl>
    <enum-decl name='demangle_component_type' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/../include/demangle.h' line='223' column='1' hash='b520c0974bc3d2e1' id='type-id-57'>
      <underlying-type type-id='type-id-56'/>
      <enumerator name='DEMANGLE_COMPONENT_NAME' value='0'/>
      <enumerator name='DEMANGLE_COMPONENT_QUAL_NAME' value='1'/>
      <enumerator name='DEMANGLE_COMPONENT_LOCAL_NAME' value='2'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPED_NAME' value='3'/>
      <enumerator name='DEMANGLE_COMPONENT_TEMPLATE' value='4'/>
      <enumerator name='DEMANGLE_COMPONENT_TEMPLATE_PARAM' value='5'/>
      <enumerator name='DEMANGLE_COMPONENT_FUNCTION_PARAM' value='6'/>
      <enumerator name='DEMANGLE_COMPONENT_CTOR' value='7'/>
      <enumerator name='DEMANGLE_COMPONENT_DTOR' value='8'/>
      <enumerator name='DEMANGLE_COMPONENT_VTABLE' value='9'/>
      <enumerator name='DEMANGLE_COMPONENT_VTT' value='10'/>
      <enumerator name='DEMANGLE_COMPONENT_CONSTRUCTION_VTABLE' value='11'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPEINFO' value='12'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPEINFO_NAME' value='13'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPEINFO_FN' value='14'/>
      <enumerator name='DEMANGLE_COMPONENT_THUNK' value='15'/>
      <enumerator name='DEMANGLE_COMPONENT_VIRTUAL_THUNK' value='16'/>
      <enumerator name='DEMANGLE_COMPONENT_COVARIANT_THUNK' value='17'/>
      <enumerator name='DEMANGLE_COMPONENT_JAVA_CLASS' value='18'/>
      <enumerator name='DEMANGLE_COMPONENT_GUARD' value='19'/>
      <enumerator name='DEMANGLE_COMPONENT_TLS_INIT' value='20'/>
      <enumerator name='DEMANGLE_COMPONENT_TLS_WRAPPER' value='21'/>
      <enumerator name='DEMANGLE_COMPONENT_REFTEMP' value='22'/>
      <enumerator name='DEMANGLE_COMPONENT_HIDDEN_ALIAS' value='23'/>
      <enumerator name='DEMANGLE_COMPONENT_SUB_STD' value='24'/>
      <enumerator name='DEMANGLE_COMPONENT_RESTRICT' value='25'/>
      <enumerator name='DEMANGLE_COMPONENT_VOLATILE' value='26'/>
      <enumerator name='DEMANGLE_COMPONENT_CONST' value='27'/>
      <enumerator name='DEMANGLE_COMPONENT_RESTRICT_THIS' value='28'/>
      <enumerator name='DEMANGLE_COMPONENT_VOLATILE_THIS' value='29'/>
      <enumerator name='DEMANGLE_COMPONENT_CONST_THIS' value='30'/>
      <enumerator name='DEMANGLE_COMPONENT_REFERENCE_THIS' value='31'/>
      <enumerator name='DEMANGLE_COMPONENT_RVALUE_REFERENCE_THIS' value='32'/>
      <enumerator name='DEMANGLE_COMPONENT_VENDOR_TYPE_QUAL' value='33'/>
      <enumerator name='DEMANGLE_COMPONENT_POINTER' value='34'/>
      <enumerator name='DEMANGLE_COMPONENT_REFERENCE' value='35'/>
      <enumerator name='DEMANGLE_COMPONENT_RVALUE_REFERENCE' value='36'/>
      <enumerator name='DEMANGLE_COMPONENT_COMPLEX' value='37'/>
      <enumerator name='DEMANGLE_COMPONENT_IMAGINARY' value='38'/>
      <enumerator name='DEMANGLE_COMPONENT_BUILTIN_TYPE' value='39'/>
      <enumerator name='DEMANGLE_COMPONENT_VENDOR_TYPE' value='40'/>
      <enumerator name='DEMANGLE_COMPONENT_FUNCTION_TYPE' value='41'/>
      <enumerator name='DEMANGLE_COMPONENT_ARRAY_TYPE' value='42'/>
      <enumerator name='DEMANGLE_COMPONENT_PTRMEM_TYPE' value='43'/>
      <enumerator name='DEMANGLE_COMPONENT_FIXED_TYPE' value='44'/>
      <enumerator name='DEMANGLE_COMPONENT_VECTOR_TYPE' value='45'/>
      <enumerator name='DEMANGLE_COMPONENT_ARGLIST' value='46'/>
      <enumerator name='DEMANGLE_COMPONENT_TEMPLATE_ARGLIST' value='47'/>
      <enumerator name='DEMANGLE_COMPONENT_INITIALIZER_LIST' value='48'/>
      <enumerator name='DEMANGLE_COMPONENT_OPERATOR' value='49'/>
      <enumerator name='DEMANGLE_COMPONENT_EXTENDED_OPERATOR' value='50'/>
      <enumerator name='DEMANGLE_COMPONENT_CAST' value='51'/>
      <enumerator name='DEMANGLE_COMPONENT_NULLARY' value='52'/>
      <enumerator name='DEMANGLE_COMPONENT_UNARY' value='53'/>
      <enumerator name='DEMANGLE_COMPONENT_BINARY' value='54'/>
      <enumerator name='DEMANGLE_COMPONENT_BINARY_ARGS' value='55'/>
      <enumerator name='DEMANGLE_COMPONENT_TRINARY' value='56'/>
      <enumerator name='DEMANGLE_COMPONENT_TRINARY_ARG1' value='57'/>
      <enumerator name='DEMANGLE_COMPONENT_TRINARY_ARG2' value='58'/>
      <enumerator name='DEMANGLE_COMPONENT_LITERAL' value='59'/>
      <enumerator name='DEMANGLE_COMPONENT_LITERAL_NEG' value='60'/>
      <enumerator name='DEMANGLE_COMPONENT_JAVA_RESOURCE' value='61'/>
      <enumerator name='DEMANGLE_COMPONENT_COMPOUND_NAME' value='62'/>
      <enumerator name='DEMANGLE_COMPONENT_CHARACTER' value='63'/>
      <enumerator name='DEMANGLE_COMPONENT_NUMBER' value='64'/>
      <enumerator name='DEMANGLE_COMPONENT_DECLTYPE' value='65'/>
      <enumerator name='DEMANGLE_COMPONENT_GLOBAL_CONSTRUCTORS' value='66'/>
      <enumerator name='DEMANGLE_COMPONENT_GLOBAL_DESTRUCTORS' value='67'/>
      <enumerator name='DEMANGLE_COMPONENT_LAMBDA' value='68'/>
      <enumerator name='DEMANGLE_COMPONENT_DEFAULT_ARG' value='69'/>
      <enumerator name='DEMANGLE_COMPONENT_UNNAMED_TYPE' value='70'/>
      <enumerator name='DEMANGLE_COMPONENT_TRANSACTION_CLONE' value='71'/>
      <enumerator name='DEMANGLE_COMPONENT_NONTRANSACTION_CLONE' value='72'/>
      <enumerator name='DEMANGLE_COMPONENT_PACK_EXPANSION' value='73'/>
      <enumerator name='DEMANGLE_COMPONENT_TAGGED_NAME' value='74'/>
      <enumerator name='DEMANGLE_COMPONENT_CLONE' value='75'/>
    </enum-decl>
    <enum-decl name='gnu_v3_ctor_kinds' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/../include/demangle.h' line='172' column='1' hash='ad173987665e6bf5' id='type-id-58'>
      <underlying-type type-id='type-id-56'/>
      <enumerator name='gnu_v3_complete_object_ctor' value='1'/>
      <enumerator name='gnu_v3_base_object_ctor' value='2'/>
      <enumerator name='gnu_v3_complete_object_allocating_ctor' value='3'/>
      <enumerator name='gnu_v3_unified_ctor' value='4'/>
      <enumerator name='gnu_v3_object_ctor_group' value='5'/>
    </enum-decl>
    <enum-decl name='gnu_v3_dtor_kinds' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/../include/demangle.h' line='191' column='1' hash='ac8ab9354ac0c986' id='type-id-59'>
      <underlying-type type-id='type-id-56'/>
      <enumerator name='gnu_v3_deleting_dtor' value='1'/>
      <enumerator name='gnu_v3_complete_object_dtor' value='2'/>
      <enumerator name='gnu_v3_base_object_dtor' value='3'/>
      <enumerator name='gnu_v3_unified_dtor' value='4'/>
      <enumerator name='gnu_v3_object_dtor_group' value='5'/>
    </enum-decl>
    <class-decl name='d_info' is-struct='yes' visibility='default' size-in-bits='768' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='93' column='1' hash='6f5c70432753528b' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='send' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='options' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='n' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='comps' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next_comp' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='num_comps' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='subs' type-id='type-id-62' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='next_sub' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='num_subs' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='did_subs' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='last_name' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='expansion' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='is_expression' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='is_conversion' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='129' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='demangle_builtin_type_info' is-struct='yes' visibility='default' size-in-bits='256' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='77' column='1' hash='2e82a19a7f4ab54c' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='java_name' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='java_len' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='print' type-id='type-id-55' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='demangle_component' is-struct='yes' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/../include/demangle.h' line='453' column='1' hash='de60cae165ddb111' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-57' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='u' type-id='type-id-64' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='560' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='demangle_operator_info' is-struct='yes' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='37' column='1' hash='8394e36452f6120e' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='code' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='args' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='461' column='1' hash='4459462e1eb691f0#2' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='466' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='522' column='1' hash='11e8ff315fe9401e#3' id='type-id-66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='string' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='527' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='515' column='1' hash='be1d4c210dd9c3f8#4' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-68' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='518' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='470' column='1' hash='aa2490bd20bf9ae5#5' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-70' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='473' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='544' column='1' hash='b9b276eb9b9ee82b#6' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='left' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='right' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='549' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='486' column='1' hash='d95c42f69a907ef6#7' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='accum' type-id='type-id-73' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='sat' type-id='type-id-73' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='493' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='552' column='1' hash='f6ca4753b0b83074#8' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sub' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='557' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='497' column='1' hash='e5efee0a14f5c732#9' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kind' type-id='type-id-58' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='502' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='506' column='1' hash='dd7a92067caa1ab9#10' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kind' type-id='type-id-59' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='511' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='477' column='1' hash='73305be8ab207ee1#11' id='type-id-77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='args' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='482' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='538' column='1' hash='a6136041df555d44#12' id='type-id-78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='character' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='540' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='531' column='1' hash='083da97dd93b5624#13' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='number' type-id='type-id-40' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='534' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../../.././libsanitizer/../include/demangle.h' line='458' column='1' hash='d4eebc0132122e1b#3' id='type-id-64'>
      <data-member access='public'>
        <var-decl name='s_name' type-id='type-id-65' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='467' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_operator' type-id='type-id-69' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='474' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_extended_operator' type-id='type-id-77' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='483' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_fixed' type-id='type-id-72' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='494' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_ctor' type-id='type-id-75' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='503' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_dtor' type-id='type-id-76' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='512' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_builtin' type-id='type-id-67' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='519' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_string' type-id='type-id-66' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='528' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_number' type-id='type-id-79' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='535' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_character' type-id='type-id-78' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='541' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_binary' type-id='type-id-71' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='550' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_unary_num' type-id='type-id-74' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='558' column='1'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='type-id-51' const='yes' hash='afb6309cf4d14745' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' hash='3fdd5bde8f6f5ee8' id='type-id-68'/>
    <qualified-type-def type-id='type-id-63' const='yes' hash='b3526efe39aa8099' id='type-id-80'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' hash='d0a6056080b98515' id='type-id-81'/>
    <qualified-type-def type-id='type-id-53' const='yes' hash='4e663cbab0ead054' id='type-id-48'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' hash='55b3085f7ddf0d7e' id='type-id-70'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' hash='2c0f73e9f326e0ab' id='type-id-82'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' hash='61981ccd18b14661' id='type-id-61'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' hash='c3f2a5582ce7584f' id='type-id-62'/>
    <function-decl name='__asan_cplus_demangle_fill_name' mangled-name='__asan_cplus_demangle_fill_name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_name' hash='9bd0d36c99b8dad2'>
      <parameter type-id='type-id-61' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1'/>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_fill_extended_operator' mangled-name='__asan_cplus_demangle_fill_extended_operator' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_extended_operator' hash='ec77335401e0731f'>
      <parameter type-id='type-id-61' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1'/>
      <parameter type-id='type-id-61' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='798' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_fill_ctor' mangled-name='__asan_cplus_demangle_fill_ctor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_ctor' hash='ed2f36cf9d59eeed'>
      <parameter type-id='type-id-61' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='812' column='1'/>
      <parameter type-id='type-id-58' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='813' column='1'/>
      <parameter type-id='type-id-61' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='814' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_fill_dtor' mangled-name='__asan_cplus_demangle_fill_dtor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='831' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_dtor' hash='b8bbc06c1685afe7'>
      <parameter type-id='type-id-61' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='831' column='1'/>
      <parameter type-id='type-id-59' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='832' column='1'/>
      <parameter type-id='type-id-61' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='833' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_mangled_name' mangled-name='__asan_cplus_demangle_mangled_name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_mangled_name' hash='34761baa5dd7a873'>
      <parameter type-id='type-id-82' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1140' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1140' column='1'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <var-decl name='__asan_cplus_demangle_operators' type-id='type-id-49' mangled-name='__asan_cplus_demangle_operators' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1688' column='1' elf-symbol-id='__asan_cplus_demangle_operators'/>
    <var-decl name='__asan_cplus_demangle_builtin_types' type-id='type-id-45' mangled-name='__asan_cplus_demangle_builtin_types' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='2188' column='1' elf-symbol-id='__asan_cplus_demangle_builtin_types'/>
    <function-decl name='__asan_cplus_demangle_type' mangled-name='__asan_cplus_demangle_type' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='2230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_type' hash='1566ada269bec3ae'>
      <parameter type-id='type-id-82' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='2230' column='1'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_print_callback' mangled-name='__asan_cplus_demangle_print_callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4029' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_print_callback' hash='44d12a9b2f3ba0e7'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4029' column='1'/>
      <parameter type-id='type-id-81' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4030' column='1'/>
      <parameter type-id='type-id-83' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4031' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4031' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_print' mangled-name='__asan_cplus_demangle_print' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_print' hash='4c514ae725cd2237'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1'/>
      <parameter type-id='type-id-81' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4070' column='1'/>
      <parameter type-id='type-id-84' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4070' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_init_info' mangled-name='__asan_cplus_demangle_init_info' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_init_info' hash='558d075156e3f919'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
      <parameter type-id='type-id-11' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
      <parameter type-id='type-id-82' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5732' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_v3' mangled-name='__asan_cplus_demangle_v3' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6018' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_v3' hash='1b0d39e45ce45198'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6018' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6018' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_v3_callback' mangled-name='__asan_cplus_demangle_v3_callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_v3_callback' hash='b2ef61a93093af56'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6026' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6026' column='1'/>
      <parameter type-id='type-id-83' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6027' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6027' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__asan_java_demangle_v3' mangled-name='__asan_java_demangle_v3' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6039' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_java_demangle_v3' hash='bac6a89264ba699c'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6039' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__asan_java_demangle_v3_callback' mangled-name='__asan_java_demangle_v3_callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6047' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_java_demangle_v3_callback' hash='047f7d52c3765ece'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6047' column='1'/>
      <parameter type-id='type-id-83' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6048' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6048' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__asan_is_gnu_v3_mangled_ctor' mangled-name='__asan_is_gnu_v3_mangled_ctor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_is_gnu_v3_mangled_ctor' hash='dcef754db64155b6'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6137' column='1'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='__asan_is_gnu_v3_mangled_dtor' mangled-name='__asan_is_gnu_v3_mangled_dtor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_is_gnu_v3_mangled_dtor' hash='b4517baa93919497'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6152' column='1'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='sprintf' filepath='/usr/include/stdio.h' line='363' column='1' visibility='default' binding='global' size-in-bits='64' hash='21335fc22233a3a7'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-4'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' hash='45200c13db6d193f' id='type-id-85'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-86'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-31'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/bridge.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C_plus_plus'>
    <function-decl name='__asan_internal_memcpy' mangled-name='__asan_internal_memcpy' filepath='../../.././libsanitizer/libbacktrace/bridge.cc' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_internal_memcpy' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='__asan_internal_memset' mangled-name='__asan_internal_memset' filepath='../../.././libsanitizer/libbacktrace/bridge.cc' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_internal_memset' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='__asan_internal_memcmp' mangled-name='__asan_internal_memcmp' filepath='../../.././libsanitizer/libbacktrace/bridge.cc' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_internal_memcmp' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__asan_internal_strcmp' mangled-name='__asan_internal_strcmp' filepath='../../.././libsanitizer/libbacktrace/bridge.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_internal_strcmp' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__asan_internal_strncmp' mangled-name='__asan_internal_strncmp' filepath='../../.././libsanitizer/libbacktrace/bridge.cc' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_internal_strncmp' hash='2f99ec08ee54ebb4'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__asan_internal_strlen' mangled-name='__asan_internal_strlen' filepath='../../.././libsanitizer/libbacktrace/bridge.cc' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_internal_strlen' hash='ed7b6a29124427dd'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='__asan_internal_strnlen' mangled-name='__asan_internal_strnlen' filepath='../../.././libsanitizer/libbacktrace/bridge.cc' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_internal_strnlen' hash='e62a7a46b2904b02'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <namespace-decl name='__sanitizer'>
      <typedef-decl name='uptr' type-id='type-id-1' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='56' column='1' hash='8fdc5eea2983a729' id='type-id-87'/>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-88' const='yes' hash='1bfbd854171e911a' id='type-id-89'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' hash='2244dc4b9d28622a' id='type-id-91'/>
    <qualified-type-def type-id='type-id-91' const='yes' hash='3986d9458290b7ce' id='type-id-92'/>
    <qualified-type-def type-id='type-id-93' const='yes' hash='0c2b54bc75fa25c8' id='type-id-94'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' hash='3f835102bda3763e' id='type-id-95'/>
    <qualified-type-def type-id='type-id-95' const='yes' hash='773b756f985cd01a' id='type-id-96'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-98'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-100'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-104'/>
    <namespace-decl name='__sanitizer'>
      <class-decl name='LowLevelAllocator' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='108' column='1' hash='476cbb09d7f7c521' id='type-id-90'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='allocated_end_' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='113' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='allocated_current_' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='114' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='CrashOnMapUnmap' is-struct='yes' visibility='default' size-in-bits='8' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator_internal.h' line='47' column='1' hash='ad190143771af9d4' id='type-id-93'/>
      <typedef-decl name='LowLevelAllocateCallback' type-id='type-id-98' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='116' column='1' hash='fd7a63c0c6c822c4' id='type-id-105'/>
      <enum-decl name='AllocatorStat' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='198' column='1' hash='72a4ca4ffcb04d90' id='type-id-106'>
        <underlying-type type-id='type-id-56'/>
        <enumerator name='AllocatorStatMalloced' value='0'/>
        <enumerator name='AllocatorStatFreed' value='1'/>
        <enumerator name='AllocatorStatMmapped' value='2'/>
        <enumerator name='AllocatorStatUnmapped' value='3'/>
        <enumerator name='AllocatorStatCount' value='4'/>
      </enum-decl>
      <typedef-decl name='ForEachChunkCallback' type-id='type-id-107' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='284' column='1' hash='fd7a63c0c6c822c4' id='type-id-108'/>
      <typedef-decl name='InternalAllocatorCache' type-id='type-id-109' size-in-bits='441344' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator_internal.h' line='43' column='1' id='type-id-110'/>
      <typedef-decl name='InternalAllocator' type-id='type-id-111' size-in-bits='16940672' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator_internal.h' line='58' column='1' id='type-id-112'/>
      <enum-decl name='memory_order' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='19' column='1' hash='3c57cb71e85bb581' id='type-id-113'>
        <underlying-type type-id='type-id-56'/>
        <enumerator name='memory_order_relaxed' value='1'/>
        <enumerator name='memory_order_consume' value='2'/>
        <enumerator name='memory_order_acquire' value='4'/>
        <enumerator name='memory_order_release' value='8'/>
        <enumerator name='memory_order_acq_rel' value='16'/>
        <enumerator name='memory_order_seq_cst' value='32'/>
      </enum-decl>
      <typedef-decl name='u8' type-id='type-id-18' size-in-bits='8' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='66' column='1' hash='6ebac62b3366db68' id='type-id-114'/>
      <typedef-decl name='u64' type-id='type-id-115' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='69' column='1' hash='ebdfc4685a1e82df' id='type-id-116'/>
    </namespace-decl>
    <function-type size-in-bits='64' hash='91495cdf6321a116' id='type-id-97'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' hash='53885bde0aa65efe' id='type-id-117'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' hash='1aad1d4b8f47e2bf' id='type-id-118'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-116'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-119'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-120'>
      <return type-id='type-id-31'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-121' size-in-bits='768' hash='e7667f469e0dd311' id='type-id-122'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='type-id-123'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' hash='dc093d0269e6cb7e' id='type-id-125'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' hash='0292528703f77da6' id='type-id-127'/>
    <qualified-type-def type-id='type-id-127' const='yes' hash='056087aa7cebba86' id='type-id-128'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' hash='39408408b98af71d' id='type-id-130'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-132'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-134'/>
    <qualified-type-def type-id='type-id-126' const='yes' hash='67f9b294e8737bc3' id='type-id-135'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' hash='434e0acc7197c282' id='type-id-136'/>
    <qualified-type-def type-id='type-id-136' const='yes' hash='3ae1076328acf369' id='type-id-137'/>
    <qualified-type-def type-id='type-id-1' const='yes' hash='d8a94d28da6128a9#2' id='type-id-138'/>
    <reference-type-def kind='lvalue' type-id='type-id-138' size-in-bits='64' hash='5aea680f8e94fc20#2' id='type-id-139'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' hash='d73e3c43344d327f' id='type-id-141'/>
    <function-decl name='__sanitizer_set_report_path' mangled-name='__sanitizer_set_report_path' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_set_report_path' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='__sanitizer_sandbox_on_notify' mangled-name='__sanitizer_sandbox_on_notify' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_sandbox_on_notify' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='__sanitizer_report_error_summary' mangled-name='__sanitizer_report_error_summary' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_report_error_summary' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='InternalScopedString' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='88' column='1' hash='5aff20bd6f76397e' id='type-id-124'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-142'/>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='length_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='102' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='LoadedModule' visibility='default' size-in-bits='960' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='442' column='1' hash='1ce558d74dfae3bd' id='type-id-126'>
        <member-type access='private'>
          <class-decl name='AddressRange' is-struct='yes' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='452' column='1' hash='4dbb5a5640cef4f1' id='type-id-121'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='beg' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='453' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='end' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='454' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='full_name_' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='456' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='base_address_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='457' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='ranges_' type-id='type-id-122' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='459' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='896'>
          <var-decl name='n_ranges_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='460' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='StackTrace' is-struct='yes' visibility='default' size-in-bits='16512' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='31' column='1' hash='e7600eb1652ecbd3' id='type-id-129'>
        <member-type access='public'>
          <typedef-decl name='SymbolizeCallback' type-id='type-id-134' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='33' column='1' hash='fd7a63c0c6c822c4' id='type-id-143'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='top_frame_bp' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='size' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='35' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='trace' type-id='type-id-144' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='36' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='DieCallbackType' type-id='type-id-145' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='202' column='1' hash='fd7a63c0c6c822c4' id='type-id-146'/>
      <class-decl name='Symbolizer' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='64' column='1' hash='2dc9d581460df942' id='type-id-147'>
        <member-type access='protected'>
          <class-decl name='SymbolizerScope' visibility='default' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='133' column='1' hash='6f614d488b22bea4' id='type-id-148'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='sym_' type-id='type-id-149' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='138' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='EndSymbolizationHook' type-id='type-id-145' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='111' column='1' hash='fd7a63c0c6c822c4' id='type-id-150'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='StartSymbolizationHook' type-id='type-id-145' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='110' column='1' hash='fd7a63c0c6c822c4' id='type-id-151'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='symbolizer_' type-id='type-id-152' mangled-name='_ZN11__sanitizer10Symbolizer11symbolizer_E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.cc' line='19' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='init_mu_' type-id='type-id-153' mangled-name='_ZN11__sanitizer10Symbolizer8init_mu_E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.cc' line='20' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='symbolizer_allocator_' type-id='type-id-90' mangled-name='_ZN11__sanitizer10Symbolizer21symbolizer_allocator_E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.cc' line='21' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='64'>
          <var-decl name='start_hook_' type-id='type-id-151' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='131' column='1'/>
        </data-member>
        <data-member access='protected' layout-offset-in-bits='128'>
          <var-decl name='end_hook_' type-id='type-id-150' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='132' column='1'/>
        </data-member>
        <member-function access='public' vtable-offset='0'>
          <function-decl name='SymbolizeCode' mangled-name='_ZN11__sanitizer10Symbolizer13SymbolizeCodeEmPNS_11AddressInfoEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64' hash='25cd40cd27039a9f'>
            <parameter type-id='type-id-152' is-artificial='yes'/>
            <parameter type-id='type-id-87' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='85' column='1'/>
            <parameter type-id='type-id-154' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='85' column='1'/>
            <parameter type-id='type-id-87' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='86' column='1'/>
            <return type-id='type-id-87'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='1'>
          <function-decl name='SymbolizeData' mangled-name='_ZN11__sanitizer10Symbolizer13SymbolizeDataEmPNS_8DataInfoE' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64' hash='ec014b6e6334a8bc'>
            <parameter type-id='type-id-152' is-artificial='yes'/>
            <parameter type-id='type-id-87' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='89' column='1'/>
            <parameter type-id='type-id-155' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='89' column='1'/>
            <return type-id='type-id-156'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='2'>
          <function-decl name='IsAvailable' mangled-name='_ZN11__sanitizer10Symbolizer11IsAvailableEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64' hash='c7c710e908194b91'>
            <parameter type-id='type-id-152' is-artificial='yes'/>
            <return type-id='type-id-156'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='IsExternalAvailable' mangled-name='_ZN11__sanitizer10Symbolizer19IsExternalAvailableEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64' hash='c7c710e908194b91'>
            <parameter type-id='type-id-152' is-artificial='yes'/>
            <return type-id='type-id-156'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='Flush' mangled-name='_ZN11__sanitizer10Symbolizer5FlushEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-152' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='5'>
          <function-decl name='Demangle' mangled-name='_ZN11__sanitizer10Symbolizer8DemangleEPKc' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64' hash='3d5693612af11c46'>
            <parameter type-id='type-id-152' is-artificial='yes'/>
            <parameter type-id='type-id-4'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='6'>
          <function-decl name='PrepareForSandboxing' mangled-name='_ZN11__sanitizer10Symbolizer20PrepareForSandboxingEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-152' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
      <function-decl name='CheckFailed' mangled-name='_ZN11__sanitizer11CheckFailedEPKciS1_yy' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11__sanitizer11CheckFailedEPKciS1_yy' hash='1aad1d4b8f47e2bf'>
        <parameter type-id='type-id-4'/>
        <parameter type-id='type-id-6'/>
        <parameter type-id='type-id-4'/>
        <parameter type-id='type-id-116'/>
        <parameter type-id='type-id-116'/>
        <return type-id='type-id-31'/>
      </function-decl>
      <typedef-decl name='CheckFailedCallbackType' type-id='type-id-157' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='205' column='1' hash='fd7a63c0c6c822c4' id='type-id-158'/>
      <typedef-decl name='fd_t' type-id='type-id-6' size-in-bits='32' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='74' column='1' hash='09d17c08f594edc7' id='type-id-159'/>
    </namespace-decl>
    <function-type size-in-bits='64' hash='6b05c161826cdf1a' id='type-id-131'>
      <parameter type-id='type-id-139'/>
      <parameter type-id='type-id-139'/>
      <return type-id='type-id-156'/>
    </function-type>
    <function-type size-in-bits='64' hash='444e544ba02da0ee' id='type-id-133'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-156'/>
    </function-type>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-160'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type method-class-id='type-id-147' size-in-bits='64' hash='25cd40cd27039a9f' id='type-id-161'>
      <parameter type-id='type-id-152' is-artificial='yes'/>
      <parameter type-id='type-id-87' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='85' column='1'/>
      <parameter type-id='type-id-154' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='85' column='1'/>
      <parameter type-id='type-id-87' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='86' column='1'/>
      <return type-id='type-id-87'/>
    </function-type>
    <function-type method-class-id='type-id-147' size-in-bits='64' hash='c7c710e908194b91' id='type-id-162'>
      <parameter type-id='type-id-152' is-artificial='yes'/>
      <return type-id='type-id-156'/>
    </function-type>
    <function-type method-class-id='type-id-147' size-in-bits='64' hash='ec014b6e6334a8bc' id='type-id-163'>
      <parameter type-id='type-id-152' is-artificial='yes'/>
      <parameter type-id='type-id-87' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='89' column='1'/>
      <parameter type-id='type-id-155' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.h' line='89' column='1'/>
      <return type-id='type-id-156'/>
    </function-type>
    <function-type method-class-id='type-id-147' size-in-bits='64' hash='3d5693612af11c46' id='type-id-164'>
      <parameter type-id='type-id-152' is-artificial='yes'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type method-class-id='type-id-147' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-165'>
      <parameter type-id='type-id-152' is-artificial='yes'/>
      <return type-id='type-id-31'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_common_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_coverage.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' hash='37b410eb8b10f623' id='type-id-167'/>
    <qualified-type-def type-id='type-id-167' const='yes' hash='287766d5e4ab629c' id='type-id-168'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' hash='d37ba974318082f6' id='type-id-170'/>
    <qualified-type-def type-id='type-id-170' const='yes' hash='a6b6ee215b8c8837' id='type-id-171'/>
    <qualified-type-def type-id='type-id-166' const='yes' hash='3744ce03666d1157' id='type-id-172'/>
    <reference-type-def kind='lvalue' type-id='type-id-172' size-in-bits='64' hash='51a4326a037fdf9a' id='type-id-173'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' hash='23c94f7b5e5de60d' id='type-id-174'/>
    <qualified-type-def type-id='type-id-174' const='yes' hash='9792afcfbfe392a8' id='type-id-175'/>
    <qualified-type-def type-id='type-id-169' const='yes' hash='33713c6470efa09e' id='type-id-176'/>
    <reference-type-def kind='lvalue' type-id='type-id-176' size-in-bits='64' hash='f3a9583d9f03baf1' id='type-id-177'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' hash='7618a48ba4b5f8b3' id='type-id-178'/>
    <qualified-type-def type-id='type-id-178' const='yes' hash='f9a1e5ce970ba082' id='type-id-179'/>
    <qualified-type-def type-id='type-id-180' const='yes' hash='6e5b7fbd041269f4' id='type-id-181'/>
    <reference-type-def kind='lvalue' type-id='type-id-181' size-in-bits='64' hash='a2578beb6ca2184c' id='type-id-182'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' hash='7b228ce973c39aff' id='type-id-183'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' hash='3cecca488cd00e0d#2' id='type-id-184'/>
    <reference-type-def kind='lvalue' type-id='type-id-180' size-in-bits='64' hash='a22afb13109fd39d' id='type-id-185'/>
    <function-decl name='__sanitizer_cov' mangled-name='__sanitizer_cov' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_coverage.cc' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_cov' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='__sanitizer_cov_dump' mangled-name='__sanitizer_cov_dump' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_coverage.cc' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_cov_dump' hash='7f32ffea222edbe7'>
      <return type-id='type-id-31'/>
    </function-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='InternalMmapVector&lt;long unsigned int&gt;' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='320' column='1' hash='bc399a347d7d6190' id='type-id-166'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='data_' type-id='type-id-140' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='382' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='capacity_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='383' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='size_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='384' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='InternalMmapVector&lt;unsigned int&gt;' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='320' column='1' hash='751815d654f2dc76' id='type-id-169'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='data_' type-id='type-id-186' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='382' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='capacity_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='383' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='size_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='384' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_flags.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <namespace-decl name='__sanitizer'>
      <typedef-decl name='s64' type-id='type-id-187' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='73' column='1' hash='5ae7f9eec1fc43d6' id='type-id-188'/>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_libc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <namespace-decl name='__sanitizer'>
      <class-decl name='SizeClassAllocatorLocalCache&lt;__sanitizer::SizeClassAllocator32&lt;0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap&lt;17ul, 64ul, 14ul&gt;, 24ul, __sanitizer::TwoLevelByteMap&lt;2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback&gt;, __sanitizer::NoOpMapUnmapCallback&gt; &gt;' is-struct='yes' visibility='default' size-in-bits='441344' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='889' column='1' hash='29c841a968bf73d6' id='type-id-109'>
        <member-type access='public'>
          <class-decl name='PerClass' is-struct='yes' visibility='default' size-in-bits='8320' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='942' column='1' hash='7277531e5c0a53cc' id='type-id-189'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='count' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='943' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='max_count' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='944' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='batch' type-id='type-id-190' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='945' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='Batch' type-id='type-id-103' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='941' column='1' id='type-id-191'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='per_class_' type-id='type-id-192' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='947' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='440960'>
          <var-decl name='stats_' type-id='type-id-193' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='948' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-194' const='yes' hash='511a84126e604852' id='type-id-195'/>
    <namespace-decl name='__sanitizer'>
      <class-decl name='InternalMmapVector&lt;__sanitizer::Suppression*&gt;' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='320' column='1' hash='10a7690341119695' id='type-id-196'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='data_' type-id='type-id-197' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='382' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='capacity_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='383' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='size_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='384' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='SuppressionType' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_suppressions.h' line='19' column='1' hash='67963126f34f1d81' id='type-id-198'>
        <underlying-type type-id='type-id-56'/>
        <enumerator name='SuppressionNone' value='0'/>
        <enumerator name='SuppressionRace' value='1'/>
        <enumerator name='SuppressionMutex' value='2'/>
        <enumerator name='SuppressionThread' value='3'/>
        <enumerator name='SuppressionSignal' value='4'/>
        <enumerator name='SuppressionLeak' value='5'/>
        <enumerator name='SuppressionLib' value='6'/>
        <enumerator name='SuppressionTypeCount' value='7'/>
      </enum-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-199' size-in-bits='2048' hash='b1acd4e4c2ca8eab' id='type-id-200'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='type-id-201'/>
    </array-type-def>
    <class-decl name='Elf64_Dyn' is-struct='yes' naming-typedef-id='type-id-202' visibility='default' size-in-bits='128' filepath='/usr/include/elf.h' line='643' column='1' hash='fe10d98cdb17c2d2' id='type-id-203'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='/usr/include/elf.h' line='646' column='1' hash='ae366dda56a7307c' id='type-id-204'>
          <data-member access='public'>
            <var-decl name='d_val' type-id='type-id-205' visibility='default' filepath='/usr/include/elf.h' line='647' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='d_ptr' type-id='type-id-206' visibility='default' filepath='/usr/include/elf.h' line='648' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_tag' type-id='type-id-207' visibility='default' filepath='/usr/include/elf.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_un' type-id='type-id-204' visibility='default' filepath='/usr/include/elf.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='link_map' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/include/link.h' line='85' column='1' hash='124c4e0a403ca2e6' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='l_addr' type-id='type-id-206' visibility='default' filepath='/usr/include/link.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='l_name' type-id='type-id-28' visibility='default' filepath='/usr/include/link.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='l_ld' type-id='type-id-209' visibility='default' filepath='/usr/include/link.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='l_next' type-id='type-id-210' visibility='default' filepath='/usr/include/link.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='l_prev' type-id='type-id-210' visibility='default' filepath='/usr/include/link.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sigaltstack' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/bits/sigstack.h' line='50' column='1' hash='c19f43ea42846939' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ss_sp' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/sigstack.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ss_flags' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/sigstack.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ss_size' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/sigstack.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Elf64_Dyn' type-id='type-id-203' size-in-bits='128' filepath='/usr/include/elf.h' line='650' column='1' id='type-id-202'/>
    <typedef-decl name='Elf64_Sxword' type-id='type-id-212' size-in-bits='64' filepath='/usr/include/elf.h' line='46' column='1' hash='b119fe0931d2ee10' id='type-id-207'/>
    <typedef-decl name='int64_t' type-id='type-id-40' size-in-bits='64' filepath='/usr/include/sys/types.h' line='198' column='1' hash='b119fe0931d2ee10' id='type-id-212'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' hash='3206d1002e26588e' id='type-id-209'/>
    <qualified-type-def type-id='type-id-213' const='yes' hash='e01e5630379fda29' id='type-id-214'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' hash='e95c7d509c86c421' id='type-id-216'/>
    <qualified-type-def type-id='type-id-216' const='yes' hash='1a1fb61c957e9fb1' id='type-id-217'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' hash='1149b23fc6efa315' id='type-id-219'/>
    <qualified-type-def type-id='type-id-219' const='yes' hash='823e90432d0dab43' id='type-id-220'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' hash='01c3cae7e870eb9a' id='type-id-222'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' hash='621d78dc8b27a169' id='type-id-224'/>
    <qualified-type-def type-id='type-id-28' const='yes' hash='351aa155d9983c83' id='type-id-225'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' hash='789df74c745bc4e9' id='type-id-226'/>
    <qualified-type-def type-id='type-id-221' const='yes' hash='458926da4923f9cb' id='type-id-227'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' hash='cf00ff6d2322dc0d' id='type-id-228'/>
    <qualified-type-def type-id='type-id-211' const='yes' hash='d6a53cdc94d219d7' id='type-id-229'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' hash='1ffe3482ef2b665d' id='type-id-230'/>
    <pointer-type-def type-id='type-id-231' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-232'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' hash='90f68929c8bd68b8' id='type-id-210'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' hash='49dbed255dc32841' id='type-id-233'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-235'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-236'/>
    <namespace-decl name='__sanitizer'>
      <class-decl name='MemoryMappingLayout' visibility='default' size-in-bits='256' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='42' column='1' hash='c4b64c99398fc77b' id='type-id-215'>
        <data-member access='public' static='yes'>
          <var-decl name='cached_proc_self_maps_' type-id='type-id-237' mangled-name='_ZN11__sanitizer19MemoryMappingLayout22cached_proc_self_maps_E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='321' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='cache_lock_' type-id='type-id-153' mangled-name='_ZN11__sanitizer19MemoryMappingLayout11cache_lock_E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='322' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='proc_self_maps_' type-id='type-id-237' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='100' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='current_' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='101' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='ThreadLister' visibility='default' size-in-bits='384' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='46' column='1' hash='6a4b4a8a7c45757c' id='type-id-218'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='pid_' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='59' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='descriptor_' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='60' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='buffer_' type-id='type-id-142' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='61' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='error_' type-id='type-id-156' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='62' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='entry_' type-id='type-id-224' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='63' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='320'>
          <var-decl name='bytes_read_' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='64' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='ProcSelfMapsBuff' is-struct='yes' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='35' column='1' hash='e4bef2058ca7c3c7' id='type-id-237'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='data' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='36' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='mmaped_size' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='len' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='38' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__sanitizer_kernel_sigaction_t' is-struct='yes' visibility='default' size-in-bits='256' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='423' column='1' hash='2011cc95858d6767' id='type-id-221'>
        <member-type access='public'>
          <union-decl name='__anonymous_union__' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='424' column='1' hash='8adc7ec905fb1aa7#4' id='type-id-238'>
            <data-member access='public'>
              <var-decl name='sigaction' type-id='type-id-235' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='425' column='1'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='handler' type-id='type-id-239' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='426' column='1'/>
            </data-member>
          </union-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='' type-id='type-id-238' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='sa_flags' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='428' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='sa_restorer' type-id='type-id-145' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='429' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='sa_mask' type-id='type-id-240' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='430' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='linux_dirent' is-struct='yes' visibility='default' size-in-bits='2240' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='565' column='1' hash='3de15d923e0da3fa' id='type-id-223'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='d_ino' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='566' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='d_off' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='567' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='d_reclen' type-id='type-id-241' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='568' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='144'>
          <var-decl name='d_name' type-id='type-id-200' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='569' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='u32' type-id='type-id-180' size-in-bits='32' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='68' column='1' hash='e66b43f97c38e87a' id='type-id-242'/>
      <typedef-decl name='OFF_T' type-id='type-id-116' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='81' column='1' hash='ebdfc4685a1e82df' id='type-id-243'/>
      <typedef-decl name='fill_profile_f' type-id='type-id-244' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='119' column='1' hash='fd7a63c0c6c822c4' id='type-id-245'/>
    </namespace-decl>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-231'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-234'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' hash='19a1d02fa5635f5c' id='type-id-246'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-156'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_linux_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-199' size-in-bits='448' hash='b9acc09cd17d593e' id='type-id-247'>
      <subrange length='56' lower-bound='0' upper-bound='55' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='1911f4cdae5d7aa5' id='type-id-248'/>
    </array-type-def>
    <enum-decl name='_Unwind_Reason_Code' naming-typedef-id='type-id-249' linkage-name='19_Unwind_Reason_Code' size-in-bits='32' alignment-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/host-x86_64-unknown-linux-gnu/gcc/include/unwind.h' line='66' column='1' hash='bbc6671cb57edbd5' id='type-id-250'>
      <underlying-type type-id='type-id-56'/>
      <enumerator name='_URC_NO_REASON' value='0'/>
      <enumerator name='_URC_FOREIGN_EXCEPTION_CAUGHT' value='1'/>
      <enumerator name='_URC_FATAL_PHASE2_ERROR' value='2'/>
      <enumerator name='_URC_FATAL_PHASE1_ERROR' value='3'/>
      <enumerator name='_URC_NORMAL_STOP' value='4'/>
      <enumerator name='_URC_END_OF_STACK' value='5'/>
      <enumerator name='_URC_HANDLER_FOUND' value='6'/>
      <enumerator name='_URC_INSTALL_CONTEXT' value='7'/>
      <enumerator name='_URC_CONTINUE_UNWIND' value='8'/>
    </enum-decl>
    <typedef-decl name='_Unwind_Ptr' type-id='type-id-1' size-in-bits='64' filepath='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/host-x86_64-unknown-linux-gnu/gcc/include/unwind.h' line='53' column='1' hash='8fdc5eea2983a729' id='type-id-251'/>
    <typedef-decl name='_Unwind_Reason_Code' type-id='type-id-250' size-in-bits='32' alignment-in-bits='32' filepath='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/host-x86_64-unknown-linux-gnu/gcc/include/unwind.h' line='76' column='1' hash='bbc6671cb57edbd5' id='type-id-249'/>
    <typedef-decl name='pthread_attr_t' type-id='type-id-252' size-in-bits='448' filepath='/usr/include/bits/pthreadtypes.h' line='57' column='1' id='type-id-253'/>
    <union-decl name='pthread_attr_t' naming-typedef-id='type-id-253' visibility='default' size-in-bits='448' filepath='/usr/include/bits/pthreadtypes.h' line='54' column='1' hash='f1fee08f614bcebf' id='type-id-252'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-247' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='55' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='56' column='1'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='type-id-130' const='yes' hash='72cfd84015ae84bd' id='type-id-254'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-255'/>
    <qualified-type-def type-id='type-id-253' const='yes' hash='13a03dff5e111f90' id='type-id-256'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' hash='119feddb672945aa' id='type-id-257'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' hash='cfcdc06ed6575035' id='type-id-258'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' hash='54c1e9f81ec7a1db' id='type-id-84'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-260'/>
    <class-decl name='_Unwind_Context' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-259'/>
    <namespace-decl name='__sanitizer'>
      <typedef-decl name='string_predicate_t' type-id='type-id-255' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='467' column='1' hash='fd7a63c0c6c822c4' id='type-id-261'/>
    </namespace-decl>
    <function-decl name='_Unwind_GetIP' filepath='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/host-x86_64-unknown-linux-gnu/gcc/include/unwind.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-260'/>
      <return type-id='type-id-251'/>
    </function-decl>
    <function-decl name='pthread_attr_setstacksize' filepath='/usr/include/pthread.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64' hash='037c1ed5d741755a'>
      <parameter type-id='type-id-258'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_linux.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_posix.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-125' const='yes' hash='f51c5ece061576b8' id='type-id-262'/>
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_posix_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <typedef-decl name='__uid_t' type-id='type-id-180' size-in-bits='32' filepath='/usr/include/bits/types.h' line='135' column='1' hash='e66b43f97c38e87a' id='type-id-263'/>
    <typedef-decl name='__useconds_t' type-id='type-id-180' size-in-bits='32' filepath='/usr/include/bits/types.h' line='150' column='1' hash='e66b43f97c38e87a' id='type-id-264'/>
    <typedef-decl name='pthread_t' type-id='type-id-1' size-in-bits='64' filepath='/usr/include/bits/pthreadtypes.h' line='50' column='1' hash='8fdc5eea2983a729' id='type-id-265'/>
    <qualified-type-def type-id='type-id-266' const='yes' hash='9172abf1d29bca7d' id='type-id-267'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' hash='1338b009d1566512' id='type-id-268'/>
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
    <function-decl name='pthread_self' filepath='/usr/include/pthread.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64' hash='e0055d99adb0e173'>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='madvise' filepath='/usr/include/sys/mman.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64' hash='3c22fdaad7e0fe35'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='getrlimit' filepath='/usr/include/sys/resource.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' hash='87894dd047aa9af0'>
      <parameter type-id='type-id-269'/>
      <parameter type-id='type-id-270'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='setrlimit' filepath='/usr/include/sys/resource.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64' hash='b049dea9ea8b238a'>
      <parameter type-id='type-id-269'/>
      <parameter type-id='type-id-268'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='getuid' filepath='/usr/include/unistd.h' line='694' column='1' visibility='default' binding='global' size-in-bits='64' hash='2bb88322482ae81c'>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='isatty' filepath='/usr/include/unistd.h' line='798' column='1' visibility='default' binding='global' size-in-bits='64' hash='d628501fd2223339'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_printf.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-271'/>
    <namespace-decl name='__sanitizer'>
      <function-decl name='OnPrint' mangled-name='_ZN11__sanitizer7OnPrintEPKc' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_printf.cc' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11__sanitizer7OnPrintEPKc' hash='53885bde0aa65efe'>
        <parameter type-id='type-id-4'/>
        <return type-id='type-id-31'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='64' hash='ce8b5719f8a8572f' id='type-id-272'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-273'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' hash='9eb919c61376d09f' id='type-id-275'/>
    <qualified-type-def type-id='type-id-275' const='yes' hash='3b0f1ffd014dc509' id='type-id-276'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' hash='565711851b49540b' id='type-id-278'/>
    <qualified-type-def type-id='type-id-278' const='yes' hash='5730a45e9834f5c1' id='type-id-279'/>
    <reference-type-def kind='lvalue' type-id='type-id-280' size-in-bits='64' hash='be9c095d26e9dacc' id='type-id-281'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' hash='8907dae3fbddcd18' id='type-id-282'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' hash='0a4930d39277009f' id='type-id-284'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' hash='e5ef88b9332b51ca' id='type-id-286'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-288'/>
    <qualified-type-def type-id='type-id-274' const='yes' hash='4523e41949dd73b6' id='type-id-289'/>
    <reference-type-def kind='lvalue' type-id='type-id-289' size-in-bits='64' hash='33af9c0279c10bbb' id='type-id-290'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' hash='49863d3e18ff6065' id='type-id-291'/>
    <qualified-type-def type-id='type-id-291' const='yes' hash='79524f3e0406bc6e' id='type-id-292'/>
    <qualified-type-def type-id='type-id-277' const='yes' hash='9cbfd15f041dd465' id='type-id-293'/>
    <reference-type-def kind='lvalue' type-id='type-id-293' size-in-bits='64' hash='1016567df29be97b' id='type-id-294'/>
    <qualified-type-def type-id='type-id-280' const='yes' hash='e7d91581f73ebe76' id='type-id-295'/>
    <reference-type-def kind='lvalue' type-id='type-id-295' size-in-bits='64' hash='7d1c47fbf01f5265' id='type-id-296'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' hash='2b4b7cc4548d549a' id='type-id-297'/>
    <namespace-decl name='__sanitizer'>
      <class-decl name='InternalMmapVector&lt;__sanitizer::StackDepotReverseMap::IdDescPair&gt;' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='320' column='1' hash='6f446c6db3abf9e7' id='type-id-274'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='data_' type-id='type-id-282' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='382' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='capacity_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='383' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='size_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='384' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='StackDepotReverseMap' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='39' column='1' hash='34a0a20f69d8b5c2' id='type-id-277'>
        <member-type access='private'>
          <class-decl name='IdDescPair' is-struct='yes' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='45' column='1' hash='c8da829e5f0a4e96' id='type-id-280'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='id' type-id='type-id-242' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='46' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='desc' type-id='type-id-286' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='47' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='map_' type-id='type-id-274' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='52' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='StackDepotStats' is-struct='yes' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='26' column='1' hash='7c7efb6f7698814b' id='type-id-283'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='n_uniq_ids' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='27' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='mapped' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.h' line='28' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='StackDesc' is-struct='yes' visibility='default' size-in-bits='256' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.cc' line='27' column='1' hash='744ae2bad145df74' id='type-id-285'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='link' type-id='type-id-286' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.cc' line='28' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='id' type-id='type-id-242' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.cc' line='29' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='hash' type-id='type-id-242' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.cc' line='30' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='size' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.cc' line='31' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='stack' type-id='type-id-272' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stackdepot.cc' line='32' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <function-type size-in-bits='64' hash='00498bfbf5d1cf02' id='type-id-287'>
      <parameter type-id='type-id-296'/>
      <parameter type-id='type-id-296'/>
      <return type-id='type-id-156'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <typedef-decl name='pid_t' type-id='type-id-298' size-in-bits='32' filepath='/usr/include/sched.h' line='37' column='1' hash='09d17c08f594edc7' id='type-id-299'/>
    <qualified-type-def type-id='type-id-300' const='yes' hash='664ccfdb6273700e' id='type-id-301'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' hash='953713545cc66323' id='type-id-303'/>
    <qualified-type-def type-id='type-id-303' const='yes' hash='cefd0674ef39d2db' id='type-id-304'/>
    <pointer-type-def type-id='type-id-305' size-in-bits='64' hash='525364e44a753625' id='type-id-306'/>
    <qualified-type-def type-id='type-id-306' const='yes' hash='f45ec6ba2bea9018' id='type-id-307'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' hash='642f1fc81c73cfcb' id='type-id-309'/>
    <qualified-type-def type-id='type-id-309' const='yes' hash='444453e09cb7e7c5' id='type-id-310'/>
    <reference-type-def kind='lvalue' type-id='type-id-311' size-in-bits='64' hash='06dd1ad8c19d2a28' id='type-id-312'/>
    <qualified-type-def type-id='type-id-313' const='yes' hash='977cd94ffa183523' id='type-id-314'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' hash='ae0e26828e6b18b6' id='type-id-316'/>
    <qualified-type-def type-id='type-id-316' const='yes' hash='7ad7c0b85efb99c3' id='type-id-317'/>
    <qualified-type-def type-id='type-id-318' const='yes' hash='79a0aa10e01a95b7' id='type-id-319'/>
    <qualified-type-def type-id='type-id-305' const='yes' hash='82975a0ac0ef83fe' id='type-id-320'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' hash='35b01d82aa0dcb11' id='type-id-321'/>
    <qualified-type-def type-id='type-id-321' const='yes' hash='e8cb5e7230562785' id='type-id-322'/>
    <qualified-type-def type-id='type-id-323' const='yes' hash='7be146eddfce62e6' id='type-id-324'/>
    <namespace-decl name='__sanitizer'>
      <class-decl name='ScopedStackSpaceWithGuard' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='276' column='1' hash='9e70a21c6e024ae7' id='type-id-305'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='stack_size_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='295' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='guard_size_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='296' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='guard_start_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='297' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='StopTheWorldScope' visibility='default' size-in-bits='32' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='307' column='1' hash='7f1c917f4ed01f44' id='type-id-308'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='process_was_dumpable_' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='354' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='ThreadSuspender' visibility='default' size-in-bits='256' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='72' column='1' hash='b7ecce7b49ed3a35' id='type-id-315'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='suspended_threads_list_' type-id='type-id-311' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='85' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='pid_' type-id='type-id-299' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='86' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='ScopedSetTracerPID' is-struct='yes' visibility='default' size-in-bits='8' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='360' column='1' hash='15f94241d5f8b3b0' id='type-id-302'/>
      <class-decl name='TracerThreadArgument' is-struct='yes' visibility='default' size-in-bits='896' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='181' column='1' hash='4c18fcde12136247' id='type-id-325'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='callback' type-id='type-id-326' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='182' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='callback_argument' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='183' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='mutex' type-id='type-id-327' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='186' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='parent_pid' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='187' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='SuspendedThreadID' type-id='type-id-6' size-in-bits='32' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld.h' line='19' column='1' hash='09d17c08f594edc7' id='type-id-328'/>
      <typedef-decl name='StopTheWorldCallback' type-id='type-id-329' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld.h' line='54' column='1' hash='fd7a63c0c6c822c4' id='type-id-326'/>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_suppressions.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-330' const='yes' hash='8dc819db9be99882' id='type-id-331'/>
    <qualified-type-def type-id='type-id-332' const='yes' hash='3b02866561d1dd42' id='type-id-333'/>
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-334' const='yes' hash='9bab1c151d47f26b' id='type-id-335'/>
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_libbacktrace.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <typedef-decl name='backtrace_error_callback' type-id='type-id-336' size-in-bits='64' filepath='../../.././libsanitizer/../libbacktrace/backtrace.h' line='82' column='1' hash='fd7a63c0c6c822c4' id='type-id-27'/>
    <typedef-decl name='backtrace_full_callback' type-id='type-id-337' size-in-bits='64' filepath='../../.././libsanitizer/../libbacktrace/backtrace.h' line='110' column='1' hash='fd7a63c0c6c822c4' id='type-id-29'/>
    <typedef-decl name='backtrace_syminfo_callback' type-id='type-id-338' size-in-bits='64' filepath='../../.././libsanitizer/../libbacktrace/backtrace.h' line='175' column='1' hash='fd7a63c0c6c822c4' id='type-id-30'/>
    <typedef-decl name='demangle_callbackref' type-id='type-id-339' size-in-bits='64' filepath='../../.././libsanitizer/../include/demangle.h' line='150' column='1' hash='fd7a63c0c6c822c4' id='type-id-83'/>
    <typedef-decl name='uintptr_t' type-id='type-id-1' size-in-bits='64' filepath='/usr/include/stdint.h' line='123' column='1' hash='8fdc5eea2983a729' id='type-id-26'/>
    <qualified-type-def type-id='type-id-340' const='yes' hash='e08b601b335ae2f0' id='type-id-341'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' hash='957d2e94c2467230' id='type-id-25'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-337'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-339'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-336'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-338'/>
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-199' size-in-bits='131072' hash='cadeca2069e0eeee' id='type-id-342'>
      <subrange length='16384' lower-bound='0' upper-bound='16383' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='2c27b44d567888c8' id='type-id-343'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' hash='39ca0204e7a4bc79' id='type-id-345'/>
    <qualified-type-def type-id='type-id-345' const='yes' hash='895c485228306dc7' id='type-id-346'/>
    <pointer-type-def type-id='type-id-347' size-in-bits='64' hash='628adc80af734371' id='type-id-348'/>
    <qualified-type-def type-id='type-id-348' const='yes' hash='6f9521d527cb877c' id='type-id-349'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' hash='42ccd576f5b989d2' id='type-id-340'/>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' hash='c0cdafe0af1c1f1c' id='type-id-352'/>
    <qualified-type-def type-id='type-id-352' const='yes' hash='292363c76f5d6d7c' id='type-id-353'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' hash='8c4411f6b2f40542' id='type-id-334'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-355'/>
    <qualified-type-def type-id='type-id-147' const='yes' hash='55063340c758423a' id='type-id-356'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' hash='38845c80cd6d6c04' id='type-id-149'/>
    <namespace-decl name='__cxxabiv1'>
      <function-decl name='__cxa_demangle' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='34' column='1' visibility='default' binding='global' size-in-bits='64' hash='d05fbc442f59b10d'>
        <parameter type-id='type-id-4'/>
        <parameter type-id='type-id-28'/>
        <parameter type-id='type-id-84'/>
        <parameter type-id='type-id-38'/>
        <return type-id='type-id-28'/>
      </function-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='ExternalSymbolizer' visibility='default' size-in-bits='131328' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='208' column='1' hash='1872146c80cfc461' id='type-id-344'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='path_' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='294' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='input_fd_' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='295' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='96'>
          <var-decl name='output_fd_' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='296' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='buffer_' type-id='type-id-342' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='299' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='131200'>
          <var-decl name='times_restarted_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='302' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='131264'>
          <var-decl name='failed_to_start_' type-id='type-id-156' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='303' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='InternalSymbolizer' visibility='default' size-in-bits='131072' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='321' column='1' hash='8b85f3b6935f2551' id='type-id-347'>
        <member-type access='public'>
          <typedef-decl name='SanitizerSymbolizeFn' type-id='type-id-355' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='323' column='1' hash='fd7a63c0c6c822c4' id='type-id-357'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='buffer_' type-id='type-id-342' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='369' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='LibbacktraceSymbolizer' visibility='default' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_libbacktrace.h' line='23' column='1' hash='0bfc8cb6ac829cca' id='type-id-350'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='state_' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_libbacktrace.h' line='37' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='POSIXSymbolizer' visibility='default' size-in-bits='1280' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='385' column='1' hash='35a821a349d4cd41' id='type-id-351'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-147'/>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='modules_' type-id='type-id-127' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='582' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='n_modules_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='583' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='320'>
          <var-decl name='modules_fresh_' type-id='type-id-156' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='585' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='384'>
          <var-decl name='mu_' type-id='type-id-327' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='586' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='1088'>
          <var-decl name='external_symbolizer_' type-id='type-id-345' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='588' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='1152'>
          <var-decl name='internal_symbolizer_' type-id='type-id-349' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='589' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='1216'>
          <var-decl name='libbacktrace_symbolizer_' type-id='type-id-340' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='590' column='1'/>
        </data-member>
        <member-function access='public' vtable-offset='0'>
          <function-decl name='SymbolizeCode' mangled-name='_ZN11__sanitizer15POSIXSymbolizer13SymbolizeCodeEmPNS_11AddressInfoEm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='395' column='1' visibility='default' binding='global' size-in-bits='64' hash='25cd40cd27039a9f'>
            <parameter type-id='type-id-352' is-artificial='yes'/>
            <parameter type-id='type-id-87'/>
            <parameter type-id='type-id-154'/>
            <parameter type-id='type-id-87'/>
            <return type-id='type-id-87'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='1'>
          <function-decl name='SymbolizeData' mangled-name='_ZN11__sanitizer15POSIXSymbolizer13SymbolizeDataEmPNS_8DataInfoE' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='464' column='1' visibility='default' binding='global' size-in-bits='64' hash='ec014b6e6334a8bc'>
            <parameter type-id='type-id-352' is-artificial='yes'/>
            <parameter type-id='type-id-87'/>
            <parameter type-id='type-id-155'/>
            <return type-id='type-id-156'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='2'>
          <function-decl name='IsAvailable' mangled-name='_ZN11__sanitizer15POSIXSymbolizer11IsAvailableEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='490' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' hash='c7c710e908194b91'>
            <parameter type-id='type-id-352' is-artificial='yes'/>
            <return type-id='type-id-156'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='IsExternalAvailable' mangled-name='_ZN11__sanitizer15POSIXSymbolizer19IsExternalAvailableEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='495' column='1' visibility='default' binding='global' size-in-bits='64' hash='c7c710e908194b91'>
            <parameter type-id='type-id-352' is-artificial='yes'/>
            <return type-id='type-id-156'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='Flush' mangled-name='_ZN11__sanitizer15POSIXSymbolizer5FlushEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='499' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-352' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='5'>
          <function-decl name='Demangle' mangled-name='_ZN11__sanitizer15POSIXSymbolizer8DemangleEPKc' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='509' column='1' visibility='default' binding='global' size-in-bits='64' hash='3d5693612af11c46'>
            <parameter type-id='type-id-352' is-artificial='yes'/>
            <parameter type-id='type-id-4'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='6'>
          <function-decl name='PrepareForSandboxing' mangled-name='_ZN11__sanitizer15POSIXSymbolizer20PrepareForSandboxingEv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='524' column='1' visibility='default' binding='global' size-in-bits='64' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-352' is-artificial='yes'/>
            <return type-id='type-id-31'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <function-decl name='execl' filepath='/usr/include/unistd.h' line='570' column='1' visibility='default' binding='global' size-in-bits='64' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='getdtablesize' filepath='/usr/include/unistd.h' line='997' column='1' visibility='default' binding='global' size-in-bits='64' hash='388da3fa973fde78'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' hash='ed90573adf183943' id='type-id-354'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-156'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_thread_registry.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-358' const='yes' hash='f4f51862fd75f4d2' id='type-id-359'/>
    <qualified-type-def type-id='type-id-360' const='yes' hash='8da4f8ebbe10e998' id='type-id-361'/>
    <qualified-type-def type-id='type-id-362' const='yes' hash='5e239c3961c78bae' id='type-id-363'/>
    <namespace-decl name='__sanitizer'>
      <typedef-decl name='ThreadContextFactory' type-id='type-id-364' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_thread_registry.h' line='71' column='1' hash='fd7a63c0c6c822c4' id='type-id-365'/>
    </namespace-decl>
    <function-type method-class-id='type-id-366' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-367'>
      <parameter type-id='type-id-360' is-artificial='yes'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type method-class-id='type-id-366' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-368'>
      <parameter type-id='type-id-360' is-artificial='yes'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-31'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/tsan/tsan_clock.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/tsan' language='LANG_C_plus_plus'>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-6'/>
    <type-decl name='sizetype' size-in-bits='64' hash='3e84f1a1648448f5' id='type-id-46'/>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='type-id-56'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-180'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-1'/>
    <type-decl name='unsigned long long int' size-in-bits='64' hash='ebdfc4685a1e82df#3' id='type-id-115'/>
    <array-type-def dimensions='1' type-id='type-id-115' size-in-bits='1048576' hash='92354dbd77d9b6b3' id='type-id-369'>
      <subrange length='16384' lower-bound='0' upper-bound='16383' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='2c27b44d567888c8' id='type-id-343'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' hash='479500b4ae25d54b' id='type-id-371'/>
    <qualified-type-def type-id='type-id-371' const='yes' hash='0604ca3a859f1c79' id='type-id-372'/>
    <pointer-type-def type-id='type-id-373' size-in-bits='64' hash='7f5adc830ffd8423' id='type-id-374'/>
    <qualified-type-def type-id='type-id-374' const='yes' hash='23be82b95dd01b0b' id='type-id-375'/>
    <pointer-type-def type-id='type-id-376' size-in-bits='64' hash='32be8d6e6ef077b8' id='type-id-377'/>
    <qualified-type-def type-id='type-id-377' const='yes' hash='1c6bc23d3426d145' id='type-id-378'/>
    <qualified-type-def type-id='type-id-379' const='yes' hash='1c7ceba604a3c911' id='type-id-380'/>
    <qualified-type-def type-id='type-id-370' const='yes' hash='3b83daec96af29be' id='type-id-381'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' hash='8dae87a32858b04d' id='type-id-382'/>
    <qualified-type-def type-id='type-id-373' const='yes' hash='245bef550874897b' id='type-id-383'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' hash='304075f25ebb8888' id='type-id-384'/>
    <qualified-type-def type-id='type-id-384' const='yes' hash='28bc40cb99e592bd' id='type-id-385'/>
    <qualified-type-def type-id='type-id-376' const='yes' hash='a81bb0955c0b7a44' id='type-id-386'/>
    <reference-type-def kind='lvalue' type-id='type-id-386' size-in-bits='64' hash='c44f58147f5a5540' id='type-id-387'/>
    <pointer-type-def type-id='type-id-386' size-in-bits='64' hash='c9d14478e950e4f9' id='type-id-388'/>
    <qualified-type-def type-id='type-id-388' const='yes' hash='69d3ef7df28480c3' id='type-id-389'/>
    <qualified-type-def type-id='type-id-115' const='yes' hash='f06d84c079ff07f5#3' id='type-id-390'/>
    <reference-type-def kind='lvalue' type-id='type-id-390' size-in-bits='64' hash='e29bc4e9795dc799#3' id='type-id-391'/>
    <reference-type-def kind='lvalue' type-id='type-id-115' size-in-bits='64' hash='6356f9ae036b2084#3' id='type-id-392'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' hash='2cf5ae0f158917c2#3' id='type-id-393'/>
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
    <namespace-decl name='__tsan'>
      <class-decl name='SyncClock' visibility='default' size-in-bits='256' filepath='../../.././libsanitizer/tsan/tsan_clock.h' line='20' column='1' hash='19da309c4d401914' id='type-id-370'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='clk_' type-id='type-id-376' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_clock.h' line='33' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='Vector&lt;long long unsigned int&gt;' visibility='default' size-in-bits='256' filepath='../../.././libsanitizer/tsan/tsan_vector.h' line='23' column='1' hash='3c3d55096071d4eb' id='type-id-376'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='typ_' type-id='type-id-380' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_vector.h' line='80' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='begin_' type-id='type-id-393' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_vector.h' line='81' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='end_' type-id='type-id-393' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_vector.h' line='82' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='last_' type-id='type-id-393' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_vector.h' line='83' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='MBlockType' size-in-bits='32' alignment-in-bits='32' filepath='../../.././libsanitizer/tsan/tsan_mman.h' line='41' column='1' hash='5186fc6b60d4cabc' id='type-id-379'>
        <underlying-type type-id='type-id-56'/>
        <enumerator name='MBlockScopedBuf' value='0'/>
        <enumerator name='MBlockString' value='1'/>
        <enumerator name='MBlockStackTrace' value='2'/>
        <enumerator name='MBlockShadowStack' value='3'/>
        <enumerator name='MBlockSync' value='4'/>
        <enumerator name='MBlockClock' value='5'/>
        <enumerator name='MBlockThreadContex' value='6'/>
        <enumerator name='MBlockDeadInfo' value='7'/>
        <enumerator name='MBlockRacyStacks' value='8'/>
        <enumerator name='MBlockRacyAddresses' value='9'/>
        <enumerator name='MBlockAtExit' value='10'/>
        <enumerator name='MBlockFlag' value='11'/>
        <enumerator name='MBlockReport' value='12'/>
        <enumerator name='MBlockReportMop' value='13'/>
        <enumerator name='MBlockReportThread' value='14'/>
        <enumerator name='MBlockReportMutex' value='15'/>
        <enumerator name='MBlockReportLoc' value='16'/>
        <enumerator name='MBlockReportStack' value='17'/>
        <enumerator name='MBlockSuppression' value='18'/>
        <enumerator name='MBlockExpectRace' value='19'/>
        <enumerator name='MBlockSignal' value='20'/>
        <enumerator name='MBlockFD' value='21'/>
        <enumerator name='MBlockJmpBuf' value='22'/>
        <enumerator name='MBlockTypeCount' value='23'/>
      </enum-decl>
      <class-decl name='ThreadClock' is-struct='yes' visibility='default' size-in-bits='1048640' filepath='../../.././libsanitizer/tsan/tsan_clock.h' line='38' column='1' hash='c593d7a0e34a6965' id='type-id-373'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='nclk_' type-id='type-id-87' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_clock.h' line='72' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='clk_' type-id='type-id-369' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_clock.h' line='73' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <type-decl name='void' id='type-id-31'/>
    <pointer-type-def type-id='type-id-31' id='type-id-3'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/tsan/tsan_fd.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/tsan' language='LANG_C_plus_plus'>
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
    <namespace-decl name='__tsan'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/tsan/tsan_flags.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/tsan' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='type-id-394' size-in-bits='64' hash='18bb34c70254df90' id='type-id-395'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' hash='9c0e3f8596726a0b' id='type-id-396'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-397'/>
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
    <namespace-decl name='__tsan'>
      <function-decl name='__tsan_default_options' mangled-name='__tsan_default_options' filepath='../../.././libsanitizer/tsan/tsan_flags.cc' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__tsan_default_options' hash='53885bde0aa65efe'>
        <return type-id='type-id-4'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/tsan/tsan_ignoreset.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/tsan' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-398' const='yes' hash='958fcabf07462d25' id='type-id-399'/>
    <qualified-type-def type-id='type-id-400' const='yes' hash='35f216b772bad53a' id='type-id-401'/>
    <namespace-decl name='__sanitizer'>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/tsan/tsan_interceptors.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/tsan' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-402' size-in-bits='16384' hash='ea37f580cd6ce268' id='type-id-403'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='type-id-404'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-405' size-in-bits='32768' hash='2b7744df10f59af7' id='type-id-406'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='type-id-404'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-407' size-in-bits='552960' hash='10ad0608ccf9609e' id='type-id-408'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='type-id-409'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-156' size-in-bits='1024' hash='f8edbaa82efaf55f' id='type-id-410'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='type-id-404'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-199' size-in-bits='112' hash='32c03ac42667596f' id='type-id-411'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='type-id-412'/>
    </array-type-def>
    <class-decl name='AtExitContext' visibility='default' size-in-bits='17536' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='281' column='1' hash='d76dfa08962303cb' id='type-id-413'>
      <member-type access='public'>
        <typedef-decl name='atexit_t' type-id='type-id-145' size-in-bits='64' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='288' column='1' hash='fd7a63c0c6c822c4' id='type-id-414'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='mtx_' type-id='type-id-415' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='333' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='stack_' type-id='type-id-416' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='334' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8256'>
        <var-decl name='args_' type-id='type-id-190' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='335' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='16448'>
        <var-decl name='is_on_exits_' type-id='type-id-410' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='336' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='17472'>
        <var-decl name='pos_' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='337' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ScopedInterceptor' visibility='default' size-in-bits='192' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='155' column='1' hash='ba8b5daf127fa32d' id='type-id-417'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='thr_' type-id='type-id-418' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='160' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='pc_' type-id='type-id-419' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='161' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='in_rtl_' type-id='type-id-420' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='162' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='160'>
        <var-decl name='in_ignored_lib_' type-id='type-id-156' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='163' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' hash='e9e9b320886d9aa6' id='type-id-421'/>
    <type-decl name='float' size-in-bits='32' hash='d7ec3bf03d3c5690' id='type-id-422'/>
    <array-type-def dimensions='1' type-id='type-id-423' size-in-bits='64000' hash='4cd0225066d8d015' id='type-id-424'>
      <subrange length='500' lower-bound='0' upper-bound='499' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='1e6b7243faa8d2c8' id='type-id-425'/>
    </array-type-def>
    <type-decl name='long double' size-in-bits='128' hash='2a9bbfe8bb0475f1#2' id='type-id-426'/>
    <type-decl name='long long int' size-in-bits='64' hash='5ae7f9eec1fc43d6#3' id='type-id-187'/>
    <class-decl name='BlockingCall' is-struct='yes' visibility='default' size-in-bits='64' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='225' column='1' hash='0b9163ce3abb1ee6' id='type-id-427'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx' type-id='type-id-428' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='235' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ScopedSyscall' is-struct='yes' visibility='default' size-in-bits='64' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='1920' column='1' hash='5127a7c8e47a8270' id='type-id-429'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thr' type-id='type-id-430' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='1921' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ioctl_desc' is-struct='yes' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors_ioctl.inc' line='13' column='1' hash='345a726a2a83848b' id='type-id-423'>
      <member-type access='public'>
        <enum-decl name='__anonymous_enum__' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors_ioctl.inc' line='16' column='1' hash='41fcfc1ed2a40f53' id='type-id-431'>
          <underlying-type type-id='type-id-56'/>
          <enumerator name='NONE' value='0'/>
          <enumerator name='READ' value='1'/>
          <enumerator name='WRITE' value='2'/>
          <enumerator name='CUSTOM' value='3'/>
        </enum-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='req' type-id='type-id-180' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors_ioctl.inc' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='type' type-id='type-id-431' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors_ioctl.inc' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34'>
        <var-decl name='size' type-id='type-id-180' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors_ioctl.inc' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors_ioctl.inc' line='23' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ioctl_desc_compare' is-struct='yes' visibility='default' size-in-bits='8' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors_ioctl.inc' line='462' column='1' hash='5623818598eee39e' id='type-id-432'/>
    <class-decl name='my_siginfo_t' is-struct='yes' visibility='default' size-in-bits='1024' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='32' column='1' hash='c6c9f3c390ec0678' id='type-id-433'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opaque' type-id='type-id-434' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='34' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sanitizer_kernel_iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='88' column='1' hash='c47012dc94087867' id='type-id-435'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='90' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sanitizer_kernel_mmsghdr' is-struct='yes' visibility='default' size-in-bits='512' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='103' column='1' hash='6d4b5a4f1da8f35f' id='type-id-436'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='msg_hdr' type-id='type-id-437' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='msg_len' type-id='type-id-180' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='105' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sanitizer_kernel_msghdr' is-struct='yes' visibility='default' size-in-bits='448' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='93' column='1' hash='67f9f51f2a6d5a1d' id='type-id-437'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='msg_name' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='msg_namelen' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='msg_iov' type-id='type-id-438' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='msg_iovlen' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='msg_control' type-id='type-id-3' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='msg_controllen' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='msg_flags' type-id='type-id-180' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='100' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sanitizer_kernel_sockaddr' is-struct='yes' visibility='default' size-in-bits='128' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='123' column='1' hash='82f466e263025957' id='type-id-439'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_family' type-id='type-id-241' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sa_data' type-id='type-id-411' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='125' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sigaction_t' is-struct='yes' visibility='default' size-in-bits='1216' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='91' column='1' hash='b5816ad8593acf6c' id='type-id-440'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='92' column='1' hash='67b323f70848ee4b#2' id='type-id-441'>
          <data-member access='public'>
            <var-decl name='sa_handler' type-id='type-id-442' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='93' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='sa_sigaction' type-id='type-id-443' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='94' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-441' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sa_mask' type-id='type-id-444' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='sa_flags' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='sa_restorer' type-id='type-id-145' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='typedef __va_list_tag __va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='82aec996f90384a2' id='type-id-445'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ucontext_t' is-struct='yes' visibility='default' size-in-bits='7552' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='37' column='1' hash='372af74ed7dfff59' id='type-id-446'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opaque' type-id='type-id-447' visibility='default' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='39' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='INTMAX_T' type-id='type-id-188' size-in-bits='64' filepath='../../.././libsanitizer/interception/interception.h' line='27' column='1' hash='5ae7f9eec1fc43d6' id='type-id-448'/>
    <typedef-decl name='OFF64_T' type-id='type-id-449' size-in-bits='64' filepath='../../.././libsanitizer/interception/interception.h' line='29' column='1' hash='ebdfc4685a1e82df' id='type-id-450'/>
    <typedef-decl name='OFF_T' type-id='type-id-243' size-in-bits='64' filepath='../../.././libsanitizer/interception/interception.h' line='28' column='1' hash='ebdfc4685a1e82df' id='type-id-451'/>
    <typedef-decl name='SIZE_T' type-id='type-id-87' size-in-bits='64' filepath='../../.././libsanitizer/interception/interception.h' line='24' column='1' hash='8fdc5eea2983a729' id='type-id-452'/>
    <typedef-decl name='SSIZE_T' type-id='type-id-453' size-in-bits='64' filepath='../../.././libsanitizer/interception/interception.h' line='25' column='1' hash='b119fe0931d2ee10' id='type-id-454'/>
    <typedef-decl name='kernel_sigset_t' type-id='type-id-31' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_syscalls.inc' line='130' column='1' id='type-id-455'/>
    <typedef-decl name='long_t' type-id='type-id-40' size-in-bits='64' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='79' column='1' hash='b119fe0931d2ee10' id='type-id-456'/>
    <typedef-decl name='scandir64_compar_f' type-id='type-id-457' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1943' column='1' hash='fd7a63c0c6c822c4' id='type-id-458'/>
    <typedef-decl name='scandir64_filter_f' type-id='type-id-459' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1942' column='1' hash='fd7a63c0c6c822c4' id='type-id-460'/>
    <typedef-decl name='scandir_compar_f' type-id='type-id-461' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1890' column='1' hash='fd7a63c0c6c822c4' id='type-id-462'/>
    <typedef-decl name='scandir_filter_f' type-id='type-id-463' size-in-bits='64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1889' column='1' hash='fd7a63c0c6c822c4' id='type-id-464'/>
    <typedef-decl name='sighandler_t' type-id='type-id-239' size-in-bits='64' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='87' column='1' hash='fd7a63c0c6c822c4' id='type-id-442'/>
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='48' hash='4d151751a9342ebe' id='type-id-465'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='type-id-123'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-18' size-in-bits='64' hash='6581debd9544f9df' id='type-id-466'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-467'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='1024' hash='ed1e12a813ec6094#2' id='type-id-468'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-469'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='256' hash='d24c0d20b5304476' id='type-id-470'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-471'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-115' size-in-bits='7552' hash='c28bce6e9e582b63' id='type-id-447'>
      <subrange length='118' lower-bound='0' upper-bound='117' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6f97e773a1e88e39' id='type-id-472'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-115' size-in-bits='1024' hash='8fc03dfdfa2d2d80#3' id='type-id-434'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-469'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-145' size-in-bits='8192' hash='723ad4905b0e82d4' id='type-id-416'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-46' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='type-id-404'/>
    </array-type-def>
    <type-decl name='wchar_t' size-in-bits='32' hash='4b224bc24abb5f1b' id='type-id-473'/>
    <pointer-type-def type-id='type-id-413' size-in-bits='64' hash='2fe4cf4630f5ed99' id='type-id-474'/>
    <qualified-type-def type-id='type-id-474' const='yes' hash='dc7bbc711d809e41' id='type-id-475'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' hash='03afa333156b82ef' id='type-id-476'/>
    <qualified-type-def type-id='type-id-476' const='yes' hash='7e05fd05994c3be2' id='type-id-477'/>
    <pointer-type-def type-id='type-id-452' size-in-bits='64' hash='9fd3033f0b045812' id='type-id-478'/>
    <pointer-type-def type-id='type-id-417' size-in-bits='64' hash='8aa81351e474dda0' id='type-id-479'/>
    <qualified-type-def type-id='type-id-479' const='yes' hash='8bfb58088952d791' id='type-id-480'/>
    <pointer-type-def type-id='type-id-429' size-in-bits='64' hash='4cf5a7c1c12ca837' id='type-id-481'/>
    <qualified-type-def type-id='type-id-481' const='yes' hash='c6dd0b4b165da900' id='type-id-482'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' hash='9ccf4b235df98601' id='type-id-483'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' hash='33137f3b153f3748' id='type-id-484'/>
    <pointer-type-def type-id='type-id-485' size-in-bits='64' hash='fdf519147b0bd16a' id='type-id-486'/>
    <pointer-type-def type-id='type-id-487' size-in-bits='64' hash='3d2069e3e149ff71' id='type-id-194'/>
    <reference-type-def kind='lvalue' type-id='type-id-488' size-in-bits='64' hash='bb1b48eafb479d6f' id='type-id-489'/>
    <pointer-type-def type-id='type-id-490' size-in-bits='64' hash='6b05b8589807a4f0' id='type-id-197'/>
    <pointer-type-def type-id='type-id-491' size-in-bits='64' hash='b8e25bde82c4efef' id='type-id-492'/>
    <pointer-type-def type-id='type-id-493' size-in-bits='64' hash='d612b30660e9d46c' id='type-id-494'/>
    <pointer-type-def type-id='type-id-495' size-in-bits='64' hash='ebaa6579df05fde9' id='type-id-496'/>
    <pointer-type-def type-id='type-id-497' size-in-bits='64' hash='47e8c00e7ce462dd' id='type-id-498'/>
    <pointer-type-def type-id='type-id-499' size-in-bits='64' hash='d8386c50ae411116' id='type-id-500'/>
    <pointer-type-def type-id='type-id-501' size-in-bits='64' hash='2147159cd293fbbd' id='type-id-502'/>
    <pointer-type-def type-id='type-id-503' size-in-bits='64' hash='110f7d2491365f15' id='type-id-504'/>
    <pointer-type-def type-id='type-id-505' size-in-bits='64' hash='b9129a7ace6ad10e' id='type-id-506'/>
    <pointer-type-def type-id='type-id-507' size-in-bits='64' hash='f76116780a6f3391' id='type-id-508'/>
    <pointer-type-def type-id='type-id-508' size-in-bits='64' hash='f9b945451b1e350c' id='type-id-509'/>
    <pointer-type-def type-id='type-id-509' size-in-bits='64' hash='e24ae38dc1463b92' id='type-id-510'/>
    <pointer-type-def type-id='type-id-511' size-in-bits='64' hash='9898a6da8a482e18' id='type-id-512'/>
    <pointer-type-def type-id='type-id-512' size-in-bits='64' hash='37ce478b472e0630' id='type-id-513'/>
    <pointer-type-def type-id='type-id-513' size-in-bits='64' hash='1ec08ddcc5fc13cf' id='type-id-514'/>
    <pointer-type-def type-id='type-id-515' size-in-bits='64' hash='e11969648e05ce33' id='type-id-516'/>
    <pointer-type-def type-id='type-id-517' size-in-bits='64' hash='f779c55c1b5a19b5' id='type-id-518'/>
    <pointer-type-def type-id='type-id-518' size-in-bits='64' hash='fdf8c892a146030c' id='type-id-519'/>
    <pointer-type-def type-id='type-id-520' size-in-bits='64' hash='07967821d1c4d67b' id='type-id-521'/>
    <pointer-type-def type-id='type-id-522' size-in-bits='64' hash='f867638d5ea4316c' id='type-id-523'/>
    <pointer-type-def type-id='type-id-523' size-in-bits='64' hash='7ed3b89c52cb4e1c' id='type-id-524'/>
    <pointer-type-def type-id='type-id-525' size-in-bits='64' hash='ffcc9acdc8cffde9' id='type-id-526'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' hash='596f1936b84c2482' id='type-id-527'/>
    <pointer-type-def type-id='type-id-528' size-in-bits='64' hash='fbfe56eaa12f7e7c' id='type-id-529'/>
    <pointer-type-def type-id='type-id-530' size-in-bits='64' hash='4cb70f50555f72b9' id='type-id-531'/>
    <pointer-type-def type-id='type-id-532' size-in-bits='64' hash='526529c54edef279' id='type-id-533'/>
    <pointer-type-def type-id='type-id-534' size-in-bits='64' hash='425ddf96562f5644' id='type-id-535'/>
    <pointer-type-def type-id='type-id-444' size-in-bits='64' hash='06c4279440ed17f9' id='type-id-536'/>
    <pointer-type-def type-id='type-id-537' size-in-bits='64' hash='70a5e7e8071e6571' id='type-id-538'/>
    <pointer-type-def type-id='type-id-539' size-in-bits='64' hash='c5063e3525a1bcfd' id='type-id-540'/>
    <pointer-type-def type-id='type-id-541' size-in-bits='64' hash='a4e61793cf52c8b9' id='type-id-542'/>
    <pointer-type-def type-id='type-id-543' size-in-bits='64' hash='058dfb8da7831c8e' id='type-id-544'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' hash='d91ded9019e1e29d' id='type-id-545'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' hash='a93039fe023ed77b' id='type-id-546'/>
    <qualified-type-def type-id='type-id-485' const='yes' hash='82170b369094fff8' id='type-id-547'/>
    <reference-type-def kind='lvalue' type-id='type-id-547' size-in-bits='64' hash='d09a64b1f8392d00' id='type-id-548'/>
    <pointer-type-def type-id='type-id-547' size-in-bits='64' hash='78df0f23701e0fd2' id='type-id-330'/>
    <qualified-type-def type-id='type-id-487' const='yes' hash='7fa34445adc5c889' id='type-id-549'/>
    <reference-type-def kind='lvalue' type-id='type-id-549' size-in-bits='64' hash='cc38c4c8c4190a2f' id='type-id-550'/>
    <pointer-type-def type-id='type-id-549' size-in-bits='64' hash='c3242e48fd9f4eb0' id='type-id-551'/>
    <qualified-type-def type-id='type-id-551' const='yes' hash='4053cc996891644a' id='type-id-552'/>
    <qualified-type-def type-id='type-id-488' const='yes' hash='71f01444a50e51e6' id='type-id-553'/>
    <reference-type-def kind='lvalue' type-id='type-id-553' size-in-bits='64' hash='a58eadccc8ca3f86' id='type-id-554'/>
    <pointer-type-def type-id='type-id-553' size-in-bits='64' hash='e84e49fb85aef037' id='type-id-555'/>
    <qualified-type-def type-id='type-id-491' const='yes' hash='3340b157edd7f712' id='type-id-556'/>
    <reference-type-def kind='lvalue' type-id='type-id-556' size-in-bits='64' hash='63fa9d3b8e8ae979' id='type-id-557'/>
    <pointer-type-def type-id='type-id-556' size-in-bits='64' hash='6a823b16a32cc479' id='type-id-332'/>
    <qualified-type-def type-id='type-id-507' const='yes' hash='65dca71099900db5' id='type-id-558'/>
    <pointer-type-def type-id='type-id-558' size-in-bits='64' hash='e3e769d12bb98eb1' id='type-id-559'/>
    <pointer-type-def type-id='type-id-559' size-in-bits='64' hash='d2f208c3e083798c' id='type-id-560'/>
    <qualified-type-def type-id='type-id-511' const='yes' hash='d594475795648151' id='type-id-561'/>
    <pointer-type-def type-id='type-id-561' size-in-bits='64' hash='3b26210508c25064' id='type-id-562'/>
    <pointer-type-def type-id='type-id-562' size-in-bits='64' hash='5f06945fb5f6fafe' id='type-id-563'/>
    <qualified-type-def type-id='type-id-525' const='yes' hash='556d49656de740c4' id='type-id-564'/>
    <pointer-type-def type-id='type-id-564' size-in-bits='64' hash='065d6b494a6859af' id='type-id-565'/>
    <qualified-type-def type-id='type-id-444' const='yes' hash='94fd9394d055ce05' id='type-id-566'/>
    <pointer-type-def type-id='type-id-566' size-in-bits='64' hash='7ead6ba524e65d8f' id='type-id-567'/>
    <qualified-type-def type-id='type-id-568' const='yes' hash='bd3176cef92fc3fb' id='type-id-569'/>
    <qualified-type-def type-id='type-id-423' const='yes' hash='583c78564811cfb0' id='type-id-570'/>
    <reference-type-def kind='lvalue' type-id='type-id-570' size-in-bits='64' hash='d55ff2a337b292fb' id='type-id-571'/>
    <qualified-type-def type-id='type-id-432' const='yes' hash='f04fb08dd3692748' id='type-id-572'/>
    <pointer-type-def type-id='type-id-572' size-in-bits='64' hash='a087dceabe564cc7' id='type-id-573'/>
    <qualified-type-def type-id='type-id-573' const='yes' hash='e7bc468689db77b5' id='type-id-574'/>
    <qualified-type-def type-id='type-id-455' const='yes' hash='fec1b3ab36b3bee9' id='type-id-575'/>
    <qualified-type-def type-id='type-id-576' const='yes' hash='83efb55678943094' id='type-id-577'/>
    <reference-type-def kind='lvalue' type-id='type-id-577' size-in-bits='64' hash='2f3b7481bf476291' id='type-id-578'/>
    <qualified-type-def type-id='type-id-579' const='yes' hash='2e38a40d99872256' id='type-id-580'/>
    <pointer-type-def type-id='type-id-580' size-in-bits='64' hash='af0dbcba6ef63250' id='type-id-581'/>
    <qualified-type-def type-id='type-id-473' const='yes' hash='f2fba7dbc42fc9d5' id='type-id-582'/>
    <pointer-type-def type-id='type-id-582' size-in-bits='64' hash='317089067e76910a' id='type-id-583'/>
    <pointer-type-def type-id='type-id-583' size-in-bits='64' hash='535c62eb027026ae' id='type-id-584'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' hash='dd31f93f4361bc41' id='type-id-585'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' hash='5022839615992ac0' id='type-id-586'/>
    <pointer-type-def type-id='type-id-587' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-463'/>
    <pointer-type-def type-id='type-id-588' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-461'/>
    <pointer-type-def type-id='type-id-589' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-459'/>
    <pointer-type-def type-id='type-id-590' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-457'/>
    <reference-type-def kind='lvalue' type-id='type-id-423' size-in-bits='64' hash='e9f9003618ad6e07' id='type-id-591'/>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' hash='09158ef4db2f3a2e' id='type-id-592'/>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' hash='04598ca17c1b4f7f' id='type-id-593'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' hash='9525b6affe75cc9d#2' id='type-id-594'/>
    <pointer-type-def type-id='type-id-433' size-in-bits='64' hash='3b5f55d8721447c6' id='type-id-595'/>
    <pointer-type-def type-id='type-id-435' size-in-bits='64' hash='991b37073e13060c' id='type-id-438'/>
    <pointer-type-def type-id='type-id-436' size-in-bits='64' hash='03935355120f5a0e' id='type-id-596'/>
    <pointer-type-def type-id='type-id-437' size-in-bits='64' hash='4c04f8b87db1c92e' id='type-id-597'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' hash='9c6590d4e21b17c5' id='type-id-598'/>
    <pointer-type-def type-id='type-id-440' size-in-bits='64' hash='dc89d352292e5898' id='type-id-599'/>
    <pointer-type-def type-id='type-id-445' size-in-bits='64' hash='648313adc1c4c534' id='type-id-600'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' hash='232fa04f890c2a5a' id='type-id-186'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' hash='d9e2f19705735211#2' id='type-id-140'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-239'/>
    <pointer-type-def type-id='type-id-601' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-443'/>
    <pointer-type-def type-id='type-id-602' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-603'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-145'/>
    <pointer-type-def type-id='type-id-604' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-605'/>
    <qualified-type-def type-id='type-id-541' volatile='yes' hash='d7bdf65d989eca0f' id='type-id-579'/>
    <pointer-type-def type-id='type-id-579' size-in-bits='64' hash='8572a8b173994baf' id='type-id-606'/>
    <qualified-type-def type-id='type-id-543' volatile='yes' hash='89bbbc5b1bf748f6' id='type-id-607'/>
    <pointer-type-def type-id='type-id-473' size-in-bits='64' hash='fb9a8c973ae04ed8' id='type-id-608'/>
    <pointer-type-def type-id='type-id-575' size-in-bits='64' id='type-id-609'/>
    <pointer-type-def type-id='type-id-455' size-in-bits='64' id='type-id-610'/>
    <namespace-decl name='std'>
      <class-decl name='nothrow_t' is-struct='yes' visibility='default' size-in-bits='8' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='108' column='1' hash='774107ffdadd3c2c' id='type-id-576'/>
    </namespace-decl>
    <namespace-decl name='__interception'>
    </namespace-decl>
    <function-decl name='__interceptor_textdomain' mangled-name='__interceptor_textdomain' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_textdomain' hash='bac6a89264ba699c'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6039' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__interceptor_strcmp' mangled-name='__interceptor_strcmp' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_strcmp' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_strncmp' mangled-name='__interceptor_strncmp' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_strncmp' hash='2f99ec08ee54ebb4'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_strcasecmp' mangled-name='__interceptor_strcasecmp' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_strcasecmp' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_strncasecmp' mangled-name='__interceptor_strncasecmp' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_strncasecmp' hash='2f99ec08ee54ebb4'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='141' column='1'/>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='141' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='141' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_frexp' mangled-name='__interceptor_frexp' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_frexp' hash='ad7941a31128189e'>
      <parameter type-id='type-id-421' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2788' column='1'/>
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2788' column='1'/>
      <return type-id='type-id-421'/>
    </function-decl>
    <function-decl name='__interceptor_frexpf' mangled-name='__interceptor_frexpf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_frexpf' hash='08eeaabf75ec666f'>
      <parameter type-id='type-id-422' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2795' column='1'/>
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2795' column='1'/>
      <return type-id='type-id-422'/>
    </function-decl>
    <function-decl name='__interceptor_frexpl' mangled-name='__interceptor_frexpl' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_frexpl' hash='789fa05bf47206ac'>
      <parameter type-id='type-id-426' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2802' column='1'/>
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2802' column='1'/>
      <return type-id='type-id-426'/>
    </function-decl>
    <function-decl name='__interceptor_read' mangled-name='__interceptor_read' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_read' hash='e1f135b405ab837f'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='316' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='316' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='316' column='1'/>
      <return type-id='type-id-454'/>
    </function-decl>
    <function-decl name='__interceptor_pread' mangled-name='__interceptor_pread' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_pread' hash='961c0ae14eb4a37c'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1'/>
      <parameter type-id='type-id-451' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1'/>
      <return type-id='type-id-454'/>
    </function-decl>
    <function-decl name='__interceptor_pread64' mangled-name='__interceptor_pread64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_pread64' hash='961c0ae14eb4a37c'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='253' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='253' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='253' column='1'/>
      <parameter type-id='type-id-450' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='253' column='1'/>
      <return type-id='type-id-454'/>
    </function-decl>
    <function-decl name='__interceptor_readv' mangled-name='__interceptor_readv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_readv' hash='c00ce4f4c2fba3a7'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='363' column='1'/>
      <parameter type-id='type-id-526' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='363' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='363' column='1'/>
      <return type-id='type-id-454'/>
    </function-decl>
    <function-decl name='__interceptor_preadv' mangled-name='__interceptor_preadv' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_preadv' hash='d054e4cac163658b'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='379' column='1'/>
      <parameter type-id='type-id-526' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='379' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='379' column='1'/>
      <parameter type-id='type-id-451' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='379' column='1'/>
      <return type-id='type-id-454'/>
    </function-decl>
    <function-decl name='__interceptor_preadv64' mangled-name='__interceptor_preadv64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_preadv64' hash='d054e4cac163658b'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='395' column='1'/>
      <parameter type-id='type-id-526' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='395' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='395' column='1'/>
      <parameter type-id='type-id-450' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='395' column='1'/>
      <return type-id='type-id-454'/>
    </function-decl>
    <function-decl name='__interceptor_write' mangled-name='__interceptor_write' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_write' hash='e1f135b405ab837f'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='316' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='316' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='316' column='1'/>
      <return type-id='type-id-454'/>
    </function-decl>
    <function-decl name='__interceptor_pwrite' mangled-name='__interceptor_pwrite' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_pwrite' hash='961c0ae14eb4a37c'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1'/>
      <parameter type-id='type-id-451' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='332' column='1'/>
      <return type-id='type-id-454'/>
    </function-decl>
    <function-decl name='__interceptor_pwrite64' mangled-name='__interceptor_pwrite64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_pwrite64' hash='6595a765a5aeeaa1'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='347' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='347' column='1'/>
      <parameter type-id='type-id-450' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='347' column='1'/>
      <parameter type-id='type-id-450' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='347' column='1'/>
      <return type-id='type-id-454'/>
    </function-decl>
    <function-decl name='__interceptor_writev' mangled-name='__interceptor_writev' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_writev' hash='c00ce4f4c2fba3a7'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='363' column='1'/>
      <parameter type-id='type-id-526' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='363' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='363' column='1'/>
      <return type-id='type-id-454'/>
    </function-decl>
    <function-decl name='__interceptor_pwritev' mangled-name='__interceptor_pwritev' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='379' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_pwritev' hash='d054e4cac163658b'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='379' column='1'/>
      <parameter type-id='type-id-526' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='379' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='379' column='1'/>
      <parameter type-id='type-id-451' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='379' column='1'/>
      <return type-id='type-id-454'/>
    </function-decl>
    <function-decl name='__interceptor_pwritev64' mangled-name='__interceptor_pwritev64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_pwritev64' hash='d054e4cac163658b'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='395' column='1'/>
      <parameter type-id='type-id-526' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='395' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='395' column='1'/>
      <parameter type-id='type-id-450' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='395' column='1'/>
      <return type-id='type-id-454'/>
    </function-decl>
    <function-decl name='__interceptor_prctl' mangled-name='__interceptor_prctl' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_prctl' hash='896e8a430ed88a60'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='411' column='1'/>
      <parameter type-id='type-id-1' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='411' column='1'/>
      <parameter type-id='type-id-1' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='411' column='1'/>
      <parameter type-id='type-id-1' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='411' column='1'/>
      <parameter type-id='type-id-1' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='411' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_time' mangled-name='__interceptor_time' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_time' hash='467af628bb237122'>
      <parameter type-id='type-id-140' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='432' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__interceptor_localtime' mangled-name='__interceptor_localtime' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_localtime' hash='374b241f53d81ab8'>
      <parameter type-id='type-id-140' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='476' column='1'/>
      <return type-id='type-id-538'/>
    </function-decl>
    <function-decl name='__interceptor_localtime_r' mangled-name='__interceptor_localtime_r' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_localtime_r' hash='374b241f53d81ab8'>
      <parameter type-id='type-id-140' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='486' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='486' column='1'/>
      <return type-id='type-id-538'/>
    </function-decl>
    <function-decl name='__interceptor_gmtime' mangled-name='__interceptor_gmtime' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_gmtime' hash='374b241f53d81ab8'>
      <parameter type-id='type-id-140' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='476' column='1'/>
      <return type-id='type-id-538'/>
    </function-decl>
    <function-decl name='__interceptor_gmtime_r' mangled-name='__interceptor_gmtime_r' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='486' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_gmtime_r' hash='374b241f53d81ab8'>
      <parameter type-id='type-id-140' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='486' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='486' column='1'/>
      <return type-id='type-id-538'/>
    </function-decl>
    <function-decl name='__interceptor_ctime' mangled-name='__interceptor_ctime' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_ctime' hash='070e1dd79ce7b6a7'>
      <parameter type-id='type-id-140' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='496' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__interceptor_ctime_r' mangled-name='__interceptor_ctime_r' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='506' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_ctime_r' hash='80ebee60fc8f9939'>
      <parameter type-id='type-id-140' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='506' column='1'/>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='506' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__interceptor_asctime' mangled-name='__interceptor_asctime' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='516' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_asctime' hash='fb1d7077d9268eda'>
      <parameter type-id='type-id-538' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='516' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__interceptor_asctime_r' mangled-name='__interceptor_asctime_r' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='526' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_asctime_r' hash='5b338c4d2207651d'>
      <parameter type-id='type-id-538' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='526' column='1'/>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='526' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__interceptor_strptime' mangled-name='__interceptor_strptime' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='550' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_strptime' hash='c699f77535ce1819'>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='550' column='1'/>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='550' column='1'/>
      <parameter type-id='type-id-538' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='550' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__interceptor_vscanf' mangled-name='__interceptor_vscanf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='587' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_vscanf' hash='09869f0b6b21fd13'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='597' column='1'/>
      <parameter type-id='type-id-600' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='597' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_vsscanf' mangled-name='__interceptor_vsscanf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_vsscanf' hash='0aa4065f8c3f2710'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='600' column='1'/>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='600' column='1'/>
      <parameter type-id='type-id-600' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='600' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_vfscanf' mangled-name='__interceptor_vfscanf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='593' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_vfscanf' hash='09869f0b6b21fd13'>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='604' column='1'/>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='604' column='1'/>
      <parameter type-id='type-id-600' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='604' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor___isoc99_vscanf' mangled-name='__interceptor___isoc99_vscanf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor___isoc99_vscanf' hash='09869f0b6b21fd13'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='597' column='1'/>
      <parameter type-id='type-id-600' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='597' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor___isoc99_vsscanf' mangled-name='__interceptor___isoc99_vsscanf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='600' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor___isoc99_vsscanf' hash='0aa4065f8c3f2710'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='600' column='1'/>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='600' column='1'/>
      <parameter type-id='type-id-600' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='600' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor___isoc99_vfscanf' mangled-name='__interceptor___isoc99_vfscanf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='604' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor___isoc99_vfscanf' hash='09869f0b6b21fd13'>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='604' column='1'/>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='604' column='1'/>
      <parameter type-id='type-id-600' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='604' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_scanf' mangled-name='__interceptor_scanf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='619' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_scanf' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='629' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_fscanf' mangled-name='__interceptor_fscanf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_fscanf' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='632' column='1'/>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='632' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_sscanf' mangled-name='__interceptor_sscanf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='625' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_sscanf' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor___isoc99_scanf' mangled-name='__interceptor___isoc99_scanf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='629' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor___isoc99_scanf' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='629' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor___isoc99_fscanf' mangled-name='__interceptor___isoc99_fscanf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='632' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor___isoc99_fscanf' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='632' column='1'/>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='632' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor___isoc99_sscanf' mangled-name='__interceptor___isoc99_sscanf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='635' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor___isoc99_sscanf' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_ioctl' mangled-name='__interceptor_ioctl' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_ioctl' hash='87b255596f349675'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='667' column='1'/>
      <parameter type-id='type-id-180' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='667' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='667' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_clock_getres' mangled-name='__interceptor_clock_getres' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='790' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_clock_getres' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-242' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='808' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='808' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_clock_gettime' mangled-name='__interceptor_clock_gettime' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='799' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_clock_gettime' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-242' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='808' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='808' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_clock_settime' mangled-name='__interceptor_clock_settime' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='808' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_clock_settime' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-242' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='808' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='808' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_getitimer' mangled-name='__interceptor_getitimer' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='823' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_getitimer' hash='d628501fd2223339'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2416' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2416' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_setitimer' mangled-name='__interceptor_setitimer' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='832' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_setitimer' hash='d628501fd2223339'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='832' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='832' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='832' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_wait' mangled-name='__interceptor_wait' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_wait' hash='2bb270506719bb4b'>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_waitid' mangled-name='__interceptor_waitid' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='976' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_waitid' hash='a3e40634f2a60824'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='976' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='976' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='976' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='976' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_waitpid' mangled-name='__interceptor_waitpid' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='985' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_waitpid' hash='1cac1fbad1227152'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='985' column='1'/>
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='985' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='985' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_wait3' mangled-name='__interceptor_wait3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='993' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_wait3' hash='d5a833aba721ca51'>
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='993' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='993' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='993' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_wait4' mangled-name='__interceptor_wait4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_wait4' hash='1cac1fbad1227152'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1003' column='1'/>
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1003' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1003' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1003' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_inet_ntop' mangled-name='__interceptor_inet_ntop' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1024' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_inet_ntop' hash='0ffc7f641c85afcc'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1024' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1024' column='1'/>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1024' column='1'/>
      <parameter type-id='type-id-242' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1024' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__interceptor_inet_pton' mangled-name='__interceptor_inet_pton' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1034' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_inet_pton' hash='e4623ae51caf7651'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1034' column='1'/>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1034' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1034' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_inet_aton' mangled-name='__interceptor_inet_aton' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1053' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_inet_aton' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1053' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1053' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_pthread_getschedparam' mangled-name='__interceptor_pthread_getschedparam' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1070' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_pthread_getschedparam' hash='b527b25539cc6fcb'>
      <parameter type-id='type-id-87' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1070' column='1'/>
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1070' column='1'/>
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1070' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_getsockname' mangled-name='__interceptor_getsockname' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_getsockname' hash='72112b17e1d575e7'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1142' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1142' column='1'/>
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1142' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_gethostbyname' mangled-name='__interceptor_gethostbyname' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_gethostbyname' hash='67dceabe4bf36ee9'>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1181' column='1'/>
      <return type-id='type-id-518'/>
    </function-decl>
    <function-decl name='__interceptor_gethostbyaddr' mangled-name='__interceptor_gethostbyaddr' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_gethostbyaddr' hash='4129031cb32d0173'>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1189' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1189' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1189' column='1'/>
      <return type-id='type-id-518'/>
    </function-decl>
    <function-decl name='__interceptor_gethostent' mangled-name='__interceptor_gethostent' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_gethostent' hash='f5874c0160d3c1b6'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1199' column='1'/>
      <return type-id='type-id-518'/>
    </function-decl>
    <function-decl name='__interceptor_gethostbyname2' mangled-name='__interceptor_gethostbyname2' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_gethostbyname2' hash='4546acfeaa1e7af3'>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1207' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1207' column='1'/>
      <return type-id='type-id-518'/>
    </function-decl>
    <function-decl name='__interceptor_gethostent_r' mangled-name='__interceptor_gethostent_r' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_gethostent_r' hash='366273185adf53c1'>
      <parameter type-id='type-id-518' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1224' column='1'/>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1224' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1224' column='1'/>
      <parameter type-id='type-id-519' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1224' column='1'/>
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1224' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_gethostbyaddr_r' mangled-name='__interceptor_gethostbyaddr_r' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_gethostbyaddr_r' hash='ef5b2d39e809790f'>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1241' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1241' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1241' column='1'/>
      <parameter type-id='type-id-518' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1241' column='1'/>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1241' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1241' column='1'/>
      <parameter type-id='type-id-519' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1241' column='1'/>
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1241' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_gethostbyname_r' mangled-name='__interceptor_gethostbyname_r' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_gethostbyname_r' hash='b52366fb3987a415'>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1261' column='1'/>
      <parameter type-id='type-id-518' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1261' column='1'/>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1261' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1261' column='1'/>
      <parameter type-id='type-id-519' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1261' column='1'/>
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1261' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_gethostbyname2_r' mangled-name='__interceptor_gethostbyname2_r' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_gethostbyname2_r' hash='da644c21d6b421ac'>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1279' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1279' column='1'/>
      <parameter type-id='type-id-518' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1279' column='1'/>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1279' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1279' column='1'/>
      <parameter type-id='type-id-519' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1279' column='1'/>
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1279' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_getsockopt' mangled-name='__interceptor_getsockopt' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1307' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_getsockopt' hash='af12d4e65bb3efea'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1307' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1307' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1307' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1307' column='1'/>
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1307' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_accept' mangled-name='__interceptor_accept' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1324' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_accept' hash='3f603a64f26323a2'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1437' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1437' column='1'/>
      <parameter type-id='type-id-186' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1437' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_accept4' mangled-name='__interceptor_accept4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_accept4' hash='e35319b40c26c5ff'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1346' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1346' column='1'/>
      <parameter type-id='type-id-186' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1346' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1346' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_modf' mangled-name='__interceptor_modf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_modf' hash='8fa4f4105be136d3'>
      <parameter type-id='type-id-421' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1368' column='1'/>
      <parameter type-id='type-id-585' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1368' column='1'/>
      <return type-id='type-id-421'/>
    </function-decl>
    <function-decl name='__interceptor_modff' mangled-name='__interceptor_modff' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_modff' hash='0d794111c5cabee9'>
      <parameter type-id='type-id-422' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1377' column='1'/>
      <parameter type-id='type-id-586' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1377' column='1'/>
      <return type-id='type-id-422'/>
    </function-decl>
    <function-decl name='__interceptor_modfl' mangled-name='__interceptor_modfl' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_modfl' hash='fb094be880066da7'>
      <parameter type-id='type-id-426' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1386' column='1'/>
      <parameter type-id='type-id-593' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1386' column='1'/>
      <return type-id='type-id-426'/>
    </function-decl>
    <function-decl name='__interceptor_recvmsg' mangled-name='__interceptor_recvmsg' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1417' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_recvmsg' hash='80ac8558c64caafa'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1417' column='1'/>
      <parameter type-id='type-id-531' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1417' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1417' column='1'/>
      <return type-id='type-id-454'/>
    </function-decl>
    <function-decl name='__interceptor_getpeername' mangled-name='__interceptor_getpeername' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_getpeername' hash='3f603a64f26323a2'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1437' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1437' column='1'/>
      <parameter type-id='type-id-186' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1437' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_sysinfo' mangled-name='__interceptor_sysinfo' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1453' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_sysinfo' hash='388da3fa973fde78'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_readdir' mangled-name='__interceptor_readdir' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_readdir' hash='d6dcd74053e87f3f'>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1467' column='1'/>
      <return type-id='type-id-508'/>
    </function-decl>
    <function-decl name='__interceptor_readdir_r' mangled-name='__interceptor_readdir_r' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1475' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_readdir_r' hash='84782e1850a82299'>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1475' column='1'/>
      <parameter type-id='type-id-508' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1475' column='1'/>
      <parameter type-id='type-id-509' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1475' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_readdir64' mangled-name='__interceptor_readdir64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_readdir64' hash='7b88e2f711a08a83'>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1496' column='1'/>
      <return type-id='type-id-512'/>
    </function-decl>
    <function-decl name='__interceptor_readdir64_r' mangled-name='__interceptor_readdir64_r' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1504' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_readdir64_r' hash='be2f39fbd7fed098'>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1504' column='1'/>
      <parameter type-id='type-id-512' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1504' column='1'/>
      <parameter type-id='type-id-513' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1504' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_ptrace' mangled-name='__interceptor_ptrace' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1524' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_ptrace' hash='1e949f3c644a4645'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='__interceptor_setlocale' mangled-name='__interceptor_setlocale' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1570' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_setlocale' hash='dc6ec5e01f333653'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1570' column='1'/>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1570' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__interceptor_getcwd' mangled-name='__interceptor_getcwd' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1586' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_getcwd' hash='8d96ff9a88b5c973'>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1586' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1586' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__interceptor_get_current_dir_name' mangled-name='__interceptor_get_current_dir_name' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_get_current_dir_name' hash='64137bddd2d8bd37'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1833' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__interceptor_strtoimax' mangled-name='__interceptor_strtoimax' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1614' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_strtoimax' hash='24058e744113e8b7'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1622' column='1'/>
      <parameter type-id='type-id-546' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1622' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1622' column='1'/>
      <return type-id='type-id-448'/>
    </function-decl>
    <function-decl name='__interceptor_strtoumax' mangled-name='__interceptor_strtoumax' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_strtoumax' hash='24058e744113e8b7'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1622' column='1'/>
      <parameter type-id='type-id-546' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1622' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1622' column='1'/>
      <return type-id='type-id-448'/>
    </function-decl>
    <function-decl name='__interceptor_mbstowcs' mangled-name='__interceptor_mbstowcs' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1638' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_mbstowcs' hash='8d629461b13fa333'>
      <parameter type-id='type-id-608' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1638' column='1'/>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1638' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1638' column='1'/>
      <return type-id='type-id-452'/>
    </function-decl>
    <function-decl name='__interceptor_mbsrtowcs' mangled-name='__interceptor_mbsrtowcs' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1649' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_mbsrtowcs' hash='a70f509e031416ad'>
      <parameter type-id='type-id-608' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1649' column='1'/>
      <parameter type-id='type-id-397' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1649' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1649' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1649' column='1'/>
      <return type-id='type-id-452'/>
    </function-decl>
    <function-decl name='__interceptor_mbsnrtowcs' mangled-name='__interceptor_mbsnrtowcs' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1673' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_mbsnrtowcs' hash='044760f979ea79ab'>
      <parameter type-id='type-id-608' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1673' column='1'/>
      <parameter type-id='type-id-397' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1673' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1673' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1673' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1673' column='1'/>
      <return type-id='type-id-452'/>
    </function-decl>
    <function-decl name='__interceptor_wcstombs' mangled-name='__interceptor_wcstombs' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_wcstombs' hash='ab4f61ad5338dd93'>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1696' column='1'/>
      <parameter type-id='type-id-583' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1696' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1696' column='1'/>
      <return type-id='type-id-452'/>
    </function-decl>
    <function-decl name='__interceptor_wcsrtombs' mangled-name='__interceptor_wcsrtombs' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1707' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_wcsrtombs' hash='e37c224c75377efb'>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1707' column='1'/>
      <parameter type-id='type-id-584' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1707' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1707' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1707' column='1'/>
      <return type-id='type-id-452'/>
    </function-decl>
    <function-decl name='__interceptor_wcsnrtombs' mangled-name='__interceptor_wcsnrtombs' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1729' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_wcsnrtombs' hash='47aeb3bfe7188d28'>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1729' column='1'/>
      <parameter type-id='type-id-584' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1729' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1729' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1729' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1729' column='1'/>
      <return type-id='type-id-452'/>
    </function-decl>
    <function-decl name='__interceptor_tcgetattr' mangled-name='__interceptor_tcgetattr' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_tcgetattr' hash='d628501fd2223339'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2416' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2416' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_realpath' mangled-name='__interceptor_realpath' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1767' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_realpath' hash='fff89543bf970ed5'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1767' column='1'/>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1767' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__interceptor_canonicalize_file_name' mangled-name='__interceptor_canonicalize_file_name' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1791' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_canonicalize_file_name' hash='bac6a89264ba699c'>
      <parameter type-id='type-id-4' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6039' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__interceptor_confstr' mangled-name='__interceptor_confstr' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1806' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_confstr' hash='d4630893dd773bfd'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1806' column='1'/>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1806' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1806' column='1'/>
      <return type-id='type-id-452'/>
    </function-decl>
    <function-decl name='__interceptor_sched_getaffinity' mangled-name='__interceptor_sched_getaffinity' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_sched_getaffinity' hash='b03aa5f98a3a1499'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1820' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1820' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1820' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_strerror' mangled-name='__interceptor_strerror' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1833' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_strerror' hash='64137bddd2d8bd37'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1833' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__interceptor_strerror_r' mangled-name='__interceptor_strerror_r' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1846' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_strerror_r' hash='e35b645a954e3a02'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1846' column='1'/>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1846' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1846' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__interceptor___xpg_strerror_r' mangled-name='__interceptor___xpg_strerror_r' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor___xpg_strerror_r' hash='6c170ffb8f9786e8'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1874' column='1'/>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1874' column='1'/>
      <parameter type-id='type-id-452' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1874' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_scandir' mangled-name='__interceptor_scandir' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1913' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_scandir' hash='8846f507cfd545ec'>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1913' column='1'/>
      <parameter type-id='type-id-510' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1913' column='1'/>
      <parameter type-id='type-id-464' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1913' column='1'/>
      <parameter type-id='type-id-462' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1913' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_scandir64' mangled-name='__interceptor_scandir64' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1966' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_scandir64' hash='b245b442d90efebb'>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1966' column='1'/>
      <parameter type-id='type-id-514' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1966' column='1'/>
      <parameter type-id='type-id-460' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1966' column='1'/>
      <parameter type-id='type-id-458' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1966' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_getgroups' mangled-name='__interceptor_getgroups' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1996' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_getgroups' hash='f85a8582ad664caa'>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1996' column='1'/>
      <parameter type-id='type-id-545' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1996' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_poll' mangled-name='__interceptor_poll' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2024' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_poll' hash='f7bdb323c203b49f'>
      <parameter type-id='type-id-535' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2024' column='1'/>
      <parameter type-id='type-id-611' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2024' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2024' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_ppoll' mangled-name='__interceptor_ppoll' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2039' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_ppoll' hash='60ec06e43329185c'>
      <parameter type-id='type-id-535' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2039' column='1'/>
      <parameter type-id='type-id-611' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2039' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2039' column='1'/>
      <parameter type-id='type-id-536' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2039' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_wordexp' mangled-name='__interceptor_wordexp' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2058' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_wordexp' hash='c0d10395253173f3'>
      <parameter type-id='type-id-28' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2058' column='1'/>
      <parameter type-id='type-id-540' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2058' column='1'/>
      <parameter type-id='type-id-6' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2058' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_sigwait' mangled-name='__interceptor_sigwait' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2081' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_sigwait' hash='244375d511e83c61'>
      <parameter type-id='type-id-536' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2081' column='1'/>
      <parameter type-id='type-id-38' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2081' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_sigwaitinfo' mangled-name='__interceptor_sigwaitinfo' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2095' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_sigwaitinfo' hash='7c2d9a90d4552034'>
      <parameter type-id='type-id-536' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2095' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2095' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_sigtimedwait' mangled-name='__interceptor_sigtimedwait' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_sigtimedwait' hash='7c2d9a90d4552034'>
      <parameter type-id='type-id-536' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2109' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2109' column='1'/>
      <parameter type-id='type-id-3' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2109' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_sigemptyset' mangled-name='__interceptor_sigemptyset' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_sigemptyset' hash='7c2d9a90d4552034'>
      <parameter type-id='type-id-536' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2148' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_sigfillset' mangled-name='__interceptor_sigfillset' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_sigfillset' hash='7c2d9a90d4552034'>
      <parameter type-id='type-id-536' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2148' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__interceptor_sigpending' mangled-name='__interceptor_sigpending' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__interceptor_sigpending' hash='7c2d9a90d4552034'>
      <parameter type-id='type-id-536' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='2148' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
