<abi-corpus version='2.4' soname='libtcmalloc_and_profiler.so.4'>
  <elf-needed>
    <dependency name='libunwind.so.8'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='GetHeapProfile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='HeapProfilerDump' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='HeapProfilerStart' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='HeapProfilerStop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='IsHeapProfilerRunning' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='MallocExtension_GetAllocatedSize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='MallocExtension_GetEstimatedAllocatedSize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZTS16MmapSysAllocator' size='19' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS16SbrkSysAllocator' size='19' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS18DevMemSysAllocator' size='21' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS19DefaultSysAllocator' size='22' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS19HugetlbSysAllocator' size='22' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS22TCMallocImplementation' size='25' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV12SysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV15MallocExtension' size='232' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV16MmapSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV16SbrkSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV18DevMemSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19DefaultSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19HugetlbSysAllocator' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV22TCMallocImplementation' size='232' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE13kPageHeapType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE14kLargeSpanType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE16kThreadCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE17kCentralCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE18kTransferCacheType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE21kPageHeapUnmappedType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZZN22TCMallocImplementation16GetFreeListSizesEPSt6vectorIN15MallocExtension12FreeListInfoESaIS2_EEE22kLargeUnmappedSpanType' size='8' type='object-type' binding='gnu-unique-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__free_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__malloc_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__memalign_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__realloc_hook' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='heap_leak_checker_bcad_variable' size='1' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='sys_alloc' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/base/atomicops-internals-x86.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/dynamic_annotations.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C89'>
    <function-decl name='RunningOnValgrind' mangled-name='RunningOnValgrind' filepath='src/base/dynamic_annotations.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='RunningOnValgrind' hash='388da3fa973fde78'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ValgrindSlowdown' mangled-name='ValgrindSlowdown' filepath='src/base/dynamic_annotations.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ValgrindSlowdown' hash='14e245f4052d89de'>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/elf_mem_image.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <class-decl name='Elf64_Ehdr' is-struct='yes' visibility='default' size-in-bits='512' filepath='/usr/include/elf.h' line='88' column='1' hash='b8444b3606110e44' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='e_ident' type-id='type-id-4' visibility='default' filepath='/usr/include/elf.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='e_type' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='e_machine' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='e_version' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='e_entry' type-id='type-id-7' visibility='default' filepath='/usr/include/elf.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='e_phoff' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='e_shoff' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='e_flags' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='e_ehsize' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='e_phentsize' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='e_phnum' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='e_shentsize' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='e_shnum' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='496'>
        <var-decl name='e_shstrndx' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Phdr' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/include/elf.h' line='551' column='1' hash='4b4898b4e81729f5' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_type' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='p_flags' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_offset' type-id='type-id-8' visibility='default' filepath='/usr/include/elf.h' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_vaddr' type-id='type-id-7' visibility='default' filepath='/usr/include/elf.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='p_paddr' type-id='type-id-7' visibility='default' filepath='/usr/include/elf.h' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_filesz' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='p_memsz' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='p_align' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='559' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Sym' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/elf.h' line='389' column='1' hash='59d1917446b00c8f' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_name' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='st_info' type-id='type-id-12' visibility='default' filepath='/usr/include/elf.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='st_other' type-id='type-id-12' visibility='default' filepath='/usr/include/elf.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='st_shndx' type-id='type-id-13' visibility='default' filepath='/usr/include/elf.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_value' type-id='type-id-7' visibility='default' filepath='/usr/include/elf.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_size' type-id='type-id-10' visibility='default' filepath='/usr/include/elf.h' line='395' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Verdaux' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/include/elf.h' line='849' column='1' hash='df0b1edc7130741e' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vda_name' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='850' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vda_next' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='851' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Verdef' is-struct='yes' visibility='default' size-in-bits='160' filepath='/usr/include/elf.h' line='812' column='1' hash='77561b1a99135bd1' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vd_version' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='vd_flags' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vd_ndx' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='vd_cnt' type-id='type-id-5' visibility='default' filepath='/usr/include/elf.h' line='816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vd_hash' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='vd_aux' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='818' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vd_next' type-id='type-id-6' visibility='default' filepath='/usr/include/elf.h' line='819' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Elf64_Addr' type-id='type-id-16' size-in-bits='64' filepath='/usr/include/elf.h' line='50' column='1' hash='8fdc5eea2983a729' id='type-id-7'/>
    <typedef-decl name='Elf64_Half' type-id='type-id-17' size-in-bits='16' filepath='/usr/include/elf.h' line='34' column='1' hash='d7723bb93a30b11d' id='type-id-5'/>
    <typedef-decl name='Elf64_Off' type-id='type-id-16' size-in-bits='64' filepath='/usr/include/elf.h' line='54' column='1' hash='8fdc5eea2983a729' id='type-id-8'/>
    <typedef-decl name='Elf64_Section' type-id='type-id-17' size-in-bits='16' filepath='/usr/include/elf.h' line='58' column='1' hash='d7723bb93a30b11d' id='type-id-13'/>
    <typedef-decl name='Elf64_Versym' type-id='type-id-5' size-in-bits='16' filepath='/usr/include/elf.h' line='62' column='1' hash='d7723bb93a30b11d' id='type-id-18'/>
    <typedef-decl name='Elf64_Word' type-id='type-id-19' size-in-bits='32' filepath='/usr/include/elf.h' line='39' column='1' hash='e66b43f97c38e87a' id='type-id-6'/>
    <typedef-decl name='Elf64_Xword' type-id='type-id-16' size-in-bits='64' filepath='/usr/include/elf.h' line='45' column='1' hash='8fdc5eea2983a729' id='type-id-10'/>
    <typedef-decl name='uint16_t' type-id='type-id-20' size-in-bits='16' filepath='/usr/include/stdint.h' line='50' column='1' hash='d7723bb93a30b11d' id='type-id-17'/>
    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='128' hash='db96c40792853cfe' id='type-id-4'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-22'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' hash='1e56033bc929c937' id='type-id-24'/>
    <qualified-type-def type-id='type-id-24' const='yes' hash='f1b7844269f07355' id='type-id-25'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' hash='c661d6d612749156' id='type-id-27'/>
    <reference-type-def kind='lvalue' type-id='type-id-28' size-in-bits='64' hash='8b6e5057d6b5677d' id='type-id-29'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' hash='635526182f95463f' id='type-id-30'/>
    <qualified-type-def type-id='type-id-30' const='yes' hash='186b418ac290dd1e' id='type-id-31'/>
    <qualified-type-def type-id='type-id-3' const='yes' hash='14748f303e55779d' id='type-id-32'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' hash='59489a54900ba47f' id='type-id-33'/>
    <qualified-type-def type-id='type-id-9' const='yes' hash='51611f98abc3863c' id='type-id-34'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' hash='d7f46a025d7f7c6d' id='type-id-35'/>
    <qualified-type-def type-id='type-id-11' const='yes' hash='f86c8f4238204abd' id='type-id-36'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' hash='bb500a4acf88d8ae' id='type-id-37'/>
    <qualified-type-def type-id='type-id-14' const='yes' hash='3122248828a85ad6' id='type-id-38'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' hash='a8ce44e51dd263b5' id='type-id-39'/>
    <qualified-type-def type-id='type-id-15' const='yes' hash='9213bfaf32811abc' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' hash='0b792ee854dc0a3d' id='type-id-41'/>
    <qualified-type-def type-id='type-id-18' const='yes' hash='6b03cd1b2e9f59d2' id='type-id-42'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' hash='f7c6974d4513ad7a' id='type-id-43'/>
    <qualified-type-def type-id='type-id-6' const='yes' hash='c64c1cc1c357abd4' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' hash='dac049f837fbb92d' id='type-id-45'/>
    <qualified-type-def type-id='type-id-23' const='yes' hash='27cfb399ca2a9740' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' hash='289d86e4e6d3ba90' id='type-id-47'/>
    <qualified-type-def type-id='type-id-47' const='yes' hash='5f483868ab6482f6' id='type-id-48'/>
    <qualified-type-def type-id='type-id-26' const='yes' hash='582c37401cca44e8' id='type-id-49'/>
    <reference-type-def kind='lvalue' type-id='type-id-49' size-in-bits='64' hash='2019f0f21fb97678' id='type-id-50'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' hash='5f8c35f8fe44aeea' id='type-id-51'/>
    <qualified-type-def type-id='type-id-28' const='yes' hash='6b9dbc64c2dabfef' id='type-id-52'/>
    <reference-type-def kind='lvalue' type-id='type-id-52' size-in-bits='64' hash='0251d0dc239aaf4e' id='type-id-53'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' hash='4042f591ef3d8b00' id='type-id-54'/>
    <qualified-type-def type-id='type-id-54' const='yes' hash='37778b6ac0e06145' id='type-id-55'/>
    <qualified-type-def type-id='type-id-56' const='yes' id='type-id-57'/>
    <namespace-decl name='base'>
      <class-decl name='ElfMemImage' visibility='default' size-in-bits='576' filepath='./src/base/elf_mem_image.h' line='56' column='1' hash='434e64cbebe51257#2' id='type-id-23'>
        <member-type access='private'>
          <class-decl name='SymbolIterator' visibility='default' size-in-bits='384' filepath='./src/base/elf_mem_image.h' line='73' column='1' hash='be3efe276e58a8dd' id='type-id-28'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='info_' type-id='type-id-26' visibility='default' filepath='./src/base/elf_mem_image.h' line='84' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='256'>
              <var-decl name='index_' type-id='type-id-1' visibility='default' filepath='./src/base/elf_mem_image.h' line='85' column='1'/>
            </data-member>
            <data-member access='private' layout-offset-in-bits='320'>
              <var-decl name='image_' type-id='type-id-57' visibility='default' filepath='./src/base/elf_mem_image.h' line='86' column='1'/>
            </data-member>
            <member-function access='private' constructor='yes'>
              <function-decl name='SymbolIterator' mangled-name='_ZN4base11ElfMemImage14SymbolIteratorC2EPKvi' filepath='src/base/elf_mem_image.cc' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIteratorC2EPKvi' hash='388da3fa973fde78'>
                <parameter type-id='type-id-30' is-artificial='yes'/>
                <parameter type-id='type-id-57' filepath='src/base/elf_mem_image.cc' line='358' column='1'/>
                <parameter type-id='type-id-1' filepath='src/base/elf_mem_image.cc' line='358' column='1'/>
                <return type-id='type-id-58'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator-&gt;' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratorptEv' filepath='src/base/elf_mem_image.cc' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratorptEv' hash='e9a84514e205fbc5'>
                <parameter type-id='type-id-54' is-artificial='yes'/>
                <return type-id='type-id-51'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator*' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratordeEv' filepath='src/base/elf_mem_image.cc' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratordeEv' hash='47bdb57ada052f30'>
                <parameter type-id='type-id-54' is-artificial='yes'/>
                <return type-id='type-id-50'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator==' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratoreqERKS1_' filepath='src/base/elf_mem_image.cc' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratoreqERKS1_' hash='c1dcd64da70beccd'>
                <parameter type-id='type-id-54' is-artificial='yes'/>
                <parameter type-id='type-id-53'/>
                <return type-id='type-id-59'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator!=' mangled-name='_ZNK4base11ElfMemImage14SymbolIteratorneERKS1_' filepath='src/base/elf_mem_image.cc' line='374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage14SymbolIteratorneERKS1_' hash='c1dcd64da70beccd'>
                <parameter type-id='type-id-54' is-artificial='yes'/>
                <parameter type-id='type-id-53'/>
                <return type-id='type-id-59'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='Update' mangled-name='_ZN4base11ElfMemImage14SymbolIterator6UpdateEi' filepath='src/base/elf_mem_image.cc' line='393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIterator6UpdateEi' hash='388da3fa973fde78'>
                <parameter type-id='type-id-30' is-artificial='yes'/>
                <parameter type-id='type-id-1'/>
                <return type-id='type-id-58'/>
              </function-decl>
            </member-function>
            <member-function access='private'>
              <function-decl name='operator++' mangled-name='_ZN4base11ElfMemImage14SymbolIteratorppEv' filepath='src/base/elf_mem_image.cc' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage14SymbolIteratorppEv' hash='62b99d6f5f9ef80a'>
                <parameter type-id='type-id-30' is-artificial='yes'/>
                <return type-id='type-id-29'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='SymbolInfo' is-struct='yes' visibility='default' size-in-bits='256' filepath='./src/base/elf_mem_image.h' line='64' column='1' hash='188c20ff50814f74' id='type-id-26'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='name' type-id='type-id-60' visibility='default' filepath='./src/base/elf_mem_image.h' line='65' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='version' type-id='type-id-60' visibility='default' filepath='./src/base/elf_mem_image.h' line='66' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='address' type-id='type-id-56' visibility='default' filepath='./src/base/elf_mem_image.h' line='68' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='symbol' type-id='type-id-37' visibility='default' filepath='./src/base/elf_mem_image.h' line='69' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='kInvalidBase' type-id='type-id-57' mangled-name='_ZN4base11ElfMemImage12kInvalidBaseE' visibility='default' filepath='src/base/elf_mem_image.cc' line='111' column='1' elf-symbol-id='_ZN4base11ElfMemImage12kInvalidBaseE'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='ehdr_' type-id='type-id-33' visibility='default' filepath='./src/base/elf_mem_image.h' line='120' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='dynsym_' type-id='type-id-37' visibility='default' filepath='./src/base/elf_mem_image.h' line='121' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='versym_' type-id='type-id-43' visibility='default' filepath='./src/base/elf_mem_image.h' line='122' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='verdef_' type-id='type-id-41' visibility='default' filepath='./src/base/elf_mem_image.h' line='123' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='hash_' type-id='type-id-45' visibility='default' filepath='./src/base/elf_mem_image.h' line='124' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='320'>
          <var-decl name='dynstr_' type-id='type-id-60' visibility='default' filepath='./src/base/elf_mem_image.h' line='125' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='384'>
          <var-decl name='strsize_' type-id='type-id-61' visibility='default' filepath='./src/base/elf_mem_image.h' line='126' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='448'>
          <var-decl name='verdefnum_' type-id='type-id-61' visibility='default' filepath='./src/base/elf_mem_image.h' line='127' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='512'>
          <var-decl name='link_base_' type-id='type-id-7' visibility='default' filepath='./src/base/elf_mem_image.h' line='128' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='GetNumSymbols' mangled-name='_ZNK4base11ElfMemImage13GetNumSymbolsEv' filepath='src/base/elf_mem_image.cc' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage13GetNumSymbolsEv' hash='388da3fa973fde78'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerdefAux' mangled-name='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef' filepath='src/base/elf_mem_image.cc' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef' hash='19f69f6f7c219776'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-41'/>
            <return type-id='type-id-39'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='end' mangled-name='_ZNK4base11ElfMemImage3endEv' filepath='src/base/elf_mem_image.cc' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage3endEv' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <return type-id='type-id-28'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerstr' mangled-name='_ZNK4base11ElfMemImage9GetVerstrEj' filepath='src/base/elf_mem_image.cc' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerstrEj' hash='cf5212e813271279'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-6'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerdef' mangled-name='_ZNK4base11ElfMemImage9GetVerdefEi' filepath='src/base/elf_mem_image.cc' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerdefEi' hash='c6a2702b6944e5b2'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-1'/>
            <return type-id='type-id-41'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetSymAddr' mangled-name='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym' filepath='src/base/elf_mem_image.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym' hash='2685c9e30f0e9c0a'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-37'/>
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetDynstr' mangled-name='_ZNK4base11ElfMemImage9GetDynstrEj' filepath='src/base/elf_mem_image.cc' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynstrEj' hash='cf5212e813271279'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-6'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetPhdr' mangled-name='_ZNK4base11ElfMemImage7GetPhdrEi' filepath='src/base/elf_mem_image.cc' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage7GetPhdrEi' hash='347de63754287c77'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-1'/>
            <return type-id='type-id-35'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='Init' mangled-name='_ZN4base11ElfMemImage4InitEPKv' filepath='src/base/elf_mem_image.cc' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage4InitEPKv' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-24' is-artificial='yes'/>
            <parameter type-id='type-id-56'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='ElfMemImage' mangled-name='_ZN4base11ElfMemImageC1EPKv' filepath='src/base/elf_mem_image.cc' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImageC1EPKv' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-24' is-artificial='yes'/>
            <parameter type-id='type-id-56'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVersym' mangled-name='_ZNK4base11ElfMemImage9GetVersymEi' filepath='src/base/elf_mem_image.cc' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVersymEi' hash='ad58fd7867afcd7f'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-1'/>
            <return type-id='type-id-43'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetDynsym' mangled-name='_ZNK4base11ElfMemImage9GetDynsymEi' filepath='src/base/elf_mem_image.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynsymEi' hash='3f9d161fff24d853'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-1'/>
            <return type-id='type-id-37'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='begin' mangled-name='_ZNK4base11ElfMemImage5beginEv' filepath='src/base/elf_mem_image.cc' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage5beginEv' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <return type-id='type-id-28'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE' filepath='src/base/elf_mem_image.cc' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE' hash='b897a0ddbd63cce5'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-56'/>
            <parameter type-id='type-id-27'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE' filepath='src/base/elf_mem_image.cc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE' hash='d055b32b0e2d828c'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-60'/>
            <parameter type-id='type-id-60'/>
            <parameter type-id='type-id-1'/>
            <parameter type-id='type-id-27'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-62'>
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <return type-id='type-id-28'/>
    </function-type>
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='d055b32b0e2d828c' id='type-id-63'>
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-59'/>
    </function-type>
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='b897a0ddbd63cce5' id='type-id-64'>
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-59'/>
    </function-type>
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='347de63754287c77' id='type-id-65'>
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-35'/>
    </function-type>
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='3f9d161fff24d853' id='type-id-66'>
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-37'/>
    </function-type>
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='19f69f6f7c219776' id='type-id-67'>
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='c6a2702b6944e5b2' id='type-id-68'>
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-41'/>
    </function-type>
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='ad58fd7867afcd7f' id='type-id-69'>
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-43'/>
    </function-type>
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='cf5212e813271279' id='type-id-70'>
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-60'/>
    </function-type>
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='388da3fa973fde78' id='type-id-71'>
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type method-class-id='type-id-23' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-72'>
      <parameter type-id='type-id-24' is-artificial='yes'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type method-class-id='type-id-23' const='yes' size-in-bits='64' hash='2685c9e30f0e9c0a' id='type-id-73'>
      <parameter type-id='type-id-47' is-artificial='yes'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-56'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/linuxthreads.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <typedef-decl name='ListAllProcessThreadsCallBack' type-id='type-id-74' size-in-bits='64' filepath='./src/base/thread_lister.h' line='48' column='1' hash='fd7a63c0c6c822c4' id='type-id-75'/>
    <typedef-decl name='__pid_t' type-id='type-id-1' size-in-bits='32' filepath='/usr/include/bits/types.h' line='143' column='1' hash='09d17c08f594edc7' id='type-id-76'/>
    <typedef-decl name='pid_t' type-id='type-id-76' size-in-bits='32' filepath='/usr/include/sched.h' line='37' column='1' hash='09d17c08f594edc7' id='type-id-77'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-74'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' hash='7e9a76962b5dc492' id='type-id-79'/>
    <function-decl name='TCMalloc_ListAllProcessThreads' mangled-name='TCMalloc_ListAllProcessThreads' filepath='src/base/linuxthreads.cc' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMalloc_ListAllProcessThreads' hash='a7f99494147764a8'>
      <parameter type-id='type-id-56' filepath='src/base/linuxthreads.cc' line='551' column='1'/>
      <parameter type-id='type-id-75' filepath='src/base/linuxthreads.cc' line='552' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='TCMalloc_ResumeAllProcessThreads' mangled-name='TCMalloc_ResumeAllProcessThreads' filepath='src/base/linuxthreads.cc' line='696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMalloc_ResumeAllProcessThreads' hash='44a39430792b90b1'>
      <parameter type-id='type-id-1' filepath='src/base/linuxthreads.cc' line='696' column='1'/>
      <parameter type-id='type-id-79' filepath='src/base/linuxthreads.cc' line='696' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' hash='60f7fa789d54ab1c' id='type-id-78'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/logging.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <namespace-decl name='FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead'>
      <var-decl name='FLAGS_verbose' type-id='type-id-81' mangled-name='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead13FLAGS_verboseE' visibility='default' filepath='src/base/logging.cc' line='38' column='1' elf-symbol-id='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead13FLAGS_verboseE'/>
      <var-decl name='FLAGS_noverbose' type-id='type-id-82' mangled-name='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead15FLAGS_noverboseE' visibility='default' filepath='src/base/logging.cc' line='40' column='1' elf-symbol-id='_ZN61FLAG__namespace_do_not_use_directly_use_DECLARE_int32_instead15FLAGS_noverboseE'/>
    </namespace-decl>
    <function-decl name='RawOpenForWriting' mangled-name='_Z17RawOpenForWritingPKc' filepath='src/base/logging.cc' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z17RawOpenForWritingPKc' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-60' filepath='src/base/logging.cc' line='90' column='1'/>
      <return type-id='type-id-83'/>
    </function-decl>
    <function-decl name='RawWrite' mangled-name='_Z8RawWriteiPKcm' filepath='src/base/logging.cc' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8RawWriteiPKcm' hash='e1f9b6b88b6e9119'>
      <parameter type-id='type-id-83' filepath='src/base/logging.cc' line='94' column='1'/>
      <parameter type-id='type-id-60' filepath='src/base/logging.cc' line='94' column='1'/>
      <parameter type-id='type-id-61' filepath='src/base/logging.cc' line='94' column='1'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='RawClose' mangled-name='_Z8RawClosei' filepath='src/base/logging.cc' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z8RawClosei' hash='388da3fa973fde78'>
      <parameter type-id='type-id-83' filepath='src/base/logging.cc' line='104' column='1'/>
      <return type-id='type-id-58'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/low_level_alloc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-84' size-in-bits='1920' hash='cb2d83dd86b161f3' id='type-id-85'>
      <subrange length='30' lower-bound='0' upper-bound='29' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='cbb4475e64ad0d01' id='type-id-86'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-87' const='yes' hash='df5c356d651669e3' id='type-id-88'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' hash='a5d279e9377417e1' id='type-id-84'/>
    <namespace-decl name='base'>
      <namespace-decl name='subtle'>
        <typedef-decl name='Atomic64' type-id='type-id-90' size-in-bits='64' filepath='./src/base/atomicops-internals-x86.h' line='70' column='1' hash='b119fe0931d2ee10' id='type-id-91'/>
      </namespace-decl>
      <enum-decl name='LinkerInitialized' size-in-bits='32' alignment-in-bits='32' filepath='./src/base/basictypes.h' line='381' column='1' hash='104662f2c242e63e' id='type-id-92'>
        <underlying-type type-id='type-id-93'/>
        <enumerator name='LINKER_INITIALIZED' value='0'/>
      </enum-decl>
      <namespace-decl name='internal'>
        <class-decl name='HookList&lt;void (*)(const void*)&gt;' is-struct='yes' visibility='default' hash='799b4a13de4db312' id='type-id-94'/>
        <class-decl name='HookList&lt;void (*)(const void*, size_t)&gt;' is-struct='yes' visibility='default' hash='83f25c96216ff315' id='type-id-95'>
          <member-function access='public'>
            <function-decl name='GetSingular' mangled-name='_ZNK4base8internal8HookListIPFvPKvmEE11GetSingularEv' filepath='src/malloc_hook-inl.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base8internal8HookListIPFvPKvmEE11GetSingularEv' hash='5695f5ce05a4c55f'>
              <parameter type-id='type-id-96' is-artificial='yes'/>
              <return type-id='type-id-97'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='empty' mangled-name='_ZNK4base8internal8HookListIPFvPKvmEE5emptyEv' filepath='src/malloc_hook-inl.h' line='80' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base8internal8HookListIPFvPKvmEE5emptyEv' hash='c7c710e908194b91'>
              <parameter type-id='type-id-96' is-artificial='yes'/>
              <return type-id='type-id-59'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='FixupPrivEndLocked' mangled-name='_ZN4base8internal8HookListIPFvPKvmEE18FixupPrivEndLockedEv' filepath='src/malloc_hook-inl.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal8HookListIPFvPKvmEE18FixupPrivEndLockedEv' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-98' is-artificial='yes'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='Traverse' mangled-name='_ZNK4base8internal8HookListIPFvPKvmEE8TraverseEPS5_i' filepath='src/malloc_hook-inl.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base8internal8HookListIPFvPKvmEE8TraverseEPS5_i' hash='22c907d6003d7682'>
              <parameter type-id='type-id-96' is-artificial='yes'/>
              <parameter type-id='type-id-99'/>
              <parameter type-id='type-id-1'/>
              <return type-id='type-id-1'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='ExchangeSingular' mangled-name='_ZN4base8internal8HookListIPFvPKvmEE16ExchangeSingularES5_' filepath='src/malloc_hook-inl.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal8HookListIPFvPKvmEE16ExchangeSingularES5_' hash='e7946129631a25a2'>
              <parameter type-id='type-id-98' is-artificial='yes'/>
              <parameter type-id='type-id-97' filepath='src/malloc_hook-inl.h' line='90' column='1'/>
              <return type-id='type-id-97'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='Remove' mangled-name='_ZN4base8internal8HookListIPFvPKvmEE6RemoveES5_' filepath='src/malloc_hook-inl.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal8HookListIPFvPKvmEE6RemoveES5_' hash='e698fbedb78e4cd2'>
              <parameter type-id='type-id-98' is-artificial='yes'/>
              <parameter type-id='type-id-97' filepath='src/malloc_hook-inl.h' line='72' column='1'/>
              <return type-id='type-id-59'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='Add' mangled-name='_ZN4base8internal8HookListIPFvPKvmEE3AddES5_' filepath='src/malloc_hook-inl.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal8HookListIPFvPKvmEE3AddES5_' hash='e698fbedb78e4cd2'>
              <parameter type-id='type-id-98' is-artificial='yes'/>
              <parameter type-id='type-id-97' filepath='src/malloc_hook-inl.h' line='72' column='1'/>
              <return type-id='type-id-59'/>
            </function-decl>
          </member-function>
        </class-decl>
      </namespace-decl>
    </namespace-decl>
    <namespace-decl name='low_level_alloc_internal'>
      <class-decl name='AllocList' is-struct='yes' visibility='default' size-in-bits='2240' filepath='src/base/low_level_alloc.cc' line='67' column='1' hash='9b4ed3506ee18546' id='type-id-89'>
        <member-type access='public'>
          <class-decl name='Header' is-struct='yes' visibility='default' size-in-bits='256' filepath='src/base/low_level_alloc.cc' line='68' column='1' hash='637c890e478d839a' id='type-id-100'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='size' type-id='type-id-101' visibility='default' filepath='src/base/low_level_alloc.cc' line='69' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='magic' type-id='type-id-101' visibility='default' filepath='src/base/low_level_alloc.cc' line='71' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='arena' type-id='type-id-87' visibility='default' filepath='src/base/low_level_alloc.cc' line='72' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='dummy_for_alignment' type-id='type-id-56' visibility='default' filepath='src/base/low_level_alloc.cc' line='73' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='header' type-id='type-id-100' visibility='default' filepath='src/base/low_level_alloc.cc' line='74' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='levels' type-id='type-id-1' visibility='default' filepath='src/base/low_level_alloc.cc' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='next' type-id='type-id-85' visibility='default' filepath='src/base/low_level_alloc.cc' line='79' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <function-type method-class-id='type-id-102' size-in-bits='64' hash='745054de67770bc9' id='type-id-103'>
      <parameter type-id='type-id-104' is-artificial='yes'/>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-107'/>
    </function-type>
    <function-type method-class-id='type-id-108' const='yes' size-in-bits='64' hash='c7c710e908194b91' id='type-id-109'>
      <parameter type-id='type-id-96' is-artificial='yes'/>
      <return type-id='type-id-59'/>
    </function-type>
    <function-type method-class-id='type-id-95' size-in-bits='64' hash='e698fbedb78e4cd2' id='type-id-110'>
      <parameter type-id='type-id-98' is-artificial='yes'/>
      <parameter type-id='type-id-97' filepath='src/malloc_hook-inl.h' line='72' column='1'/>
      <return type-id='type-id-59'/>
    </function-type>
    <function-type method-class-id='type-id-108' const='yes' size-in-bits='64' hash='22c907d6003d7682' id='type-id-111'>
      <parameter type-id='type-id-96' is-artificial='yes'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type method-class-id='type-id-108' const='yes' size-in-bits='64' hash='5695f5ce05a4c55f' id='type-id-112'>
      <parameter type-id='type-id-96' is-artificial='yes'/>
      <return type-id='type-id-97'/>
    </function-type>
    <function-type method-class-id='type-id-95' size-in-bits='64' hash='e7946129631a25a2' id='type-id-113'>
      <parameter type-id='type-id-98' is-artificial='yes'/>
      <parameter type-id='type-id-97' filepath='src/malloc_hook-inl.h' line='90' column='1'/>
      <return type-id='type-id-97'/>
    </function-type>
    <function-type method-class-id='type-id-102' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-114'>
      <parameter type-id='type-id-104' is-artificial='yes'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type method-class-id='type-id-102' size-in-bits='64' hash='e0055d99adb0e173' id='type-id-115'>
      <parameter type-id='type-id-104' is-artificial='yes'/>
      <parameter type-id='type-id-116'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type method-class-id='type-id-95' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-117'>
      <parameter type-id='type-id-98' is-artificial='yes'/>
      <return type-id='type-id-58'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/spinlock.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <class-decl name='CycleClock' is-struct='yes' visibility='default' size-in-bits='8' filepath='./src/base/cycleclock.h' line='79' column='1' hash='8e658f9e8bd44126' id='type-id-118'/>
    <qualified-type-def type-id='type-id-92' const='yes' hash='e16a423e37712bec' id='type-id-119'/>
    <namespace-decl name='base'>
      <function-decl name='SubmitSpinLockProfileData' mangled-name='_ZN4base25SubmitSpinLockProfileDataEPKvl' filepath='./src/base/synchronization_profiling.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base25SubmitSpinLockProfileDataEPKvl' hash='52c0efb08d2aa513'>
        <parameter type-id='type-id-56'/>
        <parameter type-id='type-id-105'/>
        <return type-id='type-id-58'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/spinlock_internal.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-120' const='yes' hash='b69aa0c6c66bee67' id='type-id-121'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' hash='90bbe97f9072e445' id='type-id-122'/>
    <namespace-decl name='base'>
      <namespace-decl name='subtle'>
      </namespace-decl>
      <namespace-decl name='internal'>
        <class-decl name='SpinLockWaitTransition' is-struct='yes' visibility='default' size-in-bits='96' filepath='./src/base/spinlock_internal.h' line='48' column='1' hash='0f439893da072f3f' id='type-id-120'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='from' type-id='type-id-81' visibility='default' filepath='./src/base/spinlock_internal.h' line='49' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='to' type-id='type-id-81' visibility='default' filepath='./src/base/spinlock_internal.h' line='50' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='done' type-id='type-id-59' visibility='default' filepath='./src/base/spinlock_internal.h' line='51' column='1'/>
          </data-member>
        </class-decl>
        <function-decl name='SpinLockDelay' mangled-name='_ZN4base8internal13SpinLockDelayEPViii' filepath='./src/base/spinlock_linux-inl.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal13SpinLockDelayEPViii' hash='86a51dc692bbcbe6'>
          <parameter type-id='type-id-123'/>
          <parameter type-id='type-id-81'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-58'/>
        </function-decl>
        <function-decl name='SpinLockWake' mangled-name='_ZN4base8internal12SpinLockWakeEPVib' filepath='./src/base/spinlock_linux-inl.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal12SpinLockWakeEPVib' hash='768c83cd3690d2a7'>
          <parameter type-id='type-id-123'/>
          <parameter type-id='type-id-59'/>
          <return type-id='type-id-58'/>
        </function-decl>
        <function-decl name='SpinLockWait' mangled-name='_ZN4base8internal12SpinLockWaitEPViiPKNS0_22SpinLockWaitTransitionE' filepath='src/base/spinlock_internal.cc' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base8internal12SpinLockWaitEPViiPKNS0_22SpinLockWaitTransitionE' hash='3742d95ddf1a386d'>
          <parameter type-id='type-id-123'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-81'/>
        </function-decl>
      </namespace-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/sysinfo.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='80' hash='17ea60b42da0606b' id='type-id-124'>
      <subrange length='10' lower-bound='0' upper-bound='9' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='4e72a2f569b234f4' id='type-id-125'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-82' size-in-bits='40960' hash='ee8e4ce8c75a11f9' id='type-id-126'>
      <subrange length='5120' lower-bound='0' upper-bound='5119' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='112cecc9134ba92d' id='type-id-127'/>
    </array-type-def>
    <class-decl name='ProcMapsIterator' visibility='default' size-in-bits='640' filepath='./src/base/sysinfo.h' line='102' column='1' hash='2264b5d7b5d030a4' id='type-id-128'>
      <member-type access='private'>
        <class-decl name='Buffer' is-struct='yes' visibility='default' size-in-bits='40960' filepath='./src/base/sysinfo.h' line='104' column='1' hash='0c3c920007ea2acf' id='type-id-129'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='buf_' type-id='type-id-126' visibility='default' filepath='./src/base/sysinfo.h' line='112' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='ibuf_' type-id='type-id-130' visibility='default' filepath='./src/base/sysinfo.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='stext_' type-id='type-id-130' visibility='default' filepath='./src/base/sysinfo.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='etext_' type-id='type-id-130' visibility='default' filepath='./src/base/sysinfo.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='nextline_' type-id='type-id-130' visibility='default' filepath='./src/base/sysinfo.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='ebuf_' type-id='type-id-130' visibility='default' filepath='./src/base/sysinfo.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='fd_' type-id='type-id-1' visibility='default' filepath='./src/base/sysinfo.h' line='219' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='352'>
        <var-decl name='pid_' type-id='type-id-77' visibility='default' filepath='./src/base/sysinfo.h' line='221' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='flags_' type-id='type-id-124' visibility='default' filepath='./src/base/sysinfo.h' line='222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='dynamic_buffer_' type-id='type-id-131' visibility='default' filepath='./src/base/sysinfo.h' line='223' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='using_maps_backing_' type-id='type-id-59' visibility='default' filepath='./src/base/sysinfo.h' line='224' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='Valid' mangled-name='_ZNK16ProcMapsIterator5ValidEv' filepath='src/base/sysinfo.cc' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16ProcMapsIterator5ValidEv' hash='c7c710e908194b91'>
          <parameter type-id='type-id-132' is-artificial='yes'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FormatLine' mangled-name='_ZN16ProcMapsIterator10FormatLineEPcimmPKcmlS2_m' filepath='src/base/sysinfo.cc' line='1084' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator10FormatLineEPcimmPKcmlS2_m' hash='5f991849cba2ccd3'>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-116'/>
          <parameter type-id='type-id-116'/>
          <parameter type-id='type-id-60'/>
          <parameter type-id='type-id-116'/>
          <parameter type-id='type-id-105'/>
          <parameter type-id='type-id-60'/>
          <parameter type-id='type-id-133'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorD1Ev' filepath='src/base/sysinfo.cc' line='804' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorD1Ev' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Init' mangled-name='_ZN16ProcMapsIterator4InitEiPNS_6BufferEb' filepath='src/base/sysinfo.cc' line='741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator4InitEiPNS_6BufferEb' hash='b9953348555036fa'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <parameter type-id='type-id-131'/>
          <parameter type-id='type-id-59'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC1EiPNS_6BufferEb' filepath='src/base/sysinfo.cc' line='736' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC1EiPNS_6BufferEb' hash='b9953348555036fa'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <parameter type-id='type-id-131'/>
          <parameter type-id='type-id-59'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC2EiPNS_6BufferE' filepath='src/base/sysinfo.cc' line='732' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC2EiPNS_6BufferE' hash='401f52e7102feed6'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <parameter type-id='type-id-131'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='ProcMapsIterator' mangled-name='_ZN16ProcMapsIteratorC1Ei' filepath='src/base/sysinfo.cc' line='728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIteratorC1Ei' hash='388da3fa973fde78'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='NextExt' mangled-name='_ZN16ProcMapsIterator7NextExtEPmS0_PPcS0_PlS2_S0_S0_S0_S0_S0_' filepath='src/base/sysinfo.cc' line='834' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator7NextExtEPmS0_PPcS0_PlS2_S0_S0_S0_S0_S0_' hash='4e2c5075ad0ec0c2'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-135'/>
          <parameter type-id='type-id-135'/>
          <parameter type-id='type-id-136'/>
          <parameter type-id='type-id-135'/>
          <parameter type-id='type-id-137'/>
          <parameter type-id='type-id-136'/>
          <parameter type-id='type-id-135'/>
          <parameter type-id='type-id-135'/>
          <parameter type-id='type-id-135'/>
          <parameter type-id='type-id-135'/>
          <parameter type-id='type-id-138'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Next' mangled-name='_ZN16ProcMapsIterator4NextEPmS0_PPcS0_PlS2_' filepath='src/base/sysinfo.cc' line='825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16ProcMapsIterator4NextEPmS0_PPcS0_PlS2_' hash='0028c0d0265f0714'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-135'/>
          <parameter type-id='type-id-135'/>
          <parameter type-id='type-id-136'/>
          <parameter type-id='type-id-135'/>
          <parameter type-id='type-id-137'/>
          <parameter type-id='type-id-136'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-21' size-in-bits='64' filepath='/usr/include/bits/types.h' line='134' column='1' hash='8fdc5eea2983a729' id='type-id-139'/>
    <typedef-decl name='dev_t' type-id='type-id-139' size-in-bits='64' filepath='/usr/include/sys/types.h' line='61' column='1' hash='8fdc5eea2983a729' id='type-id-133'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' hash='fa878a3e0f42a3c6' id='type-id-134'/>
    <qualified-type-def type-id='type-id-134' const='yes' hash='748044580a31ee8f' id='type-id-140'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' hash='939b08df96ab7482' id='type-id-131'/>
    <qualified-type-def type-id='type-id-128' const='yes' hash='de70b760bfe42cff' id='type-id-141'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' hash='aeb89ef50ae9a806' id='type-id-132'/>
    <qualified-type-def type-id='type-id-132' const='yes' hash='357d93c544ca96b0' id='type-id-142'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' hash='312605a909e8eaa1' id='type-id-138'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' hash='a1b0a9faf3461c39' id='type-id-137'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' hash='22112f95b58dbc67' id='type-id-135'/>
    <namespace-decl name='tcmalloc'>
      <function-decl name='FillProcSelfMaps' mangled-name='_ZN8tcmalloc16FillProcSelfMapsEPciPb' filepath='src/base/sysinfo.cc' line='1111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16FillProcSelfMapsEPciPb' hash='acd61b69cd92cb8f'>
        <parameter type-id='type-id-130'/>
        <parameter type-id='type-id-1'/>
        <parameter type-id='type-id-143'/>
        <return type-id='type-id-1'/>
      </function-decl>
      <function-decl name='DumpProcSelfMaps' mangled-name='_ZN8tcmalloc16DumpProcSelfMapsEi' filepath='src/base/sysinfo.cc' line='1137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16DumpProcSelfMapsEi' hash='388da3fa973fde78'>
        <parameter type-id='type-id-83' filepath='src/base/logging.cc' line='104' column='1'/>
        <return type-id='type-id-58'/>
      </function-decl>
    </namespace-decl>
    <function-decl name='GetenvBeforeMain' mangled-name='_Z16GetenvBeforeMainPKc' filepath='src/base/sysinfo.cc' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z16GetenvBeforeMainPKc' hash='3d5693612af11c46'>
      <parameter type-id='type-id-60' filepath='src/base/sysinfo.cc' line='122' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='TCMallocGetenvSafe' mangled-name='TCMallocGetenvSafe' filepath='src/base/sysinfo.cc' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='TCMallocGetenvSafe' hash='3d5693612af11c46'>
      <parameter type-id='type-id-60' filepath='src/base/sysinfo.cc' line='122' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='GetUniquePathFromEnv' mangled-name='_Z20GetUniquePathFromEnvPKcPc' filepath='src/base/sysinfo.cc' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20GetUniquePathFromEnvPKcPc' hash='4fcb66546067c0f3'>
      <parameter type-id='type-id-60' filepath='src/base/sysinfo.cc' line='201' column='1'/>
      <parameter type-id='type-id-130' filepath='src/base/sysinfo.cc' line='201' column='1'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='SleepForMilliseconds' mangled-name='_Z20SleepForMillisecondsi' filepath='src/base/sysinfo.cc' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z20SleepForMillisecondsi' hash='388da3fa973fde78'>
      <parameter type-id='type-id-1' filepath='src/base/sysinfo.cc' line='226' column='1'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='CyclesPerSecond' mangled-name='_Z15CyclesPerSecondv' filepath='src/base/sysinfo.cc' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15CyclesPerSecondv' hash='14e245f4052d89de'>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='NumCPUs' mangled-name='_Z7NumCPUsv' filepath='src/base/sysinfo.cc' line='505' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z7NumCPUsv' hash='388da3fa973fde78'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='HasPosixThreads' mangled-name='_Z15HasPosixThreadsv' filepath='src/base/sysinfo.cc' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Z15HasPosixThreadsv' hash='c7c710e908194b91'>
      <return type-id='type-id-59'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/base/vdso_support.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' hash='eb484dfa270591eb' id='type-id-145'/>
    <qualified-type-def type-id='type-id-145' const='yes' hash='b12b14a771f8c8b3' id='type-id-146'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' hash='883a1fc17f881c67' id='type-id-148'/>
    <qualified-type-def type-id='type-id-148' const='yes' hash='e6adfea1970106f3' id='type-id-149'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' hash='c661d6d612749156' id='type-id-151'/>
    <qualified-type-def type-id='type-id-147' const='yes' hash='965e7306817a37f5' id='type-id-152'/>
    <reference-type-def kind='lvalue' type-id='type-id-152' size-in-bits='64' hash='4c3b458300f87597' id='type-id-153'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' hash='0dd98154a5105c11' id='type-id-154'/>
    <qualified-type-def type-id='type-id-154' const='yes' hash='57eb484bf4b0b78d' id='type-id-155'/>
    <namespace-decl name='base'>
      <class-decl name='ElfMemImage' visibility='default' hash='4d05b0d78d698050' id='type-id-156'>
        <member-function access='private'>
          <function-decl name='GetNumSymbols' mangled-name='_ZNK4base11ElfMemImage13GetNumSymbolsEv' filepath='src/base/elf_mem_image.cc' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage13GetNumSymbolsEv' hash='388da3fa973fde78'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerdefAux' mangled-name='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef' filepath='src/base/elf_mem_image.cc' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12GetVerdefAuxEPK12Elf64_Verdef' hash='19f69f6f7c219776'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-41'/>
            <return type-id='type-id-39'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='end' mangled-name='_ZNK4base11ElfMemImage3endEv' filepath='src/base/elf_mem_image.cc' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage3endEv' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <return type-id='type-id-28'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerstr' mangled-name='_ZNK4base11ElfMemImage9GetVerstrEj' filepath='src/base/elf_mem_image.cc' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerstrEj' hash='cf5212e813271279'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-6'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVerdef' mangled-name='_ZNK4base11ElfMemImage9GetVerdefEi' filepath='src/base/elf_mem_image.cc' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVerdefEi' hash='c6a2702b6944e5b2'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-1'/>
            <return type-id='type-id-41'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetSymAddr' mangled-name='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym' filepath='src/base/elf_mem_image.cc' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage10GetSymAddrEPK9Elf64_Sym' hash='2685c9e30f0e9c0a'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-37'/>
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetDynstr' mangled-name='_ZNK4base11ElfMemImage9GetDynstrEj' filepath='src/base/elf_mem_image.cc' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynstrEj' hash='cf5212e813271279'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-6'/>
            <return type-id='type-id-60'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetPhdr' mangled-name='_ZNK4base11ElfMemImage7GetPhdrEi' filepath='src/base/elf_mem_image.cc' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage7GetPhdrEi' hash='347de63754287c77'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-1'/>
            <return type-id='type-id-35'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='Init' mangled-name='_ZN4base11ElfMemImage4InitEPKv' filepath='src/base/elf_mem_image.cc' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImage4InitEPKv' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-24' is-artificial='yes'/>
            <parameter type-id='type-id-56'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='ElfMemImage' mangled-name='_ZN4base11ElfMemImageC1EPKv' filepath='src/base/elf_mem_image.cc' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11ElfMemImageC1EPKv' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-24' is-artificial='yes'/>
            <parameter type-id='type-id-56'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetVersym' mangled-name='_ZNK4base11ElfMemImage9GetVersymEi' filepath='src/base/elf_mem_image.cc' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetVersymEi' hash='ad58fd7867afcd7f'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-1'/>
            <return type-id='type-id-43'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetDynsym' mangled-name='_ZNK4base11ElfMemImage9GetDynsymEi' filepath='src/base/elf_mem_image.cc' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage9GetDynsymEi' hash='3f9d161fff24d853'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-1'/>
            <return type-id='type-id-37'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='begin' mangled-name='_ZNK4base11ElfMemImage5beginEv' filepath='src/base/elf_mem_image.cc' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage5beginEv' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <return type-id='type-id-28'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE' filepath='src/base/elf_mem_image.cc' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage21LookupSymbolByAddressEPKvPNS0_10SymbolInfoE' hash='b897a0ddbd63cce5'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-56'/>
            <parameter type-id='type-id-27'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE' filepath='src/base/elf_mem_image.cc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11ElfMemImage12LookupSymbolEPKcS2_iPNS0_10SymbolInfoE' hash='d055b32b0e2d828c'>
            <parameter type-id='type-id-47' is-artificial='yes'/>
            <parameter type-id='type-id-60'/>
            <parameter type-id='type-id-60'/>
            <parameter type-id='type-id-1'/>
            <parameter type-id='type-id-27'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='VDSOInitHelper' visibility='default' size-in-bits='8' filepath='src/base/vdso_support.cc' line='137' column='1' hash='6370393810069857' id='type-id-144'/>
      <class-decl name='VDSOSupport' visibility='default' size-in-bits='576' filepath='./src/base/vdso_support.h' line='72' column='1' hash='6860908f4e29291a' id='type-id-147'>
        <member-type access='private'>
          <typedef-decl name='SymbolInfo' type-id='type-id-26' size-in-bits='256' filepath='./src/base/vdso_support.h' line='76' column='1' id='type-id-150'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='SymbolIterator' type-id='type-id-28' size-in-bits='384' filepath='./src/base/vdso_support.h' line='77' column='1' id='type-id-157'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='vdso_base_' type-id='type-id-56' mangled-name='_ZN4base11VDSOSupport10vdso_base_E' visibility='default' filepath='src/base/vdso_support.cc' line='59' column='1' elf-symbol-id='_ZN4base11VDSOSupport10vdso_base_E'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='image_' type-id='type-id-23' visibility='default' filepath='./src/base/vdso_support.h' line='112' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='LookupSymbolByAddress' mangled-name='_ZNK4base11VDSOSupport21LookupSymbolByAddressEPKvPNS_11ElfMemImage10SymbolInfoE' filepath='src/base/vdso_support.cc' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11VDSOSupport21LookupSymbolByAddressEPKvPNS_11ElfMemImage10SymbolInfoE' hash='b897a0ddbd63cce5'>
            <parameter type-id='type-id-154' is-artificial='yes'/>
            <parameter type-id='type-id-56'/>
            <parameter type-id='type-id-151'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='LookupSymbol' mangled-name='_ZNK4base11VDSOSupport12LookupSymbolEPKcS2_iPNS_11ElfMemImage10SymbolInfoE' filepath='src/base/vdso_support.cc' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK4base11VDSOSupport12LookupSymbolEPKcS2_iPNS_11ElfMemImage10SymbolInfoE' hash='d055b32b0e2d828c'>
            <parameter type-id='type-id-154' is-artificial='yes'/>
            <parameter type-id='type-id-60'/>
            <parameter type-id='type-id-60'/>
            <parameter type-id='type-id-1'/>
            <parameter type-id='type-id-151'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='SetBase' mangled-name='_ZN4base11VDSOSupport7SetBaseEPKv' filepath='src/base/vdso_support.cc' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupport7SetBaseEPKv' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-148' is-artificial='yes'/>
            <parameter type-id='type-id-56'/>
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='Init' mangled-name='_ZN4base11VDSOSupport4InitEv' filepath='src/base/vdso_support.cc' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupport4InitEv' hash='7f32ffea222edbe7'>
            <return type-id='type-id-56'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='VDSOSupport' mangled-name='_ZN4base11VDSOSupportC1Ev' filepath='src/base/vdso_support.cc' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN4base11VDSOSupportC1Ev' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-148' is-artificial='yes'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-158'>
      <return type-id='type-id-58'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/central_freelist.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <reference-type-def kind='lvalue' type-id='type-id-159' size-in-bits='64' hash='5bb43a8603322674' id='type-id-160'/>
    <qualified-type-def type-id='type-id-161' const='yes' hash='118d35f5174d8310' id='type-id-162'/>
    <reference-type-def kind='lvalue' type-id='type-id-162' size-in-bits='64' hash='43aecb5732ecabb0' id='type-id-163'/>
    <qualified-type-def type-id='type-id-164' const='yes' hash='795ecde4916fdb90' id='type-id-165'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' hash='f1228bd9c4fd21bf' id='type-id-166'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-168'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='/usr/include/libio.h' line='271' column='1' hash='29dcdce3af7c2b79' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-1' visibility='default' filepath='/usr/include/libio.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-130' visibility='default' filepath='/usr/include/libio.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-170' visibility='default' filepath='/usr/include/libio.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-171' visibility='default' filepath='/usr/include/libio.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-1' visibility='default' filepath='/usr/include/libio.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-1' visibility='default' filepath='/usr/include/libio.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-172' visibility='default' filepath='/usr/include/libio.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-20' visibility='default' filepath='/usr/include/libio.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-173' visibility='default' filepath='/usr/include/libio.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-174' visibility='default' filepath='/usr/include/libio.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-175' visibility='default' filepath='/usr/include/libio.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-176' visibility='default' filepath='/usr/include/libio.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-56' visibility='default' filepath='/usr/include/libio.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-56' visibility='default' filepath='/usr/include/libio.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-56' visibility='default' filepath='/usr/include/libio.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-56' visibility='default' filepath='/usr/include/libio.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-61' visibility='default' filepath='/usr/include/libio.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-1' visibility='default' filepath='/usr/include/libio.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-177' visibility='default' filepath='/usr/include/libio.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <namespace-decl name='base'>
      <class-decl name='MallocRange' is-struct='yes' visibility='default' hash='8f2fa3ce1ca054ae' id='type-id-178'>
      </class-decl>
    </namespace-decl>
    <function-decl name='strtod' filepath='/usr/include/stdlib.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64' hash='15d84328157dd688'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-136'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64' hash='e745adec85b81cf6'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-136'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='strtoll' filepath='/usr/include/stdlib.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64' hash='24058e744113e8b7#2'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-136'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-180'/>
    </function-decl>
    <function-decl name='strtoull' filepath='/usr/include/stdlib.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64' hash='b5c0cb10fb089e0c#2'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-136'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-181'/>
    </function-decl>
    <function-decl name='atoi' filepath='/usr/include/stdlib.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='567' column='1' visibility='default' binding='global' size-in-bits='64' hash='bac6a89264ba699c'>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-130'/>
    </function-decl>
    <namespace-decl name='tcmalloc'>
      <class-decl name='CentralFreeList' visibility='default' hash='c085a61f676e6f8d' id='type-id-182'>
        <member-function access='private'>
          <function-decl name='FetchFromOneSpans' mangled-name='_ZN8tcmalloc15CentralFreeList17FetchFromOneSpansEiPPvS2_' filepath='src/central_freelist.cc' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList17FetchFromOneSpansEiPPvS2_' hash='05583901df42bd48'>
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <parameter type-id='type-id-1'/>
            <parameter type-id='type-id-184'/>
            <parameter type-id='type-id-184'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='Init' mangled-name='_ZN8tcmalloc15CentralFreeList4InitEm' filepath='src/central_freelist.cc' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList4InitEm' hash='e0055d99adb0e173'>
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <parameter type-id='type-id-61'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='Populate' mangled-name='_ZN8tcmalloc15CentralFreeList8PopulateEv' filepath='src/central_freelist.cc' line='321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList8PopulateEv' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='FetchFromOneSpansSafe' mangled-name='_ZN8tcmalloc15CentralFreeList21FetchFromOneSpansSafeEiPPvS2_' filepath='src/central_freelist.cc' line='281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList21FetchFromOneSpansSafeEiPPvS2_' hash='05583901df42bd48'>
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <parameter type-id='type-id-1'/>
            <parameter type-id='type-id-184'/>
            <parameter type-id='type-id-184'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='OverheadBytes' mangled-name='_ZN8tcmalloc15CentralFreeList13OverheadBytesEv' filepath='src/central_freelist.cc' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList13OverheadBytesEv' hash='e0055d99adb0e173'>
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <return type-id='type-id-61'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='tc_length' mangled-name='_ZN8tcmalloc15CentralFreeList9tc_lengthEv' filepath='src/central_freelist.cc' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList9tc_lengthEv' hash='388da3fa973fde78'>
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='RemoveRange' mangled-name='_ZN8tcmalloc15CentralFreeList11RemoveRangeEPPvS2_i' filepath='src/central_freelist.cc' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList11RemoveRangeEPPvS2_i' hash='14b2e307a32069c0'>
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <parameter type-id='type-id-184'/>
            <parameter type-id='type-id-184'/>
            <parameter type-id='type-id-1'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='ReleaseToSpans' mangled-name='_ZN8tcmalloc15CentralFreeList14ReleaseToSpansEPv' filepath='src/central_freelist.cc' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList14ReleaseToSpansEPv' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <parameter type-id='type-id-56'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='ReleaseListToSpans' mangled-name='_ZN8tcmalloc15CentralFreeList18ReleaseListToSpansEPv' filepath='src/central_freelist.cc' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList18ReleaseListToSpansEPv' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <parameter type-id='type-id-56'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='ShrinkCache' mangled-name='_ZN8tcmalloc15CentralFreeList11ShrinkCacheEib' filepath='src/central_freelist.cc' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList11ShrinkCacheEib' hash='6e5147834edeef47'>
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <parameter type-id='type-id-1'/>
            <parameter type-id='type-id-59'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='EvictRandomSizeClass' mangled-name='_ZN8tcmalloc15CentralFreeList20EvictRandomSizeClassEib' filepath='src/central_freelist.cc' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList20EvictRandomSizeClassEib' hash='6e5147834edeef47#2'>
            <parameter type-id='type-id-1'/>
            <parameter type-id='type-id-59'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='MakeCacheSpace' mangled-name='_ZN8tcmalloc15CentralFreeList14MakeCacheSpaceEv' filepath='src/central_freelist.cc' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList14MakeCacheSpaceEv' hash='c7c710e908194b91'>
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='InsertRange' mangled-name='_ZN8tcmalloc15CentralFreeList11InsertRangeEPvS1_i' filepath='src/central_freelist.cc' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc15CentralFreeList11InsertRangeEPvS1_i' hash='388da3fa973fde78'>
            <parameter type-id='type-id-183' is-artificial='yes'/>
            <parameter type-id='type-id-56'/>
            <parameter type-id='type-id-56'/>
            <parameter type-id='type-id-1'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='CentralFreeListPadded' visibility='default' hash='927adecee00cfb9c' id='type-id-185'/>
      <class-decl name='PageHeap' visibility='default' hash='222c75e813625762' id='type-id-186'>
        <member-function access='private'>
          <function-decl name='MayMergeSpans' mangled-name='_ZN8tcmalloc8PageHeap13MayMergeSpansEPNS_4SpanES2_' filepath='src/page_heap.cc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap13MayMergeSpansEPNS_4SpanES2_' hash='37bb0ff623f303ce'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-188'/>
            <parameter type-id='type-id-188'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='RegisterSizeClass' mangled-name='_ZN8tcmalloc8PageHeap17RegisterSizeClassEPNS_4SpanEm' filepath='src/page_heap.cc' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap17RegisterSizeClassEPNS_4SpanEm' hash='ebab2e40fedd1db3'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-188'/>
            <parameter type-id='type-id-61'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetLargeSpanStats' mangled-name='_ZN8tcmalloc8PageHeap17GetLargeSpanStatsEPNS0_14LargeSpanStatsE' filepath='src/page_heap.cc' line='537' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap17GetLargeSpanStatsEPNS0_14LargeSpanStatsE' hash='5287c32193a057e7'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-189'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetNextRange' mangled-name='_ZN8tcmalloc8PageHeap12GetNextRangeEmPN4base11MallocRangeE' filepath='src/page_heap.cc' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap12GetNextRangeEmPN4base11MallocRangeE' hash='49299f0d79243915'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-190'/>
            <parameter type-id='type-id-191'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='Check' mangled-name='_ZN8tcmalloc8PageHeap5CheckEv' filepath='src/page_heap.cc' line='646' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap5CheckEv' hash='c7c710e908194b91'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='CheckList' mangled-name='_ZN8tcmalloc8PageHeap9CheckListEPNS_4SpanEmmi' filepath='src/page_heap.cc' line='663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap9CheckListEPNS_4SpanEmmi' hash='c0f70e7895fb5be5'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-188'/>
            <parameter type-id='type-id-192'/>
            <parameter type-id='type-id-192'/>
            <parameter type-id='type-id-1'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='CheckExpensive' mangled-name='_ZN8tcmalloc8PageHeap14CheckExpensiveEv' filepath='src/page_heap.cc' line='652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap14CheckExpensiveEv' hash='c7c710e908194b91'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='Split' mangled-name='_ZN8tcmalloc8PageHeap5SplitEPNS_4SpanEm' filepath='src/page_heap.cc' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap5SplitEPNS_4SpanEm' hash='8a9780a59468e315'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-188'/>
            <parameter type-id='type-id-192'/>
            <return type-id='type-id-188'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GetSmallSpanStats' mangled-name='_ZN8tcmalloc8PageHeap17GetSmallSpanStatsEPNS0_14SmallSpanStatsE' filepath='src/page_heap.cc' line='530' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap17GetSmallSpanStatsEPNS0_14SmallSpanStatsE' hash='988bbfba08aca7f1'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-193'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='RemoveFromFreeList' mangled-name='_ZN8tcmalloc8PageHeap18RemoveFromFreeListEPNS_4SpanE' filepath='src/page_heap.cc' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap18RemoveFromFreeListEPNS_4SpanE' hash='e089691e785388d9'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-188'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='PrependToFreeList' mangled-name='_ZN8tcmalloc8PageHeap17PrependToFreeListEPNS_4SpanE' filepath='src/page_heap.cc' line='403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap17PrependToFreeListEPNS_4SpanE' hash='e089691e785388d9'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-188'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='DecommitSpan' mangled-name='_ZN8tcmalloc8PageHeap12DecommitSpanEPNS_4SpanE' filepath='src/page_heap.cc' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap12DecommitSpanEPNS_4SpanE' hash='b836a24ffbd86a3b'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-188'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='MergeIntoFreeList' mangled-name='_ZN8tcmalloc8PageHeap17MergeIntoFreeListEPNS_4SpanE' filepath='src/page_heap.cc' line='323' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap17MergeIntoFreeListEPNS_4SpanE' hash='e089691e785388d9'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-188'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='ReleaseLastNormalSpan' mangled-name='_ZN8tcmalloc8PageHeap21ReleaseLastNormalSpanEPNS0_8SpanListE' filepath='src/page_heap.cc' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap21ReleaseLastNormalSpanEPNS0_8SpanListE' hash='e0bb13d58b9d984f'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-194'/>
            <return type-id='type-id-192'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='ReleaseAtLeastNPages' mangled-name='_ZN8tcmalloc8PageHeap20ReleaseAtLeastNPagesEm' filepath='src/page_heap.cc' line='471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap20ReleaseAtLeastNPagesEm' hash='91495cdf6321a116'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-192'/>
            <return type-id='type-id-192'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='EnsureLimit' mangled-name='_ZN8tcmalloc8PageHeap11EnsureLimitEmb' filepath='src/page_heap.cc' line='494' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap11EnsureLimitEmb' hash='edf93e0e926f2972'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-192'/>
            <parameter type-id='type-id-59'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='IncrementalScavenge' mangled-name='_ZN8tcmalloc8PageHeap19IncrementalScavengeEm' filepath='src/page_heap.cc' line='425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap19IncrementalScavengeEm' hash='e0055d99adb0e173'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-192'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='Delete' mangled-name='_ZN8tcmalloc8PageHeap6DeleteEPNS_4SpanE' filepath='src/page_heap.cc' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap6DeleteEPNS_4SpanE' hash='e089691e785388d9'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-188'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='GrowHeap' mangled-name='_ZN8tcmalloc8PageHeap8GrowHeapEm' filepath='src/page_heap.cc' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap8GrowHeapEm' hash='7e544b18f5e89a62'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-192'/>
            <return type-id='type-id-59'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='CommitSpan' mangled-name='_ZN8tcmalloc8PageHeap10CommitSpanEPNS_4SpanE' filepath='src/page_heap.cc' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap10CommitSpanEPNS_4SpanE' hash='e089691e785388d9'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-188'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='Carve' mangled-name='_ZN8tcmalloc8PageHeap5CarveEPNS_4SpanEm' filepath='src/page_heap.cc' line='256' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap5CarveEPNS_4SpanEm' hash='8a9780a59468e315'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-188'/>
            <parameter type-id='type-id-192'/>
            <return type-id='type-id-188'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='AllocLarge' mangled-name='_ZN8tcmalloc8PageHeap10AllocLargeEm' filepath='src/page_heap.cc' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap10AllocLargeEm' hash='ebab2e40fedd1db3'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-192'/>
            <return type-id='type-id-188'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='SearchFreeAndLargeLists' mangled-name='_ZN8tcmalloc8PageHeap23SearchFreeAndLargeListsEm' filepath='src/page_heap.cc' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap23SearchFreeAndLargeListsEm' hash='ebab2e40fedd1db3'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-192'/>
            <return type-id='type-id-188'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='New' mangled-name='_ZN8tcmalloc8PageHeap3NewEm' filepath='src/page_heap.cc' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeap3NewEm' hash='ebab2e40fedd1db3'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <parameter type-id='type-id-192'/>
            <return type-id='type-id-188'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='PageHeap' mangled-name='_ZN8tcmalloc8PageHeapC1Ev' filepath='src/page_heap.cc' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc8PageHeapC1Ev' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-187' is-artificial='yes'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='Static' visibility='default' hash='1bc5e1dbc1d1509d' id='type-id-195'>
        <member-function access='private' static='yes'>
          <function-decl name='InitStaticVars' mangled-name='_ZN8tcmalloc6Static14InitStaticVarsEv' filepath='src/static_vars.cc' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc6Static14InitStaticVarsEv' hash='7f32ffea222edbe7'>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='Span' is-struct='yes' visibility='default' hash='9155200a80dda2bf' id='type-id-196'/>
      <class-decl name='StackTrace' is-struct='yes' visibility='default' hash='0ebb74cf73f54255' id='type-id-197'/>
      <class-decl name='LogItem' visibility='default' hash='c56129486804d69d' id='type-id-198'>
      </class-decl>
      <class-decl name='PageHeapAllocator&lt;tcmalloc::Span&gt;' visibility='default' size-in-bits='256' filepath='src/page_heap_allocator.h' line='47' column='1' hash='f6d6733aed128ac5' id='type-id-199'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='free_area_' type-id='type-id-130' visibility='default' filepath='src/page_heap_allocator.h' line='102' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='free_avail_' type-id='type-id-61' visibility='default' filepath='src/page_heap_allocator.h' line='103' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='free_list_' type-id='type-id-56' visibility='default' filepath='src/page_heap_allocator.h' line='106' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='inuse_' type-id='type-id-1' visibility='default' filepath='src/page_heap_allocator.h' line='109' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='PageHeapAllocator&lt;tcmalloc::StackTrace&gt;' visibility='default' size-in-bits='256' filepath='src/page_heap_allocator.h' line='47' column='1' hash='45310e04242d15c6' id='type-id-200'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='free_area_' type-id='type-id-130' visibility='default' filepath='src/page_heap_allocator.h' line='102' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='free_avail_' type-id='type-id-61' visibility='default' filepath='src/page_heap_allocator.h' line='103' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='free_list_' type-id='type-id-56' visibility='default' filepath='src/page_heap_allocator.h' line='106' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='inuse_' type-id='type-id-1' visibility='default' filepath='src/page_heap_allocator.h' line='109' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='PageHeapAllocator&lt;tcmalloc::StackTraceTable::Bucket&gt;' visibility='default' size-in-bits='256' filepath='src/page_heap_allocator.h' line='47' column='1' hash='fe7c8d14e53f5993' id='type-id-201'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='free_area_' type-id='type-id-130' visibility='default' filepath='src/page_heap_allocator.h' line='102' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='free_avail_' type-id='type-id-61' visibility='default' filepath='src/page_heap_allocator.h' line='103' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='free_list_' type-id='type-id-56' visibility='default' filepath='src/page_heap_allocator.h' line='106' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='inuse_' type-id='type-id-1' visibility='default' filepath='src/page_heap_allocator.h' line='109' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='SizeMap' visibility='default' hash='2dbf9d0b9da46da8' id='type-id-202'>
        <member-function access='private'>
          <function-decl name='NumMoveSize' mangled-name='_ZN8tcmalloc7SizeMap11NumMoveSizeEm' filepath='src/common.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc7SizeMap11NumMoveSizeEm' hash='b6a97d07f8261bc0'>
            <parameter type-id='type-id-203' is-artificial='yes'/>
            <parameter type-id='type-id-61'/>
            <return type-id='type-id-1'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='Init' mangled-name='_ZN8tcmalloc7SizeMap4InitEv' filepath='src/common.cc' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc7SizeMap4InitEv' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-203' is-artificial='yes'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-204'>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-205'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-206'>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-56'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='91495cdf6321a116' id='type-id-208'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <parameter type-id='type-id-192'/>
      <return type-id='type-id-192'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='e0bb13d58b9d984f' id='type-id-209'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <parameter type-id='type-id-194'/>
      <return type-id='type-id-192'/>
    </function-type>
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='c7c710e908194b91' id='type-id-211'>
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <return type-id='type-id-59'/>
    </function-type>
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='6e5147834edeef47' id='type-id-212'>
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-59'/>
    </function-type>
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='6e5147834edeef47#2' id='type-id-213'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-59'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='c7c710e908194b91' id='type-id-214'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <return type-id='type-id-59'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='7e544b18f5e89a62' id='type-id-215'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <parameter type-id='type-id-192'/>
      <return type-id='type-id-59'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='edf93e0e926f2972' id='type-id-216'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <parameter type-id='type-id-192'/>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-59'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='49299f0d79243915' id='type-id-217'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-191'/>
      <return type-id='type-id-59'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='b836a24ffbd86a3b' id='type-id-218'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-59'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='c0f70e7895fb5be5' id='type-id-219'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-192'/>
      <parameter type-id='type-id-192'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-59'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='37bb0ff623f303ce' id='type-id-220'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-59'/>
    </function-type>
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='388da3fa973fde78' id='type-id-221'>
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='05583901df42bd48' id='type-id-222'>
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='14b2e307a32069c0' id='type-id-223'>
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type method-class-id='type-id-224' size-in-bits='64' hash='b6a97d07f8261bc0' id='type-id-225'>
      <parameter type-id='type-id-203' is-artificial='yes'/>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='e0055d99adb0e173' id='type-id-226'>
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <return type-id='type-id-61'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='ebab2e40fedd1db3' id='type-id-227'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <parameter type-id='type-id-192'/>
      <return type-id='type-id-188'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='8a9780a59468e315' id='type-id-228'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-192'/>
      <return type-id='type-id-188'/>
    </function-type>
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-229'>
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='e0055d99adb0e173' id='type-id-230'>
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-231'>
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type method-class-id='type-id-210' size-in-bits='64' hash='388da3fa973fde78' id='type-id-232'>
      <parameter type-id='type-id-183' is-artificial='yes'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-233'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='e0055d99adb0e173' id='type-id-234'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <parameter type-id='type-id-192'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='5287c32193a057e7' id='type-id-235'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='988bbfba08aca7f1' id='type-id-236'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <parameter type-id='type-id-193'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='e089691e785388d9' id='type-id-237'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type method-class-id='type-id-207' size-in-bits='64' hash='ebab2e40fedd1db3' id='type-id-238'>
      <parameter type-id='type-id-187' is-artificial='yes'/>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type method-class-id='type-id-224' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-239'>
      <parameter type-id='type-id-203' is-artificial='yes'/>
      <return type-id='type-id-58'/>
    </function-type>
    <function-type method-class-id='type-id-240' size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-241'>
      <return type-id='type-id-58'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <namespace-decl name='base'>
    </namespace-decl>
    <namespace-decl name='tcmalloc'>
      <function-decl name='AlignmentForSize' mangled-name='_ZN8tcmalloc16AlignmentForSizeEm' filepath='src/common.cc' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc16AlignmentForSizeEm' hash='b6a97d07f8261bc0'>
        <parameter type-id='type-id-61'/>
        <return type-id='type-id-1'/>
      </function-decl>
      <function-decl name='MetaDataAlloc' mangled-name='_ZN8tcmalloc13MetaDataAllocEm' filepath='src/common.cc' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc13MetaDataAllocEm' hash='e0055d99adb0e173'>
        <parameter type-id='type-id-61'/>
        <return type-id='type-id-56'/>
      </function-decl>
      <function-decl name='metadata_system_bytes' mangled-name='_ZN8tcmalloc21metadata_system_bytesEv' filepath='src/common.cc' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN8tcmalloc21metadata_system_bytesEv' hash='e0055d99adb0e173'>
        <return type-id='type-id-16'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/heap-checker-bcad.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <class-decl name='HeapLeakCheckerGlobalPrePost' visibility='default' size-in-bits='8' filepath='src/heap-checker-bcad.cc' line='60' column='1' hash='8d1ad826c51051b3' id='type-id-242'>
      <data-member access='public' static='yes'>
        <var-decl name='count_' type-id='type-id-1' mangled-name='_ZN28HeapLeakCheckerGlobalPrePost6count_E' visibility='default' filepath='src/heap-checker-bcad.cc' line='90' column='1' elf-symbol-id='_ZN28HeapLeakCheckerGlobalPrePost6count_E'/>
      </data-member>
      <member-function access='private' destructor='yes'>
        <function-decl name='~HeapLeakCheckerGlobalPrePost' mangled-name='_ZN28HeapLeakCheckerGlobalPrePostD1Ev' filepath='src/heap-checker-bcad.cc' line='79' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN28HeapLeakCheckerGlobalPrePostD1Ev' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-243' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' hash='a621862bcbe54005' id='type-id-243'/>
    <qualified-type-def type-id='type-id-243' const='yes' hash='5237db837ff51788' id='type-id-244'/>
    <var-decl name='heap_leak_checker_bcad_variable' type-id='type-id-59' mangled-name='heap_leak_checker_bcad_variable' visibility='default' filepath='src/heap-checker-bcad.cc' line='53' column='1' elf-symbol-id='heap_leak_checker_bcad_variable'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/heap-checker.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-kFgaKP/gperftools-2.4' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-245' size-in-bits='512' hash='ecac7e1584aeceef#2' id='type-id-246'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-247'/>
    </array-type-def>
    <class-decl name='AddressMap&lt;HeapProfileTable::AllocValue&gt;' visibility='default' size-in-bits='320' filepath='src/addressmap-inl.h' line='104' column='1' hash='6eacb0f56ba1e983' id='type-id-248'>
      <member-type access='private'>
        <class-decl name='Cluster' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-249'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='Entry' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-250'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='Object' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-251'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='hashtable_' type-id='type-id-252' visibility='default' filepath='src/addressmap-inl.h' line='193' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='free_' type-id='type-id-253' visibility='default' filepath='src/addressmap-inl.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='alloc_' type-id='type-id-254' visibility='default' filepath='src/addressmap-inl.h' line='251' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='dealloc_' type-id='type-id-255' visibility='default' filepath='src/addressmap-inl.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='allocated_' type-id='type-id-256' visibility='default' filepath='src/addressmap-inl.h' line='253' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='AddressMap' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEEC2EPFPvmEPFvS3_E' filepath='src/addressmap-inl.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10AddressMapIN16HeapProfileTable10AllocValueEEC2EPFPvmEPFvS3_E' hash='e7946129631a25a2'>
          <parameter type-id='type-id-257' is-artificial='yes'/>
          <parameter type-id='type-id-254'/>
          <parameter type-id='type-id-255'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Insert' mangled-name='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE6InsertEPKvS1_' filepath='src/addressmap-inl.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10AddressMapIN16HeapProfileTable10AllocValueEE6InsertEPKvS1_' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-257' is-artificial='yes'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-258'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='GoogleInitializer' visibility='default' size-in-bits='128' filepath='src/base/googleinit.h' line='39' column='1' hash='44f5dfa25db33174' id='type-id-259'>
      <member-type access='private'>
        <typedef-decl name='VoidFunction' type-id='type-id-261' size-in-bits='64' filepath='./src/base/googleinit.h' line='41' column='1' hash='fd7a63c0c6c822c4' id='type-id-260'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='name_' type-id='type-id-262' visibility='default' filepath='src/base/googleinit.h' line='55' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='destructor_' type-id='type-id-263' visibility='default' filepath='src/base/googleinit.h' line='56' column='1'/>
      </data-member>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='./src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~GoogleInitializer' mangled-name='_ZN17GoogleInitializerD2Ev' filepath='src/base/googleinit.h' line='48' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17GoogleInitializerD2Ev' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-264' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='HeapCleaner' visibility='default' size-in-bits='8' filepath='./src/gperftools/heap-checker.h' line='403' column='1' hash='c1c248c574bcc05a' id='type-id-265'>
      <member-type access='private'>
        <typedef-decl name='void_function' type-id='type-id-261' size-in-bits='64' filepath='./src/gperftools/heap-checker.h' line='405' column='1' hash='fd7a63c0c6c822c4' id='type-id-266'/>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='heap_cleanups_' type-id='type-id-267' mangled-name='_ZN11HeapCleaner14heap_cleanups_E' visibility='default' filepath='src/heap-checker.cc' line='1906' column='1' elf-symbol-id='_ZN11HeapCleaner14heap_cleanups_E'/>
      </data-member>
      <member-function access='private' static='yes'>
        <function-decl name='RunHeapCleanups' mangled-name='_ZN11HeapCleaner15RunHeapCleanupsEv' filepath='src/heap-checker.cc' line='1917' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11HeapCleaner15RunHeapCleanupsEv' hash='7f32ffea222edbe7'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapCleaner' mangled-name='_ZN11HeapCleanerC1EPFvvE' filepath='src/heap-checker.cc' line='1910' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11HeapCleanerC1EPFvvE' hash='5695f5ce05a4c55f'>
          <parameter type-id='type-id-268' is-artificial='yes'/>
          <parameter type-id='type-id-266'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='HeapLeakChecker' visibility='default' size-in-bits='448' filepath='src/gperftools/heap-checker.h' line='78' column='1' hash='58e4a70268cc98a3' id='type-id-269'>
      <member-type access='private'>
        <class-decl name='Disabler' visibility='default' size-in-bits='8' filepath='./src/gperftools/heap-checker.h' line='175' column='1' hash='292407e770723063' id='type-id-270'>
          <member-function access='private' destructor='yes'>
            <function-decl name='~Disabler' mangled-name='_ZN15HeapLeakChecker8DisablerD1Ev' filepath='src/heap-checker.cc' line='516' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8DisablerD1Ev' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-271' is-artificial='yes'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='private' constructor='yes'>
            <function-decl name='Disabler' mangled-name='_ZN15HeapLeakChecker8DisablerC1Ev' filepath='src/heap-checker.cc' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8DisablerC1Ev' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-271' is-artificial='yes'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <enum-decl name='ProcMapsResult' size-in-bits='32' alignment-in-bits='32' filepath='./src/gperftools/heap-checker.h' line='301' column='1' hash='5acc66b484e08503' id='type-id-272'>
          <underlying-type type-id='type-id-93'/>
          <enumerator name='PROC_MAPS_USED' value='0'/>
          <enumerator name='CANT_OPEN_PROC_MAPS' value='1'/>
          <enumerator name='NO_SHARED_LIBS_IN_PROC_MAPS' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <enum-decl name='ProcMapsTask' size-in-bits='32' alignment-in-bits='32' filepath='./src/gperftools/heap-checker.h' line='295' column='1' hash='5d48bb902be64192' id='type-id-273'>
          <underlying-type type-id='type-id-93'/>
          <enumerator name='RECORD_GLOBAL_DATA' value='0'/>
          <enumerator name='DISABLE_LIBRARY_ALLOCS' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <enum-decl name='ShouldSymbolize' size-in-bits='32' alignment-in-bits='32' filepath='./src/gperftools/heap-checker.h' line='225' column='1' hash='40841eec60d1b1b9' id='type-id-274'>
          <underlying-type type-id='type-id-93'/>
          <enumerator name='SYMBOLIZE' value='0'/>
          <enumerator name='DO_NOT_SYMBOLIZE' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='Allocator' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/heap-checker.cc' line='292' column='1' hash='9db6034888da57eb' id='type-id-275'>
          <data-member access='public' static='yes'>
            <var-decl name='arena_' type-id='type-id-87' mangled-name='_ZN15HeapLeakChecker9Allocator6arena_E' visibility='default' filepath='src/heap-checker.cc' line='337' column='1' elf-symbol-id='_ZN15HeapLeakChecker9Allocator6arena_E'/>
          </data-member>
          <data-member access='public' static='yes'>
            <var-decl name='alloc_count_' type-id='type-id-1' mangled-name='_ZN15HeapLeakChecker9Allocator12alloc_count_E' visibility='default' filepath='src/heap-checker.cc' line='338' column='1' elf-symbol-id='_ZN15HeapLeakChecker9Allocator12alloc_count_E'/>
          </data-member>
          <member-function access='public' static='yes'>
            <function-decl name='Allocate' mangled-name='_ZN15HeapLeakChecker9Allocator8AllocateEm' filepath='src/heap-checker.cc' line='309' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9Allocator8AllocateEm' hash='e0055d99adb0e173'>
              <parameter type-id='type-id-61'/>
              <return type-id='type-id-56'/>
            </function-decl>
          </member-function>
          <member-function access='public' static='yes'>
            <function-decl name='Free' mangled-name='_ZN15HeapLeakChecker9Allocator4FreeEPv' filepath='src/heap-checker.cc' line='315' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9Allocator4FreeEPv' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-56'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='RangeValue' is-struct='yes' visibility='default' size-in-bits='128' filepath='src/heap-checker.cc' line='404' column='1' hash='4f3e20a025af33d8' id='type-id-276'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='start_address' type-id='type-id-277' visibility='default' filepath='src/heap-checker.cc' line='405' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='max_depth' type-id='type-id-1' visibility='default' filepath='src/heap-checker.cc' line='406' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='lock_' type-id='type-id-104' visibility='default' filepath='./src/gperftools/heap-checker.h' line='358' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='name_' type-id='type-id-60' visibility='default' filepath='./src/gperftools/heap-checker.h' line='359' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='start_snapshot_' type-id='type-id-56' visibility='default' filepath='./src/gperftools/heap-checker.h' line='365' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='has_checked_' type-id='type-id-59' visibility='default' filepath='./src/gperftools/heap-checker.h' line='367' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='inuse_bytes_increase_' type-id='type-id-278' visibility='default' filepath='./src/gperftools/heap-checker.h' line='368' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='inuse_allocs_increase_' type-id='type-id-278' visibility='default' filepath='./src/gperftools/heap-checker.h' line='369' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='keep_profiles_' type-id='type-id-59' visibility='default' filepath='./src/gperftools/heap-checker.h' line='371' column='1'/>
      </data-member>
      <member-function access='private' static='yes'>
        <function-decl name='DisableChecksIn' mangled-name='_ZN15HeapLeakChecker15DisableChecksInEPKc' filepath='src/heap-checker.cc' line='1514' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker15DisableChecksInEPKc' hash='53885bde0aa65efe#2'>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='BeforeConstructorsLocked' mangled-name='_ZN15HeapLeakChecker24BeforeConstructorsLockedEv' filepath='src/heap-checker.cc' line='2203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker24BeforeConstructorsLockedEv' hash='7f32ffea222edbe7'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MakeProfileNameLocked' mangled-name='_ZN15HeapLeakChecker21MakeProfileNameLockedEv' filepath='src/heap-checker.cc' line='1564' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker21MakeProfileNameLockedEv' hash='02a096d257a5e00d'>
          <parameter type-id='type-id-279' is-artificial='yes'/>
          <return type-id='type-id-130'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DisableChecksFromToLocked' mangled-name='_ZN15HeapLeakChecker25DisableChecksFromToLockedEPKvS1_i' filepath='src/heap-checker.cc' line='2336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker25DisableChecksFromToLockedEPKvS1_i' hash='388da3fa973fde78'>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DisableLibraryAllocsLocked' mangled-name='_ZN15HeapLeakChecker26DisableLibraryAllocsLockedEPKcmm' filepath='src/heap-checker.cc' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker26DisableLibraryAllocsLockedEPKcmm' hash='528fd71af1a2ca2e'>
          <parameter type-id='type-id-60'/>
          <parameter type-id='type-id-277'/>
          <parameter type-id='type-id-277'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='TurnItselfOffLocked' mangled-name='_ZN15HeapLeakChecker19TurnItselfOffLockedEv' filepath='src/heap-checker.cc' line='2229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker19TurnItselfOffLockedEv' hash='7f32ffea222edbe7'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker23IgnoreLiveObjectsLockedEPKcS1_' filepath='src/heap-checker.cc' line='1392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker23IgnoreLiveObjectsLockedEPKcS1_' hash='3d5693612af11c46'>
          <parameter type-id='type-id-60'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GetAllocCaller' mangled-name='_ZN15HeapLeakChecker14GetAllocCallerEPv' filepath='src/heap-checker.cc' line='2380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14GetAllocCallerEPv' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='CancelGlobalCheck' mangled-name='_ZN15HeapLeakChecker17CancelGlobalCheckEv' filepath='src/heap-checker.cc' line='2193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker17CancelGlobalCheckEv' hash='7f32ffea222edbe7'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GlobalChecker' mangled-name='_ZN15HeapLeakChecker13GlobalCheckerEv' filepath='src/heap-checker.cc' line='2181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker13GlobalCheckerEv' hash='99664fa74c8b5886'>
          <return type-id='type-id-279'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IsActive' mangled-name='_ZN15HeapLeakChecker8IsActiveEv' filepath='src/heap-checker.cc' line='1901' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker8IsActiveEv' hash='c7c710e908194b91'>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ObjectsLeaked' mangled-name='_ZNK15HeapLeakChecker13ObjectsLeakedEv' filepath='src/heap-checker.cc' line='1645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15HeapLeakChecker13ObjectsLeakedEv' hash='52c0efb08d2aa513'>
          <parameter type-id='type-id-280' is-artificial='yes'/>
          <return type-id='type-id-278'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='BytesLeaked' mangled-name='_ZNK15HeapLeakChecker11BytesLeakedEv' filepath='src/heap-checker.cc' line='1637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15HeapLeakChecker11BytesLeakedEv' hash='52c0efb08d2aa513'>
          <parameter type-id='type-id-280' is-artificial='yes'/>
          <return type-id='type-id-278'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='UnIgnoreObject' mangled-name='_ZN15HeapLeakChecker14UnIgnoreObjectEPKv' filepath='src/heap-checker.cc' line='1539' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14UnIgnoreObjectEPKv' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerD1Ev' filepath='src/heap-checker.cc' line='1875' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerD1Ev' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-279' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreNonThreadLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker32IgnoreNonThreadLiveObjectsLockedEv' filepath='src/heap-checker.cc' line='1093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker32IgnoreNonThreadLiveObjectsLockedEv' hash='7f32ffea222edbe7'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoIgnoreObject' mangled-name='_ZN15HeapLeakChecker14DoIgnoreObjectEPKv' filepath='src/heap-checker.cc' line='1519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker14DoIgnoreObjectEPKv' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='Create' mangled-name='_ZN15HeapLeakChecker6CreateEPKcb' filepath='src/heap-checker.cc' line='1576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker6CreateEPKcb' hash='1d691fe62b812ee9'>
          <parameter type-id='type-id-279' is-artificial='yes'/>
          <parameter type-id='type-id-60'/>
          <parameter type-id='type-id-59'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerC1Ev' filepath='src/heap-checker.cc' line='1621' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerC1Ev' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-279' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapLeakChecker' mangled-name='_ZN15HeapLeakCheckerC1EPKc' filepath='src/heap-checker.cc' line='1616' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakCheckerC1EPKc' hash='53885bde0aa65efe'>
          <parameter type-id='type-id-279' is-artificial='yes'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='UseProcMapsLocked' mangled-name='_ZN15HeapLeakChecker17UseProcMapsLockedENS_12ProcMapsTaskE' filepath='src/heap-checker.cc' line='892' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker17UseProcMapsLockedENS_12ProcMapsTaskE' hash='6c1520210560e52a'>
          <parameter type-id='type-id-273'/>
          <return type-id='type-id-272'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreLiveThreadsLocked' mangled-name='_ZN15HeapLeakChecker23IgnoreLiveThreadsLockedEPviPiP13__va_list_tag' filepath='src/heap-checker.cc' line='1021' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker23IgnoreLiveThreadsLockedEPviPiP13__va_list_tag' hash='60f7fa789d54ab1c'>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-79'/>
          <parameter type-id='type-id-80'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IgnoreAllLiveObjectsLocked' mangled-name='_ZN15HeapLeakChecker26IgnoreAllLiveObjectsLockedEPKv' filepath='src/heap-checker.cc' line='1261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker26IgnoreAllLiveObjectsLockedEPKv' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='DoNoLeaks' mangled-name='_ZN15HeapLeakChecker9DoNoLeaksENS_15ShouldSymbolizeE' filepath='src/heap-checker.cc' line='1712' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker9DoNoLeaksENS_15ShouldSymbolizeE' hash='201b9a45c4cc743f'>
          <parameter type-id='type-id-279' is-artificial='yes'/>
          <parameter type-id='type-id-274'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='NoGlobalLeaksMaybeSymbolize' mangled-name='_ZN15HeapLeakChecker27NoGlobalLeaksMaybeSymbolizeENS_15ShouldSymbolizeE' filepath='src/heap-checker.cc' line='2141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker27NoGlobalLeaksMaybeSymbolizeENS_15ShouldSymbolizeE' hash='201b9a45c4cc743f#2'>
          <parameter type-id='type-id-274'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='NoGlobalLeaks' mangled-name='_ZN15HeapLeakChecker13NoGlobalLeaksEv' filepath='src/heap-checker.cc' line='2187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker13NoGlobalLeaksEv' hash='c7c710e908194b91'>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoMainHeapCheck' mangled-name='_ZN15HeapLeakChecker15DoMainHeapCheckEv' filepath='src/heap-checker.cc' line='2153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15HeapLeakChecker15DoMainHeapCheckEv' hash='c7c710e908194b91'>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='HeapProfileTable' visibility='default' size-in-bits='832' filepath='src/heap-profile-table.h' line='51' column='1' hash='345094956414ce3a' id='type-id-281'>
      <member-type access='private'>
        <class-decl name='AddNonLiveArgs' is-struct='yes' visibility='default' size-in-bits='128' filepath='src/heap-profile-table.h' line='305' column='1' hash='8e781208f7863759' id='type-id-282'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='dest' type-id='type-id-283' visibility='default' filepath='src/heap-profile-table.h' line='306' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='base' type-id='type-id-283' visibility='default' filepath='src/heap-profile-table.h' line='307' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='AllocContextInfo' is-struct='yes' visibility='default' size-in-bits='320' filepath='src/heap-profile-table.h' line='77' column='1' hash='bac876d81c2c4cc1' id='type-id-284'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-285'/>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='stack_depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='78' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='call_stack' type-id='type-id-286' visibility='default' filepath='src/heap-profile-table.h' line='79' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='AllocInfo' is-struct='yes' visibility='default' size-in-bits='192' filepath='src/heap-profile-table.h' line='66' column='1' hash='4cb0991ce88c3954' id='type-id-287'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='object_size' type-id='type-id-61' visibility='default' filepath='src/heap-profile-table.h' line='67' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='call_stack' type-id='type-id-286' visibility='default' filepath='src/heap-profile-table.h' line='68' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='stack_depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='69' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='160'>
            <var-decl name='live' type-id='type-id-59' visibility='default' filepath='src/heap-profile-table.h' line='70' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='168'>
            <var-decl name='ignored' type-id='type-id-59' visibility='default' filepath='src/heap-profile-table.h' line='71' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='AllocValue' is-struct='yes' visibility='default' size-in-bits='128' filepath='src/heap-profile-table.h' line='190' column='1' hash='8293b8cc349a54a5' id='type-id-258'>
          <member-type access='private'>
            <typedef-decl name='Bucket' type-id='type-id-289' size-in-bits='448' filepath='src/heap-profile-table.h' line='187' column='1' id='type-id-288'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='bytes' type-id='type-id-61' visibility='default' filepath='src/heap-profile-table.h' line='197' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='bucket_rep' type-id='type-id-277' visibility='default' filepath='src/heap-profile-table.h' line='218' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='BufferArgs' is-struct='yes' visibility='default' size-in-bits='128' filepath='src/heap-profile-table.h' line='227' column='1' hash='091015b07ff18e1f' id='type-id-290'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='buf' type-id='type-id-130' visibility='default' filepath='src/heap-profile-table.h' line='234' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='buflen' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='235' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='bufsize' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='236' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='DumpArgs' is-struct='yes' visibility='default' size-in-bits='128' filepath='src/heap-profile-table.h' line='242' column='1' hash='56f87ce773364004' id='type-id-291'>
          <member-type access='public'>
            <typedef-decl name='Stats' type-id='type-id-285' size-in-bits='192' filepath='src/heap-profile-table.h' line='63' column='1' id='type-id-292'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='fd' type-id='type-id-83' visibility='default' filepath='src/heap-profile-table.h' line='248' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='profile_stats' type-id='type-id-293' visibility='default' filepath='src/heap-profile-table.h' line='249' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='Snapshot' is-struct='yes' visibility='default' size-in-bits='768' filepath='src/heap-profile-table.h' line='347' column='1' hash='b9c3c49a890454d3' id='type-id-294'>
          <member-type access='private'>
            <class-decl name='Entry' is-struct='yes' visibility='default' size-in-bits='128' filepath='src/heap-profile-table.cc' line='514' column='1' hash='a965c1627ce0ce09' id='type-id-295'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='count' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.cc' line='515' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='32'>
                <var-decl name='bytes' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.cc' line='516' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='64'>
                <var-decl name='bucket' type-id='type-id-296' visibility='default' filepath='src/heap-profile-table.cc' line='517' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <class-decl name='ReportState' is-struct='yes' visibility='default' size-in-bits='384' filepath='src/heap-profile-table.cc' line='528' column='1' hash='59f79b350a60fcce' id='type-id-297'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='buckets_' type-id='type-id-298' visibility='default' filepath='src/heap-profile-table.cc' line='529' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='total_' type-id='type-id-288' visibility='default' filepath='src/heap-profile-table.h' line='372' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='448'>
            <var-decl name='map_' type-id='type-id-299' visibility='default' filepath='src/heap-profile-table.h' line='376' column='1'/>
          </data-member>
          <member-function access='private' static='yes'>
            <function-decl name='ReportObject' mangled-name='_ZN16HeapProfileTable8Snapshot12ReportObjectEPKvPNS_10AllocValueEPc' filepath='src/heap-profile-table.cc' line='614' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot12ReportObjectEPKvPNS_10AllocValueEPc' hash='c3d5e8d93c14b581'>
              <parameter type-id='type-id-56'/>
              <parameter type-id='type-id-300'/>
              <parameter type-id='type-id-130'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='ReportIndividualObjects' mangled-name='_ZN16HeapProfileTable8Snapshot23ReportIndividualObjectsEv' filepath='src/heap-profile-table.cc' line='622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot23ReportIndividualObjectsEv' hash='7f32ffea222edbe7'>
              <parameter type-id='type-id-283' is-artificial='yes'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='private' static='yes'>
            <function-decl name='ReportCallback' mangled-name='_ZN16HeapProfileTable8Snapshot14ReportCallbackEPKvPNS_10AllocValueEPNS0_11ReportStateE' filepath='src/heap-profile-table.cc' line='533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot14ReportCallbackEPKvPNS_10AllocValueEPNS0_11ReportStateE' hash='d794cebc31bd91f7'>
              <parameter type-id='type-id-56'/>
              <parameter type-id='type-id-300'/>
              <parameter type-id='type-id-301'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='ReportLeaks' mangled-name='_ZN16HeapProfileTable8Snapshot11ReportLeaksEPKcS2_b' filepath='src/heap-profile-table.cc' line='542' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable8Snapshot11ReportLeaksEPKcS2_b' hash='fc23a79e09513cdb'>
              <parameter type-id='type-id-283' is-artificial='yes'/>
              <parameter type-id='type-id-60'/>
              <parameter type-id='type-id-60'/>
              <parameter type-id='type-id-59'/>
              <return type-id='type-id-58'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='AllocContextIterator' type-id='type-id-303' size-in-bits='64' filepath='src/heap-profile-table.h' line='147' column='1' hash='fd7a63c0c6c822c4' id='type-id-302'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='AllocIterator' type-id='type-id-305' size-in-bits='64' filepath='src/heap-profile-table.h' line='138' column='1' hash='fd7a63c0c6c822c4' id='type-id-304'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='AllocationMap' type-id='type-id-248' size-in-bits='320' filepath='src/heap-profile-table.h' line='224' column='1' id='type-id-299'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='Allocator' type-id='type-id-307' size-in-bits='64' filepath='src/heap-profile-table.h' line='83' column='1' hash='fd7a63c0c6c822c4' id='type-id-306'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='DeAllocator' type-id='type-id-255' size-in-bits='64' filepath='src/heap-profile-table.h' line='84' column='1' hash='fd7a63c0c6c822c4' id='type-id-308'/>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='kFileExt' type-id='type-id-309' mangled-name='_ZN16HeapProfileTable8kFileExtE' visibility='default' filepath='src/heap-profile-table.cc' line='99' column='1' elf-symbol-id='_ZN16HeapProfileTable8kFileExtE'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='kMaxStackDepth' type-id='type-id-159' mangled-name='_ZN16HeapProfileTable14kMaxStackDepthE' visibility='default' filepath='src/heap-profile-table.h' line='58' column='1' elf-symbol-id='_ZN16HeapProfileTable14kMaxStackDepthE'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='alloc_' type-id='type-id-306' visibility='default' filepath='src/heap-profile-table.h' line='325' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='dealloc_' type-id='type-id-308' visibility='default' filepath='src/heap-profile-table.h' line='326' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='total_' type-id='type-id-288' visibility='default' filepath='src/heap-profile-table.h' line='330' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='profile_mmap_' type-id='type-id-59' visibility='default' filepath='src/heap-profile-table.h' line='332' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='bucket_table_' type-id='type-id-310' visibility='default' filepath='src/heap-profile-table.h' line='338' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='num_buckets_' type-id='type-id-1' visibility='default' filepath='src/heap-profile-table.h' line='339' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='address_map_' type-id='type-id-311' visibility='default' filepath='src/heap-profile-table.h' line='342' column='1'/>
      </data-member>
      <member-function access='private' static='yes'>
        <function-decl name='MapArgsAllocIterator' mangled-name='_ZN16HeapProfileTable20MapArgsAllocIteratorEPKvPNS_10AllocValueEPFvS1_RKNS_9AllocInfoEE' filepath='src/heap-profile-table.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable20MapArgsAllocIteratorEPKvPNS_10AllocValueEPFvS1_RKNS_9AllocInfoEE' hash='79e377909b3eb7d7'>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-300'/>
          <parameter type-id='type-id-304'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AllocValueSize' mangled-name='_ZN16HeapProfileTable14AllocValueSizeERKNS_10AllocValueE' filepath='src/heap-profile-table.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable14AllocValueSizeERKNS_10AllocValueE' hash='eea6ded2882eee29'>
          <parameter type-id='type-id-312'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='private' destructor='yes'>
        <function-decl name='~HeapProfileTable' mangled-name='_ZN16HeapProfileTableD1Ev' filepath='src/heap-profile-table.cc' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTableD1Ev' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ReleaseSnapshot' mangled-name='_ZN16HeapProfileTable15ReleaseSnapshotEPNS_8SnapshotE' filepath='src/heap-profile-table.cc' line='485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable15ReleaseSnapshotEPNS_8SnapshotE' hash='d055d1fa605b6d5c'>
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <parameter type-id='type-id-283'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' constructor='yes'>
        <function-decl name='HeapProfileTable' mangled-name='_ZN16HeapProfileTableC2EPFPvmEPFvS0_Eb' filepath='src/heap-profile-table.cc' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTableC2EPFPvmEPFvS0_Eb' hash='86e303dd42a54213'>
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <parameter type-id='type-id-306'/>
          <parameter type-id='type-id-308'/>
          <parameter type-id='type-id-59'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='UnparseBucket' mangled-name='_ZN16HeapProfileTable13UnparseBucketERK17HeapProfileBucketPciiPKcP16HeapProfileStats' filepath='src/heap-profile-table.cc' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13UnparseBucketERK17HeapProfileBucketPciiPKcP16HeapProfileStats' hash='446a63ade4236164'>
          <parameter type-id='type-id-314'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-60'/>
          <parameter type-id='type-id-293'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DumpNonLiveIterator' mangled-name='_ZN16HeapProfileTable19DumpNonLiveIteratorEPKvPNS_10AllocValueERKNS_8DumpArgsE' filepath='src/heap-profile-table.cc' line='397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable19DumpNonLiveIteratorEPKvPNS_10AllocValueERKNS_8DumpArgsE' hash='54cc623966dbb6a1'>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-300'/>
          <parameter type-id='type-id-315'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DumpBucketIterator' mangled-name='_ZN16HeapProfileTable18DumpBucketIteratorEPK17HeapProfileBucketPNS_10BufferArgsE' filepath='src/heap-profile-table.cc' line='390' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable18DumpBucketIteratorEPK17HeapProfileBucketPNS_10BufferArgsE' hash='696e4681e6be6694'>
          <parameter type-id='type-id-316'/>
          <parameter type-id='type-id-317'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='GetBucket' mangled-name='_ZN16HeapProfileTable9GetBucketEiPKPKv' filepath='src/heap-profile-table.cc' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable9GetBucketEiPKPKv' hash='b6d0e8f32e037e2b'>
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-286'/>
          <return type-id='type-id-296'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GetCallerStackTrace' mangled-name='_ZN16HeapProfileTable19GetCallerStackTraceEiPPv' filepath='src/heap-profile-table.cc' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable19GetCallerStackTraceEiPPv' hash='50a6880b60aff73f'>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-184'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MakeSortedBucketList' mangled-name='_ZNK16HeapProfileTable20MakeSortedBucketListEv' filepath='src/heap-profile-table.cc' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable20MakeSortedBucketListEv' hash='60ed56c89de5e837'>
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <return type-id='type-id-310'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='IterateOrderedAllocContexts' mangled-name='_ZNK16HeapProfileTable27IterateOrderedAllocContextsEPFvRKNS_16AllocContextInfoEE' filepath='src/heap-profile-table.cc' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable27IterateOrderedAllocContextsEPFvRKNS_16AllocContextInfoEE' hash='5695f5ce05a4c55f'>
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <parameter type-id='type-id-302'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FillOrderedProfile' mangled-name='_ZNK16HeapProfileTable18FillOrderedProfileEPci' filepath='src/heap-profile-table.cc' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable18FillOrderedProfileEPci' hash='8487c9d489875495'>
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MarkAsIgnored' mangled-name='_ZN16HeapProfileTable13MarkAsIgnoredEPKv' filepath='src/heap-profile-table.cc' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13MarkAsIgnoredEPKv' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='WriteProfile' mangled-name='_ZN16HeapProfileTable12WriteProfileEPKcRK17HeapProfileBucketP10AddressMapINS_10AllocValueEE' filepath='src/heap-profile-table.cc' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12WriteProfileEPKcRK17HeapProfileBucketP10AddressMapINS_10AllocValueEE' hash='d0ea9d1532049c25'>
          <parameter type-id='type-id-60'/>
          <parameter type-id='type-id-314'/>
          <parameter type-id='type-id-311'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindInsideAlloc' mangled-name='_ZNK16HeapProfileTable15FindInsideAllocEPKvmPS1_Pm' filepath='src/heap-profile-table.cc' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable15FindInsideAllocEPKvmPS1_Pm' hash='0f316b00ac7ee281'>
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-61'/>
          <parameter type-id='type-id-184'/>
          <parameter type-id='type-id-319'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AddToSnapshot' mangled-name='_ZN16HeapProfileTable13AddToSnapshotEPKvPNS_10AllocValueEPNS_8SnapshotE' filepath='src/heap-profile-table.cc' line='491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable13AddToSnapshotEPKvPNS_10AllocValueEPNS_8SnapshotE' hash='e4fe7bb089a91809'>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-300'/>
          <parameter type-id='type-id-283'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='TakeSnapshot' mangled-name='_ZN16HeapProfileTable12TakeSnapshotEv' filepath='src/heap-profile-table.cc' line='479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12TakeSnapshotEv' hash='d055d1fa605b6d5c'>
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <return type-id='type-id-283'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='RecordAlloc' mangled-name='_ZN16HeapProfileTable11RecordAllocEPKvmiPKS1_' filepath='src/heap-profile-table.cc' line='210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable11RecordAllocEPKvmiPKS1_' hash='4d3907c2c1e842ae'>
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-61'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-286'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='RecordFree' mangled-name='_ZN16HeapProfileTable10RecordFreeEPKv' filepath='src/heap-profile-table.cc' line='225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable10RecordFreeEPKv' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AddIfNonLive' mangled-name='_ZN16HeapProfileTable12AddIfNonLiveEPKvPNS_10AllocValueEPNS_14AddNonLiveArgsE' filepath='src/heap-profile-table.cc' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable12AddIfNonLiveEPKvPNS_10AllocValueEPNS_14AddNonLiveArgsE' hash='f36b47d22ae82aa9'>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-300'/>
          <parameter type-id='type-id-320'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='NonLiveSnapshot' mangled-name='_ZN16HeapProfileTable15NonLiveSnapshotEPNS_8SnapshotE' filepath='src/heap-profile-table.cc' line='496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable15NonLiveSnapshotEPNS_8SnapshotE' hash='d7cf3f266b91be01'>
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <parameter type-id='type-id-283'/>
          <return type-id='type-id-283'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='MarkAsLive' mangled-name='_ZN16HeapProfileTable10MarkAsLiveEPKv' filepath='src/heap-profile-table.cc' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable10MarkAsLiveEPKv' hash='c7c710e908194b91'>
          <parameter type-id='type-id-313' is-artificial='yes'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='CleanupOldProfiles' mangled-name='_ZN16HeapProfileTable18CleanupOldProfilesEPKc' filepath='src/heap-profile-table.cc' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16HeapProfileTable18CleanupOldProfilesEPKc' hash='53885bde0aa65efe'>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindAllocDetails' mangled-name='_ZNK16HeapProfileTable16FindAllocDetailsEPKvPNS_9AllocInfoE' filepath='src/heap-profile-table.cc' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable16FindAllocDetailsEPKvPNS_9AllocInfoE' hash='74fcff412c436e0b'>
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-321'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindAlloc' mangled-name='_ZNK16HeapProfileTable9FindAllocEPKvPm' filepath='src/heap-profile-table.cc' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16HeapProfileTable9FindAllocEPKvPm' hash='a64ac8f4f7534435'>
          <parameter type-id='type-id-318' is-artificial='yes'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-319'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='LowLevelAlloc' visibility='default' size-in-bits='8' filepath='src/base/low_level_alloc.h' line='44' column='1' hash='c55f19eb4cd0776f' id='type-id-322'>
      <member-type access='private'>
        <class-decl name='Arena' is-struct='yes' visibility='default' size-in-bits='2560' filepath='src/base/low_level_alloc.cc' line='184' column='1' hash='f6ff43c8ab87ab07' id='type-id-323'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='mu' type-id='type-id-102' visibility='default' filepath='src/base/low_level_alloc.cc' line='189' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='freelist' type-id='type-id-89' visibility='default' filepath='src/base/low_level_alloc.cc' line='191' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2304'>
            <var-decl name='allocation_count' type-id='type-id-81' visibility='default' filepath='src/base/low_level_alloc.cc' line='192' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2336'>
            <var-decl name='flags' type-id='type-id-81' visibility='default' filepath='src/base/low_level_alloc.cc' line='193' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2368'>
            <var-decl name='pagesize' type-id='type-id-61' visibility='default' filepath='src/base/low_level_alloc.cc' line='194' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2432'>
            <var-decl name='roundup' type-id='type-id-61' visibility='default' filepath='src/base/low_level_alloc.cc' line='195' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2496'>
            <var-decl name='min_size' type-id='type-id-61' visibility='default' filepath='src/base/low_level_alloc.cc' line='197' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-function access='private' static='yes'>
        <function-decl name='DefaultArena' mangled-name='_ZN13LowLevelAlloc12DefaultArenaEv' filepath='src/base/low_level_alloc.cc' line='521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc12DefaultArenaEv' hash='b79eb19d4c2d908e'>
          <return type-id='type-id-87'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='AllocWithArena' mangled-name='_ZN13LowLevelAlloc14AllocWithArenaEmPNS_5ArenaE' filepath='src/base/low_level_alloc.cc' line='510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc14AllocWithArenaEmPNS_5ArenaE' hash='ee12f578c4792ed6'>
          <parameter type-id='type-id-61'/>
          <parameter type-id='type-id-87'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='NewArena' mangled-name='_ZN13LowLevelAlloc8NewArenaEiPNS_5ArenaE' filepath='src/base/low_level_alloc.cc' line='296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc8NewArenaEiPNS_5ArenaE' hash='d71230e10294e65d'>
          <parameter type-id='type-id-81'/>
          <parameter type-id='type-id-87'/>
          <return type-id='type-id-87'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Alloc' mangled-name='_ZN13LowLevelAlloc5AllocEm' filepath='src/base/low_level_alloc.cc' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc5AllocEm' hash='e0055d99adb0e173'>
          <parameter type-id='type-id-61'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Free' mangled-name='_ZN13LowLevelAlloc4FreeEPv' filepath='src/base/low_level_alloc.cc' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc4FreeEPv' hash='7f32ffea222edbe7'>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DeleteArena' mangled-name='_ZN13LowLevelAlloc11DeleteArenaEPNS_5ArenaE' filepath='src/base/low_level_alloc.cc' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13LowLevelAlloc11DeleteArenaEPNS_5ArenaE' hash='afc65823b0d92ac9'>
          <parameter type-id='type-id-87'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='MemoryRegionMap' visibility='default' size-in-bits='8' filepath='src/memory_region_map.h' line='69' column='1' hash='a7b84d65e51c3c1a' id='type-id-324'>
      <member-type access='private'>
        <class-decl name='LockHolder' visibility='default' size-in-bits='8' filepath='src/memory_region_map.h' line='126' column='1' hash='45fb04c1bd8375c4' id='type-id-325'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='MyAllocator' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/memory_region_map.h' line='252' column='1' hash='d9ccece561bd6edb' id='type-id-326'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='Region' is-struct='yes' visibility='default' size-in-bits='2304' filepath='src/memory_region_map.h' line='137' column='1' hash='6f3aa3a5da33f0d6' id='type-id-327'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='start_addr' type-id='type-id-277' visibility='default' filepath='src/memory_region_map.h' line='138' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='end_addr' type-id='type-id-277' visibility='default' filepath='src/memory_region_map.h' line='139' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='call_stack_depth' type-id='type-id-1' visibility='default' filepath='src/memory_region_map.h' line='140' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='call_stack' type-id='type-id-328' visibility='default' filepath='src/memory_region_map.h' line='141' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='2240'>
            <var-decl name='is_stack' type-id='type-id-59' visibility='default' filepath='src/memory_region_map.h' line='143' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='RegionCmp' is-struct='yes' visibility='default' size-in-bits='8' filepath='src/memory_region_map.h' line='245' column='1' hash='b84997bda69f730a' id='type-id-329'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='RegionIterator' type-id='type-id-331' size-in-bits='64' filepath='src/memory_region_map.h' line='268' column='1' id='type-id-330'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='RegionSet' type-id='type-id-333' size-in-bits='384' filepath='src/memory_region_map.h' line='263' column='1' id='type-id-332'/>
      </member-type>
      <member-type access='private'>
        <union-decl name='RegionSetRep' visibility='default' is-declaration-only='yes' id='type-id-334'/>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='client_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap13client_count_E' visibility='default' filepath='src/memory_region_map.cc' line='141' column='1' elf-symbol-id='_ZN15MemoryRegionMap13client_count_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='max_stack_depth_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap16max_stack_depth_E' visibility='default' filepath='src/memory_region_map.cc' line='142' column='1' elf-symbol-id='_ZN15MemoryRegionMap16max_stack_depth_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='arena_' type-id='type-id-87' mangled-name='_ZN15MemoryRegionMap6arena_E' visibility='default' filepath='src/memory_region_map.cc' line='144' column='1' elf-symbol-id='_ZN15MemoryRegionMap6arena_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='regions_' type-id='type-id-335' mangled-name='_ZN15MemoryRegionMap8regions_E' visibility='default' filepath='src/memory_region_map.cc' line='143' column='1' elf-symbol-id='_ZN15MemoryRegionMap8regions_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='lock_' type-id='type-id-102' mangled-name='_ZN15MemoryRegionMap5lock_E' visibility='default' filepath='src/memory_region_map.cc' line='145' column='1' elf-symbol-id='_ZN15MemoryRegionMap5lock_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='owner_lock_' type-id='type-id-102' mangled-name='_ZN15MemoryRegionMap11owner_lock_E' visibility='default' filepath='src/memory_region_map.cc' line='147' column='1' elf-symbol-id='_ZN15MemoryRegionMap11owner_lock_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='recursion_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap16recursion_count_E' visibility='default' filepath='src/memory_region_map.cc' line='148' column='1' elf-symbol-id='_ZN15MemoryRegionMap16recursion_count_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='lock_owner_tid_' type-id='type-id-336' mangled-name='_ZN15MemoryRegionMap15lock_owner_tid_E' visibility='default' filepath='src/memory_region_map.cc' line='149' column='1' elf-symbol-id='_ZN15MemoryRegionMap15lock_owner_tid_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='map_size_' type-id='type-id-105' mangled-name='_ZN15MemoryRegionMap9map_size_E' visibility='default' filepath='src/memory_region_map.cc' line='150' column='1' elf-symbol-id='_ZN15MemoryRegionMap9map_size_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='unmap_size_' type-id='type-id-105' mangled-name='_ZN15MemoryRegionMap11unmap_size_E' visibility='default' filepath='src/memory_region_map.cc' line='151' column='1' elf-symbol-id='_ZN15MemoryRegionMap11unmap_size_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='bucket_table_' type-id='type-id-337' mangled-name='_ZN15MemoryRegionMap13bucket_table_E' visibility='default' filepath='src/memory_region_map.cc' line='152' column='1' elf-symbol-id='_ZN15MemoryRegionMap13bucket_table_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='num_buckets_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap12num_buckets_E' visibility='default' filepath='src/memory_region_map.cc' line='153' column='1' elf-symbol-id='_ZN15MemoryRegionMap12num_buckets_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='saved_buckets_count_' type-id='type-id-1' mangled-name='_ZN15MemoryRegionMap20saved_buckets_count_E' visibility='default' filepath='src/memory_region_map.cc' line='154' column='1' elf-symbol-id='_ZN15MemoryRegionMap20saved_buckets_count_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='saved_buckets_' type-id='type-id-338' mangled-name='_ZN15MemoryRegionMap14saved_buckets_E' visibility='default' filepath='src/memory_region_map.cc' line='155' column='1' elf-symbol-id='_ZN15MemoryRegionMap14saved_buckets_E'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='saved_buckets_keys_' type-id='type-id-339' mangled-name='_ZN15MemoryRegionMap19saved_buckets_keys_E' visibility='default' filepath='src/memory_region_map.cc' line='158' column='1' elf-symbol-id='_ZN15MemoryRegionMap19saved_buckets_keys_E'/>
      </data-member>
      <member-function access='private' static='yes'>
        <function-decl name='HandleSavedRegionsLocked' mangled-name='_ZN15MemoryRegionMap24HandleSavedRegionsLockedEPFvRKNS_6RegionEE' filepath='src/memory_region_map.cc' line='487' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap24HandleSavedRegionsLockedEPFvRKNS_6RegionEE' hash='5695f5ce05a4c55f'>
          <parameter type-id='type-id-340'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Unlock' mangled-name='_ZN15MemoryRegionMap6UnlockEv' filepath='src/memory_region_map.cc' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap6UnlockEv' hash='7f32ffea222edbe7'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='LockIsHeld' mangled-name='_ZN15MemoryRegionMap10LockIsHeldEv' filepath='src/memory_region_map.cc' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10LockIsHeldEv' hash='c7c710e908194b91'>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='LogAllLocked' mangled-name='_ZN15MemoryRegionMap12LogAllLockedEv' filepath='src/memory_region_map.cc' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap12LogAllLockedEv' hash='7f32ffea222edbe7'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoInsertRegionLocked' mangled-name='_ZN15MemoryRegionMap20DoInsertRegionLockedERKNS_6RegionE' filepath='src/memory_region_map.cc' line='443' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap20DoInsertRegionLockedERKNS_6RegionE' hash='d2a180ed49dda32d'>
          <parameter type-id='type-id-341'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='EndRegionLocked' mangled-name='_ZN15MemoryRegionMap15EndRegionLockedEv' filepath='src/memory_region_map.cc' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap15EndRegionLockedEv' hash='7f32ffea222edbe7'>
          <return type-id='type-id-330'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='BeginRegionLocked' mangled-name='_ZN15MemoryRegionMap17BeginRegionLockedEv' filepath='src/memory_region_map.cc' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap17BeginRegionLockedEv' hash='7f32ffea222edbe7'>
          <return type-id='type-id-330'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoFindRegionLocked' mangled-name='_ZN15MemoryRegionMap18DoFindRegionLockedEm' filepath='src/memory_region_map.cc' line='334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap18DoFindRegionLockedEm' hash='0d5a4f50079cbc9a'>
          <parameter type-id='type-id-277'/>
          <return type-id='type-id-342'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='IsRecordingLocked' mangled-name='_ZN15MemoryRegionMap17IsRecordingLockedEv' filepath='src/memory_region_map.cc' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap17IsRecordingLockedEv' hash='c7c710e908194b91'>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Lock' mangled-name='_ZN15MemoryRegionMap4LockEv' filepath='src/memory_region_map.cc' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap4LockEv' hash='7f32ffea222edbe7'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FindAndMarkStackRegion' mangled-name='_ZN15MemoryRegionMap22FindAndMarkStackRegionEmPNS_6RegionE' filepath='src/memory_region_map.cc' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap22FindAndMarkStackRegionEmPNS_6RegionE' hash='e33ae77537c78254'>
          <parameter type-id='type-id-277'/>
          <parameter type-id='type-id-343'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FindRegion' mangled-name='_ZN15MemoryRegionMap10FindRegionEmPNS_6RegionE' filepath='src/memory_region_map.cc' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10FindRegionEmPNS_6RegionE' hash='e33ae77537c78254'>
          <parameter type-id='type-id-277'/>
          <parameter type-id='type-id-343'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Shutdown' mangled-name='_ZN15MemoryRegionMap8ShutdownEv' filepath='src/memory_region_map.cc' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8ShutdownEv' hash='c7c710e908194b91'>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='Init' mangled-name='_ZN15MemoryRegionMap4InitEib' filepath='src/memory_region_map.cc' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap4InitEib' hash='a79502d22727be06'>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-59'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RestoreSavedBucketsLocked' mangled-name='_ZN15MemoryRegionMap25RestoreSavedBucketsLockedEv' filepath='src/memory_region_map.cc' line='499' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap25RestoreSavedBucketsLockedEv' hash='7f32ffea222edbe7'>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='GetBucket' mangled-name='_ZN15MemoryRegionMap9GetBucketEiPKPKv' filepath='src/memory_region_map.cc' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap9GetBucketEiPKPKv' hash='48445b2fb3c4a68e'>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-286'/>
          <return type-id='type-id-344'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RecordRegionRemovalInBucket' mangled-name='_ZN15MemoryRegionMap27RecordRegionRemovalInBucketEiPKPKvm' filepath='src/memory_region_map.cc' line='752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap27RecordRegionRemovalInBucketEiPKPKvm' hash='529c7cd691910ece'>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-286'/>
          <parameter type-id='type-id-61'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='InsertRegionLocked' mangled-name='_ZN15MemoryRegionMap18InsertRegionLockedERKNS_6RegionE' filepath='src/memory_region_map.cc' line='537' column='1' declared-inline='yes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap18InsertRegionLockedERKNS_6RegionE' hash='d2a180ed49dda32d'>
          <parameter type-id='type-id-341'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RecordRegionAddition' mangled-name='_ZN15MemoryRegionMap20RecordRegionAdditionEPKvm' filepath='src/memory_region_map.cc' line='580' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap20RecordRegionAdditionEPKvm' hash='e0055d99adb0e173'>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-61'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MmapHook' mangled-name='_ZN15MemoryRegionMap8MmapHookEPKvS1_miiil' filepath='src/memory_region_map.cc' line='762' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8MmapHookEPKvS1_miiil' hash='d89e6f5baae5273c'>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-61'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-345'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='RecordRegionRemoval' mangled-name='_ZN15MemoryRegionMap19RecordRegionRemovalEPKvm' filepath='src/memory_region_map.cc' line='634' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap19RecordRegionRemovalEPKvm' hash='e0055d99adb0e173'>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-61'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MunmapHook' mangled-name='_ZN15MemoryRegionMap10MunmapHookEPKvm' filepath='src/memory_region_map.cc' line='778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10MunmapHookEPKvm' hash='e0055d99adb0e173'>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-61'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='SbrkHook' mangled-name='_ZN15MemoryRegionMap8SbrkHookEPKvl' filepath='src/memory_region_map.cc' line='800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap8SbrkHookEPKvl' hash='52c0efb08d2aa513'>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-346'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='MremapHook' mangled-name='_ZN15MemoryRegionMap10MremapHookEPKvS1_mmiS1_' filepath='src/memory_region_map.cc' line='785' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15MemoryRegionMap10MremapHookEPKvS1_mmiS1_' hash='d8f551d99ba6f26a'>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-56'/>
          <parameter type-id='type-id-61'/>
          <parameter type-id='type-id-61'/>
          <parameter type-id='type-id-1'/>
          <parameter type-id='type-id-56'/>
          <return type-id='type-id-58'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt;' visibility='default' size-in-bits='8' filepath='src/base/stl_allocator.h' line='60' column='1' hash='b6006b08de989dc0' id='type-id-347'/>
    <class-decl name='STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt;' visibility='default' size-in-bits='8' filepath='src/base/stl_allocator.h' line='60' column='1' hash='e39a5832c57b7a4e' id='type-id-348'/>
    <class-decl name='STL_Allocator&lt;long unsigned int, HeapLeakChecker::Allocator&gt;' visibility='default' size-in-bits='8' filepath='src/base/stl_allocator.h' line='60' column='1' hash='44ca8e382350b5f6' id='type-id-349'/>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;long unsigned int&gt;, HeapLeakChecker::Allocator&gt;' visibility='default' size-in-bits='8' filepath='src/base/stl_allocator.h' line='60' column='1' hash='6193c3b660526c50' id='type-id-350'/>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt;, HeapLeakChecker::Allocator&gt;' visibility='default' size-in-bits='8' filepath='src/base/stl_allocator.h' line='60' column='1' hash='de56ae0409a56c3c' id='type-id-351'/>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt;, HeapLeakChecker::Allocator&gt;' visibility='default' size-in-bits='8' filepath='src/base/stl_allocator.h' line='60' column='1' hash='0a09b8ffad890478' id='type-id-352'/>
    <class-decl name='STL_Allocator&lt;std::_Rb_tree_node&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt; &gt;, HeapLeakChecker::Allocator&gt;' visibility='default' size-in-bits='8' filepath='src/base/stl_allocator.h' line='60' column='1' hash='fd51693fea9d2f61' id='type-id-353'/>
    <class-decl name='STL_Allocator&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;, HeapLeakChecker::Allocator&gt;' visibility='default' size-in-bits='8' filepath='src/base/stl_allocator.h' line='60' column='1' hash='e719f4ee346c8b8e' id='type-id-354'/>
    <class-decl name='STL_Allocator&lt;std::pair&lt;const long unsigned int, long unsigned int&gt;, HeapLeakChecker::Allocator&gt;' visibility='default' size-in-bits='8' filepath='src/base/stl_allocator.h' line='60' column='1' hash='67b67043abd9fba6' id='type-id-355'/>
    <class-decl name='STL_Allocator&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, STL_Allocator&lt;char, HeapLeakChecker::Allocator&gt; &gt;, std::vector&lt;AllocObject, STL_Allocator&lt;AllocObject, HeapLeakChecker::Allocator&gt; &gt; &gt;, HeapLeakChecker::Allocator&gt;' visibility='default' size-in-bits='8' filepath='src/base/stl_allocator.h' line='60' column='1' hash='ef858715047a8a50' id='type-id-356'/>
    <class-decl name='STL_Allocator&lt;void*, HeapLeakChecker::Allocator&gt;' visibility='default' size-in-bits='8' filepath='src/base/stl_allocator.h' line='60' column='1' hash='39c9dbb33650eb94' id='type-id-357'/>
    <enum-decl name='ObjectPlacement' size-in-bits='32' alignment-in-bits='32' filepath='src/heap-checker.cc' line='345' column='1' hash='7a80bb93811484b3' id='type-id-358'>
      <underlying-type type-id='type-id-93'/>
      <enumerator name='MUST_BE_ON_HEAP' value='0'/>
      <enumerator name='IGNORED_ON_HEAP' value='1'/>
      <enumerator name='MAYBE_LIVE' value='2'/>
      <enumerator name='IN_GLOBAL_DATA' value='3'/>
      <enumerator name='THREAD_DATA' value='4'/>
      <enumerator name='THREAD_REGISTERS' value='5'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='type-id-61' size-in-bits='256' hash='3faccf7f3517bdb4' id='type-id-359'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-360'/>
    </array-type-def>
    <class-decl name='AllocObject' is-struct='yes' visibility='default' size-in-bits='192' filepath='src/heap-checker.cc' line='356' column='1' hash='55c7da8fdf062763' id='type-id-361'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='type-id-56' visibility='default' filepath='src/heap-checker.cc' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-277' visibility='default' filepath='src/heap-checker.cc' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='place' type-id='type-id-358' visibility='default' filepath='src/heap-checker.cc' line='359' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='HeapProfileBucket' is-struct='yes' visibility='default' size-in-bits='448' filepath='src/heap-profile-stats.h' line='68' column='1' hash='2e84093fba1c7854' id='type-id-289'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-285'/>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash' type-id='type-id-277' visibility='default' filepath='src/heap-profile-stats.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='depth' type-id='type-id-1' visibility='default' filepath='src/heap-profile-stats.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='stack' type-id='type-id-184' visibility='default' filepath='src/heap-profile-stats.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='next' type-id='type-id-344' visibility='default' filepath='src/heap-profile-stats.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='HeapProfileStats' is-struct='yes' visibility='default' size-in-bits='192' filepath='src/heap-profile-stats.h' line='54' column='1' hash='0d34ab555cebf165' id='type-id-285'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='allocs' type-id='type-id-81' visibility='default' filepath='src/heap-profile-stats.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='frees' type-id='type-id-81' visibility='default' filepath='src/heap-profile-stats.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='alloc_size' type-id='type-id-105' visibility='default' filepath='src/heap-profile-stats.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='free_size' type-id='type-id-105' visibility='default' filepath='src/heap-profile-stats.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='AtomicWord' type-id='type-id-362' size-in-bits='64' filepath='src/base/atomicops.h' line='129' column='1' hash='b119fe0931d2ee10#2' id='type-id-245'/>
    <typedef-decl name='DisabledRangeMap' type-id='type-id-363' size-in-bits='384' filepath='src/heap-checker.cc' line='411' column='1' id='type-id-364'/>
    <typedef-decl name='GlobalRegionCallerRangeMap' type-id='type-id-365' size-in-bits='384' filepath='src/heap-checker.cc' line='432' column='1' id='type-id-366'/>
    <typedef-decl name='LibraryLiveObjectsStacks' type-id='type-id-367' size-in-bits='384' filepath='src/heap-checker.cc' line='397' column='1' id='type-id-368'/>
    <typedef-decl name='LiveObjectsStack' type-id='type-id-369' size-in-bits='192' filepath='src/heap-checker.cc' line='384' column='1' id='type-id-370'/>
    <typedef-decl name='MallocHook_DeleteHook' type-id='type-id-255' size-in-bits='64' filepath='./src/gperftools/malloc_hook_c.h' line='76' column='1' hash='fd7a63c0c6c822c4' id='type-id-371'/>
    <typedef-decl name='MallocHook_MmapHook' type-id='type-id-372' size-in-bits='64' filepath='./src/gperftools/malloc_hook_c.h' line='99' column='1' hash='fd7a63c0c6c822c4' id='type-id-373'/>
    <typedef-decl name='MallocHook_NewHook' type-id='type-id-97' size-in-bits='64' filepath='./src/gperftools/malloc_hook_c.h' line='70' column='1' hash='fd7a63c0c6c822c4' id='type-id-374'/>
    <typedef-decl name='MallocHook_SbrkHook' type-id='type-id-375' size-in-bits='64' filepath='./src/gperftools/malloc_hook_c.h' line='144' column='1' hash='fd7a63c0c6c822c4' id='type-id-376'/>
    <typedef-decl name='RawFD' type-id='type-id-1' size-in-bits='32' filepath='./src/base/logging.h' line='251' column='1' hash='09d17c08f594edc7' id='type-id-83'/>
    <typedef-decl name='StackTopSet' type-id='type-id-377' size-in-bits='384' filepath='src/heap-checker.cc' line='422' column='1' id='type-id-378'/>
    <typedef-decl name='__intptr_t' type-id='type-id-179' size-in-bits='64' filepath='/usr/include/bits/types.h' line='189' column='1' hash='b119fe0931d2ee10' id='type-id-379'/>
    <typedef-decl name='__ssize_t' type-id='type-id-179' size-in-bits='64' filepath='/usr/include/bits/types.h' line='180' column='1' hash='b119fe0931d2ee10' id='type-id-380'/>
    <typedef-decl name='intptr_t' type-id='type-id-379' size-in-bits='64' filepath='/usr/include/unistd.h' line='268' column='1' hash='b119fe0931d2ee10#2' id='type-id-362'/>
    <typedef-decl name='ssize_t' type-id='type-id-380' size-in-bits='64' filepath='/usr/include/sys/types.h' line='110' column='1' hash='b119fe0931d2ee10' id='type-id-278'/>
    <array-type-def dimensions='1' type-id='type-id-56' hash='5d3fd11335b842ea' id='type-id-328'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-381'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' hash='27ca620fdc0acd81' id='type-id-257'/>
    <reference-type-def kind='lvalue' type-id='type-id-361' size-in-bits='64' hash='c626c1f004b7edfa' id='type-id-382'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' hash='98e4132b728e09d4' id='type-id-383'/>
    <qualified-type-def type-id='type-id-383' const='yes' hash='c4a16ff4a37103ce' id='type-id-384'/>
    <reference-type-def kind='lvalue' type-id='type-id-384' size-in-bits='64' hash='f5fb013facda5ffa' id='type-id-385'/>
    <reference-type-def kind='lvalue' type-id='type-id-383' size-in-bits='64' hash='86490b5895bbed86' id='type-id-386'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' hash='a3f9b8e2c6edab54' id='type-id-387'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='64' hash='1b2d2eb3fd01e066' id='type-id-388'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' hash='c0244ea8ad03b845' id='type-id-389'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' hash='c819f0d9982d0e3f' id='type-id-390'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' hash='566791fedbd89a17' id='type-id-264'/>
    <qualified-type-def type-id='type-id-264' const='yes' hash='832c270a6145f187' id='type-id-391'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' hash='a79471b92bd2625a' id='type-id-268'/>
    <qualified-type-def type-id='type-id-268' const='yes' hash='21a89aebcf94d950' id='type-id-392'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' hash='d55377855cf76ce7' id='type-id-279'/>
    <qualified-type-def type-id='type-id-279' const='yes' hash='b93bb1ff52f08527' id='type-id-393'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' hash='10cd53d230669192' id='type-id-271'/>
    <qualified-type-def type-id='type-id-271' const='yes' hash='c703da715da761f1' id='type-id-394'/>
    <reference-type-def kind='lvalue' type-id='type-id-276' size-in-bits='64' hash='734c32c7a2c39822' id='type-id-395'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' hash='58e57fc994709824' id='type-id-344'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' hash='921e04b160c7d1f7' id='type-id-313'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' hash='ec9d5108eb9a2b3e' id='type-id-396'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' hash='e48cd8b4058344df' id='type-id-320'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' hash='f8d18ced706fb73f' id='type-id-321'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' hash='7505dcae5582781d' id='type-id-300'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' hash='88df8b6683f98ed2' id='type-id-296'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' hash='4df5de4be2947731' id='type-id-310'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' hash='739e1e4f1de648e5' id='type-id-311'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' hash='ec052920a6de5bb1' id='type-id-317'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' hash='6f6cdf84d20bfe66' id='type-id-397'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' hash='15d73fb7ebf997cd' id='type-id-293'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' hash='ffd8886d4bc3cd83' id='type-id-283'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' hash='5c407806d8cefa3e' id='type-id-301'/>
    <pointer-type-def type-id='type-id-368' size-in-bits='64' hash='01bb7b5b689c1c55' id='type-id-398'/>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' hash='4871c20c22ea1d7f' id='type-id-399'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' hash='cd51ae8080840d3c' id='type-id-400'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' hash='8ff287de4d2c5168' id='type-id-401'/>
    <pointer-type-def type-id='type-id-323' size-in-bits='64' hash='b4325a8ff1c518d9' id='type-id-87'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' hash='84f9f55ce069bbc8' id='type-id-402'/>
    <qualified-type-def type-id='type-id-402' const='yes' hash='ed3f9b15f992fa41' id='type-id-403'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' hash='2a25bcdaa99f44a6' id='type-id-343'/>
    <reference-type-def kind='lvalue' type-id='type-id-347' size-in-bits='64' hash='64be31e301eb3486' id='type-id-404'/>
    <pointer-type-def type-id='type-id-347' size-in-bits='64' hash='2f8c03e9ae80a3c9' id='type-id-405'/>
    <qualified-type-def type-id='type-id-405' const='yes' hash='35c8ac3ca946c176' id='type-id-406'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' hash='a84940de32fb1c65' id='type-id-407'/>
    <qualified-type-def type-id='type-id-407' const='yes' hash='9652461c3c0e40bd' id='type-id-408'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' hash='8860d9d98ff0c5e6' id='type-id-409'/>
    <qualified-type-def type-id='type-id-409' const='yes' hash='6f73a973f315d1c7' id='type-id-410'/>
    <reference-type-def kind='lvalue' type-id='type-id-350' size-in-bits='64' hash='39386eaeadc1b565' id='type-id-411'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' hash='c546f7d6cbb2b3b5' id='type-id-412'/>
    <qualified-type-def type-id='type-id-412' const='yes' hash='394b945a8e246165' id='type-id-413'/>
    <reference-type-def kind='lvalue' type-id='type-id-351' size-in-bits='64' hash='e024f02a6c421546' id='type-id-414'/>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' hash='d154d03963a52336' id='type-id-415'/>
    <qualified-type-def type-id='type-id-415' const='yes' hash='2af7178fd72acf36' id='type-id-416'/>
    <reference-type-def kind='lvalue' type-id='type-id-352' size-in-bits='64' hash='8c1e6d88e90135d3' id='type-id-417'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' hash='279e692a1a354fdc' id='type-id-418'/>
    <qualified-type-def type-id='type-id-418' const='yes' hash='e53abfb81f65ffee' id='type-id-419'/>
    <reference-type-def kind='lvalue' type-id='type-id-353' size-in-bits='64' hash='cf65b592ba11906e' id='type-id-420'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' hash='46071a8c88fc91bc' id='type-id-421'/>
    <qualified-type-def type-id='type-id-421' const='yes' hash='53d53f1cae800899' id='type-id-422'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' hash='87bf87ccc55e0167' id='type-id-423'/>
    <qualified-type-def type-id='type-id-423' const='yes' hash='96b3c13e077f4eae' id='type-id-424'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' hash='36a02b4c28239f29' id='type-id-425'/>
    <qualified-type-def type-id='type-id-425' const='yes' hash='1f4df51dc90dc614' id='type-id-426'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' hash='ec2dbe05548680b1' id='type-id-427'/>
    <qualified-type-def type-id='type-id-427' const='yes' hash='b456d730500e9f17' id='type-id-428'/>
    <reference-type-def kind='lvalue' type-id='type-id-357' size-in-bits='64' hash='1c396c745647dc9e' id='type-id-429'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' hash='5ad964df81e51440' id='type-id-430'/>
    <qualified-type-def type-id='type-id-430' const='yes' hash='94372520e79d20a9' id='type-id-431'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' hash='18187cd5f591babc' id='type-id-432'/>
    <pointer-type-def type-id='type-id-432' size-in-bits='64' hash='665f9308bee6e52c' id='type-id-433'/>
    <reference-type-def kind='lvalue' type-id='type-id-434' size-in-bits='64' hash='d4cbfc244407fb5c' id='type-id-435'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' hash='7e1ef7223c31038a' id='type-id-436'/>
    <qualified-type-def type-id='type-id-436' const='yes' hash='bba9c6b74cc3b9d2' id='type-id-437'/>
    <reference-type-def kind='lvalue' type-id='type-id-438' size-in-bits='64' hash='723eb65ccec2b3fa' id='type-id-439'/>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' hash='b7a6582dd6224319' id='type-id-440'/>
    <qualified-type-def type-id='type-id-440' const='yes' hash='783442b6db2f286a' id='type-id-441'/>
    <reference-type-def kind='lvalue' type-id='type-id-442' size-in-bits='64' hash='0ce6bcbc44150da1' id='type-id-443'/>
    <pointer-type-def type-id='type-id-442' size-in-bits='64' hash='9241321b5f82df63' id='type-id-444'/>
    <qualified-type-def type-id='type-id-444' const='yes' hash='037df4282af9fb7c' id='type-id-445'/>
    <reference-type-def kind='lvalue' type-id='type-id-446' size-in-bits='64' hash='6fa7bb78e219b8da' id='type-id-447'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' hash='d58baffd6a29a693' id='type-id-448'/>
    <qualified-type-def type-id='type-id-448' const='yes' hash='3dbfaa60559a1c5a' id='type-id-449'/>
    <qualified-type-def type-id='type-id-450' const='yes' hash='e44adfc70c429f12' id='type-id-451'/>
    <pointer-type-def type-id='type-id-452' size-in-bits='64' hash='64ae31aa0c47d7ea' id='type-id-453'/>
    <qualified-type-def type-id='type-id-453' const='yes' hash='bc516a1dca02f1b9' id='type-id-454'/>
    <pointer-type-def type-id='type-id-455' size-in-bits='64' hash='4f0c3d505352c896' id='type-id-456'/>
    <pointer-type-def type-id='type-id-457' size-in-bits='64' hash='d3ad080fd241ed93' id='type-id-458'/>
    <qualified-type-def type-id='type-id-248' const='yes' hash='893a52b56acbc372' id='type-id-459'/>
    <pointer-type-def type-id='type-id-459' size-in-bits='64' hash='d527572b90279b81' id='type-id-460'/>
    <qualified-type-def type-id='type-id-460' const='yes' hash='2a3e93edb9eb13e5' id='type-id-461'/>
    <qualified-type-def type-id='type-id-361' const='yes' hash='accb06e5d78d2e25' id='type-id-462'/>
    <reference-type-def kind='lvalue' type-id='type-id-462' size-in-bits='64' hash='e17d6d2de7bb16db' id='type-id-463'/>
    <pointer-type-def type-id='type-id-462' size-in-bits='64' hash='88a9ce81957ef4cd' id='type-id-464'/>
    <qualified-type-def type-id='type-id-464' const='yes' hash='c5259849b368cf1c' id='type-id-465'/>
    <reference-type-def kind='lvalue' type-id='type-id-465' size-in-bits='64' hash='af20903bff4aa74a' id='type-id-466'/>
    <qualified-type-def type-id='type-id-260' const='yes' hash='2f87264feb5513f7' id='type-id-263'/>
    <qualified-type-def type-id='type-id-269' const='yes' hash='c767313c280eac82' id='type-id-467'/>
    <reference-type-def kind='lvalue' type-id='type-id-467' size-in-bits='64' hash='7a14f1fb59e073ff' id='type-id-468'/>
    <pointer-type-def type-id='type-id-467' size-in-bits='64' hash='79db06d5b12edb72' id='type-id-280'/>
    <qualified-type-def type-id='type-id-280' const='yes' hash='e1405d6ea4a45adc' id='type-id-469'/>
    <qualified-type-def type-id='type-id-270' const='yes' hash='9c8eaf28f001102c' id='type-id-470'/>
    <reference-type-def kind='lvalue' type-id='type-id-470' size-in-bits='64' hash='195a2884e02e3551' id='type-id-471'/>
    <qualified-type-def type-id='type-id-276' const='yes' hash='8ce2a42a0941277a' id='type-id-472'/>
    <reference-type-def kind='lvalue' type-id='type-id-472' size-in-bits='64' hash='c85b13dabdf5fcb5' id='type-id-473'/>
    <qualified-type-def type-id='type-id-285' const='yes' hash='cd747c029beb62ad' id='type-id-474'/>
    <reference-type-def kind='lvalue' type-id='type-id-474' size-in-bits='64' hash='803ff467052f1ff9' id='type-id-475'/>
    <pointer-type-def type-id='type-id-474' size-in-bits='64' hash='11f31473db6b4e3c' id='type-id-476'/>
    <qualified-type-def type-id='type-id-281' const='yes' hash='c7622e4934b890df' id='type-id-477'/>
    <reference-type-def kind='lvalue' type-id='type-id-477' size-in-bits='64' hash='796f5fc8f3d534b3' id='type-id-478'/>
    <pointer-type-def type-id='type-id-477' size-in-bits='64' hash='b4b57f8dcd10756b' id='type-id-318'/>
    <qualified-type-def type-id='type-id-318' const='yes' hash='19d4d7c209401c90' id='type-id-479'/>
    <qualified-type-def type-id='type-id-284' const='yes' hash='32cedd583101f33f' id='type-id-480'/>
    <reference-type-def kind='lvalue' type-id='type-id-480' size-in-bits='64' hash='da9c33b8ee5e972e' id='type-id-481'/>
    <qualified-type-def type-id='type-id-287' const='yes' hash='d31cb430fa8b1f8e' id='type-id-482'/>
    <reference-type-def kind='lvalue' type-id='type-id-482' size-in-bits='64' hash='56c77bd15b3381a8' id='type-id-483'/>
    <qualified-type-def type-id='type-id-258' const='yes' hash='05aa5db0903e12f1' id='type-id-484'/>
    <reference-type-def kind='lvalue' type-id='type-id-484' size-in-bits='64' hash='9a766da64f0c6086' id='type-id-312'/>
    <pointer-type-def type-id='type-id-484' size-in-bits='64' hash='663c53f2d84bf7f7' id='type-id-485'/>
    <qualified-type-def type-id='type-id-485' const='yes' hash='73d0ed1b7c1d40e4' id='type-id-486'/>
    <qualified-type-def type-id='type-id-288' const='yes' hash='05676b0784bb4b46' id='type-id-487'/>
    <reference-type-def kind='lvalue' type-id='type-id-487' size-in-bits='64' hash='134ac618967234ac' id='type-id-314'/>
    <pointer-type-def type-id='type-id-487' size-in-bits='64' hash='4bccd3da311c3510' id='type-id-316'/>
    <qualified-type-def type-id='type-id-290' const='yes' hash='64055b4f3abf9f8a' id='type-id-488'/>
    <reference-type-def kind='lvalue' type-id='type-id-488' size-in-bits='64' hash='1f007f1e9579c282' id='type-id-489'/>
    <qualified-type-def type-id='type-id-291' const='yes' hash='888107b405b4de34' id='type-id-490'/>
    <reference-type-def kind='lvalue' type-id='type-id-490' size-in-bits='64' hash='732f237f661e54f8' id='type-id-315'/>
    <qualified-type-def type-id='type-id-292' const='yes' hash='5a67046b16fca9c5' id='type-id-491'/>
    <reference-type-def kind='lvalue' type-id='type-id-491' size-in-bits='64' hash='4e6e7195b7a0db7f' id='type-id-492'/>
    <qualified-type-def type-id='type-id-294' const='yes' hash='0ca6ba79ddbe3374' id='type-id-493'/>
    <reference-type-def kind='lvalue' type-id='type-id-493' size-in-bits='64' hash='576cee1496c5f615' id='type-id-494'/>
    <pointer-type-def type-id='type-id-493' size-in-bits='64' hash='78c32f713d6dcded' id='type-id-495'/>
    <qualified-type-def type-id='type-id-495' const='yes' hash='3a143e15f35db0a8' id='type-id-496'/>
    <qualified-type-def type-id='type-id-325' const='yes' hash='5b65356031fd5d8c' id='type-id-497'/>
    <reference-type-def kind='lvalue' type-id='type-id-497' size-in-bits='64' hash='2870acded8661bab' id='type-id-498'/>
    <qualified-type-def type-id='type-id-327' const='yes' hash='11862c1b4dce7b82' id='type-id-499'/>
    <reference-type-def kind='lvalue' type-id='type-id-499' size-in-bits='64' hash='3b0aa4d1706ea891' id='type-id-341'/>
    <pointer-type-def type-id='type-id-499' size-in-bits='64' hash='420a460455857255' id='type-id-342'/>
    <qualified-type-def type-id='type-id-342' const='yes' hash='8ee07a3239e471a2' id='type-id-500'/>
    <qualified-type-def type-id='type-id-347' const='yes' hash='02bf8467ac7aa7fd' id='type-id-501'/>
    <reference-type-def kind='lvalue' type-id='type-id-501' size-in-bits='64' hash='558980db5099f323' id='type-id-502'/>
    <pointer-type-def type-id='type-id-501' size-in-bits='64' hash='44cfae81c1833ddf' id='type-id-503'/>
    <qualified-type-def type-id='type-id-503' const='yes' hash='563c8dac69d32baa' id='type-id-504'/>
    <qualified-type-def type-id='type-id-348' const='yes' hash='89a0fa66fa2056e8' id='type-id-505'/>
    <reference-type-def kind='lvalue' type-id='type-id-505' size-in-bits='64' hash='6c381c3bca83a2ae' id='type-id-506'/>
    <pointer-type-def type-id='type-id-505' size-in-bits='64' hash='81d3799e0ada16d6' id='type-id-507'/>
    <qualified-type-def type-id='type-id-507' const='yes' hash='2d277dbb5ae126c9' id='type-id-508'/>
    <qualified-type-def type-id='type-id-349' const='yes' hash='ff4d1414952f91ea' id='type-id-509'/>
    <reference-type-def kind='lvalue' type-id='type-id-509' size-in-bits='64' hash='4415aaa04af0a1d2' id='type-id-510'/>
    <pointer-type-def type-id='type-id-509' size-in-bits='64' hash='4b24fbacd4232d48' id='type-id-511'/>
    <qualified-type-def type-id='type-id-350' const='yes' hash='d5bb7b3f076144a0' id='type-id-512'/>
    <reference-type-def kind='lvalue' type-id='type-id-512' size-in-bits='64' hash='c35c75df1c856c4c' id='type-id-513'/>
    <pointer-type-def type-id='type-id-512' size-in-bits='64' hash='979d5a0b30e37bcf' id='type-id-514'/>
    <qualified-type-def type-id='type-id-351' const='yes' hash='34f5bf5b9e080b8d' id='type-id-515'/>
    <reference-type-def kind='lvalue' type-id='type-id-515' size-in-bits='64' hash='e0329cd2fcfc7a6c' id='type-id-516'/>
    <pointer-type-def type-id='type-id-515' size-in-bits='64' hash='972c7418d9782a7b' id='type-id-517'/>
    <qualified-type-def type-id='type-id-352' const='yes' hash='9b932f18f4ffd8c9' id='type-id-518'/>
    <reference-type-def kind='lvalue' type-id='type-id-518' size-in-bits='64' hash='34bca7e96a457ac5' id='type-id-519'/>
    <pointer-type-def type-id='type-id-518' size-in-bits='64' hash='24d1b3755cc952c6' id='type-id-520'/>
    <qualified-type-def type-id='type-id-353' const='yes' hash='56a7660be37f4087' id='type-id-521'/>
    <reference-type-def kind='lvalue' type-id='type-id-521' size-in-bits='64' hash='3d4be12a0443ec6d' id='type-id-522'/>
    <pointer-type-def type-id='type-id-521' size-in-bits='64' hash='86274b334f80c186' id='type-id-523'/>
    <qualified-type-def type-id='type-id-354' const='yes' hash='aa4c7b616e786375' id='type-id-524'/>
    <reference-type-def kind='lvalue' type-id='type-id-524' size-in-bits='64' hash='3a5f21f273c8087a' id='type-id-525'/>
    <pointer-type-def type-id='type-id-524' size-in-bits='64' hash='6787ff77ed419caf' id='type-id-526'/>
    <qualified-type-def type-id='type-id-355' const='yes' hash='7824406c711f6199' id='type-id-527'/>
    <reference-type-def kind='lvalue' type-id='type-id-527' size-in-bits='64' hash='490d6c2102d46ad3' id='type-id-528'/>
    <pointer-type-def type-id='type-id-527' size-in-bits='64' hash='0d49ae178dff6b2c' id='type-id-529'/>
    <qualified-type-def type-id='type-id-356' const='yes' hash='067e0ab9cd7f0e64' id='type-id-530'/>
    <reference-type-def kind='lvalue' type-id='type-id-530' size-in-bits='64' hash='72bbc46f94d100e6' id='type-id-531'/>
    <pointer-type-def type-id='type-id-530' size-in-bits='64' hash='9d28fe08d2815148' id='type-id-532'/>
    <qualified-type-def type-id='type-id-357' const='yes' hash='e7faf02809ae4e31' id='type-id-533'/>
    <reference-type-def kind='lvalue' type-id='type-id-533' size-in-bits='64' hash='3797d10f0c77c7a0' id='type-id-534'/>
    <pointer-type-def type-id='type-id-533' size-in-bits='64' hash='6d80234105dc4ed8' id='type-id-535'/>
    <qualified-type-def type-id='type-id-535' const='yes' hash='f57a3d1ab20c7b92' id='type-id-536'/>
    <qualified-type-def type-id='type-id-434' const='yes' hash='6f596c2718e0acd8' id='type-id-537'/>
    <reference-type-def kind='lvalue' type-id='type-id-537' size-in-bits='64' hash='1b86e380fbe195fb' id='type-id-538'/>
    <pointer-type-def type-id='type-id-537' size-in-bits='64' hash='ea0dbc36d82fd835' id='type-id-539'/>
    <qualified-type-def type-id='type-id-539' const='yes' hash='6d2718e1fc6122f1' id='type-id-540'/>
    <qualified-type-def type-id='type-id-438' const='yes' hash='2c522ad53a4301b6' id='type-id-541'/>
    <reference-type-def kind='lvalue' type-id='type-id-541' size-in-bits='64' hash='fd288ef0628ba1ec' id='type-id-542'/>
    <pointer-type-def type-id='type-id-541' size-in-bits='64' hash='38e20c89fbbd87de' id='type-id-543'/>
    <qualified-type-def type-id='type-id-543' const='yes' hash='bda916e2efd299c9' id='type-id-544'/>
    <qualified-type-def type-id='type-id-442' const='yes' hash='cec0e113fb00e4a2' id='type-id-545'/>
    <reference-type-def kind='lvalue' type-id='type-id-545' size-in-bits='64' hash='3bfcb680cfcc959a' id='type-id-546'/>
    <pointer-type-def type-id='type-id-545' size-in-bits='64' hash='b457bfdd10a11c12' id='type-id-547'/>
    <qualified-type-def type-id='type-id-547' const='yes' hash='acfd9fb0e44a14d8' id='type-id-548'/>
    <qualified-type-def type-id='type-id-446' const='yes' hash='63d17a1ee9728233' id='type-id-549'/>
    <reference-type-def kind='lvalue' type-id='type-id-549' size-in-bits='64' hash='044af8bbda9438d8' id='type-id-550'/>
    <pointer-type-def type-id='type-id-549' size-in-bits='64' hash='3892adaf14a09c00' id='type-id-551'/>
    <qualified-type-def type-id='type-id-551' const='yes' hash='386c6b6b5e645987' id='type-id-552'/>
    <qualified-type-def type-id='type-id-452' const='yes' hash='a705758eaf016b75' id='type-id-553'/>
    <reference-type-def kind='lvalue' type-id='type-id-553' size-in-bits='64' hash='2e0dcad20ce8cc23' id='type-id-554'/>
    <pointer-type-def type-id='type-id-553' size-in-bits='64' hash='ba83be0c745964ac' id='type-id-555'/>
    <qualified-type-def type-id='type-id-555' const='yes' hash='a4b9da88f92c8290' id='type-id-556'/>
    <qualified-type-def type-id='type-id-455' const='yes' hash='4fffe40af4225f17' id='type-id-557'/>
    <pointer-type-def type-id='type-id-557' size-in-bits='64' hash='7a5827bc5f47a325' id='type-id-558'/>
    <qualified-type-def type-id='type-id-558' const='yes' hash='ce99f8af4cc12892' id='type-id-559'/>
    <qualified-type-def type-id='type-id-457' const='yes' hash='ddf4c816c9104c1e' id='type-id-560'/>
    <pointer-type-def type-id='type-id-560' size-in-bits='64' hash='6eeb6884924b7ef4' id='type-id-561'/>
    <qualified-type-def type-id='type-id-561' const='yes' hash='252587d75e6e06dc' id='type-id-562'/>
    <qualified-type-def type-id='type-id-59' const='yes' hash='2b32da4512609d62' id='type-id-563'/>
    <reference-type-def kind='lvalue' type-id='type-id-563' size-in-bits='64' hash='883080011329ce3a' id='type-id-564'/>
    <qualified-type-def type-id='type-id-60' const='yes' hash='ec42cf78a9d93a8c' id='type-id-262'/>
    <reference-type-def kind='lvalue' type-id='type-id-262' size-in-bits='64' hash='99be3ab0d9b2fe43' id='type-id-565'/>
    <qualified-type-def type-id='type-id-61' const='yes' hash='86827e66a8bd4e2d' id='type-id-566'/>
    <reference-type-def kind='lvalue' type-id='type-id-566' size-in-bits='64' hash='59df9380ec284028' id='type-id-567'/>
    <qualified-type-def type-id='type-id-568' const='yes' hash='5f73e58a5c84aef5' id='type-id-569'/>
    <pointer-type-def type-id='type-id-569' size-in-bits='64' hash='1666e15aa677bde0' id='type-id-570'/>
    <qualified-type-def type-id='type-id-570' const='yes' hash='b88850ef74728474' id='type-id-571'/>
    <qualified-type-def type-id='type-id-572' const='yes' hash='75ea5bc3086087de' id='type-id-573'/>
    <reference-type-def kind='lvalue' type-id='type-id-573' size-in-bits='64' hash='e640cda2aa1cb557' id='type-id-574'/>
    <pointer-type-def type-id='type-id-573' size-in-bits='64' hash='e59019ab68bb93cc' id='type-id-575'/>
    <qualified-type-def type-id='type-id-575' const='yes' hash='1e063f09b41870b9' id='type-id-576'/>
    <qualified-type-def type-id='type-id-577' const='yes' hash='f9a5417229a901cc' id='type-id-578'/>
    <reference-type-def kind='lvalue' type-id='type-id-578' size-in-bits='64' hash='5546678f6c110a67' id='type-id-579'/>
    <pointer-type-def type-id='type-id-578' size-in-bits='64' hash='f44e5759e728708e' id='type-id-580'/>
    <qualified-type-def type-id='type-id-580' const='yes' hash='6ba8831bc8dd12e2' id='type-id-581'/>
    <qualified-type-def type-id='type-id-582' const='yes' hash='036882b9abc668fe' id='type-id-583'/>
    <reference-type-def kind='lvalue' type-id='type-id-583' size-in-bits='64' hash='00e5672ecb47e9c0' id='type-id-584'/>
    <pointer-type-def type-id='type-id-583' size-in-bits='64' hash='16ed76410190f9f0' id='type-id-585'/>
    <qualified-type-def type-id='type-id-585' const='yes' hash='7825e12a5b10e8bf' id='type-id-586'/>
    <qualified-type-def type-id='type-id-587' const='yes' hash='41459fe75b86ea9a' id='type-id-588'/>
    <reference-type-def kind='lvalue' type-id='type-id-588' size-in-bits='64' hash='227d97d21b911769' id='type-id-589'/>
    <pointer-type-def type-id='type-id-588' size-in-bits='64' hash='8e0417d1e8308484' id='type-id-590'/>
    <qualified-type-def type-id='type-id-590' const='yes' hash='8c6076881beabb37' id='type-id-591'/>
    <qualified-type-def type-id='type-id-331' const='yes' hash='a99374d6bab7ff11' id='type-id-592'/>
    <reference-type-def kind='lvalue' type-id='type-id-592' size-in-bits='64' hash='68ddc2d52c6a6f0e' id='type-id-593'/>
    <pointer-type-def type-id='type-id-592' size-in-bits='64' hash='77fcb720375d81e5' id='type-id-594'/>
    <qualified-type-def type-id='type-id-594' const='yes' hash='e5855bd345d4f80a' id='type-id-595'/>
    <qualified-type-def type-id='type-id-596' const='yes' hash='62026a538fc3cef0' id='type-id-597'/>
    <reference-type-def kind='lvalue' type-id='type-id-597' size-in-bits='64' hash='f76f545fd55e2e0f' id='type-id-598'/>
    <pointer-type-def type-id='type-id-597' size-in-bits='64' hash='c9f801bbf8208ca9' id='type-id-599'/>
    <qualified-type-def type-id='type-id-599' const='yes' hash='6c87dd7bf098658f' id='type-id-600'/>
    <qualified-type-def type-id='type-id-601' const='yes' hash='b3d04a04999e3451' id='type-id-602'/>
    <reference-type-def kind='lvalue' type-id='type-id-602' size-in-bits='64' hash='8b2093921c869ec5' id='type-id-603'/>
    <pointer-type-def type-id='type-id-602' size-in-bits='64' hash='136647d98c968c3a' id='type-id-604'/>
    <qualified-type-def type-id='type-id-604' const='yes' hash='74beb1db87ac0261' id='type-id-605'/>
    <qualified-type-def type-id='type-id-606' const='yes' hash='b2890eb2fd637e61' id='type-id-607'/>
    <reference-type-def kind='lvalue' type-id='type-id-607' size-in-bits='64' hash='efce95b678b2a74a' id='type-id-608'/>
    <pointer-type-def type-id='type-id-607' size-in-bits='64' hash='24b155ae4359385b' id='type-id-609'/>
    <qualified-type-def type-id='type-id-609' const='yes' hash='6f043a72fbb15e37' id='type-id-610'/>
    <qualified-type-def type-id='type-id-611' const='yes' hash='4400d275dc9a785a' id='type-id-612'/>
    <reference-type-def kind='lvalue' type-id='type-id-612' size-in-bits='64' hash='fac0b3556a0d889b' id='type-id-613'/>
    <pointer-type-def type-id='type-id-612' size-in-bits='64' hash='6bdb5fd7cab981bc' id='type-id-614'/>
    <qualified-type-def type-id='type-id-615' const='yes' hash='10b8509f9e10af31' id='type-id-616'/>
    <reference-type-def kind='lvalue' type-id='type-id-616' size-in-bits='64' hash='3dc58fd357360ae9' id='type-id-617'/>
    <qualified-type-def type-id='type-id-618' const='yes' hash='e104ebac458ea553' id='type-id-619'/>
    <reference-type-def kind='lvalue' type-id='type-id-619' size-in-bits='64' hash='9970212aa7f84772' id='type-id-620'/>
    <pointer-type-def type-id='type-id-619' size-in-bits='64' hash='c78d15d2c830a8a6' id='type-id-621'/>
    <qualified-type-def type-id='type-id-621' const='yes' hash='22442548bcef8330' id='type-id-622'/>
    <qualified-type-def type-id='type-id-623' const='yes' hash='bc38e3e661386af6' id='type-id-624'/>
    <reference-type-def kind='lvalue' type-id='type-id-624' size-in-bits='64' hash='3bf6764931af2104' id='type-id-625'/>
    <pointer-type-def type-id='type-id-624' size-in-bits='64' hash='5fb0526171e4e2ea' id='type-id-626'/>
    <qualified-type-def type-id='type-id-626' const='yes' hash='616ba70558299adb' id='type-id-627'/>
    <qualified-type-def type-id='type-id-628' const='yes' hash='55b02e9d7b57c9fc' id='type-id-629'/>
    <reference-type-def kind='lvalue' type-id='type-id-629' size-in-bits='64' hash='b88c4488c3e873b6' id='type-id-630'/>
    <pointer-type-def type-id='type-id-629' size-in-bits='64' hash='b2afef71ecf24327' id='type-id-631'/>
    <qualified-type-def type-id='type-id-631' const='yes' hash='8560e343ce1b8e90' id='type-id-632'/>
    <qualified-type-def type-id='type-id-633' const='yes' hash='ee3eefc6775946df' id='type-id-634'/>
    <reference-type-def kind='lvalue' type-id='type-id-634' size-in-bits='64' hash='95b7dec000eb74a8' id='type-id-635'/>
    <pointer-type-def type-id='type-id-634' size-in-bits='64' hash='1e2a7686195bf86b' id='type-id-636'/>
    <qualified-type-def type-id='type-id-636' const='yes' hash='03197857f266dc4b' id='type-id-637'/>
    <qualified-type-def type-id='type-id-638' const='yes' hash='ff152f07e39e1536' id='type-id-639'/>
    <pointer-type-def type-id='type-id-639' size-in-bits='64' hash='cdb3ec6f1570c647' id='type-id-640'/>
    <qualified-type-def type-id='type-id-641' const='yes' hash='91e80b0d82b71aad' id='type-id-642'/>
    <pointer-type-def type-id='type-id-642' size-in-bits='64' hash='4ce4a687134f91ae' id='type-id-643'/>
    <qualified-type-def type-id='type-id-643' const='yes' hash='9e96e0756112acec' id='type-id-644'/>
    <qualified-type-def type-id='type-id-645' const='yes' hash='3e3c347d59030f75' id='type-id-646'/>
    <pointer-type-def type-id='type-id-646' size-in-bits='64' hash='5b01944f43b4e8d2' id='type-id-647'/>
    <qualified-type-def type-id='type-id-647' const='yes' hash='4957b24fc70e1897' id='type-id-648'/>
    <qualified-type-def type-id='type-id-649' const='yes' hash='40538cca5008b9e9' id='type-id-650'/>
    <pointer-type-def type-id='type-id-650' size-in-bits='64' hash='214f00809c568628' id='type-id-651'/>
    <qualified-type-def type-id='type-id-651' const='yes' hash='afa74f6952aedb0a' id='type-id-652'/>
    <qualified-type-def type-id='type-id-653' const='yes' hash='2e773d6ff72d904b' id='type-id-654'/>
    <pointer-type-def type-id='type-id-654' size-in-bits='64' hash='60138fed8e54e614' id='type-id-655'/>
    <qualified-type-def type-id='type-id-655' const='yes' hash='569513b1be0b1597' id='type-id-656'/>
    <qualified-type-def type-id='type-id-657' const='yes' hash='c60af80859388e79' id='type-id-658'/>
    <pointer-type-def type-id='type-id-658' size-in-bits='64' hash='6776cdf60d657cbe' id='type-id-659'/>
    <qualified-type-def type-id='type-id-659' const='yes' hash='59b6d57bbf63abd7' id='type-id-660'/>
    <qualified-type-def type-id='type-id-661' const='yes' hash='ed78512334bad26b' id='type-id-662'/>
    <pointer-type-def type-id='type-id-662' size-in-bits='64' hash='30cea3739833bbe9' id='type-id-663'/>
    <qualified-type-def type-id='type-id-663' const='yes' hash='45d759dc2980f75b' id='type-id-664'/>
    <qualified-type-def type-id='type-id-665' const='yes' hash='106643b567521cee' id='type-id-666'/>
    <reference-type-def kind='lvalue' type-id='type-id-666' size-in-bits='64' hash='1e25540bc356fd3f' id='type-id-667'/>
    <qualified-type-def type-id='type-id-668' const='yes' hash='632096072e76e63d' id='type-id-669'/>
    <reference-type-def kind='lvalue' type-id='type-id-669' size-in-bits='64' hash='f20949d6bd2baeca' id='type-id-670'/>
    <pointer-type-def type-id='type-id-669' size-in-bits='64' hash='0f813f9423fc70d2' id='type-id-671'/>
    <qualified-type-def type-id='type-id-671' const='yes' hash='e8b44390363a5c20' id='type-id-672'/>
    <qualified-type-def type-id='type-id-673' const='yes' hash='7226944aa4e46352' id='type-id-674'/>
    <pointer-type-def type-id='type-id-674' size-in-bits='64' hash='61c33da8fd0cc9a8' id='type-id-675'/>
    <qualified-type-def type-id='type-id-675' const='yes' hash='e3a9df79e286d8c0' id='type-id-676'/>
    <qualified-type-def type-id='type-id-677' const='yes' hash='514521c34f0ee6b8' id='type-id-678'/>
    <qualified-type-def type-id='type-id-679' const='yes' hash='7226944aa4e46352' id='type-id-680'/>
    <pointer-type-def type-id='type-id-680' size-in-bits='64' hash='61c33da8fd0cc9a8' id='type-id-681'/>
    <qualified-type-def type-id='type-id-682' const='yes' hash='0d301f00e830e5eb' id='type-id-683'/>
    <reference-type-def kind='lvalue' type-id='type-id-683' size-in-bits='64' hash='d98a60be7234f7c8' id='type-id-684'/>
    <pointer-type-def type-id='type-id-683' size-in-bits='64' hash='f4903706bce76c85' id='type-id-685'/>
    <qualified-type-def type-id='type-id-686' const='yes' hash='9c3f1503b45b0328' id='type-id-687'/>
    <reference-type-def kind='lvalue' type-id='type-id-687' size-in-bits='64' hash='00b5256d58d8bd92' id='type-id-688'/>
    <qualified-type-def type-id='type-id-689' const='yes' hash='5d498865f38eb057' id='type-id-690'/>
    <reference-type-def kind='lvalue' type-id='type-id-690' size-in-bits='64' hash='f113631b60e9068c' id='type-id-691'/>
    <pointer-type-def type-id='type-id-690' size-in-bits='64' hash='df8c0d3150b9b291' id='type-id-692'/>
    <qualified-type-def type-id='type-id-692' const='yes' hash='fc2f7e2576cd04dc' id='type-id-693'/>
    <qualified-type-def type-id='type-id-694' const='yes' hash='6876a52a5619ce07' id='type-id-695'/>
    <reference-type-def kind='lvalue' type-id='type-id-695' size-in-bits='64' hash='4a173051006838b3' id='type-id-696'/>
    <pointer-type-def type-id='type-id-695' size-in-bits='64' hash='a62a4ecdd028982a' id='type-id-697'/>
    <qualified-type-def type-id='type-id-697' const='yes' hash='f63c99d018d76d91' id='type-id-698'/>
    <qualified-type-def type-id='type-id-363' const='yes' hash='e8ffe4e29da8ea38' id='type-id-699'/>
    <reference-type-def kind='lvalue' type-id='type-id-699' size-in-bits='64' hash='687bbe3ce9cda357' id='type-id-700'/>
    <pointer-type-def type-id='type-id-699' size-in-bits='64' hash='40b2df459fb559b3' id='type-id-701'/>
    <qualified-type-def type-id='type-id-365' const='yes' hash='f3a5be8e61719bbc' id='type-id-702'/>
    <reference-type-def kind='lvalue' type-id='type-id-702' size-in-bits='64' hash='8f74e7414576d9cd' id='type-id-703'/>
    <pointer-type-def type-id='type-id-702' size-in-bits='64' hash='9625a82da66e4034' id='type-id-704'/>
    <qualified-type-def type-id='type-id-367' const='yes' hash='8f4c33a1019cc3ae' id='type-id-705'/>
    <reference-type-def kind='lvalue' type-id='type-id-705' size-in-bits='64' hash='958bb5909eef1414' id='type-id-706'/>
    <pointer-type-def type-id='type-id-705' size-in-bits='64' hash='caba7918a4a8bc53' id='type-id-707'/>
    <qualified-type-def type-id='type-id-707' const='yes' hash='179c4ba0a598c292' id='type-id-708'/>
    <qualified-type-def type-id='type-id-709' const='yes' hash='6a2158f128d7ffba' id='type-id-710'/>
    <reference-type-def kind='lvalue' type-id='type-id-710' size-in-bits='64' hash='2b42984aa78e180f' id='type-id-711'/>
    <pointer-type-def type-id='type-id-710' size-in-bits='64' hash='c373f8b8c9e04265' id='type-id-712'/>
    <qualified-type-def type-id='type-id-713' const='yes' hash='b1ffda668c982e08' id='type-id-714'/>
    <reference-type-def kind='lvalue' type-id='type-id-714' size-in-bits='64' hash='2a64eb5f8e50da2c' id='type-id-715'/>
    <pointer-type-def type-id='type-id-714' size-in-bits='64' hash='fd13598488b830eb' id='type-id-716'/>
    <qualified-type-def type-id='type-id-717' const='yes' hash='f5948268722803a6' id='type-id-718'/>
    <reference-type-def kind='lvalue' type-id='type-id-718' size-in-bits='64' hash='8a9a1d797e1d7830' id='type-id-719'/>
    <pointer-type-def type-id='type-id-718' size-in-bits='64' hash='fd7552c453b69962' id='type-id-720'/>
    <qualified-type-def type-id='type-id-721' const='yes' hash='b615ba01aa551f92' id='type-id-722'/>
    <reference-type-def kind='lvalue' type-id='type-id-722' size-in-bits='64' hash='6e7ca09e3a4710c8' id='type-id-723'/>
    <qualified-type-def type-id='type-id-724' const='yes' hash='20a7909ca18bbbad' id='type-id-725'/>
    <reference-type-def kind='lvalue' type-id='type-id-725' size-in-bits='64' hash='3a42ae960bc54cb3' id='type-id-726'/>
    <qualified-type-def type-id='type-id-377' const='yes' hash='c75ae7eadf8aa76d' id='type-id-727'/>
    <reference-type-def kind='lvalue' type-id='type-id-727' size-in-bits='64' hash='f8f9ce5f9c5d1d67' id='type-id-728'/>
    <pointer-type-def type-id='type-id-727' size-in-bits='64' hash='053087693c6dd47c' id='type-id-729'/>
    <qualified-type-def type-id='type-id-729' const='yes' hash='8ab4ddf65aebc88f' id='type-id-730'/>
    <qualified-type-def type-id='type-id-369' const='yes' hash='bd84c99732c42e90' id='type-id-731'/>
    <reference-type-def kind='lvalue' type-id='type-id-731' size-in-bits='64' hash='4479d40f519e3df2' id='type-id-732'/>
    <pointer-type-def type-id='type-id-731' size-in-bits='64' hash='2546ea4243cdf0be' id='type-id-733'/>
    <qualified-type-def type-id='type-id-733' const='yes' hash='d8bd68dd567530de' id='type-id-734'/>
    <qualified-type-def type-id='type-id-735' const='yes' hash='663921d1e466de22' id='type-id-736'/>
    <reference-type-def kind='lvalue' type-id='type-id-736' size-in-bits='64' hash='f87b94639809b46c' id='type-id-737'/>
    <pointer-type-def type-id='type-id-736' size-in-bits='64' hash='4751c1e99147b797' id='type-id-738'/>
    <qualified-type-def type-id='type-id-738' const='yes' hash='f0278931e35cb855' id='type-id-739'/>
    <qualified-type-def type-id='type-id-740' const='yes' hash='7a450a9a562a63c4' id='type-id-741'/>
    <reference-type-def kind='lvalue' type-id='type-id-741' size-in-bits='64' hash='ef2ef9e038defc9b' id='type-id-742'/>
    <pointer-type-def type-id='type-id-741' size-in-bits='64' hash='38ffdd72c7514c5c' id='type-id-743'/>
    <qualified-type-def type-id='type-id-743' const='yes' hash='2ff3f9e00730d20c' id='type-id-744'/>
    <pointer-type-def type-id='type-id-745' size-in-bits='64' hash='3cecca488cd00e0d' id='type-id-746'/>
    <pointer-type-def type-id='type-id-747' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-748'/>
    <reference-type-def kind='lvalue' type-id='type-id-572' size-in-bits='64' hash='3424d9bdef1f1fe9' id='type-id-749'/>
    <pointer-type-def type-id='type-id-572' size-in-bits='64' hash='041651a091b49c85' id='type-id-750'/>
    <qualified-type-def type-id='type-id-750' const='yes' hash='891d315c77507f2b' id='type-id-751'/>
    <pointer-type-def type-id='type-id-752' size-in-bits='64' hash='4b2ff9ceaf116335' id='type-id-753'/>
    <qualified-type-def type-id='type-id-753' const='yes' hash='e8cf0ed67a90ea4a' id='type-id-754'/>
    <reference-type-def kind='lvalue' type-id='type-id-577' size-in-bits='64' hash='156289be121d38bd' id='type-id-755'/>
    <pointer-type-def type-id='type-id-577' size-in-bits='64' hash='5fad08c27eb15d75' id='type-id-756'/>
    <qualified-type-def type-id='type-id-756' const='yes' hash='e48bbfb2ac3a43ec' id='type-id-757'/>
    <pointer-type-def type-id='type-id-758' size-in-bits='64' hash='4b2ff9ceaf116335' id='type-id-759'/>
    <qualified-type-def type-id='type-id-759' const='yes' hash='e8cf0ed67a90ea4a' id='type-id-760'/>
    <reference-type-def kind='lvalue' type-id='type-id-582' size-in-bits='64' hash='92a28c32b409f8ad' id='type-id-761'/>
    <pointer-type-def type-id='type-id-582' size-in-bits='64' hash='4f2b65619d2f783c' id='type-id-762'/>
    <qualified-type-def type-id='type-id-762' const='yes' hash='cb624255acd9e063' id='type-id-763'/>
    <pointer-type-def type-id='type-id-764' size-in-bits='64' hash='4b2ff9ceaf116335' id='type-id-765'/>
    <qualified-type-def type-id='type-id-765' const='yes' hash='e8cf0ed67a90ea4a' id='type-id-766'/>
    <reference-type-def kind='lvalue' type-id='type-id-587' size-in-bits='64' hash='373f325ad2f0a5e4' id='type-id-767'/>
    <pointer-type-def type-id='type-id-587' size-in-bits='64' hash='9372b5f3b64863ad' id='type-id-768'/>
    <qualified-type-def type-id='type-id-768' const='yes' hash='de9319c685e64649' id='type-id-769'/>
    <pointer-type-def type-id='type-id-770' size-in-bits='64' hash='a651ac0c5ea4d9d2' id='type-id-771'/>
    <qualified-type-def type-id='type-id-771' const='yes' hash='a0232b9d574a8562' id='type-id-772'/>
    <reference-type-def kind='lvalue' type-id='type-id-331' size-in-bits='64' hash='a20cecf2037061b0' id='type-id-773'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' hash='f31d62bf64495ab0' id='type-id-774'/>
    <qualified-type-def type-id='type-id-774' const='yes' hash='6e2a635775d0a841' id='type-id-775'/>
    <reference-type-def kind='lvalue' type-id='type-id-596' size-in-bits='64' hash='d75d6c12dd36d0e6' id='type-id-776'/>
    <pointer-type-def type-id='type-id-596' size-in-bits='64' hash='960a6cf900acb233' id='type-id-777'/>
    <qualified-type-def type-id='type-id-777' const='yes' hash='ba4f1a6fd70a4f1d' id='type-id-778'/>
    <reference-type-def kind='lvalue' type-id='type-id-601' size-in-bits='64' hash='e0d00b7755ed2314' id='type-id-779'/>
    <pointer-type-def type-id='type-id-601' size-in-bits='64' hash='f26a4670a8bdc44d' id='type-id-780'/>
    <qualified-type-def type-id='type-id-780' const='yes' hash='6f11617aa4894e83' id='type-id-781'/>
    <reference-type-def kind='lvalue' type-id='type-id-606' size-in-bits='64' hash='b87868db6546f266' id='type-id-782'/>
    <pointer-type-def type-id='type-id-606' size-in-bits='64' hash='ee8f03df120a1189' id='type-id-783'/>
    <qualified-type-def type-id='type-id-783' const='yes' hash='58dfd3e15aacc40f' id='type-id-784'/>
    <reference-type-def kind='lvalue' type-id='type-id-611' size-in-bits='64' hash='4413f069f3463fed' id='type-id-785'/>
    <pointer-type-def type-id='type-id-611' size-in-bits='64' hash='de3696b2b4556cd3' id='type-id-786'/>
    <qualified-type-def type-id='type-id-786' const='yes' hash='a0b70fa561664f61' id='type-id-787'/>
    <reference-type-def kind='lvalue' type-id='type-id-618' size-in-bits='64' hash='aa1f2af7fd00bc61' id='type-id-788'/>
    <pointer-type-def type-id='type-id-618' size-in-bits='64' hash='a3c82d05e0566644' id='type-id-789'/>
    <qualified-type-def type-id='type-id-789' const='yes' hash='62a0fd779fd83a0a' id='type-id-790'/>
    <reference-type-def kind='lvalue' type-id='type-id-623' size-in-bits='64' hash='57d00e3fb9d13d58' id='type-id-791'/>
    <pointer-type-def type-id='type-id-623' size-in-bits='64' hash='160411b307904fa6' id='type-id-792'/>
    <qualified-type-def type-id='type-id-792' const='yes' hash='46d85356c2525b40' id='type-id-793'/>
    <reference-type-def kind='lvalue' type-id='type-id-628' size-in-bits='64' hash='893ec553562f974e' id='type-id-794'/>
    <pointer-type-def type-id='type-id-628' size-in-bits='64' hash='ec41c4a265ffe9ee' id='type-id-795'/>
    <qualified-type-def type-id='type-id-795' const='yes' hash='905b8ac92c2454fc' id='type-id-796'/>
    <reference-type-def kind='lvalue' type-id='type-id-633' size-in-bits='64' hash='8e43f5b5685179b3' id='type-id-797'/>
    <pointer-type-def type-id='type-id-633' size-in-bits='64' hash='757666f788a9e19e' id='type-id-798'/>
    <qualified-type-def type-id='type-id-798' const='yes' hash='8454e6a29d4c0b60' id='type-id-799'/>
    <pointer-type-def type-id='type-id-638' size-in-bits='64' hash='68858e106acefb39' id='type-id-800'/>
    <reference-type-def kind='lvalue' type-id='type-id-800' size-in-bits='64' hash='25d1ab60378aba7a' id='type-id-801'/>
    <pointer-type-def type-id='type-id-653' size-in-bits='64' hash='65b71fe011ab6de3' id='type-id-802'/>
    <qualified-type-def type-id='type-id-802' const='yes' hash='83a87bb96aeeec1d' id='type-id-803'/>
    <pointer-type-def type-id='type-id-804' size-in-bits='64' hash='437509a8ebc56156' id='type-id-805'/>
    <qualified-type-def type-id='type-id-805' const='yes' hash='9b9a9e3e6ead6f78' id='type-id-806'/>
    <pointer-type-def type-id='type-id-657' size-in-bits='64' hash='c8b5a725ee4c901f' id='type-id-807'/>
    <qualified-type-def type-id='type-id-807' const='yes' hash='092bd9a2414f0182' id='type-id-808'/>
    <pointer-type-def type-id='type-id-809' size-in-bits='64' hash='437509a8ebc56156' id='type-id-810'/>
    <qualified-type-def type-id='type-id-810' const='yes' hash='9b9a9e3e6ead6f78' id='type-id-811'/>
    <pointer-type-def type-id='type-id-661' size-in-bits='64' hash='d1d6177643ded135' id='type-id-812'/>
    <qualified-type-def type-id='type-id-812' const='yes' hash='e531af045d2ffad5' id='type-id-813'/>
    <pointer-type-def type-id='type-id-814' size-in-bits='64' hash='437509a8ebc56156' id='type-id-815'/>
    <qualified-type-def type-id='type-id-815' const='yes' hash='9b9a9e3e6ead6f78' id='type-id-816'/>
    <reference-type-def kind='lvalue' type-id='type-id-665' size-in-bits='64' hash='5a7fe4297c327710' id='type-id-817'/>
    <pointer-type-def type-id='type-id-665' size-in-bits='64' hash='4524b9c0be857b0a' id='type-id-818'/>
    <qualified-type-def type-id='type-id-818' const='yes' hash='36936c2dd8fca91f' id='type-id-819'/>
    <reference-type-def kind='lvalue' type-id='type-id-668' size-in-bits='64' hash='304c0b5d5ea2efc4' id='type-id-820'/>
    <pointer-type-def type-id='type-id-668' size-in-bits='64' hash='c49587e5cddf8886' id='type-id-821'/>
    <qualified-type-def type-id='type-id-821' const='yes' hash='9a75344b7bebb12b' id='type-id-822'/>
    <pointer-type-def type-id='type-id-823' size-in-bits='64' hash='9d029584a1ffef40' id='type-id-824'/>
    <qualified-type-def type-id='type-id-824' const='yes' hash='bdb67d5a3f1e852b' id='type-id-825'/>
    <reference-type-def kind='lvalue' type-id='type-id-673' size-in-bits='64' hash='dce7c83b7dca5265' id='type-id-826'/>
    <pointer-type-def type-id='type-id-673' size-in-bits='64' hash='0eeadcf9df869442' id='type-id-827'/>
    <qualified-type-def type-id='type-id-827' const='yes' hash='4432589e1ddb9aed' id='type-id-828'/>
    <qualified-type-def type-id='type-id-829' const='yes' hash='277400705582a96c' id='type-id-830'/>
    <qualified-type-def type-id='type-id-831' const='yes' hash='bdb67d5a3f1e852b' id='type-id-832'/>
    <qualified-type-def type-id='type-id-833' const='yes' hash='4432589e1ddb9aed' id='type-id-834'/>
    <reference-type-def kind='lvalue' type-id='type-id-682' size-in-bits='64' hash='75929b1513585467' id='type-id-835'/>
    <pointer-type-def type-id='type-id-682' size-in-bits='64' hash='4cef840ef4725ab6' id='type-id-836'/>
    <reference-type-def kind='lvalue' type-id='type-id-363' size-in-bits='64' hash='e60d3aa1c9cd0874' id='type-id-837'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' hash='bafda5d3fa70adc3' id='type-id-838'/>
    <qualified-type-def type-id='type-id-838' const='yes' hash='5a608fc7d8df6130' id='type-id-839'/>
    <reference-type-def kind='lvalue' type-id='type-id-365' size-in-bits='64' hash='7636bd7efed366c6' id='type-id-840'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' hash='ce89926c0afcc11d' id='type-id-841'/>
    <qualified-type-def type-id='type-id-841' const='yes' hash='68e0eca2e82735c0' id='type-id-842'/>
    <reference-type-def kind='lvalue' type-id='type-id-367' size-in-bits='64' hash='4e845626b7f4b0ed' id='type-id-843'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' hash='1f32ca8c15c02670' id='type-id-844'/>
    <qualified-type-def type-id='type-id-844' const='yes' hash='b64dc3bec0e9ee61' id='type-id-845'/>
    <reference-type-def kind='lvalue' type-id='type-id-709' size-in-bits='64' hash='841f62a155550a0f' id='type-id-846'/>
    <pointer-type-def type-id='type-id-709' size-in-bits='64' hash='859aba1907d22452' id='type-id-847'/>
    <qualified-type-def type-id='type-id-847' const='yes' hash='dd7eb1c64e0be8d3' id='type-id-848'/>
    <reference-type-def kind='lvalue' type-id='type-id-713' size-in-bits='64' hash='e20a5d081c42fc4d' id='type-id-849'/>
    <pointer-type-def type-id='type-id-713' size-in-bits='64' hash='4c24b79defb34fb3' id='type-id-850'/>
    <qualified-type-def type-id='type-id-850' const='yes' hash='21e9a74abec6ad17' id='type-id-851'/>
    <reference-type-def kind='lvalue' type-id='type-id-717' size-in-bits='64' hash='a5e61221e8b7c4cc' id='type-id-852'/>
    <pointer-type-def type-id='type-id-717' size-in-bits='64' hash='25910c8a7b1e8702' id='type-id-853'/>
    <qualified-type-def type-id='type-id-853' const='yes' hash='fe86d992f68179c7' id='type-id-854'/>
    <pointer-type-def type-id='type-id-721' size-in-bits='64' hash='c1675460a71f364d' id='type-id-855'/>
    <qualified-type-def type-id='type-id-855' const='yes' hash='7e0e6d40649d3a71' id='type-id-856'/>
    <pointer-type-def type-id='type-id-724' size-in-bits='64' hash='762fde9cb7973032' id='type-id-857'/>
    <qualified-type-def type-id='type-id-857' const='yes' hash='373b0d479faf430e' id='type-id-858'/>
    <pointer-type-def type-id='type-id-859' size-in-bits='64' hash='90e4e003f12d5da9' id='type-id-860'/>
    <qualified-type-def type-id='type-id-860' const='yes' hash='a580cea2b06a78af' id='type-id-861'/>
    <pointer-type-def type-id='type-id-862' size-in-bits='64' hash='d1d8047086f0e54d' id='type-id-863'/>
    <qualified-type-def type-id='type-id-863' const='yes' hash='eb5aca859e5f72c6' id='type-id-864'/>
    <pointer-type-def type-id='type-id-865' size-in-bits='64' hash='19f3d0387e379af0' id='type-id-866'/>
    <qualified-type-def type-id='type-id-866' const='yes' hash='30fe2a247fe058e9' id='type-id-867'/>
    <pointer-type-def type-id='type-id-868' size-in-bits='64' hash='696a2eb4da09a175' id='type-id-869'/>
    <qualified-type-def type-id='type-id-869' const='yes' hash='81c8fb2a3ba7e17f' id='type-id-870'/>
    <pointer-type-def type-id='type-id-871' size-in-bits='64' hash='9e2e73c83e5672c4' id='type-id-872'/>
    <qualified-type-def type-id='type-id-872' const='yes' hash='d4f61830a0064efb' id='type-id-873'/>
    <reference-type-def kind='lvalue' type-id='type-id-377' size-in-bits='64' hash='d2c11b6eb3958849' id='type-id-874'/>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' hash='b5bebae0c88be804' id='type-id-875'/>
    <qualified-type-def type-id='type-id-875' const='yes' hash='29f37117bc906bf1' id='type-id-876'/>
    <reference-type-def kind='lvalue' type-id='type-id-369' size-in-bits='64' hash='f6bf1db9522e80b7' id='type-id-877'/>
    <pointer-type-def type-id='type-id-369' size-in-bits='64' hash='a7286192c97077c2' id='type-id-878'/>
    <qualified-type-def type-id='type-id-878' const='yes' hash='77c625be08321496' id='type-id-879'/>
    <reference-type-def kind='lvalue' type-id='type-id-735' size-in-bits='64' hash='b6d6cecd171ba5e4' id='type-id-880'/>
    <pointer-type-def type-id='type-id-735' size-in-bits='64' hash='be644cbee9ea26fc' id='type-id-267'/>
    <qualified-type-def type-id='type-id-267' const='yes' hash='fb28a9ca173b8d02' id='type-id-881'/>
    <reference-type-def kind='lvalue' type-id='type-id-740' size-in-bits='64' hash='6501fd64e511c47e' id='type-id-882'/>
    <pointer-type-def type-id='type-id-740' size-in-bits='64' hash='a79f957a59865ea5' id='type-id-883'/>
    <qualified-type-def type-id='type-id-883' const='yes' hash='3e33890aa222513b' id='type-id-884'/>
    <reference-type-def kind='lvalue' type-id='type-id-21' size-in-bits='64' hash='b08a4d7705311570' id='type-id-885'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' hash='d9e2f19705735211' id='type-id-886'/>
    <pointer-type-def type-id='type-id-887' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-303'/>
    <qualified-type-def type-id='type-id-261' const='yes' hash='6fd743acdba65045' id='type-id-888'/>
    <reference-type-def kind='lvalue' type-id='type-id-888' size-in-bits='64' hash='d357d6f75e871c2e' id='type-id-889'/>
    <pointer-type-def type-id='type-id-888' size-in-bits='64' hash='09e423a99cb07be4' id='type-id-890'/>
    <reference-type-def kind='lvalue' type-id='type-id-261' size-in-bits='64' hash='08ad80fa94e51a26' id='type-id-891'/>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' hash='551ba7e18ed5752b' id='type-id-892'/>
    <qualified-type-def type-id='type-id-892' const='yes' hash='2a91facb283adb1e' id='type-id-893'/>
    <reference-type-def kind='lvalue' type-id='type-id-893' size-in-bits='64' hash='e919f554e7937b2c' id='type-id-894'/>
    <pointer-type-def type-id='type-id-895' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-896'/>
    <pointer-type-def type-id='type-id-897' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-305'/>
    <pointer-type-def type-id='type-id-898' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-375'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' hash='551ba7e18ed5752b' id='type-id-899'/>
    <pointer-type-def type-id='type-id-900' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-372'/>
    <pointer-type-def type-id='type-id-372' size-in-bits='64' hash='551ba7e18ed5752b' id='type-id-901'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-307'/>
    <reference-type-def kind='lvalue' type-id='type-id-902' size-in-bits='64' hash='96def6eeaeb2ccd0' id='type-id-903'/>
    <pointer-type-def type-id='type-id-902' size-in-bits='64' hash='cca8ba375802253e' id='type-id-286'/>
    <reference-type-def kind='lvalue' type-id='type-id-56' size-in-bits='64' hash='fb592a4752ed7557' id='type-id-904'/>
    <qualified-type-def type-id='type-id-184' const='yes' hash='52c4b44d191c43e5' id='type-id-905'/>
    <reference-type-def kind='lvalue' type-id='type-id-905' size-in-bits='64' hash='004df27d316b7d17' id='type-id-906'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-907'/>
    <pointer-type-def type-id='type-id-907' size-in-bits='64' id='type-id-252'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-253'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-256'/>
    <qualified-type-def type-id='type-id-908' const='yes' id='type-id-909'/>
    <pointer-type-def type-id='type-id-909' size-in-bits='64' id='type-id-910'/>
    <qualified-type-def type-id='type-id-911' const='yes' id='type-id-912'/>
    <reference-type-def kind='lvalue' type-id='type-id-912' size-in-bits='64' id='type-id-913'/>
    <pointer-type-def type-id='type-id-912' size-in-bits='64' id='type-id-914'/>
    <qualified-type-def type-id='type-id-915' const='yes' id='type-id-916'/>
    <reference-type-def kind='lvalue' type-id='type-id-916' size-in-bits='64' id='type-id-917'/>
    <pointer-type-def type-id='type-id-916' size-in-bits='64' id='type-id-918'/>
    <qualified-type-def type-id='type-id-919' const='yes' id='type-id-920'/>
    <reference-type-def kind='lvalue' type-id='type-id-920' size-in-bits='64' id='type-id-921'/>
    <pointer-type-def type-id='type-id-920' size-in-bits='64' id='type-id-922'/>
    <qualified-type-def type-id='type-id-923' const='yes' id='type-id-924'/>
    <reference-type-def kind='lvalue' type-id='type-id-924' size-in-bits='64' id='type-id-925'/>
    <pointer-type-def type-id='type-id-924' size-in-bits='64' id='type-id-926'/>
    <namespace-decl name='std'>
      <class-decl name='_Rb_tree&lt;long unsigned int, long unsigned int, std::_Identity&lt;long unsigned int&gt;, std::less&lt;long unsigned int&gt;, STL_Allocator&lt;long unsigned int, HeapLeakChecker::Allocator&gt; &gt;' visibility='default' size-in-bits='384' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='323' column='1' hash='5c1b12654c8bd5fb' id='type-id-572'>
        <member-type access='protected'>
          <class-decl name='_Rb_tree_impl&lt;std::less&lt;long unsigned int&gt;, false&gt;' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='427' column='1' hash='dd1aadc4a06ff363' id='type-id-752'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-350'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_key_compare' type-id='type-id-689' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='428' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_header' type-id='type-id-638' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='429' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='320'>
              <var-decl name='_M_node_count' type-id='type-id-61' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='430' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_impl' type-id='type-id-752' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='453' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='_M_erase' mangled-name='_ZNSt8_Rb_treeImmSt9_IdentityImESt4lessImE13STL_AllocatorImN15HeapLeakChecker9AllocatorEEE8_M_eraseEPSt13_Rb_tree_nodeImE' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='964' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeImmSt9_IdentityImESt4lessImE13STL_AllocatorImN15HeapLeakChecker9AllocatorEEE8_M_eraseEPSt13_Rb_tree_nodeImE' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-750' is-artificial='yes'/>
            <parameter type-id='type-id-927'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_insert_' mangled-name='_ZNSt8_Rb_treeImmSt9_IdentityImESt4lessImE13STL_AllocatorImN15HeapLeakChecker9AllocatorEEE10_M_insert_EPKSt18_Rb_tree_node_baseSB_RKm' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeImmSt9_IdentityImESt4lessImE13STL_AllocatorImN15HeapLeakChecker9AllocatorEEE10_M_insert_EPKSt18_Rb_tree_node_baseSB_RKm' hash='591bcb047a6ffd3b'>
            <parameter type-id='type-id-750' is-artificial='yes'/>
            <parameter type-id='type-id-640'/>
            <parameter type-id='type-id-640'/>
            <parameter type-id='type-id-928'/>
            <return type-id='type-id-618'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_Rb_tree&lt;long unsigned int, std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;, std::_Select1st&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt; &gt;, std::less&lt;long unsigned int&gt;, STL_Allocator&lt;std::pair&lt;const long unsigned int, HeapLeakChecker::RangeValue&gt;, HeapLeakChecker::Allocator&gt; &gt;' visibility='default' size-in-bits='384' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='323' column='1' hash='9232299cdd7a5669' id='type-id-577'>
        <member-type access='protected'>
          <class-decl name='_Rb_tree_impl&lt;std::less&lt;long unsigned int&gt;, false&gt;' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='427' column='1' hash='dd1aadc4a06ff363' id='type-id-758'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-351'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_key_compare' type-id='type-id-689' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='428' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_header' type-id='type-id-638' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='429' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='320'>
              <var-decl name='_M_node_count' type-id='type-id-61' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='430' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_impl' type-id='type-id-758' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='453' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='_M_erase' mangled-name='_ZNSt8_Rb_treeImSt4pairIKmN15HeapLeakChecker10RangeValueEESt10_Select1stIS4_ESt4lessImE13STL_AllocatorIS4_NS2_9AllocatorEEE8_M_eraseEPSt13_Rb_tree_nodeIS4_E' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='964' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeImSt4pairIKmN15HeapLeakChecker10RangeValueEESt10_Select1stIS4_ESt4lessImE13STL_AllocatorIS4_NS2_9AllocatorEEE8_M_eraseEPSt13_Rb_tree_nodeIS4_E' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-756' is-artificial='yes'/>
            <parameter type-id='type-id-929'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_insert_' mangled-name='_ZNSt8_Rb_treeImSt4pairIKmN15HeapLeakChecker10RangeValueEESt10_Select1stIS4_ESt4lessImE13STL_AllocatorIS4_NS2_9AllocatorEEE10_M_insert_EPKSt18_Rb_tree_node_baseSF_RKS4_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeImSt4pairIKmN15HeapLeakChecker10RangeValueEESt10_Select1stIS4_ESt4lessImE13STL_AllocatorIS4_NS2_9AllocatorEEE10_M_insert_EPKSt18_Rb_tree_node_baseSF_RKS4_' hash='57dbd69b6c0c7dbb'>
            <parameter type-id='type-id-756' is-artificial='yes'/>
            <parameter type-id='type-id-640'/>
            <parameter type-id='type-id-640'/>
            <parameter type-id='type-id-711'/>
            <return type-id='type-id-623'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_Rb_tree&lt;long unsigned int, std::pair&lt;const long unsigned int, long unsigned int&gt;, std::_Select1st&lt;std::pair&lt;const long unsigned int, long unsigned int&gt; &gt;, std::less&lt;long unsigned int&gt;, STL_Allocator&lt;std::pair&lt;const long unsigned int, long unsigned int&gt;, HeapLeakChecker::Allocator&gt; &gt;' visibility='default' size-in-bits='384' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='323' column='1' hash='fe6f354b69cb5a4e' id='type-id-582'>
        <member-type access='protected'>
          <class-decl name='_Rb_tree_impl&lt;std::less&lt;long unsigned int&gt;, false&gt;' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='427' column='1' hash='dd1aadc4a06ff363' id='type-id-764'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-352'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_key_compare' type-id='type-id-689' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='428' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_header' type-id='type-id-638' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='429' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='320'>
              <var-decl name='_M_node_count' type-id='type-id-61' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='430' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_impl' type-id='type-id-764' visibility='default' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='453' column='1'/>
        </data-member>
        <member-function access='private'>
          <function-decl name='_M_erase' mangled-name='_ZNSt8_Rb_treeImSt4pairIKmmESt10_Select1stIS2_ESt4lessImE13STL_AllocatorIS2_N15HeapLeakChecker9AllocatorEEE8_M_eraseEPSt13_Rb_tree_nodeIS2_E' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='964' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeImSt4pairIKmmESt10_Select1stIS2_ESt4lessImE13STL_AllocatorIS2_N15HeapLeakChecker9AllocatorEEE8_M_eraseEPSt13_Rb_tree_nodeIS2_E' hash='7f32ffea222edbe7'>
            <parameter type-id='type-id-762' is-artificial='yes'/>
            <parameter type-id='type-id-930'/>
            <return type-id='type-id-58'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_insert_' mangled-name='_ZNSt8_Rb_treeImSt4pairIKmmESt10_Select1stIS2_ESt4lessImE13STL_AllocatorIS2_N15HeapLeakChecker9AllocatorEEE10_M_insert_EPKSt18_Rb_tree_node_baseSE_RKS2_' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/../../../../include/c++/4.4.7/bits/stl_tree.h' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt8_Rb_treeImSt4pairIKmmESt10_Select1stIS2_ESt4lessImE13STL_AllocatorIS2_N15HeapLeakChecker9AllocatorEEE10_M_insert_EPKSt18_Rb_tree_node_baseSE_RKS2_' hash='78a6228f9d63649d'>
